{
  "WebStoreTemplate": {
    "name": "WebStoreTemplate",
    "description": "Represents a configuration for creating commerce stores.",
    "properties": {
      "CheckoutTimeToLive": {
        "type": "number",
        "description": "Amount of time in minutes that a checkout stays active and doesn’t expire. If you use a Null value, your checkout never expires. If you use a 0 value, checkout is disabled. This field is available in API version 50.0 and later."
      },
      "CheckoutValidAfterDate": {
        "type": "dateTime",
        "description": "A timestamp in the default server timezone (GMT). All checkouts that start before this date are considered expired. A Null value means that all checkouts are valid. Example format: 2020-07-14T14:27:00.000Z. This field is available in API version 50.0 and later."
      },
      "Country": {
        "type": "string",
        "description": "Two-digit ISO code of the store's country. Purchases can be shipped only to the country assigned to the store. Valid for only D2C stores. This field is available in API version 56.0 and later."
      },
      "DefaultCurrency": {
        "type": "string",
        "description": "The template’s default currency setting for new records."
      },
      "DefaultLanguage": {
        "type": "string",
        "description": "Required. The template’s default language setting for new records."
      },
      "DefaultTaxLocaleType": {
        "type": "string",
        "description": "Required. The template’s default tax type for your webstore. Possible values include: Gross Net This field is available in API version 55.0 and later."
      },
      "Description": {
        "type": "string",
        "description": "The description of the template."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Required. The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Record Type Name."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated WebStoreTemplate in Metadata API. The full name can include a namespaceprefix."
      },
      "GuestCartTimeToLive": {
        "type": "number",
        "description": "The time that a guest cart is to remain valid before it expires. The default value is 168 hours (7 days), and the maximum value is 720 hours (30 days). This field is available in API version 52.0 and later."
      },
      "Language": {
        "type": "string",
        "description": "The language of the WebStoreTemplate."
      },
      "ManageableState": {
        "type": "string",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label for the WebStoreTemplate."
      },
      "MaxValuesPerFacet": {
        "type": "number",
        "description": "Maximum number of values that can be added to a facet."
      },
      "Metadata": {
        "type": "string",
        "description": "The metadata for the WebStoreTemplate."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix associated with this object. Each Developer Edition organization that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values: In Developer Edition organizations, the namespace prefix is set to the namespace prefix of the organization for all objects that support it. There is an exception if an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition organization of the package developer. In organizations that are not Developer Edition organizations, NamespacePrefix is only set for objects that are part of an installed managed package. There is no namespace prefix for all other objects."
      },
      "OptionsAutoFacetingEnabled": {
        "type": "boolean",
        "description": "If enabled (True), the most relevant search facets are automatically returned, in addition to the configured search facets, in the product search results. If disabled (False), only the configured search facets are returned. The default is False. See Add Product Search Filters (Facets) for more information. This field is available in API version 50.0 or later."
      },
      "OptionsCartAsyncProcessingEnabled": {
        "type": "boolean",
        "description": "Indicates whether add-to-cart requests are processed asynchronously (True) or not (False). The default value is True. This field is available in API version 59.0 or later."
      },
      "OptionsCartCalculateEnabled": {
        "type": "boolean",
        "description": "Indicates whether the cart calculate extension is enabled (True) or not (False). The default value is False."
      },
      "OptionsCartToOrderAutoCustomFieldMapping": {
        "type": "boolean",
        "description": "Indicates whether custom field mapping for cart and order objects is enabled (True) or not (False). The default value is True."
      },
      "OptionsCommerceEinsteinActivitiesTracked": {
        "type": "boolean",
        "description": "Indicates whether Commerce Einstein activities tracking is enabled (true) or not (false)."
      },
      "OptionsCommerceEinsteinDeployed": {
        "type": "boolean",
        "description": "Indicates whether Commerce Einstein is deployed (true) or not (false)."
      },
      "OptionsDuplicateCartItemsEnabled": {
        "type": "boolean",
        "description": "Indicates whether a cart can include multiple items with the same product ID (True) or not (False). The default value is False. This field is available in API version 59.0 or later."
      },
      "OptionsGuestBrowsingEnabled": {
        "type": "boolean",
        "description": "Indicates whether guest browsing is enabled for this store. Set the option to True to allow guest buyers access to products in the store."
      },
      "OptionsGuestCartEnabled": {
        "type": "boolean",
        "description": "Required. Indicates whether guest cart access is enabled for a store created with an LWR template. Set the option to True to allow guest buyers access to products in the store. This field is available in API version 58.0 and later."
      },
      "OptionsGuestCheckoutEnabled": {
        "type": "boolean",
        "description": "Required. Indicates whether guest checkout access is enabled for a store created with an LWR template. Set the option to True to allow guest buyers access to products in the store. This field is available in API version 58.0 and later."
      },
      "OptionsPreserveGuestCartEnabled": {
        "type": "boolean",
        "description": "Required. Indicates whether cart contents are preserved when a guest logs in to the store. Set the option to True to preserve guest carts. This field is available in API version 60.0 and later."
      },
      "OptionsSkipAdditionalEntitlementCheckForSearch": {
        "type": "boolean",
        "description": "By default, user entitlement checks are run as part of a search index rebuild and again when product search results are returned. Skips the second check to promote faster search performance. Set the option to True to skip additional entitlement checks on a search. This field is available in API version 52.0 and later."
      },
      "OptionsSkuDetectionEnabled": {
        "type": "boolean",
        "description": "Indicates whether SKU detection is enabled (true) or not (false)."
      },
      "OptionsSplitShipmentEnabled": {
        "type": "boolean",
        "description": "Required. Indicates whether split shipments are enabled (true) or not (false)."
      },
      "OrderActivationStatus": {
        "type": "string",
        "description": "Status of the order. Possible values include: Activated Draft"
      },
      "OrderLifeCycleType": {
        "type": "string",
        "description": "The order life cycle type. Possible values include: MANAGED UNMANAGED"
      },
      "PaginationSize": {
        "type": "number",
        "description": "Number of results displayed per search results page."
      },
      "PricingStrategy": {
        "type": "string",
        "description": "Required. The price selected to display to buyers. Possible values include: LowestPrice Priority The default value is LowestPrice."
      },
      "ProductGrouping": {
        "type": "string",
        "description": "Determines whether product variations are listed individually in search results or are represented by the parent product, which links to its children. Possible values are: NoGrouping—Variations are listed individually in search results. VariationParent—The parent product is returned in search results with a link to its children. The default value is VariationParent. This field is available in API version 52.0 and later."
      },
      "SupportedCurrencies": {
        "type": "string",
        "description": "Currencies supported for store template."
      },
      "SupportedLanguages": {
        "type": "string",
        "description": "Required. Languages supported for store template."
      },
      "SupportedShipToCountries": {
        "type": "string",
        "description": "Countries that a store created from the template can ship to."
      },
      "Type": {
        "type": "string",
        "description": "Required."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_webstoretemplate.htm",
    "accessRules": "A B2B Commerce or D2C Commerce license and access to Commerce objects is required.",
    "clouds": [
      "Tooling API"
    ]
  }
}