{
  "WorkforceCapacityUnit": {
    "name": "WorkforceCapacityUnit",
    "description": "Represents the number of resources allocated or needed for a specific set of work items at a timestamp within a specific duration.",
    "properties": {
      "AssignedTotalCount": {
        "type": "double",
        "description": "The number of shifts assigned at specific time period."
      },
      "AvailableTotalCount": {
        "type": "double",
        "description": "The total number of shifts scheduled at a specific time period."
      },
      "Capacity": {
        "type": "double",
        "description": "Staffing prediction for a capacity plan. This field is available in API version 54.0 and later."
      },
      "DateTime": {
        "type": "dateTime",
        "description": "The timestamp of the data point."
      },
      "IsOmni": {
        "type": "boolean",
        "description": "Derived from the isOmni field on WorkforceCapacity. Indicates that the workload is Omni-based."
      },
      "IsShiftTemplateNonStandard": {
        "type": "boolean",
        "description": "Indicates whether the shift template that’s used at a specific time period is a non-standard shift. This field is available in API version 53.0 and later."
      },
      "JobProfileName": {
        "type": "string",
        "description": "The derived field from the WorkDemographic SkillSet field."
      },
      "MaxCount": {
        "type": "int",
        "description": "The max number of resources allocated or needed at a specific time period."
      },
      "MeasureUnit": {
        "type": "picklist",
        "description": "The time interval (in minutes) used in capacity plans."
      },
      "OriginalTotalCount": {
        "type": "int",
        "description": "The original total number of resources allocated or needed at specific time period calculated from the planning process."
      },
      "ResourceGap": {
        "type": "int",
        "description": "Represents the resource gap between the available and required resources."
      },
      "ServiceTerritoryName": {
        "type": "string",
        "description": "The derived field from the WorkDemographic Region field."
      },
      "ShiftTemplateDuration": {
        "type": "double",
        "description": "The duration of the shift template that’s used at a specific time period. This field is available in API version 53.0 and later."
      },
      "ShiftTemplateDurationType": {
        "type": "picklist",
        "description": "Indicates whether the duration of the shift template that’s used at a specific time period is in minutes or hours. This field is available in API version 53.0 and later."
      },
      "ShiftTemplateId": {
        "type": "reference",
        "description": "The ID of the shift template that’s used at a specific time period. This field is available in API version 53.0 and later."
      },
      "ShiftTemplateJobProfile": {
        "type": "string",
        "description": "The job profile that relates to the shift template that’s used at a specific time period. This field is available in API version 53.0 and later."
      },
      "ShiftTemplateName": {
        "type": "string",
        "description": "Name of the shift template that’s used at a specific time period. This field is available in API version 53.0 and later."
      },
      "ShiftTemplateStartTime": {
        "type": "time",
        "description": "The start time of the shift template that’s used at a specific time period. This field is available in API version 53.0 and later."
      },
      "TotalCount": {
        "type": "int",
        "description": "The total number of resources allocated or needed at specific time period. It represents the updated count after the adjustment. This value is the same as OriginalTotalCount if no adjustments were made."
      },
      "WorkDemographicId": {
        "type": "reference",
        "description": "The foreign key to WorkDemographic object."
      },
      "WorkforceCapacityId": {
        "type": "reference",
        "description": "The foreign key to WorkCapacity object."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_workforcecapacityunit.htm"
  }
}