{
  "WatchlistedLearner": {
    "name": "WatchlistedLearner",
    "description": "Represents information for a learner that needs to be monitored for support.",
    "properties": {
      "CarePlanId": {
        "type": "reference",
        "description": "The Care Plan associated with the Watchlisted Learner that's used to improve the learner’s performance"
      },
      "CaseId": {
        "type": "reference",
        "description": "The learner’s Case record associated with the Watchlisted Learner."
      },
      "Category": {
        "type": "picklist",
        "description": "Specifies the category of the Watchlisted Learner."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "The ISO code for the currency associated with the Pulse Check."
      },
      "EndDate": {
        "type": "dateTime",
        "description": "The date and time when the learner was removed as a Watchlisted Learner."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the Watchlisted Learner is active (true) or not (false)."
      },
      "IsEscalated": {
        "type": "boolean",
        "description": "Indicates whether the Watchlisted Learner is escalated (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "Name": {
        "type": "string",
        "description": "The name of the Watchlisted Learner."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The user who owns this record."
      },
      "ProgramEnrollmentId": {
        "type": "reference",
        "description": "The Program Enrollment record associated with the Watchlisted Learner."
      },
      "Reason": {
        "type": "picklist",
        "description": "Specifies the reason for adding the learner as a Watchlisted Learner."
      },
      "ReasonDescription": {
        "type": "textarea",
        "description": "Descriptive context for adding the learner as a Watchlisted Learner."
      },
      "StartDate": {
        "type": "dateTime",
        "description": "The date and time when the learner was added as a Watchlisted Learner."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the learner’s performance after being added as a Watchlisted Learner."
      }
    },
    "module": "Education Cloud"
  }
}