{
  "WorkStep": {
    "name": "WorkStep",
    "description": "Represents a work step in a work plan.",
    "properties": {
      "ActionDefinition": {
        "type": "picklist",
        "description": "The platform action that the work step executes. The possible values are the names of the flow and quick actions configured in your org. To launch Lightning Web Components from Work Steps, you must use QuickAction on the action definition."
      },
      "ActionType": {
        "type": "picklist",
        "description": "The type of platform action that the work step is associated with."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the work step."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The date and time the work step ends. The value must be greater than or equal to StartTime."
      },
      "ExecutionOrder": {
        "type": "int",
        "description": "The order in which the work step is executed. Only positive integer values or null are supported."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last interacted with this record, directly or indirectly. Some sample scenarios are:"
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "Name": {
        "type": "string",
        "description": "Required. The user-defined name of the work step."
      },
      "PausedFlowInterviewId": {
        "type": "reference",
        "description": "The auto-populated ID of the flow interview paused by a user."
      },
      "ProcessType": {
        "type": "picklist",
        "description": "The flow process type launched from the work step."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The date and time the work step starts."
      },
      "Status": {
        "type": "picklist",
        "description": "The customizable status of the work order. Every status must be mapped to a status category, but there can be status categories not mapped to a status."
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "The category that each status value belongs to. Each default status category is mapped to the corresponding default status. If you create a custom status, you must indicate which status category it belongs to. To learn which processes reference StatusCategory, see How are Status Categories Used?."
      },
      "WorkOrderId": {
        "type": "reference",
        "description": "The ID of the work order."
      },
      "WorkOrderLineItemId": {
        "type": "reference",
        "description": "The ID of the work order line item."
      },
      "WorkPlanExecutionOrder": {
        "type": "int",
        "description": "The ID of the plan execution order."
      },
      "WorkPlanId": {
        "type": "reference",
        "description": "The ID of the work plan."
      }
    },
    "module": "Field Service Lightning"
  }
}