{
  "WorkGoal": {
    "name": "WorkGoal",
    "description": "Represents the components of a goal, such as its description and associated metrics.",
    "properties": {
      "ActualValue": {
        "type": "double",
        "description": "The actual value of the WorkGoal metric. Applicable only to WorkGoal objects of Type: Metric."
      },
      "ActualValueExternalUrl": {
        "type": "url",
        "description": "Contains a URL that references WDC data synchronization for the actual value of a metric. Applicable only to WorkGoal objects of Type: Metric."
      },
      "CompletionDate": {
        "type": "dateTime",
        "description": "The completion date of the goal. Note Field-level security limits access to only administrators and owners by default, and only they can complete a goal."
      },
      "Description": {
        "type": "textarea (max length 4000)",
        "description": "The description of the goal."
      },
      "DueDate": {
        "type": "date",
        "description": "The date the WorkGoal object is due (optional). Applicable only to WorkGoal objects of Type: Metric."
      },
      "FlaggedAs": {
        "type": "picklist",
        "description": "The progress of the WorkGoal object. Applicable only to WorkGoal objects of Type: Metric."
      },
      "ImageUrl": {
        "type": "url",
        "description": "The URL for the goal image. The image must be stored in Documents and set as externally available. Applicable only to WorkGoal objects of Type: Goal."
      },
      "InitialValue": {
        "type": "double",
        "description": "The initial value of the WorkGoal metric. Applicable only to WorkGoal objects of Type: Metric and MetricType: Progress or Percent."
      },
      "IsKeyCompanyGoal": {
        "type": "boolean",
        "description": "Used to indicate if the goal is a key company goal. Used for the Company Goal Showcase. Applicable only to WorkGoal objects of Type: Goal."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The time stamp that indicates when the current user last viewed a record that is related to this goal."
      },
      "LastSyncDate": {
        "type": "dateTime",
        "description": "The time stamp that indicates when the actual value was last synced with the associated metrics report."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The time stamp that indicates when the current user last viewed this goal."
      },
      "MetricType": {
        "type": "picklist",
        "description": "The type of metric that is represented. (See values in the following list). Applies only to WorkGoal objects of Type: Metric."
      },
      "MetricTypeDataSource": {
        "type": "picklist",
        "description": "Specifies how the metric (ActualValue and CurrentValue) is updated. Applies only to WorkGoal objects of Type: Goal and Metric."
      },
      "Name": {
        "type": "string",
        "description": "The name of the WorkGoal object. (Maximum length is 255.)"
      },
      "OverallStatus": {
        "type": "string",
        "description": "The overall calculated status of the WorkGoal based on FlaggedAs and CompletionDate."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who owns the WorkGoal."
      },
      "ParentId": {
        "type": "reference",
        "description": "Specifies the structural parent of the WorkGoal. For example, a goal that has a metric is represented by a WorkGoal of Type Metric, which has a parent of WorkGoal of Type Goal. Note The root and the parent must be set to the parent goal for any child metrics."
      },
      "Progress": {
        "type": "percent",
        "description": "Read Only. The overall progress of the WorkGoal."
      },
      "RootId": {
        "type": "reference to a WorkGoal object",
        "description": "Specifies the structural root of the WorkGoal. For example, a goal that has a metric is represented by a WorkGoal of Type Metric, which has a root of WorkGoal of Type Goal."
      },
      "State": {
        "type": "picklist",
        "description": "The state of the WorkGoal object. Applies only to WorkGoal objects of Type: Metric."
      },
      "TargetValue": {
        "type": "double",
        "description": "The target value of the WorkGoal. Applies only to WorkGoal objects of Type: Metric."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of the WorkGoal object, used to differentiate between the components of a goal. (This field is used to represent components of a goal such as its description and associated metrics.)"
      },
      "Weight": {
        "type": "double",
        "description": "The weight of the goal or metric. The sum of the weights should equal 100%."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_workgoal.htm"
  }
}