{
  "WorkBadgeDefinition": {
    "name": "WorkBadgeDefinition",
    "description": "Represents the attributes of a badge including the badge name, description, and image. Each WorkBadge record must have a lookup to a WorkBadgeDefinition since badge attributes (like badge name) are derived from the WorkBadgeDefinition object.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "Required. Limit: 4000 characters. The description of the badge and what it means to receive this badge."
      },
      "GivenBadgeCount": {
        "type": "int",
        "description": "The number of badges given per user or across all users. Note This field can’t be added in a list view or referenced in a formula field."
      },
      "ImageUrl": {
        "type": "url",
        "description": "Required. This is the badge image that will be displayed in the UI. Use DocumentID or ImageURL."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Represents whether a WorkBadgeDefinition is active and available in the UI and API."
      },
      "IsCompanyWide": {
        "type": "boolean",
        "description": "Represents a special class of badges known as Company Badges. Company badges are visible to the entire company and visible in specific list view filters. Note If this field is selected, everyone within the user’s network will be able to give the badge automatically. If this field is not selected, people with sharing must be added to the badge’s access list in order to give the badge."
      },
      "IsLimitPerUser": {
        "type": "boolean",
        "description": "Indicates whether the badge limit is per user (true) or across all users (false). The default value is false."
      },
      "IsRewardBadge": {
        "type": "boolean",
        "description": "Indicates whether the badge is a reward badge (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The time stamp that indicates when the current user last viewed a record that is related to this WorkBadgeDefinition."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The time stamp that indicates when the current user last viewed this WorkBadgeDefinition. If this value is null, this record might have been only referenced (LastReferencedDate) and not viewed."
      },
      "LimitNumber": {
        "type": "int",
        "description": "The badge limit per user or across all users."
      },
      "LimitStartDate": {
        "type": "date",
        "description": "The start date of the badge limit. The date can be reset to the current date."
      },
      "Name": {
        "type": "string",
        "description": "Required. Name of the Badge. Label: Badge Title."
      },
      "NetworkId": {
        "type": "reference",
        "description": "The ID of the community that this WorkBadgeDefinition is associated with. This field is available only if digital experiences is enabled in your org."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Salesforce User ID for User who is the Owner of the WorkBadgeDefinition record (usually the creator of the record)"
      },
      "RewardFundId": {
        "type": "reference",
        "description": "Salesforce unique ID for the WorkRewardFund that is associated with this WorkBadgeDefinition. WorkBadgeDefinition records with a RewardFundID indicate a Reward Badge."
      }
    },
    "module": "Core Salesforce"
  }
}