{
  "WorkReportLineItem": {
    "name": "WorkReportLineItem",
    "description": "Represents one measure of work performed by a contractor business for a consumer at a location within a program.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The utility's consumer or business account associated with the work report line item."
      },
      "ContractorAccountId": {
        "type": "reference",
        "description": "The contractor associated with the work report line item"
      },
      "CustomerFirstName": {
        "type": "string",
        "description": "The first name of the customer"
      },
      "CustomerLastName": {
        "type": "string",
        "description": "The last name of the customer"
      },
      "Description": {
        "type": "string",
        "description": "The description of the work report line item."
      },
      "ExternalDocumentIdentifier": {
        "type": "string",
        "description": "The externally generated ID associated with uploaded documents to this work report line item for application and invoice approvals."
      },
      "HasError": {
        "type": "boolean",
        "description": "Indicates whether the work report line item has submission errors."
      },
      "LaborCost": {
        "type": "currency",
        "description": "The cost of labor for this work report line item."
      },
      "LocationId": {
        "type": "reference",
        "description": "The location associated with the work report line item. The premises of the customer account in which the measure was installed."
      },
      "LocationStreetAddress": {
        "type": "string",
        "description": "The reference street address for the customer's premises."
      },
      "MaterialCost": {
        "type": "currency",
        "description": "The cost of materials and parts for this work report line item."
      },
      "Measure": {
        "type": "string",
        "description": "The equipment or part that is installed, repaired, or maintained for this work report line item"
      },
      "Name": {
        "type": "string",
        "description": "The name of the work report line item."
      },
      "OtherCost": {
        "type": "currency",
        "description": "The cost of taxes, fees, and other charges that are not attributed to materials or labor for this work report line item."
      },
      "ProcessingStatus": {
        "type": "picklist",
        "description": "Specifies the processing status of the work report line item."
      },
      "ProductQuantity": {
        "type": "int",
        "description": "The quantity of the measure installed at the premises for the same program."
      },
      "ProgramProductId": {
        "type": "reference",
        "description": "The program product associated with the work report line item. These are individual measures within a program implemented at the location by the contractor."
      },
      "ProjectName": {
        "type": "string",
        "description": "The contractor's project name"
      },
      "ServiceDate": {
        "type": "date",
        "description": "The date when the measure was implemented at the customer's premises."
      },
      "TotalCost": {
        "type": "currency",
        "description": "The sum of the material cost, labor cost and the other costs in this record. The total invoice for the service provided to the property for the measure within the program for the account on this line item."
      },
      "UploadedById": {
        "type": "reference",
        "description": ""
      },
      "WorkReportId": {
        "type": "reference",
        "description": "The work report ID associated with the work report line item generated after submission in run time."
      }
    },
    "module": "Energy and Utilities Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.eu_developer_guide.meta/eu_developer_guide/sforce_api_objects_workreportlineitem.htm"
  }
}