{
  "WorkOrder": {
    "name": "WorkOrder",
    "description": "Represents field service work to be performed for a customer.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The account associated with the work order."
      },
      "Address": {
        "type": "address",
        "description": "The compound form of the address where the work order is completed."
      },
      "AssetId": {
        "type": "reference",
        "description": "The asset associated with the work order."
      },
      "AssetWarrantyId": {
        "type": "reference",
        "description": "The asset warranty term associated with the work order. This field is available in API version 50.0 and above."
      },
      "BusinessHoursId": {
        "type": "reference",
        "description": "The business hours associated with the work order."
      },
      "CaseId": {
        "type": "reference",
        "description": "The case associated with the work order."
      },
      "City": {
        "type": "string",
        "description": "The city where the work order is completed. Maximum length is 40 characters."
      },
      "ContactId": {
        "type": "reference",
        "description": "The contact associated with the work order."
      },
      "Country": {
        "type": "string",
        "description": "The country where the work order is completed. Maximum length is 80 characters."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for orgs with the multicurrency feature enabled. Contains the ISO code for any currency allowed by the organization. The label in the user interface is Currency ISO Code."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the work order. Try to include the steps needed to change the work order’s status to Completed."
      },
      "Discount": {
        "type": "percent",
        "description": "Read only. The weighted average of the discounts on all line items in the work order. It can be any positive number up to 100."
      },
      "Duration": {
        "type": "double",
        "description": "The estimated time required to complete the work order. Specify the duration unit in the Duration Type field. If the Duration field on a Work Order is null, it adopts the duration value from the Work Type object when the work type is updated or inserted. Note Work order duration and work order line item duration are independent of each other. If you want work order duration to automatically show the sum of the work order line items’ duration, replace the Duration field on work orders with a custom roll-up summary field."
      },
      "DurationInMinutes": {
        "type": "double",
        "description": "The estimated duration in minutes. For internal use only."
      },
      "DurationType": {
        "type": "picklist",
        "description": "The unit of the duration: Minutes or Hours."
      },
      "EndDate": {
        "type": "dateTime",
        "description": "The date when the work order is completed. This field is blank unless you set up an Apex trigger or quick action to populate it. For example, you can create a quick action that sets the EndDate to 365 days after the StartDate."
      },
      "EntitlementId": {
        "type": "reference",
        "description": "The entitlement associated with the work order."
      },
      "GeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the address. See Compound Field Considerations and Limitations for details on geolocation compound fields. Note conref=\"sforce_api_objects_workorderlineitem.xml#sforce_api_objects_workorderlineitem/api_only\""
      },
      "GrandTotal": {
        "type": "currency",
        "description": "Read only. The total price of the work order with tax added."
      },
      "IsClosed": {
        "type": "boolean",
        "description": "Indicates whether the work order is closed (true) or open (false). Tip Use this field to report on closed versus open work orders."
      },
      "IsGeneratedFromMaintenancePlan": {
        "type": "boolean",
        "description": "(Read Only) Indicates that the work order was generated from a maintenance plan (true), rather than manually created (false). Note This option is deselected for work orders that were generated from maintenance plans before Summer ’18."
      },
      "IsStopped": {
        "type": "boolean",
        "description": "Indicates whether a milestone is paused (true) or counting down (false). This field is available only if Enable stopped time and actual elapsed time is selected on the Entitlement Settings page."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the work order was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the work order was last viewed."
      },
      "Latitude": {
        "type": "double",
        "description": "Used with Longitude to specify the precise geolocation of the address where the work order is completed. Acceptable values are numbers between –90 and 90 with up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields. Note This field is available in the API only."
      },
      "LineItemCount": {
        "type": "int",
        "description": "The number of work order line items in the work order. Its label in the user interface is Line Items."
      },
      "LocationId": {
        "type": "reference",
        "description": "The location associated with the work order. For example, a work site."
      },
      "Longitude": {
        "type": "double",
        "description": "Used with Latitude to specify the precise geolocation of the address where the work order is completed. Acceptable values are numbers between –180 and 180 with up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields. Note This field is available in the API only."
      },
      "MaintenancePlanId": {
        "type": "reference",
        "description": "The maintenance plan associated with the work order. When the work order is auto-generated from a maintenance plan, this field automatically lists the related plan."
      },
      "MaintenanceWorkRuleId": {
        "type": "reference",
        "description": "ID of the maintenance work rule that generated this work order. This field is available in API version 50.0 and above."
      },
      "MilestoneStatus": {
        "type": "string",
        "description": "Indicates the status of a milestone. This field is visible if an entitlement process is applied to a work order."
      },
      "MinimumCrewSize": {
        "type": "int",
        "description": "The minimum crew size allowed for a crew assigned to the work order. If you’re not using the Field Service managed package, this field serves as a suggestion rather than a rule. If you are using the managed package, the scheduling optimizer counts the number of service crew members on a service crew to determine whether it fits a work order’s minimum crew size requirement."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The work order’s assigned owner."
      },
      "ParentWorkOrderId": {
        "type": "reference",
        "description": "The work order’s parent work order, if it has one. Tip Create a custom report to view a work order’s child work orders."
      },
      "PostWorkSummary": {
        "type": "textarea",
        "description": "The summary of a completed work order that’s either entered manually or created by an AI agent."
      },
      "PostalCode": {
        "type": "string",
        "description": "The postal code where the work order is completed. Maximum length is 20 characters."
      },
      "PreWorkBriefPromptTemplate": {
        "type": "string",
        "description": "The ID of the activated Pre-Work Brief prompt template."
      },
      "Pricebook2Id": {
        "type": "reference",
        "description": "The price book associated with the work order. Adding a price book to the work order lets you assign different price book entries to the work order’s line items. This is only available if Product2 is enabled."
      },
      "Priority": {
        "type": "picklist",
        "description": "The priority of the work order. The picklist includes the following values, which can be customized: Low Medium High Critical"
      },
      "ProductServiceCampaignId": {
        "type": "reference",
        "description": "The product service campaign associated with the work order."
      },
      "ProductServiceCampaignItemId": {
        "type": "reference",
        "description": "The product service campaign item associated with the work order."
      },
      "RecommendedCrewSize": {
        "type": "int",
        "description": "The recommended number of people on the service crew assigned to the work order. For example, you might have a Minimum Crew Size of 2 and a Recommended Crew Size of 3."
      },
      "ReturnOrderId": {
        "type": "reference",
        "description": "The return order associated with the work order."
      },
      "ReturnOrderLineItemId": {
        "type": "reference",
        "description": "The return order line item associated with the work order."
      },
      "RootWorkOrderId": {
        "type": "reference",
        "description": "(Read only) The top-level work order in a work order hierarchy. Depending on where a work order lies in the hierarchy, its root could be the same as its parent. Note View a work order’s child work order in the Child Work Orders related list."
      },
      "ServiceAppointmentCount": {
        "type": "int",
        "description": "The number of service appointments on the work order."
      },
      "ServiceContractId": {
        "type": "reference",
        "description": "The service contract associated with the work order."
      },
      "ServiceDocumentTemplate": {
        "type": "string",
        "description": "The template ID which sets the template for each service document for the Document Builder feature."
      },
      "ServiceReportLanguage": {
        "type": "picklist",
        "description": "The language used for all service reports and service report previews created for the work order, its service appointments, and its work order line items and their service appointments. If the field is blank, service reports are generated in the default language in Salesforce of the person creating the report.To appear as an option in the ServiceReportLanguage field, a language must be set up in Translation Workbench or be one of Salesforce’s 18 fully supported languages. Rich text fields and service report section names aren’t translated."
      },
      "ServiceReportTemplateId": {
        "type": "reference",
        "description": "The service report template that the work order uses. If you don’t specify a service report template on a work order, it uses the service report template listed on its work type. If the work type doesn’t list a template or no work type is specified, the work order uses the default service report template."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The service territory where the work order is taking place."
      },
      "SlaExitDate": {
        "type": "dateTime",
        "description": "The time that the work order exits the entitlement process."
      },
      "SlaStartDate": {
        "type": "dateTime",
        "description": "The time that the work order enters the entitlement process. You can update or reset the time if you have “Edit” permission on work orders."
      },
      "StartDate": {
        "type": "dateTime",
        "description": "The date when the work order goes into effect. This field is blank unless you set up an Apex trigger or quick action to populate it. For example, you can create a quick action that sets the StartDate to the date when the Status changes to In Progress."
      },
      "State": {
        "type": "string",
        "description": "The state where the work order is completed. Maximum length is 80 characters."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the work order. The picklist includes the following values, which can be customized: New—Work order was created, but there hasn’t yet been any activity. In Progress—Work has begun. On Hold—Work is paused. Completed—Work is complete. Cannot Complete—Work could not be completed. Closed—All work and associated activity is complete. Canceled—Work is canceled, typically before any work began. Changing a work order’s status does not affect the status of its work order line items or associated service appointments."
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "The category that each Status value falls into. The Status Category field has eight default values: seven values which are identical to the default Status values, and a None value for statuses without a status category.If you create custom Status values, you must indicate which category it belongs to. For example, if you create a Waiting for Response value, you may decide that it belongs in the On Hold category. To learn which processes reference StatusCategory, see How are Status Categories Used?"
      },
      "StopStartDate": {
        "type": "dateTime",
        "description": "Indicates when the milestone was paused. The label in the user interface is Stopped Since."
      },
      "Street": {
        "type": "textarea",
        "description": "The street number and name where the work order is completed."
      },
      "Subject": {
        "type": "string",
        "description": "The subject of the work order. Try to describe the nature and purpose of the job to be completed. For example, “Annual On-Site Well Maintenance.” Maximum length is 255 characters."
      },
      "Subtotal": {
        "type": "currency",
        "description": "Read only. The total of the work order line items’ subtotals before discounts and taxes are applied."
      },
      "SuggestedMaintenanceDate": {
        "type": "date",
        "description": "The suggested date that the work order is completed. When the work order is auto-generated from a maintenance plan, this field is automatically populated based on the maintenance plan’s settings."
      },
      "Tax": {
        "type": "currency",
        "description": "The total tax on the work order. You can enter a number with or without the currency symbol and use up to two decimal places. For example, in a work order whose total price is $100, enter $10 to apply a 10% tax."
      },
      "TotalPrice": {
        "type": "currency",
        "description": "Read only. The total of the work order line items’ prices. This value has discounts applied but not tax."
      },
      "WorkOrderNumber": {
        "type": "string",
        "description": "An eight-digit, auto-generated number that identifies the work order."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The work type associated with the work order. When a work type is selected, the work order automatically inherits the work type’s Duration, Duration Type, and required skills. If the Duration field for the work type is null, enter the duration value."
      }
    },
    "module": "Field Service Lightning"
  }
}