{
  "WorkFeedbackQuestion": {
    "name": "WorkFeedbackQuestion",
    "description": "Represents a free-form text type or multiple choice question within a set of questions.",
    "properties": {
      "Choices": {
        "type": "textarea",
        "description": "New-line separated list of valid choices for multiple choice questions. Maximum length is 1000 characters."
      },
      "Detail": {
        "type": "textarea",
        "description": "Detailed instructions on how to answer the question."
      },
      "IsConfidentialAnswer": {
        "type": "boolean",
        "description": "Answers to questions marked confidential will not be shared with the subject of the review. This field applies only to performance summaries."
      },
      "IsOptional": {
        "type": "boolean",
        "description": "If this option is selected, the question is optional and isn’t required to be answered. This field applies only to performance summaries."
      },
      "Name": {
        "type": "string",
        "description": "A short description of the question, which can be used as a header for reports and Calibration."
      },
      "Number": {
        "type": "int",
        "description": "The order of the question that is displayed within the question set, such as question number three in a question set that has five questions."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of the WorkFeedbackQuestion."
      },
      "QuestionSetId": {
        "type": "reference",
        "description": "The question set this question is a part of."
      },
      "Text": {
        "type": "textarea",
        "description": "The body of the question. Max length is 16384 characters."
      },
      "Type": {
        "type": "picklist",
        "description": "Allows for either a free-form text answer or a multiple choice question defined by new-line separate choices in the ‘Choices’ field. Valid picklist values are: MultipleChoice FreeText Rating"
      }
    },
    "module": "Core Salesforce"
  }
}