{
  "WorkType": {
    "name": "WorkType",
    "description": "Represents a type of work to be performed in Salesforce Scheduler.",
    "properties": {
      "AppointmentCategoryId": {
        "type": "reference",
        "description": "The ID of the appointment category that’s assigned to the work type. This field is available in API version 58.0 and later."
      },
      "ApptStartTimeIntvlInMin": {
        "type": "int",
        "description": "Specify the time interval in minutes between appointment start times. For example, if you set the interval as 15, appointments can then begin at the top of the hour and at 15-minute intervals thereafter (10:00 AM, 10:15 AM, 10:30 AM). Valid values can be between 5 through 720. Note If you don’t specify a value for this field, Salesforce Scheduler considers the value specified in the default scheduling policy. This field is available in API version 57.0 and later."
      },
      "AttendeeLimit": {
        "type": "int",
        "description": "The maximum number of attendees for a group service appointment in a shift. This field is considered when the appointment mode is Group. Available in API version 61.0 and later."
      },
      "BlockTimeAfterAppointment": {
        "type": "int",
        "description": "Specify the after buffer time for the service appointment. Note In Salesforce Scheduler, during appointment scheduling, the number of available time slots is automatically adjusted to accommodate the after buffer time."
      },
      "BlockTimeAfterUnit": {
        "type": "picklist",
        "description": "Specify the unit of time for BlockTimeAfterAppointment."
      },
      "BlockTimeBeforeAppointment": {
        "type": "int",
        "description": "Specify the before buffer time for the service appointment. Note In Salesforce Scheduler, during appointment scheduling, the number of available time slots is automatically adjusted to accommodate the before buffer time."
      },
      "BlockTimeBeforeUnit": {
        "type": "picklist",
        "description": "Specify the unit of time for BlockTimeBeforeAppointment."
      },
      "DefaultAppointmentType": {
        "type": "picklist",
        "description": "The default appointment type of the work type."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the work type. Try to add details about the task or tasks that this work type represents."
      },
      "DurationType": {
        "type": "picklist",
        "description": "The unit of the Estimated Duration: Minutes or Hours."
      },
      "EstimatedDuration": {
        "type": "double",
        "description": "The estimated length of the work. The estimated duration is in minutes or hours based on the value selected in the Duration Type field."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the work type was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the work type was last viewed by the current user."
      },
      "Name": {
        "type": "string",
        "description": "The name of the work type."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The ID of the operating hours that’s assigned to the work type. If a service resource needs special operating hours, create them in Setup and select them in the Operating Hours lookup field on the member’s detail page."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The work type’s owner."
      },
      "ProductId": {
        "type": "reference",
        "description": "References the product associated with the work type."
      },
      "TimeFrameEndUnit": {
        "type": "picklist",
        "description": "Specify the unit of time for TimeFrame End."
      },
      "TimeFrameStartUnit": {
        "type": "picklist",
        "description": "Specify the unit of time for TimeFrame Start."
      },
      "TimeframeEnd": {
        "type": "int",
        "description": "Specify the timeframe end to show only time slots that end before the duration that is set in Timeframe End."
      },
      "TimeframeStart": {
        "type": "int",
        "description": "Specify the timeframe start to show only time slots that start after the duration that is set in Timeframe Start."
      }
    },
    "module": "Scheduler"
  }
}