{
  "WorkCapacityUsage": {
    "name": "WorkCapacityUsage",
    "description": "Represents the capacity usage in a specific service territory for a workstream or for the whole service territory in a given period.",
    "properties": {
      "AvailCapacityHours": {
        "type": "double",
        "description": "This value is copied from the AvailCapacityHours of the WorkCapacityAvailability object for the service territory on the same date."
      },
      "CapacityLimitRelaxation": {
        "type": "string",
        "description": "Defines the relaxation behavior that determines the limit override policy for this limit if the limit override policy is set per limit in Field Service Settings. If the limit override policy isn’t set per limit, this value is ignored. Valid strings are:"
      },
      "ConsumptionToLimitRatio": {
        "type": "double",
        "description": "(Time consumed in hours / Limit in hours) * 100"
      },
      "EndDate": {
        "type": "date",
        "description": "End date of the time period for which the capacity usage is accumulated."
      },
      "IsSvcTerrOnlyLimit": {
        "type": "boolean",
        "description": "Applies this work capacity limit to the entire service territory."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate isn’t null, the user accessed this record or list view indirectly."
      },
      "LimitationPercentage": {
        "type": "double",
        "description": "If the LimitationUnits is Percentage this value is copied from the LimitationValue field of the WorkCapacityLimit object."
      },
      "LimitationUnits": {
        "type": "picklist",
        "description": "Defines whether the limitation for the workstream in the service territory is in hours or as a percentage of all the available hours for all the workstreams for which limitations exist in the service territory on a specific day."
      },
      "LimitationValue": {
        "type": "double",
        "description": "The LimitationValue depends on the LimitationUnit. If the LimitationUnit is Hours the value is copied from LimitationValue in the WorkCapacityLimit object. If the LimitationUnit is Percentage, the percentage is calculated relative to the availability in the WorkCapacityAvailability object."
      },
      "OriginalLimit": {
        "type": "double",
        "description": "If the limit value is changed after the work capacity usage was created, this parameter is the original value."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this object."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "ID of the service territory of the work capacity workstream for which usage is accumulated."
      },
      "StartDate": {
        "type": "date",
        "description": "Start date of the time period for which the capacity usage is accumulated."
      },
      "SvcApptField": {
        "type": "picklist",
        "description": "Work-specific criteria used to define the capacity limit for the workstream."
      },
      "SvcApptFieldValDplyNm": {
        "type": "string",
        "description": "Workstream display name of SvcApptFieldValue."
      },
      "SvcApptFieldValue": {
        "type": "string",
        "description": "Value of SvcApptField, the work-specific criteria of the capacity limit."
      },
      "TimeConsumedInHours": {
        "type": "double",
        "description": "Time consumed in hours by the workstream in the service territory for the defined period. This value is calculated by dividing TimeConsumedInMinutes by 60."
      },
      "TimeConsumedInMinutes": {
        "type": "double",
        "description": "Time consumed in minutes by the workstream in the service territory for the defined period."
      },
      "TimePeriod": {
        "type": "picklist",
        "description": "Duration for defining the capacity limitation on the workstream in the service territory."
      },
      "WcuUniqueField1": {
        "type": "string",
        "description": "Read-only. Auto populated, unique identifying number."
      },
      "WcuUniqueField2": {
        "type": "string",
        "description": "Read-only. Auto populated, unique identifying number."
      },
      "WorkCapacityUsageNumber": {
        "type": "string",
        "description": "Read-only. Auto populated, unique identifying number."
      }
    },
    "module": "Field Service Lightning"
  }
}