{
  "Layout": {
    "name": "Layout",
    "description": "Represents a page layout.",
    "properties": {
      "EntityDefinitionId": {
        "type": "string",
        "description": "The Id of the EntityDefinition object associated with this object."
      },
      "FullName": {
        "type": "string",
        "description": "The unique name of the layout used as the identifier for API access. The fullName can contain only underscores and alphanumeric characters. It must be unique, begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores."
      },
      "LayoutType": {
        "type": "picklist",
        "description": "Indicates the type of the layout. Valid values are: GlobalQuickActionList ProcessDefinition Standard"
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "Metadata": {
        "type": "mns:Layout",
        "description": "Layout metadata."
      },
      "Name": {
        "type": "string",
        "description": "The layout name."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "A unique string to distinguish this layout from any others. For example, if this layout is being using by a flow, use the NamespacePrefix to uniquely identify the layouts in multiple flow instances."
      },
      "ShowSubmitAndAttachButton": {
        "type": "boolean",
        "description": "Only allowed on Case layout. If true, Submit & Add Attachment displays on case edit pages to portal users in the Customer Portal."
      },
      "TableEnumOrId": {
        "type": "picklist",
        "description": "The enum (for example, Account) or ID of the object this layout is on."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_layout.htm"
  }
}