{
  "LeadDailyMetric": {
    "name": "LeadDailyMetric",
    "description": "Represents the daily engagement metrics for a lead.",
    "properties": {
      "AllCallsCallBackLater": {
        "type": "int",
        "description": "The number of calls in the day for this lead with the call result Call Back Later."
      },
      "AllCallsLeftVoicemail": {
        "type": "int",
        "description": "The number of calls in the day for this lead with the call result Left Voicemail."
      },
      "AllCallsMeaningfulConnect": {
        "type": "int",
        "description": "The number of calls in the day for this lead with the call result Meaningful Connect."
      },
      "AllCallsNotInterested": {
        "type": "int",
        "description": "The number of calls in the day for this lead with the call result Not Interested."
      },
      "AllCallsUncategorized": {
        "type": "int",
        "description": "The number of calls in the day for this lead with no call result specified."
      },
      "AllCallsUnqualified": {
        "type": "int",
        "description": "The number of calls in the day for this lead with the call result Unqualified."
      },
      "AllEmailsBouncedCount": {
        "type": "int",
        "description": "The total of hard and soft bounced emails for this lead in the day."
      },
      "AllEmailsDeliveredCount": {
        "type": "int",
        "description": "The number of successfully delivered emails for this lead in the day."
      },
      "AllEmailsDeliveredRate": {
        "type": "percent",
        "description": "The percentage of tracked emails sent that were successfully delivered to this lead. This field is a calculated field."
      },
      "AllEmailsHardBouncedCount": {
        "type": "int",
        "description": "The number of hard bounced emails for this lead in the day."
      },
      "AllEmailsOutOfOfficeCount": {
        "type": "int",
        "description": "The number of emails that triggered an out of office reply for this lead in the day."
      },
      "AllEmailsSentCount": {
        "type": "int",
        "description": "The number of emails sent to this lead in the day."
      },
      "AllEmailsSoftBouncedCount": {
        "type": "int",
        "description": "The number of emails soft bounced for this lead in the day."
      },
      "AllEmailsTrackedSentCount": {
        "type": "int",
        "description": "The number of emails sent to this lead with engagement tracking enabled in the day."
      },
      "AllEmailsUntrackedSentCount": {
        "type": "int",
        "description": "The number of emails sent to this lead without engagement tracking enabled in the day."
      },
      "AllTotalCallsCount": {
        "type": "int",
        "description": "The total number of calls to this lead with all call results in the day."
      },
      "DailyCutOffTimeStamp": {
        "type": "dateTime",
        "description": "The time of day when each 24-hour metrics period starts and ends."
      },
      "Date": {
        "type": "date",
        "description": "The date on which the engagement occurred."
      },
      "DateInt": {
        "type": "int",
        "description": "The date on which the engagement occurred, in yyyymmdd format."
      },
      "HardBounceTrackableSends": {
        "type": "int",
        "description": "The number of emails sent to this lead with hard bounce tracking."
      },
      "InboundEngagementsCount": {
        "type": "int",
        "description": "The number of inbound engagements for this lead in the day. This field is a calculated field. The value is the sum of UniqueEmailsOpenedCount, UniqueEmailsRepliedCount, and UniqueEmailsLinkClickedCount."
      },
      "LeadId": {
        "type": "reference",
        "description": "The ID of the related lead."
      },
      "LinkClickTrackableSends": {
        "type": "int",
        "description": "The number of emails sent to this lead with link click tracking."
      },
      "OpenTrackableSends": {
        "type": "int",
        "description": "The number of emails sent to this lead with open tracking."
      },
      "OutOfOfficeTrackableSends": {
        "type": "int",
        "description": "The number of emails sent to this lead with out-of-office tracking."
      },
      "OutboundEngagementsCount": {
        "type": "int",
        "description": "The number of outbound engagements for this lead in the day. This field is a calculated field. The value is the sum of AllTotalCallsCount and AllEmailsDeliveredCount."
      },
      "ReplyTrackableSends": {
        "type": "int",
        "description": "The number of emails sent to this lead with reply tracking."
      },
      "SoftBounceTrackableSends": {
        "type": "int",
        "description": "The number of emails sent to this lead with soft bounce tracking."
      },
      "TrackableSendHardBounceRate": {
        "type": "percent",
        "description": "The percentage of emails sent to this lead with hard bounce tracking that hard bounced. This field is a calculated field."
      },
      "TrackableSendLinkClickRate": {
        "type": "percent",
        "description": "The percentage of emails sent to this lead with link tracking that had link clicks. This field is a calculated field."
      },
      "TrackableSendOpenRate": {
        "type": "percent",
        "description": "The percentage of emails sent to this lead with open tracking that were opened by the recipient. This field is a calculated field."
      },
      "TrackableSendOutOfOfficeRate": {
        "type": "percent",
        "description": "The percentage of emails sent to this lead with out-of-office tracking that received out-of-office replies. This field is a calculated field."
      },
      "TrackableSendReplyRate": {
        "type": "percent",
        "description": "The percentage of emails sent to this lead with reply tracking that received replies. This field is a calculated field."
      },
      "TrackableSendSoftBounceRate": {
        "type": "percent",
        "description": "The percentage of emails sent to this lead with soft bounce tracking that soft bounced. This field is a calculated field."
      },
      "UniqueEmailsLinkClickedCount": {
        "type": "int",
        "description": "The number of individual emails in which the lead clicked a link in the day."
      },
      "UniqueEmailsOpenedCount": {
        "type": "int",
        "description": "The number of individual emails opened by the lead in the day."
      },
      "UniqueEmailsRepliedCount": {
        "type": "int",
        "description": "The number of individual emails replied to by the lead in the day."
      }
    },
    "module": "Core Salesforce"
  }
}