{
  "LeadLineItem": {
    "name": "LeadLineItem",
    "description": "Represents items such as vehicles, accessories, and parts that a lead is interested in.",
    "properties": {
      "AssetIdentificationNumber": {
        "type": "string",
        "description": "The unique identifier of the associated product, such as a vehicle identification number or serial number of an accessory."
      },
      "Classification": {
        "type": "picklist",
        "description": "Specifies the classification type of the associated item such as new, used, or refurbished."
      },
      "Condition": {
        "type": "picklist",
        "description": "Specifies the condition of the associated item, such as excellent, fair, or unknown."
      },
      "InterestType": {
        "type": "picklist",
        "description": "Specifies the lead's interest type such as buying an item, selling an item, leasing an item, and so on."
      },
      "ItemType": {
        "type": "picklist",
        "description": "Specifies the type of item that the lead is interested in, such as a vehicle, parts of a vehicle, other accessories, and so on."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LeadId": {
        "type": "reference",
        "description": "The parent Lead record that's associated with this line item."
      },
      "Name": {
        "type": "string",
        "description": "The name of the lead line item."
      },
      "PriceType": {
        "type": "picklist",
        "description": "Specifies the type of price, such as quote, offer, or appraisal, associated with the item."
      },
      "ProductId": {
        "type": "reference",
        "description": "The Product record associated with this line item."
      },
      "Quantity": {
        "type": "double",
        "description": "The number of units of the item that the lead is interested in."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "The price per unit of the associated product."
      }
    },
    "module": "Automotive Cloud"
  }
}