{
  "Lead": {
    "name": "Lead",
    "description": "Represents a prospect or lead.",
    "properties": {
      "ActionCadenceAssigneeId": {
        "type": "reference",
        "description": "The ID of the sales rep designated to work the lead through their assigned cadence. This field is available in API version 48.0 and later when the Sales Engagement license is enabled. To see this field, the user also needs the Sales Engagement User or Sales Engagement Quick Cadence Creator user permission set."
      },
      "ActionCadenceId": {
        "type": "reference",
        "description": "The ID of the lead’s assigned cadence. This field is available in API version 48.0 and later when the Sales Engagement license is enabled. To see this field, the user also needs the Sales Engagement User or Sales Engagement Quick Cadence Creator user permission set."
      },
      "ActionCadenceState": {
        "type": "picklist",
        "description": "The state of the current action cadence tracker. This field is available in API version 50.0 and later when the Sales Engagement license is enabled. To see this field, the user also needs the Sales Engagement User or Sales Engagement Quick Cadence Creator user permission set."
      },
      "ActiveTrackerCount": {
        "type": "int",
        "description": "The number of cadences that are actively running on this lead. This field is available in API version 57.0 and later when the Sales Engagement license is enabled. To see this field, the user also needs the Sales Engagement User or Sales Engagement Quick Cadence Creator user permission set."
      },
      "ActivityMetricId": {
        "type": "reference",
        "description": "When Einstein Activity Capture with Activity Metrics is enabled, the ID of the related activity metric."
      },
      "ActivityMetricRollupId": {
        "type": "reference",
        "description": "When Einstein Activity Capture with Activity Metrics is enabled, the ID of the related activity metric rollup."
      },
      "Address": {
        "type": "address",
        "description": "The compound form of the address. Read-only. For details on compound address fields, see Address Compound Fields."
      },
      "AnnualRevenue": {
        "type": "currency",
        "description": "Annual revenue for the lead’s company."
      },
      "City": {
        "type": "string",
        "description": "City for the lead’s address."
      },
      "CleanStatus": {
        "type": "picklist",
        "description": "Indicates the record's clean status compared with Data.com. .Several values for CleanStatus appear with different labels on the lead record. Values include: Acknowledged - Reviewed Different Inactive Matched - In Sync NotFound - Not Found Pending - Not Compared SelectMatch - Select Match Skipped"
      },
      "Company": {
        "type": "string",
        "description": "Required. The lead’s company. If person account record types have been enabled, and if the value of Company is null, the lead converts to a person account."
      },
      "CompanyDunsNumber": {
        "type": "string",
        "description": "The Data Universal Numbering System (D-U-N-S) number, which is a unique, nine-digit number assigned to every business location in the Dun & Bradstreet database that has a unique, separate, and distinct operation. Industries and companies use D-U-N-S numbers as a global standard for business identification and tracking. Maximum size is 9 characters.This field is only available to organizations that use Data.com Prospector or Data.com Clean."
      },
      "ConvertedAccountId": {
        "type": "reference",
        "description": "Object reference ID that points to the account into which the lead converted."
      },
      "ConvertedContactId": {
        "type": "reference",
        "description": "Object reference ID that points to the contact into which the lead converted."
      },
      "ConvertedDate": {
        "type": "date",
        "description": "Date on which this lead was converted."
      },
      "ConvertedOpportunityId": {
        "type": "reference",
        "description": "Object reference ID that points to the opportunity into which the lead has been converted."
      },
      "ConnectionReceivedId": {
        "type": "reference",
        "description": "ID of the PartnerNetworkConnection that shared this record with your org. This field is available when Salesforce to Salesforce is enabled."
      },
      "ConnectionSentId": {
        "type": "reference",
        "description": "ID of the PartnerNetworkConnection that this record is shared with. This field is available Salesforce to Salesforce is enabled. In API version 16.0 and later, this value is null. Use PartnerNetworkRecordConnection object to forward records to connections."
      },
      "Country": {
        "type": "string",
        "description": "The lead’s country."
      },
      "CountryCode": {
        "type": "picklist",
        "description": "The ISO country code for the lead’s address."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for organizations with the multicurrency feature enabled. Contains the ISO code for any currency allowed by the organization."
      },
      "DandBCompanyId": {
        "type": "reference",
        "description": "Reference ID to a Dun & Bradstreet® company record, associated with an account added from Data.com."
      },
      "Description": {
        "type": "textarea",
        "description": "The lead’s description."
      },
      "Division": {
        "type": "picklist",
        "description": "A logical segment of your organization's data. For example, if your company is organized into different business units, you could create a division for each business unit, such as North America, Healthcare, or Consulting. Available only when the Division permission is enabled."
      },
      "Email": {
        "type": "email",
        "description": "The lead’s email address."
      },
      "EmailBouncedDate": {
        "type": "dateTime",
        "description": "If bounce management is activated and an email sent to the lead bounced, the date and time of the bounce. Email bounce functionality isn't triggered by record updates, including updates to this field."
      },
      "EmailBouncedReason": {
        "type": "string",
        "description": "If bounce management is activated and an email sent to the lead bounced, the reason for the bounce. Email bounce functionality isn't triggered by record updates, including updates to this field."
      },
      "ExportStatus": {
        "type": "picklist",
        "description": "Derived field for the record map for Partner Connect. The export status of this opportunity to the partner’s connected org. To see this field, enable Partner Connect and add the Export Vendor Records to an Authorized Partner Org user permission to the cosell export user. See Set Up Partner Connect as a Vendor in Salesforce Help. Available in API version 62.0 and later."
      },
      "Fax": {
        "type": "phone",
        "description": "The lead’s fax number."
      },
      "FirstCallDateTime": {
        "type": "datetime",
        "description": "The date and time of the first call placed to the lead. This field is available in API version 48.0 when the Sales Engagement license is enabled. To see this field, the user also needs the Sales Engagement User or Sales Engagement Quick Cadence Creator user permission set."
      },
      "FirstEmailDateTime": {
        "type": "datetime",
        "description": "The date and time of the first email sent to the lead. This field is available in API version 48.0 when the Sales Engagement license is enabled. To see this field, the user also needs the Sales Engagement User or Sales Engagement Quick Cadence Creator user permission set."
      },
      "FirstName": {
        "type": "string",
        "description": "The lead’s first name up to 40 characters."
      },
      "GeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the address. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "GenderIdentity": {
        "type": "picklist",
        "description": "The lead’s internal experience of their gender, which may or may not correspond to their designated sex at birth."
      },
      "HasOptedOutOfEmail": {
        "type": "boolean",
        "description": "Indicates whether the lead doesn’t want to receive email from Salesforce (true) or does (false). Label is Email Opt Out."
      },
      "HasOptedOutOfFax": {
        "type": "boolean",
        "description": "Indicates whether the lead doesn’t want to receive faxes from Salesforce (true) or does (false). Label is FaxOpt Out."
      },
      "IndividualId": {
        "type": "reference",
        "description": "ID of the data privacy record associated with this lead. This field is available if you enabled Data Protection and Privacy in Setup."
      },
      "Industry": {
        "type": "picklist",
        "description": "Industry in which the lead works."
      },
      "IsConverted": {
        "type": "boolean",
        "description": "Indicates whether the lead has been converted (true) or not (false). Label is Converted."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "IsPriorityRecord": {
        "type": "boolean",
        "description": "Shows whether the user has marked the lead as important (True) or not (False). The default value is false. Available in API version 59.0 and later."
      },
      "IsUnreadByOwner": {
        "type": "boolean",
        "description": "If true, lead has been assigned, but not yet viewed. See Unread Leads for more information. Label is Unread By Owner."
      },
      "Jigsaw": {
        "type": "string",
        "description": "References the ID of a contact in Data.com. If a lead has a value in this field, it means that a contact was imported as a lead from Data.com. If the contact (converted to a lead) wasn’t imported from Data.com, the field value is null. Maximum size is 20 characters. Available in API version 22.0 and later. Label is Data.com Key. Important The Jigsaw field is exposed in the API to support troubleshooting for import errors and reimporting of corrected data. Don’t modify the value in the Jigsaw field."
      },
      "JigsawContactId": {
        "type": "string",
        "description": "The ID of the contact in reference to Jigsaw. Important The Jigsaw field is exposed in the API to support troubleshooting for import errors and reimporting of corrected data. Don’t modify the value in the Jigsaw field."
      },
      "LastActivityDate": {
        "type": "date",
        "description": "Value is the most recent of either: Due date of the most recent event logged against the record. Due date of the most recently closed task associated with the record."
      },
      "LastName": {
        "type": "string",
        "description": "Required. Last name of the lead up to 80 characters."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "Latitude": {
        "type": "double",
        "description": "Used with Longitude to specify the precise geolocation of an address. Acceptable values are numbers between –90 and 90 up to 15 decimal places. For details on geolocation compound fields, see Compound Field Considerations and Limitations"
      },
      "LeadSource": {
        "type": "picklist",
        "description": "The origin or source of the lead."
      },
      "Longitude": {
        "type": "double",
        "description": "Used with Latitude to specify the precise geolocation of an address. Acceptable values are numbers between –180 and 180 up to 15 decimal places. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "MasterRecordId": {
        "type": "reference",
        "description": "If this record was deleted as the result of a merge, this field contains the ID of the record that was kept. If this record was deleted for any other reason, or hasn’t been deleted, the value is null.When using Apex triggers to determine which record was deleted in a merge event, this field’s value is the ID of the record that remains in Trigger.old. In Trigger.new, the value is null."
      },
      "MiddleName": {
        "type": "string",
        "description": "The lead’s middle name. Maximum size is 40 characters."
      },
      "MobilePhone": {
        "type": "phone",
        "description": "The lead’s mobile phone number."
      },
      "Name": {
        "type": "string",
        "description": "Concatenation of FirstName, MiddleName, LastName, and Suffix up to 203 characters, including whitespaces."
      },
      "NumberOfEmployees": {
        "type": "int",
        "description": "Number of employees at the lead’s company. Label is Employees."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the lead’s owner."
      },
      "PartnerAccountId": {
        "type": "reference",
        "description": "ID of the partner account for the partner user that owns this lead. Available if Partner Relationship Management is enabled or if digital experiences is enabled and you have partner portal licenses. In API version 16.0 and later, the Partner Account field is set to the appropriate account for the partner user that owns the lead. If the owner of the lead isn’t a partner user, this field has no value."
      },
      "Phone": {
        "type": "phone",
        "description": "The lead’s phone number."
      },
      "PhotoUrl": {
        "type": "url",
        "description": "Path to be combined with the URL of a Salesforce instance (Example: https://yourInstance.salesforce.com/) to generate a URL to request the social network profile image associated with the lead. Generated URL returns an HTTP redirect (code 302) to the social network profile image for the lead."
      },
      "PostalCode": {
        "type": "string",
        "description": "Postal code for the address of the lead. Label is Zip/Postal Code."
      },
      "Pronouns": {
        "type": "picklist",
        "description": "The lead’s personal pronouns, reflecting their gender identity. Others can use these pronouns to refer to the lead in the third person. The entry is selected from a picklist of available values, which the administrator sets. Maximum 40 characters."
      },
      "Rating": {
        "type": "picklist",
        "description": "Rating of the lead."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "ID of the record type assigned to this object."
      },
      "Salutation": {
        "type": "picklist",
        "description": "Salutation for the lead."
      },
      "ScheduledResumeDateTime": {
        "type": "dateTime",
        "description": "The date and time when the action cadence tracker is going to resume after it’s paused or on a wait step. This field is available in API version 54.0 and later when the Sales Engagement license is enabled. To see this field, the user also needs the Sales Engagement User or Sales Engagement Quick Cadence Creator user permission set."
      },
      "ScoreIntelligenceId": {
        "type": "reference",
        "description": "The ID of the intelligent field record that contains lead score."
      },
      "State": {
        "type": "string",
        "description": "State for the address of the lead."
      },
      "StateCode": {
        "type": "picklist",
        "description": "The ISO state code for the lead’s address."
      },
      "Status": {
        "type": "picklist",
        "description": "Status code for this converted lead. Status codes are defined in Status and represented in the API by the LeadStatus object."
      },
      "Street": {
        "type": "textarea",
        "description": "Street number and name for the address of the lead."
      },
      "Suffix": {
        "type": "string",
        "description": "The lead’s name suffix. Maximum size is 40 characters."
      },
      "Title": {
        "type": "string",
        "description": "Title for the lead, such as CFO or CEO. The maximum size is 128 characters. When converting a lead to a person account, the conversion fails if the lead Title field contains more than 80 characters."
      },
      "Website": {
        "type": "url",
        "description": "Website for the lead."
      },
      "assignmentRuleId": {
        "type": "",
        "description": ""
      },
      "useDefaultRule": {
        "type": "",
        "description": ""
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_lead.htm"
  }
}