{
  "LearnerProgramRqmtProgress": {
    "name": "LearnerProgramRqmtProgress",
    "description": "Represents information about the progress of a requirement that a learner is required to complete as a part of the assigned program plan.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the Learning Program Requirement Progress."
      },
      "Duration": {
        "type": "double",
        "description": "The allocated length of time for completion of the Requirement."
      },
      "DurationUnit": {
        "type": "picklist",
        "description": "The unit of measurement for length of time for the completion of the Requirement. Example values include Credit Hour, Contact Hour, Hours, Weeks, Quarters, Semesters, and Years."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates whether the record is locked (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "LearnerProgramRequirementId": {
        "type": "reference",
        "description": "The Learner Program Requirement associated with this Learner Program Requirement Progress."
      },
      "LearningOutcomeItemId": {
        "type": "reference",
        "description": "The Learning Outcome Item used to fulfill the requirement."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates whether the record can be edited (true) or not (false)."
      },
      "Name": {
        "type": "string",
        "description": "The name of the Learning Program Requirement Progress that tracks the completion of a requirement."
      }
    },
    "module": "Education Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.edu_cloud_dev_guide.meta/edu_cloud_dev_guide/sforce_api_objects_learnerprogramrqmtprogress.htm"
  }
}