{
  "LearningContent": {
    "name": "LearningContent",
    "description": "Represents a Trailhead or enablement site (myTrailhead) module assigned to a user in Workforce Engagement or Learning Paths. This object also represents a Trailhead module or video in an Enablement program exercise.",
    "properties": {
      "ApiName": {
        "type": "string",
        "description": "The module's human-readable API name, such as pure-aloe-sales-strategies."
      },
      "AvailablePointCount": {
        "type": "int",
        "description": "The maximum points that a user can earn on their profile by completing the module. This value is the sum of points that the content creator assigns to the module’s units."
      },
      "ContainsAssessmentType": {
        "type": "picklist",
        "description": "Specifies the type of assessment that the content’s units include."
      },
      "ContentType": {
        "type": "picklist",
        "description": "The type of content assigned to the user."
      },
      "ContentUrl": {
        "type": "url",
        "description": "The absolute URL to the content, such as https://purealoe.my.trailhead.com/en/content/sales-team-enablement/modules/pure-aloe-sales-strategies."
      },
      "Description": {
        "type": "string",
        "description": "The module’s description."
      },
      "DurationCount": {
        "type": "int",
        "description": "The total time, in minutes, for a learner to complete all units in the module. This value is the sum of the estimated times that the content creator assigns to the module’s units."
      },
      "ExternalId": {
        "type": "string",
        "description": "The GUID that Trailhead uses to reference the module."
      },
      "ImageUrl": {
        "type": "url",
        "description": "The absolute URL to the module’s badge art image file."
      },
      "IsPublic": {
        "type": "boolean",
        "description": "Indicates whether the content is public Trailhead content (true) or private enablement site (myTrailhead) content (false)."
      },
      "Title": {
        "type": "string",
        "description": "The module’s title."
      }
    },
    "module": "Core Salesforce"
  }
}