{
  "LearningFoundationItem": {
    "name": "LearningFoundationItem",
    "description": "Represents information about the prerequisite, co-requisite, or the recommended learning that’s required for a learning outcome.",
    "properties": {
      "Category": {
        "type": "string",
        "description": "The category associated with the Learning Foundation Item."
      },
      "Duration": {
        "type": "double",
        "description": "The allocated length of time for completion of the Learning."
      },
      "DurationUnit": {
        "type": "picklist",
        "description": "The unit of measurement for length of time for completion of the Learning."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates whether the record is locked (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "LearningAchievementId": {
        "type": "reference",
        "description": "A modeled qualification, achievement, or other program outcome used for the Learning Foundation."
      },
      "LearningId": {
        "type": "reference",
        "description": "Prerequisite, co-requisite or recommended Learning to attain a Learning Achievement."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates whether the record can be edited (true) or not (false)."
      },
      "MinimumNumericGrade": {
        "type": "double",
        "description": "The minimum numeric grade that is required to meet the learning foundation requirement. This is applicable to Learner Program and Course Offering Participant Result."
      },
      "Name": {
        "type": "string",
        "description": "Name of the mapping between the Learning and the Learning Achievement requirements."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of Learning Foundation Item."
      }
    },
    "module": "Education Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.edu_cloud_dev_guide.meta/edu_cloud_dev_guide/sforce_api_objects_learningfoundationitem.htm"
  }
}