{
  "LegalEntity": {
    "name": "LegalEntity",
    "description": "Represents the way an organization is structured. An organization can be a single legal entity or it can comprise more than one legal entity.",
    "properties": {
      "CompanyName": {
        "type": "string",
        "description": "The name of the company that this legal entity represents."
      },
      "Description": {
        "type": "textarea",
        "description": "Additional details about the legal entity."
      },
      "EmailTemplateId": {
        "type": "reference",
        "description": "A template that's used to send emails for the legal entity. This field is available in API version 65.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a legal entity indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a legal entity. If this value is null, it’s possible that the user only accessed the legal entity or a related list view (LastReferencedDate), but not viewed the legal entity itself."
      },
      "LegalEntityAddress": {
        "type": "address",
        "description": "The address of the company that this legal entity represents. See Address Compound Fields for details on compound address fields."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the legal entity."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Required. The ID of the record owner."
      },
      "ShouldAttachInvoiceDocToEmail": {
        "type": "boolean",
        "description": "Indicates whether to attach the invoice PDF document to the email that's sent for the legal entity (true) or not (false). This field is available in API version 65.0 and later."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the legal entity."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_legalentity.htm"
  }
}