{
  "ListViewChartInstance": {
    "name": "ListViewChartInstance",
    "description": "Retrieves metadata for all standard and custom charts for a given entity in context of a given list view.",
    "properties": {
      "AggregateField": {
        "type": "string",
        "description": "The field that’s used for calculating data on each group. AggregateField can’t be the same as GroupingField."
      },
      "AggregateType": {
        "type": "picklist",
        "description": "The type of calculations to run on each group. The supported AggregateType values are Count, Sum, and Avg."
      },
      "ChartType": {
        "type": "picklist",
        "description": "The type of chart to create. The supported chart types are horizontal bar chart, vertical bar chart, and donut chart."
      },
      "DataQuery": {
        "type": "textarea",
        "description": "The SOQL query that can be executed to fetch the data for drawing a chart."
      },
      "DataQueryWithoutUserFilters": {
        "type": "textarea",
        "description": "The SOQL query that can be executed to fetch the data for drawing a chart, without user filters."
      },
      "DeveloperName": {
        "type": "string",
        "description": "API name of the chart. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "ExternalId": {
        "type": "string",
        "description": "Reserved for future use."
      },
      "GroupingField": {
        "type": "string",
        "description": "The field that’s used to divide the data into collections. The field has to be supported by SOQL GROUP BY functionality. GroupingField can’t be the same as AggregateField."
      },
      "IsDeletable": {
        "type": "boolean",
        "description": "Indicates if the chart can be deleted."
      },
      "IsEditable": {
        "type": "boolean",
        "description": "Indicates if the chart can be edited. Standard charts are not editable."
      },
      "IsLastViewed": {
        "type": "boolean",
        "description": "Indicates if a chart is the last viewed by a user."
      },
      "Label": {
        "type": "string",
        "description": "The display name of the chart."
      },
      "ListViewChartId": {
        "type": "reference",
        "description": "ID of the chart created by a user. For standard charts, this is null."
      },
      "ListViewContextId": {
        "type": "reference",
        "description": "ID of the list view in context of which the chart is generated. Required to query ListViewChartInstance."
      },
      "SourceEntity": {
        "type": "string",
        "description": "API name of the entity to which the chart is related. Required to query ListViewChartInstance."
      }
    },
    "module": "Core Salesforce"
  }
}