{
  "LiveChatDeployment": {
    "name": "LiveChatDeployment",
    "description": "Represents the general settings for deploying Live Agent on a website.",
    "properties": {
      "BrandingId": {
        "type": "reference",
        "description": "The record ID of the static image resource that’s displayed in the chat window."
      },
      "ConnectionTimeoutDuration": {
        "type": "int",
        "description": "Indicates the amount of time before the chat times out, in seconds."
      },
      "ConnectionWarningDuration": {
        "type": "int",
        "description": "Indicates the amount of time before a time-out warning is displayed to the agent, in seconds."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record. Note Only users with View DeveloperName OR View Setup and Configuration permission can view, group, sort, and filter this field."
      },
      "Domains": {
        "type": "textarea",
        "description": "A comma-separated list of domains the deployment is allowlisted for. Leave this blank to allow the deployment to be used on any domain."
      },
      "HasTranscriptSave": {
        "type": "boolean",
        "description": "Determines whether visitors can download and save transcripts from the chat window."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the deployment."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The name of the deployment"
      },
      "MobileBrandingId": {
        "type": "reference",
        "description": "The record ID of the static image resource displayed in the mobile version of the chat window."
      },
      "OptionsHasPrechatApi": {
        "type": "boolean",
        "description": "Determines whether developers can access the Pre-Chat API."
      },
      "SiteId": {
        "type": "reference",
        "description": "The record ID of the site used for loading static resources."
      },
      "WindowTitle": {
        "type": "string",
        "description": "The text displayed in the title bar of the browser window used to launch the chat window."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_livechatdeployment.htm"
  }
}