{
  "LoanApplicantDeclaration": {
    "name": "LoanApplicantDeclaration",
    "description": "Represents financial issues like foreclosure, lawsuits, or defaults of the applicant or co-applicant.",
    "properties": {
      "BankruptcyType": {
        "type": "multipicklist",
        "description": "Bankruptcy type or types (if applicable)."
      },
      "BorrowedAmount": {
        "type": "currency",
        "description": "Amount of money borrowed for loan application transaction."
      },
      "DeclarationExtIdentifier": {
        "type": "string",
        "description": "ID that uniquely identifies imported data in an external data source (if applicable). This field is unique within your organization."
      },
      "HasBorrowedMoney": {
        "type": "boolean",
        "description": "Indicates whether borrower is borrowing money for loan application transaction."
      },
      "HasDeclaredBankruptcy": {
        "type": "boolean",
        "description": "Indicates whether borrower declared bankruptcy within the past seven years."
      },
      "HasDeedSurrender": {
        "type": "boolean",
        "description": "Indicates whether borrower conveyed title to a property in lieu of foreclosure in past 7 years."
      },
      "HasOutstandingJudgement": {
        "type": "boolean",
        "description": "Indicates whether there are one or more outstanding judgments against the borrower."
      },
      "HasOwnershipInterest": {
        "type": "boolean",
        "description": "Indicates whether borrower had ownership interest in a property in the last 3 years."
      },
      "HasPastShortSale": {
        "type": "boolean",
        "description": "Indicates whether borrower sold a property to a third party where lender agreed to accept amount less than total outstanding mortgage balance due within past 7 years."
      },
      "HasPropertyForeclosed": {
        "type": "boolean",
        "description": "Indicates whether borrower had property foreclosed upon in last 7 years."
      },
      "HasUndisclAddlCreditApp": {
        "type": "boolean",
        "description": "Indicates whether, on or before closing, borrower applied for new undisclosed credit like a credit card or installment loan."
      },
      "HasUndisclAddlPropApp": {
        "type": "boolean",
        "description": "Indicates whether, on or before closing, borrower applied for an undisclosed mortgage loan on a property other than the application property."
      },
      "IsCoSignerUndisclDebt": {
        "type": "boolean",
        "description": "Indicates whether borrower is co-signer or guarantor on debt or loan that's not disclosed on loan application."
      },
      "IsPartyToLawsuit": {
        "type": "boolean",
        "description": "Indicates whether borrower is party to lawsuit with potential personal financial liability."
      },
      "IsPresentlyDelinquent": {
        "type": "boolean",
        "description": "Indicates whether borrower is currently delinquent or in default on any federal debt or other loan, mortgage, financial obligation, bond, or loan guarantee."
      },
      "IsPrimaryResidence": {
        "type": "boolean",
        "description": "Indicates whether property to be borrower's primary residence."
      },
      "IsRelatedToSeller": {
        "type": "boolean",
        "description": "Indicates whether borrower has family or business relationship with seller of property (for purchase transaction)."
      },
      "IsSubjectToPriorityLien": {
        "type": "boolean",
        "description": "Indicates whether application property is to have a priority clean energy lien like Property Assessed Clean Energy Program financing that takes priority over the first mortgage lien."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "LoanApplicantId": {
        "type": "reference",
        "description": "ID of the borrower making these declarations."
      },
      "LoanApplicationId": {
        "type": "reference",
        "description": "ID of the loan application associated with these declarations."
      },
      "Name": {
        "type": "string",
        "description": "Name of the loan application declaration."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who owns this record."
      },
      "PriorPropertyTitleType": {
        "type": "picklist",
        "description": "Identifies how borrower held title in the ownership interest property."
      },
      "PriorPropertyUsageType": {
        "type": "picklist",
        "description": "Identifies type of property borrower held ownership interest in."
      }
    },
    "module": "Financial Services Cloud"
  }
}