{
  "LoyaltyPgmEngmtAttribute": {
    "name": "LoyaltyPgmEngmtAttribute",
    "description": "Represents information about an engagement attribute for a loyalty program.",
    "properties": {
      "DefaultValue": {
        "type": "string",
        "description": "The default value for the loyalty program engagement attribute."
      },
      "Description": {
        "type": "textarea",
        "description": "The description for the loyalty program engagement attribute."
      },
      "EndDate": {
        "type": "date",
        "description": "The date when the loyalty program engagement attribute ends."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LoyaltyProgramId": {
        "type": "reference",
        "description": "The loyalty program that’s related to the loyalty program engagement attribute."
      },
      "MaximumResetCountPerPeriod": {
        "type": "int",
        "description": "The number of times the current value of an engagement attribute can be reset during a period."
      },
      "Name": {
        "type": "string",
        "description": "The name of the loyalty program engagement attribute."
      },
      "ResetValueOn": {
        "type": "string",
        "description": "The day on which loyalty program members' current value for the engagement attribute must be reset."
      },
      "ShouldOverwriteAttrCurrVal": {
        "type": "boolean",
        "description": "Indicates whether the associated member's current value is overwritten every period (true) or not (false)."
      },
      "StartDate": {
        "type": "date",
        "description": "Required. The date when the loyalty program engagement attribute ends."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the loyalty program engagement attribute."
      },
      "TargetValue": {
        "type": "string",
        "description": "The value that the loyalty program member must reach to qualify for rewards of the engagement attribute."
      },
      "ValueResetFrequency": {
        "type": "picklist",
        "description": "The frequency at which the loyalty program member's engagement attribute value is reset."
      }
    },
    "module": "Loyalty",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.loyalty.meta/loyalty/sforce_api_objects_loyaltypgmengmtattribute.htm"
  }
}