{
  "LoyaltyLedgerTraceability": {
    "name": "LoyaltyLedgerTraceability",
    "description": "Represents a tracker for the loyalty ledger. The debit ledger consumes points from the linked credit ledger for a member redemption or an accrual cancellation.",
    "properties": {
      "ActionType": {
        "type": "picklist",
        "description": "Required. Specifies the action that creates an entry in the ledger."
      },
      "CreditLoyaltyLedgerId": {
        "type": "reference",
        "description": "Required. The credit type loyalty ledger associated with the loyalty ledger tracker. Points are consumed from the credit type ledger for the loyalty program member's debit type ledger."
      },
      "DebitLoyaltyLedgerId": {
        "type": "reference",
        "description": "Required. The debit ledger associated with the loyalty ledger tracker. Points are consumed by the debit ledger from the loyalty program member's point balance."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LoyaltyPgmCurrencySubtypeId": {
        "type": "reference",
        "description": "The ID of the loyalty program currency subtype associated with the related loyalty ledger."
      },
      "LoyaltyProgramCurrencyId": {
        "type": "reference",
        "description": "The ID of the loyalty program currency associated with the related loyalty ledger."
      },
      "LoyaltyProgramMemberId": {
        "type": "reference",
        "description": "The ID of the loyalty program member associated with the related loyalty ledger."
      },
      "Name": {
        "type": "string",
        "description": "The autogenerated number of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "Points": {
        "type": "double",
        "description": "Required. The number of points used from the credit ledger by the debit ledger."
      }
    },
    "module": "Loyalty"
  }
}