{
  "LoyaltyPgmMbrAttributeVal": {
    "name": "LoyaltyPgmMbrAttributeVal",
    "description": "Represents information about the value reached by a loyalty program member for an engagement attribute.",
    "properties": {
      "CumulativeValue": {
        "type": "double",
        "description": "The cumulative value achieved by a loyalty program member for the related loyalty program engagement attribute across all the periods."
      },
      "CurrentValue": {
        "type": "string",
        "description": "The value achieved by a loyalty program member for the related loyalty program member engagement attribute in during a specific period."
      },
      "EndDate": {
        "type": "date",
        "description": "The end date of the period for which the member's progress towards achieving the related engagement attribute target is tracked."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastResetDate": {
        "type": "date",
        "description": "The date on which the related loyalty program member's current value was last reset."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LoyaltyPgmEngmtAttributeId": {
        "type": "reference",
        "description": "Required. The loyalty program engagement attribute that’s related to the loyalty program member engagement attribute value."
      },
      "LoyaltyProgramMemberId": {
        "type": "reference",
        "description": "The loyalty program member that’s related to the loyalty program member engagement attribute value."
      },
      "Name": {
        "type": "string",
        "description": "The name of the loyalty program engagements attribute related to the loyalty program member engagement attribute value."
      },
      "ResetCount": {
        "type": "int",
        "description": "The number of times the current value of the engagement attribute is reset."
      },
      "StartDate": {
        "type": "date",
        "description": "Required. The start date of the period for which the member's progress towards achieving the related engagement attribute target is tracked."
      }
    },
    "module": "Loyalty"
  }
}