{
  "LoyaltyMemberCurrency": {
    "name": "LoyaltyMemberCurrency",
    "description": "Represents the information about point balance for a member and a particular currency.",
    "properties": {
      "BalanceBeforeReset": {
        "type": "double",
        "description": "The last balance of points before resetting the qualifying points of the member."
      },
      "EscrowPointsBalance": {
        "type": "double",
        "description": "The number of escrow points to be credited to the loyalty member's points balance. This field is available in API version 53.0 and later."
      },
      "ExpirablePoints": {
        "type": "double",
        "description": "Calculates the points to be expired for unredeemed points."
      },
      "LastAccrualProcessedDate": {
        "type": "dateTime",
        "description": "The date when the last accrual was processed. This field indicates the date and time at which the Point Balance calculation process updated the total accrued points for a member and its currency the last time."
      },
      "LastEscrowProcessedDate": {
        "type": "dateTime",
        "description": "The last date and time when the Roll Over Escrow Points to Members Data Processing Engine definition was run to calculate rollover of escrow points. This field is available in API version 53.0 and later."
      },
      "LastExpirationProcessRunDate": {
        "type": "date",
        "description": "The most recent date when the expired points for a member were calculated."
      },
      "LastExpiredPtTraceabilityRunDt": {
        "type": "date",
        "description": "The latest date on which a process was run to trace points that have expired. This field is available in API version 65.0 and later."
      },
      "LastPointsAggregationDate": {
        "type": "",
        "description": "The latest date on which a process was run to trace points that have expired."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastResetDate": {
        "type": "date",
        "description": "The most recent date when the qualifying points for members were reset."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LoyaltyMemberId": {
        "type": "reference",
        "description": "ID of the loyalty program member."
      },
      "LoyaltyProgramCurrencyId": {
        "type": "reference",
        "description": "ID of the loyalty program currency."
      },
      "Name": {
        "type": "string",
        "description": "The name of the loyalty member currency."
      },
      "NextResetDate": {
        "type": "date",
        "description": "The next date when the qualifying points for members are reset."
      },
      "PointsBalBeforeSecondLastReset": {
        "type": "double",
        "description": "The points balance before the second to last points reset of the member's associated qualifying currency. This field is available in API version 55.0 and later."
      },
      "PointsBalance": {
        "type": "double",
        "description": "Represents information about Point balance for a member and a particular currency."
      },
      "RedemStlPendFromDateTime": {
        "type": "dateTime",
        "description": "Date and time from when the member's redemption settlement is pending for the currency. This field is available in API version 61.0 and later."
      },
      "TotalEscrowPointsAccrued": {
        "type": "double",
        "description": "The number of escrow points that the associated member has accrued. This field is available in API version 53.0 and later."
      },
      "TotalEscrowRolloverPoints": {
        "type": "double",
        "description": "The total number of escrow points that are credited to the points balance until the current date. This field is available in API version 53.0 and later."
      },
      "TotalPointsAccrued": {
        "type": "double",
        "description": "The total points accrued by the member until today."
      },
      "TotalPointsExpired": {
        "type": "double",
        "description": "The total points expired for a member until today."
      },
      "TotalPointsRedeemed": {
        "type": "double",
        "description": "The total points redeemed by the member until today."
      }
    },
    "module": "Loyalty",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.loyalty.meta/loyalty/sforce_api_objects_loyaltymembercurrency.htm"
  }
}