{
  "LoyaltyPgmPtnrLdgrSummary": {
    "name": "LoyaltyPgmPtnrLdgrSummary",
    "description": "Represents the aggregated ledger used by a loyalty program to credit points to or debit points from a prepaid partner's points pack. This ledger can also be used to add or deduct the monetary value of points from the postpaid partner's bill.",
    "properties": {
      "ActivityDate": {
        "type": "date",
        "description": "Required. The date on which points that are part of the associated loyalty program partner prepaid pack are debited or credited. For postpaid billing, it is the date when the postpaid amount of the loyalty program partner is debited or credited."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LoyaltyPgmPtnrPrepaidPackId": {
        "type": "reference",
        "description": "The loyalty program partner prepaid pack associated with the loyalty program partner ledger."
      },
      "LoyaltyProgramPartnerId": {
        "type": "reference",
        "description": "The loyalty program partner associated with the loyalty program."
      },
      "Name": {
        "type": "string",
        "description": "The name of the loyalty program partner ledger summary."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. Specifies the status of the loyalty program partner ledger."
      },
      "TotalPoints": {
        "type": "double",
        "description": "Required. The number of points debited from or credited to the associated loyalty program partner's prepaid pack or postpaid bill amount."
      },
      "Type": {
        "type": "picklist",
        "description": "Required. Specifies the type of the loyalty program partner ledger."
      }
    },
    "module": "Loyalty"
  }
}