{
  "LoyaltyProgramCurrency": {
    "name": "LoyaltyProgramCurrency",
    "description": "Represents qualifying and non-qualifying currencies associated with the program. Qualifying currency represents the engagement of a member with the program and it’s associated with a tier group. Non-qualifying currency represent the points that the member earns for redemption.",
    "properties": {
      "CostperUnit": {
        "type": "currency",
        "description": "The cost for each currency associated with a loyalty program."
      },
      "CurrencyType": {
        "type": "picklist",
        "description": "Required. Type of the loyalty program currency."
      },
      "DoesAllowLedgerTracing": {
        "type": "boolean",
        "description": "Indicates whether points credited by accrual transactions and debited by redemption transactions for a fixed-model non-qualifying currency is traced (true) or not (false). This field is available in API version 61.0 and later."
      },
      "DoesAllowNegativeBalance": {
        "type": "boolean",
        "description": "Indicates whether a non-qualifying currency allows members to hold a negative point balance. This field is available in API version 61.0 and later."
      },
      "ExpiryModel": {
        "type": "picklist",
        "description": "The model evaluates the type of expiration of points based on the fixed date or customer’s activity."
      },
      "ExpiryPeriodFrequency": {
        "type": "int",
        "description": "The frequency type to evaluate the expiration of currency."
      },
      "ExpiryPeriodUnit": {
        "type": "picklist",
        "description": "Unit of the period in which currency expiration is done."
      },
      "ExtendExpiration": {
        "type": "picklist",
        "description": "The field decides if the expiration date is changed on the exact day or the last day of the month."
      },
      "HasEscrow": {
        "type": "boolean",
        "description": "Indicates whether points can be escrowed for the loyalty program currency. This field is available in API version 53.0 and later."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Required. Indicates whether the loyalty program currency is active."
      },
      "IsPrimary": {
        "type": "boolean",
        "description": "Indicates whether the loyalty program currency is primary."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LoyaltyProgramId": {
        "type": "reference",
        "description": "The ID of the loyalty program."
      },
      "LoyaltyTierGroupId": {
        "type": "reference",
        "description": "The ID of the loyalty tier group."
      },
      "Name": {
        "type": "string",
        "description": "The name of the loyalty program currency."
      }
    },
    "module": "Loyalty",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.loyalty.meta/loyalty/sforce_api_objects_loyaltyprogramcurrency.htm"
  }
}