{
  "LoyaltyPgmGroupMbrRlnsp": {
    "name": "LoyaltyPgmGroupMbrRlnsp",
    "description": "Represents a junction between a Corporate or Individual type loyalty program member who is part of a group and the Group type loyalty program member.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The ID of the account with which the loyalty program member is associated."
      },
      "CanMemberRedeemFromGroup": {
        "type": "boolean",
        "description": "Required. Indicates whether the member can redeem points from a group. This field isn’t used. You can customize and use this field based on your org's requirements."
      },
      "ContactId": {
        "type": "reference",
        "description": "The ID of the contact with which the loyalty program member is associated."
      },
      "ContributionCalculationType": {
        "type": "picklist",
        "description": "Required. Specifies the basis on which the member’s point contribution to a group is calculated."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LoyaltyProgramGroupMemberId": {
        "type": "reference",
        "description": "ID of the Group type loyalty program member that the related Individual or Corporate type loyalty program member is a part of."
      },
      "MemberName": {
        "type": "string",
        "description": "The name of the related loyalty program member record. For an Individual type loyalty program member, it's the first name and the last name of the contact record associated with loyalty program member record. For a Corporate type loyalty program member, it's the name of the account record associated with the loyalty program member record. This field is read-only."
      },
      "MemberPointContributionPercent": {
        "type": "percent",
        "description": "The percentage of a group member's total accrued points that’s transferred to the group."
      },
      "MemberRole": {
        "type": "picklist",
        "description": "Specifies the role of the loyalty program member in a group. You can add values to the picklist. This field isn't used. You can customize and use this field based on your org's requirements."
      },
      "Name": {
        "type": "string",
        "description": "The name of the loyalty program member group relationship record."
      },
      "RelatedLoyaltyProgramMemberId": {
        "type": "reference",
        "description": "The related Individual or Corporate type loyalty program member associated with the loyalty program group member relationship."
      }
    },
    "module": "Loyalty",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.loyalty.meta/loyalty/sforce_api_objects_loyaltypgmgroupmbrrlnsp.htm"
  }
}