{
  "LoyaltyProgramProcess": {
    "name": "LoyaltyProgramProcess",
    "description": "Represents information about loyalty program processes that determine how transaction journals are processed.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the loyalty program process."
      },
      "ExecutionType": {
        "type": "picklist",
        "description": "Specifies the method used for executing the loyalty program process. Determines how transaction journals are processed. If you select Real Time, incoming transactions are processed as soon as they’re created. If you select Batch, then Run Program Process for Transaction Journal action in Flows is used to schedule when pending transaction journals are processed."
      },
      "JournalSubTypeId": {
        "type": "reference",
        "description": "The ID of the journal subtype record associated with the loyalty program process record."
      },
      "JournalTypeId": {
        "type": "reference",
        "description": "The ID of the journal type record associated with the loyalty program process record."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LoyaltyProgramId": {
        "type": "reference",
        "description": "The loyalty program associated with the loyalty program process record."
      },
      "LoyaltyTierGroup": {
        "type": "reference",
        "description": "The tier group of a program that's associated with the loyalty program process.This field is available in API version 56.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the loyalty program process."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "ProcessType": {
        "type": "picklist",
        "description": "Required. Specifies the type of loyalty program process."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the loyalty program process."
      }
    },
    "module": "Loyalty",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.loyalty.meta/loyalty/sforce_api_objects_loyaltyprogramprocess.htm"
  }
}