{
  "LoyaltyProgramPartner": {
    "name": "LoyaltyProgramPartner",
    "description": "Represents partners that are associated with a given loyalty program. Partners can be an accrual partner, a redemption partner, or both.",
    "properties": {
      "AccrualCostperUnit": {
        "type": "currency",
        "description": "The cost per point associated with the transactions of accrual partner. This field is available in API version 52.0 and later."
      },
      "AlertValue": {
        "type": "double",
        "description": "The value that’s used to send an alert to a partner to indicate the minimum points required when the billing type is prepaid or the maximum outstanding amount when the billing type is postpaid. This field is available in API version 55.0 and later."
      },
      "BillingType": {
        "type": "picklist",
        "description": "Specifies the method in which the loyalty program partner is billed."
      },
      "CreditedPoints": {
        "type": "double",
        "description": "The number of points credited to partners (using prepaid billing) for member redemptions, accrual cancellations, or any custom processes. This field is available in API version 55.0 and later."
      },
      "DebitedPoints": {
        "type": "double",
        "description": "The total number of points debited from the partner (using prepaid billing) for member accruals, redemption cancellations, or any custom processes. This field is available in API version 55.0 and later."
      },
      "LastProcessedDateTime": {
        "type": "dateTime",
        "description": "The last date and time when the prepaid points balance or the outstanding postpaid bill amount for a partner was calculated. This field is available in API version 55.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LoyaltyPartnerId": {
        "type": "reference",
        "description": "Required. Account ID of the loyalty program partner."
      },
      "LoyaltyProgramId": {
        "type": "reference",
        "description": "Required. ID of the loyalty program."
      },
      "Name": {
        "type": "string",
        "description": "The name of the loyalty program partner."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PartnerCategory": {
        "type": "picklist",
        "description": "The category of the program partnership."
      },
      "PartnerIndustry": {
        "type": "picklist",
        "description": "Required. The industry type of the program partner. Picklist values aren't provided for this field and must be added based on the requirements of the organization."
      },
      "PartnerStatus": {
        "type": "picklist",
        "description": "Required. The status of the partner in the loyalty program. The default value is Active."
      },
      "PartnerType": {
        "type": "picklist",
        "description": "Required. The type of the program partnership."
      },
      "PartnershipEndDate": {
        "type": "date",
        "description": "The date on which the partnership with the program ends."
      },
      "PartnershipStartDate": {
        "type": "date",
        "description": "Required. The date on which the partnership with the program starts."
      },
      "PointsBalance": {
        "type": "double",
        "description": "The number of points available with the loyalty program partner using prepaid billing. This field is available in API version 55.0 and later."
      },
      "PostpaidBillAmount": {
        "type": "currency",
        "description": "The total amount of all credits minus debits for partner transactions from the partnership start date. A positive value indicates that the partner is liable to the program. A negative value indicates the program is liable to the partner. The total amount that either the partner is liable to pay to the program or the program is liable to pay to the partner. This field is available in API version 55.0 and later."
      },
      "PurchasedPoints": {
        "type": "double",
        "description": "The total number of points that the partner (using prepaid billing) has purchased across all their packs. This field is available in API version 55.0 and later."
      },
      "RedemptionCostperUnit": {
        "type": "currency",
        "description": "The cost per point associated with the transactions of redemption partner. This field is available in API version 52.0 and later."
      }
    },
    "module": "Loyalty",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.loyalty.meta/loyalty/sforce_api_objects_loyaltyprogrampartner.htm"
  }
}