{
  "KnowledgeArticle": {
    "name": "KnowledgeArticle",
    "description": "Provides read-only access to an article and the ability to delete the primary article.",
    "properties": {
      "ArchivedById": {
        "type": "reference",
        "description": "The ID of the user who archived the article."
      },
      "ArchivedDate": {
        "type": "dateTime",
        "description": "The date when the article was archived."
      },
      "ArticleNumber": {
        "type": "string",
        "description": "The unique number automatically assigned to the article when it's created. You can't change the format or value for this field."
      },
      "CaseAssociationCount": {
        "type": "int",
        "description": "The number of cases attached to the article."
      },
      "FirstPublishedDate": {
        "type": "dateTime",
        "description": "The date when the article was first published."
      },
      "IsGeneratedByLlm": {
        "type": "boolean",
        "description": "True if the first version of an article was created with an LLM. This object is available in API version 59.0 and later."
      },
      "LastPublishedDate": {
        "type": "dateTime",
        "description": "The date when the article was last published."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user has not viewed this record or list view, though they might have accessed it (LastReferencedDate)"
      },
      "MasterLanguage": {
        "type": "picklist",
        "description": "The article's original language. Only accessible if your knowledge base supports multiple languages."
      },
      "MigratedToFromArticle": {
        "type": "string",
        "description": "The ID for the corresponding pre- or post-migration article. Contains values only in orgs that migrate from Knowledge in Salesforce Classic to Lightning Knowledge. This field is available in API version 45.0 and later."
      },
      "TotalViewCount": {
        "type": "int",
        "description": "Total number of views for this article. This field is available in API version 39.0 and later."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_knowledgearticle.htm"
  }
}