{
  "Knowledge__kav": {
    "name": "Knowledge__kav",
    "description": "Provides access to the concrete object that represents a Knowledge article version.",
    "properties": {
      "ArchivedById": {
        "type": "reference",
        "description": "The ID of the user who archived the article."
      },
      "ArchivedDate": {
        "type": "dateTime",
        "description": "The date the article version was archived."
      },
      "ArticleArchivedById": {
        "type": "reference",
        "description": "The ID of the user who archived the article."
      },
      "ArticleArchivedDate": {
        "type": "dateTime",
        "description": "The date the article was archived."
      },
      "ArticleCaseAttachCount": {
        "type": "int",
        "description": "The number of cases where this article is attached."
      },
      "ArticleCreatedById": {
        "type": "reference",
        "description": "The ID of the user who created the article."
      },
      "ArticleCreatedDate": {
        "type": "dateTime",
        "description": "The date the article was created."
      },
      "ArticleMasterLanguage": {
        "type": "picklist",
        "description": "The article's original language. Only accessible if your knowledge base supports multiple languages."
      },
      "ArticleNumber": {
        "type": "string",
        "description": "The unique number automatically assigned to the article when it's created. You can't change the format or value for this field."
      },
      "ArticleTotalViewCount": {
        "type": "int",
        "description": "Total number of views for the article."
      },
      "AssignedById": {
        "type": "reference",
        "description": "The ID of the user who assigned the article."
      },
      "AssignedToId": {
        "type": "reference",
        "description": "The ID of the user assigned to the article."
      },
      "AssignmentDate": {
        "type": "dateTime",
        "description": "The date the article was assigned to a user."
      },
      "AssignmentDueDate": {
        "type": "dateTime",
        "description": "The due date when an article is assigned."
      },
      "AssignmentNote": {
        "type": "textarea",
        "description": "Notes to the assignee from the user who assigned the article."
      },
      "ExternalRef": {
        "type": "string",
        "description": "The ID of the item being referenced on the external system. For example, the ID of a document on a Google Drive or a page on Confluence."
      },
      "ExternalSourceId": {
        "type": "reference",
        "description": "Reference to the external Knowledge data source object."
      },
      "ExternalUrl": {
        "type": "url",
        "description": "The URL of the knowledge content referenced in an external system. For example, the ID of a document in Google Drive or a page in Confluence."
      },
      "FirstPublishedDate": {
        "type": "dateTime",
        "description": "The date when the article was first published."
      },
      "IsExternalData": {
        "type": "boolean",
        "description": "Indicates whether the data is external to the customer’s knowledge base (true) or not (false)."
      },
      "IsLatestVersion": {
        "type": "boolean",
        "description": "Indicates whether the article is the most current version. (true) or not (false). This field can be true on the online or published version, a draft version in the primary language, a draft version in a translation, and the latest archived version. However, you can’t filter by (PublishState=’Online’) and (IsLatestVersion=false) because the online version is also the latest version. This field is available in API version 24.0 and later."
      },
      "IsMasterLanguage": {
        "type": "boolean",
        "description": "Indicates whether the article has one or more translations associated with it (true) or not (false)."
      },
      "IsOutOfDate": {
        "type": "boolean",
        "description": "Indicates whether the source article has been updated since this translated version was created (true) or not (false)."
      },
      "IsVisibleInApp": {
        "type": "boolean",
        "description": "Required. Indicates whether the article is visible in the Articles tab (true) or not (false)."
      },
      "IsVisibleInCsp": {
        "type": "boolean",
        "description": "Required. Indicates whether the article is visible in the Customer Portal (true) or not (false)."
      },
      "IsVisibleInPkb": {
        "type": "boolean",
        "description": "Required. Indicates whether the article is visible in the public knowledge base (true) or not (false)."
      },
      "IsVisibleInPrm": {
        "type": "boolean",
        "description": "Required. Indicates whether the article is visible in the partner portal (true) or not (false)."
      },
      "KnowledgeArticleId": {
        "type": "reference",
        "description": "The ID of the article independent from its version. The value for this field is retrieved from the Id field of the KnowledgeArticle object."
      },
      "Language": {
        "type": "picklist",
        "description": "The language that the article is written in, such as French or Chinese (Traditional).Querying or searching articles in SOSL require that you specify the Language field in the WHERE clause. The language must be the same for all article types. Before API version 47.0, you must include the Language field to filter queries on Knowledge article versions. In API version 47.0 and later, you can filter queries on Knowledge article versions with or without Language depending on what you are querying."
      },
      "LastPublishedDate": {
        "type": "dateTime",
        "description": "The date when the article was last published."
      },
      "MasterVersionId": {
        "type": "reference",
        "description": "ID of the source article, if the article is the translation of a source article. Only accessible if your knowledge base supports multiple languages."
      },
      "MigratedToFromArticleVersion": {
        "type": "string",
        "description": "The ID for the corresponding pre- or post-migration article version. Contains values only in orgs that migrate from Classic to Lightning Knowledge. Available in API version 43.0 and later."
      },
      "NextReviewDate": {
        "type": "dateTime",
        "description": "The date when the article must next be reviewed for accuracy. Available in API version 58.0 and later."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the article's owner."
      },
      "PublishStatus": {
        "type": "picklist",
        "description": "The publication status for the article: Draft: any draft articles. Online: articles published in Salesforce Knowledge. Archived: archived articles. A user must have the “Manage Articles” permission enabled to use Online. Article queries and searches in SOQL or SOSL require that you specify either the PublishStatus or the Id field in the WHERE clause. You can search for only one publication status per article type in a single SOSL query. When searching for articles with a PublishStatus of Archived, also check that IsLatestVersion equals false in your WHERE clause."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "Indicates the API Name that describes the type of article. Use the record type to determine the article structure and other settings for different types of content."
      },
      "SourceId": {
        "type": "reference",
        "description": "ID of the source from which the article was created (Case or Reply). This field is only accessible from the API and isn’t visible in the Salesforce UI."
      },
      "Summary": {
        "type": "textarea",
        "description": "Summary of the article. Maximum size is 1000 characters."
      },
      "Title": {
        "type": "string",
        "description": "Required. Article's title. Maximum size is 255 characters."
      },
      "TranslationCompletedDate": {
        "type": "dateTime",
        "description": "Date and time when the article was last translated. Only accessible if your knowledge base supports multiple languages."
      },
      "TranslationExportedDate": {
        "type": "dateTime",
        "description": "Date and time when the article was last exported for translation. Only accessible if your knowledge base supports multiple languages."
      },
      "TranslationImportedDate": {
        "type": "dateTime",
        "description": "Date and time when the article was last imported for translation. Only accessible if your knowledge base supports multiple languages."
      },
      "UrlName": {
        "type": "string",
        "description": "Required. Represents the article's URL. Can contain alphanumeric characters and hyphens but can't begin or end with a hyphen. Use a unique value regardless of context. (For example, a unique value allows you to get expected results when running an Apex test with SeeAllData set to false.) UrlName is case-sensitive and its maximum size is 255 characters."
      },
      "ValidationStatus": {
        "type": "picklist",
        "description": "Shows whether the content of the article has been validated. Possible values are Validated and Not Validated. The default value is Not Validated. This field is available in API version 24.0 or later."
      },
      "VersionNumber": {
        "type": "int",
        "description": "The number assigned to a version of an article. This field is available in API version 24.0 and later."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_knowledge__kav.htm"
  }
}