{
  "KnowledgeArticleFeedback": {
    "name": "KnowledgeArticleFeedback",
    "description": "Represents information about feedback from users on Knowledge articles and details about assignment of feedback to the article owner or team to take action.",
    "properties": {
      "AssignedToId": {
        "type": "reference",
        "description": "The user ID of the feedback assignee, who reviews and takes action on the feedback."
      },
      "FeedbackResponseId": {
        "type": "reference",
        "description": "The unique ID of the feedback response associated with the feedback record."
      },
      "FeedbackSource": {
        "type": "picklist",
        "description": "The source of feedback. Possible values are: Internal Community"
      },
      "FeedbackSubmitterId": {
        "type": "reference",
        "description": "The ID of the user who submitted feedback."
      },
      "IsLiked": {
        "type": "boolean",
        "description": "The answer to the Article Liked question in the feedback form."
      },
      "KnowledgeArticle": {
        "type": "string",
        "description": "The ID of the article associated with the feedback response."
      },
      "KnowledgeArticleUrl": {
        "type": "url",
        "description": "The URL of the article version associated with the feedback response."
      },
      "KnowledgeArticleVersion": {
        "type": "string",
        "description": "The version of the article associated with the feedback response."
      },
      "KnowledgeArticleVersionTitle": {
        "type": "string",
        "description": "The title of the article version associated with the feedback response."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the feedback record was last accessed or referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the feedback record was last viewed."
      },
      "LinkedArticleEntityId": {
        "type": "reference",
        "description": "Internal entity that links a Knowledge article version and survey invitation."
      },
      "Name": {
        "type": "string",
        "description": "A unique name automatically assigned to the Knowledge article feedback when it's created. You can't change the format or value of this field."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The user ID of the article feedback owner."
      },
      "ReviewActionTaken": {
        "type": "picklist",
        "description": "The review action taken to address the feedback. You can configure the possible values for this picklist field."
      },
      "ReviewComment": {
        "type": "textArea",
        "description": "The review comment provided by the feedback assignee. This is optional. The maximum length is 1,212 characters."
      },
      "ReviewCompletionDate": {
        "type": "dateTime",
        "description": "The date when the review was completed."
      },
      "ReviewDueDate": {
        "type": "dateTime",
        "description": "The due date for completing the feedback review."
      },
      "ReviewStatus": {
        "type": "picklist",
        "description": "The review status of the feedback. You can configure the possible values for this picklist field."
      }
    },
    "module": "Core Salesforce"
  }
}