{
  "BenefitAction": {
    "name": "BenefitAction",
    "description": "Represents details of an action that can be triggered for a benefit.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the benefit action."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. This field is automatically generated, but you can supply your own value if you create the record using the API.When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow while Salesforce generates one for each record."
      },
      "FlowDefinition": {
        "type": "picklist",
        "description": "The ID of the flow associated with the benefit action. The possible values depend on the flows defined in the org."
      },
      "FlowInstance": {
        "type": "string",
        "description": "The flow associated with the benefit action."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated in Metadata API."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the benefit action is active."
      },
      "IsBenefitExpirationAllowed": {
        "type": "boolean",
        "description": "Indicates whether the benefit action is allowed to expire the benefit."
      },
      "IsBenefitUpdateAllowed": {
        "type": "boolean",
        "description": "Indicates whether the benefit action is allowed to update the benefit."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the benefit action."
      },
      "ManageableState": {
        "type": "picklist",
        "description": "Indicates the manageable state of the specified component that is contained in a package."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The UI label of the benefit action."
      },
      "MemberBenefitVariableName": {
        "type": "string",
        "description": "The name of the input variable that stores the member benefit ID in the flow specified for the benefit action. The field is available in API version 52.0 and later."
      },
      "Metadata": {
        "type": "BenefitAction",
        "description": "Provides access to the associated metadata type and related fields in Tooling API."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation."
      },
      "ProcessType": {
        "type": "picklist",
        "description": "The process type of the benefit action."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of the benefit action."
      }
    },
    "module": "Loyalty",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.loyalty.meta/loyalty/tooling_api_objects_benefitaction.htm"
  }
}