{
  "BenefitAssignmentAdjustment": {
    "name": "BenefitAssignmentAdjustment",
    "description": "Represents a monetary or non-monetary benefit adjustment made to an enrollee that can be disbursed in various frequencies.",
    "properties": {
      "AdjustmentType": {
        "type": "picklist",
        "description": "Required. Specifies the type of adjustment made to the benefit assignment."
      },
      "ApprovalStatus": {
        "type": "picklist",
        "description": "Required. Specifies the approval status of the benefit adjustment."
      },
      "BenefitAssignmentId": {
        "type": "reference",
        "description": "Required. The benefit assignment associated with this benefit adjustment."
      },
      "Comment": {
        "type": "string",
        "description": "The description about the benefit adjustment."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "Name": {
        "type": "string",
        "description": "The name of the benefit assignment adjustment."
      },
      "ProcessingStatus": {
        "type": "picklist",
        "description": "Required. Specifies the processing status of the benefit adjustment."
      },
      "Reason": {
        "type": "string",
        "description": "Required. The reason for making an adjustment to a benefit assignment."
      },
      "RecurringAmount": {
        "type": "currency",
        "description": "Required. The benefit adjustment amount that must be paid to the enrollee or the recipient at regular intervals."
      },
      "ReferenceRecordId": {
        "type": "reference",
        "description": "The case or participant associated with the benefit assignment."
      },
      "StartDate": {
        "type": "dateTime",
        "description": "Required. The start date and time of the benefit adjustment period."
      },
      "TotalAdjustmentAmount": {
        "type": "currency",
        "description": "Required. The total benefit adjustment amount that must be paid to the enrollee or the recipient."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/sforce_api_objects_benefitassignmentadjustment.htm"
  }
}