{
  "BillingMilestonePlanItem": {
    "name": "BillingMilestonePlanItem",
    "description": "Represents a specific billing milestone within the billing milestone plan that’s used to manage and track billing based on the completion of certain deliverables or stages.",
    "properties": {
      "BillingMilestonePlanId": {
        "type": "reference",
        "description": "The billing milestone plan associated with the billing milestone plan item."
      },
      "BillingScheduleGroupId": {
        "type": "reference",
        "description": "The billing schedule group that's related to the billing milestone plan item. Available in API version 64.0 and later."
      },
      "CommencementDate": {
        "type": "picklist",
        "description": "The action that triggers the start of the billing milestone plan for a date-based milestone."
      },
      "CommencementDateOffset": {
        "type": "int",
        "description": "The offset applied to the commencement date to determine the milestone achievement date for a date-based milestone."
      },
      "CommencementDateOffsetUnit": {
        "type": "picklist",
        "description": "The unit of time for the commencement date offset."
      },
      "Description": {
        "type": "string",
        "description": "Additional details about the billing milestone plan item."
      },
      "FlatAmount": {
        "type": "currency",
        "description": "The amount in terms of units of currency, such as $10 or $21.52, to invoice from the order item. Used only when Type field has a value of FlatAmount."
      },
      "IsMilestoneAccomplished": {
        "type": "boolean",
        "description": "Required. Indicates whether the billing treatment is for milestone billing (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a billing milestone plan item record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a billing milestone plan item record. If this value is null, it’s possible that the user only accessed the billing milestone plan item record or a related list view (LastReferencedDate), but not viewed the billing milestone plan item record itself."
      },
      "MilestoneAccomplishmentDate": {
        "type": "date",
        "description": "The date the milestone is achieved for date-based milestones. For event-based milestones, this field indicates the date when the milestone is manually marked as completed."
      },
      "MilestoneAmount": {
        "type": "currency",
        "description": "The amount that’s billed when the milestone is reached or completed."
      },
      "MilestoneType": {
        "type": "picklist",
        "description": "The milestone type for the billing treatment item."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the billing milestone plan item."
      },
      "Percentage": {
        "type": "percent",
        "description": "The percentage,such as 10% or 12.5%, to invoice from the order item. Used only when Type field has a value of Percentage."
      },
      "ServicePeriodEnd": {
        "type": "picklist",
        "description": "The end date of the service associated with the milestone."
      },
      "ServicePeriodStart": {
        "type": "picklist",
        "description": "The start date of the service associated with the milestone."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the billing milestone plan item."
      },
      "Type": {
        "type": "picklist",
        "description": "Required. Specifies whether billing schedules created from this billing treatment item are based on a flat amount or a percentage of the order item's total amount."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_billingmilestoneplanitem.htm"
  }
}