{
  "BillingBatchFilterCriteria": {
    "name": "BillingBatchFilterCriteria",
    "description": "Represents the filter that all eligible billing schedules must satisfy in order to be picked up by an invoice run.",
    "properties": {
      "BatchCriteriaId": {
        "type": "reference",
        "description": "Required. The ID of the batch criteria record."
      },
      "BillingBatchFilterCriteriaNumber": {
        "type": "string",
        "description": "Required. The auto-generated reference number for the billing batch filter criteria."
      },
      "ColumnEnum": {
        "type": "picklist",
        "description": "Required. The column or field to which the filter criteria are applied."
      },
      "CriteriaFieldType": {
        "type": "picklist",
        "description": "The data type of the custom or standard criteria field."
      },
      "CriteriaSequence": {
        "type": "int",
        "description": "The order in which the filter criteria are applied on the billing batch."
      },
      "CustomCriteriaFieldName": {
        "type": "string",
        "description": "The API name of the custom field on the object specified in the ObjectName field. The filter criteria is applied on the custom field. This object is available in API version 65.0 and later."
      },
      "InvoiceRunMatchingValue": {
        "type": "picklist",
        "description": "A value to match during an invoice run. This field is useful for filtering the invoices based on specific criteria during the billing process."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "ObjectName": {
        "type": "picklist",
        "description": "Required. The object on which the filter criteria are applied."
      },
      "Operation": {
        "type": "picklist",
        "description": "Required. The type of comparison or logical operation to be performed on the specified column or field."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Required. The ID of the user who created the billing batch filter criteria."
      },
      "PaymentRunMatchingValue": {
        "type": "picklist",
        "description": "A value to match during a payment run. This field is useful for filtering the payments based on specific criteria during the billing process. This field is visible but isn't used in API version 62.0."
      },
      "StandardCriteriaField": {
        "type": "string",
        "description": "The name of the standard field for the object specified in the ObjectName field. The filter criteria is applied on the standard field. Available in API version 63.0 and later."
      },
      "Value": {
        "type": "string",
        "description": "Required. The value to be used in the filter criteria."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_billingbatchfiltercriteria.htm"
  }
}