{
  "BillingBatchScheduler": {
    "name": "BillingBatchScheduler",
    "description": "Represents a scheduled processing job that triggers recurring invoice batch runs.",
    "properties": {
      "BillingSchedulerName": {
        "type": "string",
        "description": "Required. The name of the scheduler."
      },
      "Comments": {
        "type": "textarea",
        "description": "Additional details about the billing batch scheduler."
      },
      "CronExpression": {
        "type": "string",
        "description": "Required. This field determines how often the scheduler recurs."
      },
      "EndDate": {
        "type": "date",
        "description": "The date when the scheduler stops triggering batch processing jobs."
      },
      "FrequencyCadence": {
        "type": "picklist",
        "description": "Required. The frequency of the scheduler triggering the invoice batch run."
      },
      "FrequencyOptions": {
        "type": "textarea",
        "description": "This field is a derived field that stores the scheduler configuration."
      },
      "JobType": {
        "type": "picklist",
        "description": "Required. The type of batch processing job that the scheduler triggers."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a billing batch scheduler record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a billing batch scheduler record. If this value is null, it’s possible that the user only accessed the billing batch scheduler record or a related list view (LastReferencedDate), but not viewed the billing batch scheduler record itself."
      },
      "NextRunTime": {
        "type": "dateTime",
        "description": "The date and timestamp of the next scheduled batch invoice run in the user's time zone."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Required. The ID of the user who created the scheduler."
      },
      "RecurringSubType": {
        "type": "picklist",
        "description": "The frequency at which the batch processing job recurs when the FrequencyCadence field value is set to Monthly."
      },
      "RecurringType": {
        "type": "picklist",
        "description": "The frequency at which the batch processing job is repeated when the FrequencyCadence field value is set to Weekly."
      },
      "RecursOn": {
        "type": "picklist",
        "description": "The interval at which the scheduler triggers a batch processing job."
      },
      "RecursOnDate": {
        "type": "string",
        "description": "The date on which the scheduler triggers a batch processing job."
      },
      "RecursOnDay": {
        "type": "picklist",
        "description": "The day on which the scheduler triggers a batch processing job."
      },
      "RunCriteriaId": {
        "type": "reference",
        "description": "Required. The ID of the filter criteria that’s defined for the invoice batch run or the payment batch run."
      },
      "ShouldExcludeWkendAndHldy": {
        "type": "boolean",
        "description": "Required. Indicates whether weekends and holidays are excluded from the billing schedule (true) or not (false)."
      },
      "ShouldStartRunImmediately": {
        "type": "boolean",
        "description": "Required. Indicates whether the invoice scheduler must start the run immediately (true) or not (false)."
      },
      "StartDate": {
        "type": "date",
        "description": "Required. The date when the scheduler triggers its first batch processing job."
      },
      "StartTime": {
        "type": "time",
        "description": "Required. The time when the scheduler triggers the batch processing job."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the scheduler. Only active schedulers can trigger batch processing jobs."
      },
      "TimeZone": {
        "type": "picklist",
        "description": "The time zone is either the value selected when the run was configured, or it's the user's time zone. The time zone is shown in Greenwich Mean Time (GMT)."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_billingbatchscheduler.htm",
    "accessRules": "the Billing Admin permission set to access this object",
    "clouds": [
      "Revenue Lifecycle Management",
      "Core Salesforce"
    ]
  }
}