{
  "BillingPeriodItem": {
    "name": "BillingPeriodItem",
    "description": "Represents a payment period for an invoice. The billing period item is used to pass billing information to an invoice line.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "Required. The price for the billing period item. This field is used to calculate the invoice line's amount."
      },
      "BillingPeriodEndDate": {
        "type": "date",
        "description": "The end date of a billing period that’s used to calculate the invoice line’s end date."
      },
      "BillingPeriodItemNumber": {
        "type": "string",
        "description": "Required. An auto-generated number identifying the billing period item."
      },
      "BillingPeriodStartDate": {
        "type": "date",
        "description": "The start date of a billing period item that’s used to calculate the invoice line's start date."
      },
      "BillingScheduleGroupId": {
        "type": "reference",
        "description": "The ID of the parent billing schedule group record that's related to the billing period item. Available in API version 64.0 and later."
      },
      "BillingScheduleId": {
        "type": "reference",
        "description": "Required. The ID of the parent billing schedule record of the billing period item."
      },
      "InvoiceBatchRunId": {
        "type": "reference",
        "description": "The ID of the parent invoice batch run record of the billing period item."
      },
      "InvoiceId": {
        "type": "reference",
        "description": "The ID of the parent Invoice record of the Invoice Line record that's generated from the billing period item."
      },
      "InvoiceLineId": {
        "type": "reference",
        "description": "The ID of the Invoice Line record that's generated from the billing period item. This field is populated only when a billing period item is generated by an invoice batch run. Otherwise, this field is empty."
      },
      "InvoiceStatus": {
        "type": "picklist",
        "description": "Required. The status of the invoice that contains the invoice line created from the billing period item."
      },
      "OverageQuantity": {
        "type": "double",
        "description": "The quantity of the usage overage that has exceeded the initial grant. This field is available in API version 63.0 and later with Revenue Cloud Billing license."
      },
      "RelatedMilestonePlanItemId": {
        "type": "reference",
        "description": "The billing milestone plan item that creates the billing period item. This field is available in API version 63.0 and later with Revenue Cloud Billing license."
      },
      "RelatedUsageBillPeriodItemId": {
        "type": "reference",
        "description": "The method for retrieving billing information for usage-based products. This field is available in API version 63.0 and later with Revenue Cloud Billing license."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the billing period item. Draft billing period items aren't evaluated for invoice line creation."
      },
      "TotalUsedQuantity": {
        "type": "double",
        "description": "The total quantity of the usage resource consumed during the billing period. This includes granted entitlements, excess consumption, or consumption below the granted entitlements. This field is available in API version 63.0 and later with Revenue Cloud Billing license."
      },
      "UnitOfMeasureId": {
        "type": "reference",
        "description": "The units used to measure the overage. For example, bytes or minutes. Available in API version 63.0 and later."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Contains the ISO code for any currency allowed by the org. Available only for orgs with the multicurrency feature enabled."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_billingperioditem.htm",
    "accessRules": "the Billing Admin permission set to access this object",
    "clouds": [
      "Revenue Lifecycle Management",
      "Core Salesforce"
    ]
  }
}