{
  "BlockedRedirectEventLog": {
    "name": "BlockedRedirectEventLog",
    "description": "Blocked Redirect events capture information about blocked redirections from Salesforce to untrusted and malformed URLs.",
    "properties": {
      "BlockedUri": {
        "type": "string",
        "description": "The full string of the target for the redirection."
      },
      "BlockedUriDomain": {
        "type": "string",
        "description": "If BLOCKED_URI is a URL, the domain for that URL. To allow future redirections to the BLOCKED_URI, BLOCKED_URI_DOMAIN is the value to add to RedirectWhitelistUrl."
      },
      "IsMalformedUrl": {
        "type": "boolean",
        "description": "Indicates whether this redirection was blocked because the target URL failed a syntax check or not."
      },
      "Origin": {
        "type": "string",
        "description": "The origin that caused the request to the BLOCKED_URI. For example, if a form on an Experience Cloud Visualforce site page redirects a user to an untrusted URL via the saveURL parameter, ORIGIN contains the base URL of that site."
      },
      "Referrer": {
        "type": "string",
        "description": "The absolute or partial address from which the request to the BLOCKED_URI came. The Referrer-Policy HTTP Header of the request determines how much of the URL is shared."
      },
      "RemoteAddress": {
        "type": "string",
        "description": "Remote IP address of the client making the request."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "The unique ID of a single transaction. A transaction can contain one or more events. Each event in a given transaction has the same REQUEST_ID."
      },
      "Timestamp": {
        "type": "dateTime",
        "description": "The access time of Salesforce services in GMT. For example, 2020-01-20T19:12:26.965Z. Milliseconds are the most granular setting."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_blockedredirecteventlog.htm"
  }
}