{
  "BrowserPolicyViolation": {
    "name": "BrowserPolicyViolation",
    "description": "Represents a violation that occurred within the last seven days related to the Trusted URLs and Trusted URLs for External Redirects allowlists. These violations include blocked resource requests based on your content security policy (CSP) and blocked redirections.",
    "properties": {
      "DeveloperName": {
        "type": "string",
        "description": "The developer name of the violation."
      },
      "Language": {
        "type": "picklist",
        "description": "The language for the blocked request."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Master label for this violation."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "Namespace prefix for this violation."
      },
      "UntrustedUrl": {
        "type": "string",
        "description": "The URL associated with the blocked request, without the path. For example, if a blocked requested resource is an image with the URL https://www.example.com/images/image1.png, the UntrustedUrl is https://www.example.com."
      },
      "ViolationContext": {
        "type": "picklist",
        "description": "If the ViolationType is img-src (image), font-src (fonts), or frame-src (iframe content), the content security policy (CSP) context for the request. The CSP context controls which pages can load content from a CspTrustedSite."
      },
      "ViolationType": {
        "type": "picklist",
        "description": "The violation type. Possible values are: img-src–At least one request to load an image file from the URL was blocked because the UntrustedUrl isn’t a CspTrustedSite object with this CSP directive. font-src–At least one request to load a font from the URL was blocked because the UntrustedUrl isn’t a CspTrustedSite object with this CSP directive. frame-src–At least one request to load content in an iframe that originated from the URL was blocked because the UntrustedUrl isn’t a CspTrustedSite object with this CSP directive. MalformedUrl–At least one redirection to this URL failed because the UntrustedUrl is malformed. Redirect–At least one redirection to this URL was blocked because the UntrustedUrl isn’t a RedirectWhitelistUrl object."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_browserpolicyviolation.htm"
  }
}