{
  "BulkApiEventLog": {
    "name": "BulkApiEventLog",
    "description": "Bulk API event logs contain details about Bulk API requests.",
    "properties": {
      "BatchIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the Bulk API batch."
      },
      "ClientIp": {
        "type": "string",
        "description": "The IP address of the client that’s using Salesforce services. A Salesforce internal IP (such as a login from AppExchange) is shown as “Salesforce.com IP”. For example: 96.43.144.26."
      },
      "CpuTime": {
        "type": "double",
        "description": "The CPU time in milliseconds used to complete the request. This field indicates the amount of activity taking place in the app server layer."
      },
      "FailureCount": {
        "type": "double",
        "description": "The number of failures that were returned with the request."
      },
      "IsSuccess": {
        "type": "boolean",
        "description": "Indicates whether the callout request was successful."
      },
      "JobIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the Bulk API job."
      },
      "LoginKey": {
        "type": "string",
        "description": "The string that ties together all events in a given user’s login session. It starts with a login event and ends with either a logout event or the user session expiring. For example: GeJCsym5eyvtEK2I."
      },
      "Message": {
        "type": "string",
        "description": "Any success or error message that’s associated with the request."
      },
      "ObjectType": {
        "type": "string",
        "description": "The type of entity that the Bulk API used."
      },
      "OperationType": {
        "type": "string",
        "description": "The type of Bulk API operation that was performed."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "The unique ID of a single transaction. A transaction can contain one or more events. Each event in a given transaction has the same RequestId. For example: 3nWgxWbDKWWDIk0FKfF5DV."
      },
      "RunTime": {
        "type": "double",
        "description": "The amount of time that the request took in milliseconds."
      },
      "SessionKey": {
        "type": "string",
        "description": "The user’s unique session ID. You can use this value to identify all user events within a session. When a user logs out and logs in again, a new session is started. For example: d7DEq/ANa7nNZZVD."
      },
      "Timestamp": {
        "type": "dateTime",
        "description": "The access time of Salesforce services in GMT. For example, 2020-01-20T19:12:26.965Z. Milliseconds are the most granular setting."
      },
      "Uri": {
        "type": "string",
        "description": "The URI of the page that’s receiving the request. For example: /home/home.jsp."
      },
      "UserIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the user who’s using Salesforce services through the UI or the API. For example: 00530000009M943."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_bulkapieventlog.htm"
  }
}