{
  "BundleBasedAdjustment": {
    "name": "BundleBasedAdjustment",
    "description": "Represents the association between the product selling model and the price adjustment for a product or service being sold as a bundle. This object stores information of the product or service's price, the discounts applied, along with its value for a given date range.",
    "properties": {
      "AdjustmentType": {
        "type": "picklist",
        "description": "The type of pricing adjustment being made."
      },
      "AdjustmentValue": {
        "type": "double",
        "description": "The type of pricing adjustment being made."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "ISO code of the currency. Must be one of the valid alphabetic, three-letter currency ISO codes defined by the ISO 4217 standard, such as USD, GBP, or JPY. Must be unique within your organization."
      },
      "EffectiveFrom": {
        "type": "dateTime",
        "description": "The date and time when the bundle based adjustment comes into effect."
      },
      "EffectiveTo": {
        "type": "dateTime",
        "description": "The date and time till when the bundle based adjustment remains effective."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date the bundle based adjustment was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date the bundle based adjustment was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the bundle based adjustment record."
      },
      "ParentProductId": {
        "type": "reference",
        "description": "Represents the immediate parent in the product bundle that the price is configured for."
      },
      "ParentProductSellingModelId": {
        "type": "reference",
        "description": "The immediate parent node of a product selling model when nodes are represented in a hierarchial structure."
      },
      "PriceAdjustmentScheduleId": {
        "type": "reference",
        "description": "The price adjustment schedule associated with the bundle based adjustment record."
      },
      "PricingTerm": {
        "type": "int",
        "description": "The number of pricing term units in the pricing term. Used with PricingTermUnit to define the length of the pricing term. For example, if PricingTermUnit is Months and this field is 1, the subscription is priced monthly.If the selling model is one-time, this field must be null."
      },
      "PricingTermUnit": {
        "type": "picklist",
        "description": "The unit of time used to define the pricing term. Used with PricingTerm to define the length of the pricing term. For example, if this field is Months and PricingTerm is 1, the subscription is priced monthly. If the selling model is one-time, this field must be null."
      },
      "ProductId": {
        "type": "reference",
        "description": "The ID of the product associated with the product bundle set."
      },
      "ProductSellingModelId": {
        "type": "reference",
        "description": "The ID of the ProductSellingModel record associated with this bundle based adjustment record."
      },
      "RootBundleId": {
        "type": "reference",
        "description": "Represents the structural root product in a product's bundle that the price is configured for."
      },
      "RootProductSellingModelId": {
        "type": "reference",
        "description": "The root product selling model. The primary or base product selling method."
      },
      "SellingModelType": {
        "type": "picklist",
        "description": "Indicates whether the product is sold as a one-time sale, an evergreen subscription, or a subscription with a defined term."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_bundlebasedadjustment.htm",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}