{
  "ValidationRule": {
    "name": "ValidationRule",
    "description": "Represents a validation rule or workflow rule which specifies the formula for when a condition is met.",
    "properties": {
      "Active": {
        "type": "boolean",
        "description": "Required. Indicates whether this validation rule is active, (true), or not active (false)."
      },
      "Description": {
        "type": "string",
        "description": "A description of the validation rule."
      },
      "EntityDefinition": {
        "type": "EntityDefinition",
        "description": "Required. The entity definition for the object associated with the validation rule."
      },
      "EntityDefinitionId": {
        "type": "string",
        "description": "Required. ID of the record in EntityDefinition."
      },
      "ErrorDisplayField": {
        "type": "string",
        "description": "The fully specified name of a field in the application. If a value is supplied, the error message appears next to the specified field. If you do not specify a value or the field isn’t visible on the page layout, the value changes automatically to Top of Page."
      },
      "ErrorMessage": {
        "type": "string",
        "description": "Required. The message that appears if the validation rule fails. The message must be 255 characters or less."
      },
      "FullName": {
        "type": "string",
        "description": "The internal name of the object. White spaces and special characters are escaped for validity. The name must: Contain characters, letters, or the underscore (_) character Must start with a letter Can’t end with an underscore Can't contain two consecutive underscore characters."
      },
      "Id": {
        "type": "Id",
        "description": "The unique system ID for this record."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "Metadata": {
        "type": "ValidationRule Metadata",
        "description": "Validation rule metadata."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix associated with this object. Each Developer Edition organization that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values: In Developer Edition organizations, the namespace prefix is set to the namespace prefix of the organization for all objects that support it. There is an exception if an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition organization of the package developer. In organizations that are not Developer Edition organizations, NamespacePrefix is only set for objects that are part of an installed managed package. There is no namespace prefix for all other objects."
      },
      "ValidationName": {
        "type": "string",
        "description": "The name or ID of the object that this rule is associated with."
      },
      "errorConditionFormula": {
        "type": "string",
        "description": "Required. The formula defined in the validation rule. If the formula returns a value of true, an error message is displayed."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_validationrule.htm"
  }
}