{
  "VideoCall": {
    "name": "VideoCall",
    "description": "Represents a video call.",
    "properties": {
      "AcceptanceTimeStamp": {
        "type": "dateTime",
        "description": "The timestamp when the user consented for uploading the video call recording. Reserved for future use."
      },
      "ConsentedUserId": {
        "type": "reference",
        "description": "The ID of the user who consented to upload the video call recording. Reserved for future use."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the video call. Typically, the sales rep enters the description."
      },
      "DurationInSeconds": {
        "type": "int",
        "description": "The video call duration in seconds."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "Time the video call ended, in universal time coordinated (UTC)."
      },
      "EventId": {
        "type": "reference",
        "description": "The ID of the event record associated with this video call. Reserved for future use."
      },
      "ExternalId": {
        "type": "string",
        "description": "The ID of the video call, sent by the video call provider."
      },
      "HostId": {
        "type": "reference",
        "description": "The ID of the user who hosted the meeting."
      },
      "IntelligenceScore": {
        "type": "int",
        "description": "The Einstein Intelligence score for the video call. Video calls with higher scores are likely to contain more relevant information. For example, video calls where product names and competitor names are mentioned tend to have a higher score."
      },
      "IsCallCoachingIncluded": {
        "type": "boolean",
        "description": "Indicates whether Einstein Conversation Insights is available for this org and this user (true) or not (false)."
      },
      "IsDiarizationOptIn": {
        "type": "boolean",
        "description": "Indicates whether optimal speaker separation (diarization) is opted in (true) or not (false) for the call."
      },
      "IsRecorded": {
        "type": "boolean",
        "description": "Indicates whether the video call was recorded (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "MeetingType": {
        "type": "picklist",
        "description": "The type of the call. Reserved for future use."
      },
      "Name": {
        "type": "string",
        "description": "The name of the video call. Typically entered by the sales rep."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who created the video call."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "The ID of the account or opportunity related to this video call."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "The date and time that the video call started, in universal time coordinated (UTC)."
      },
      "TranscribedLanguage": {
        "type": "string",
        "description": "The language that is transcribed for this video call."
      },
      "UsageType": {
        "type": "picklist",
        "description": "The cloud using the VideoCall."
      },
      "VendorMeetingKey": {
        "type": "string",
        "description": "The vendor's ID for this video call."
      },
      "VendorMeetingUuid": {
        "type": "string",
        "description": "The vendor's unique identifier for this video call."
      },
      "VendorName": {
        "type": "picklist",
        "description": "The name of the vendor providing the video call software."
      }
    },
    "module": "Core Salesforce"
  }
}