{
  "VisualforceRequestEventLog": {
    "name": "VisualforceRequestEventLog",
    "description": "Visualforce Request events contain details of Visualforce requests. Requests can originate from the browser (UI).",
    "properties": {
      "ClientIp": {
        "type": "string",
        "description": "The IP address of the client that’s using Salesforce services. A Salesforce internal IP (such as a login from AppExchange) is shown as “Salesforce.com IP”. For example: 96.43.144.26."
      },
      "ControllerType": {
        "type": "string",
        "description": "The type of controller that’s used by the requested Visualforce page."
      },
      "CpuTime": {
        "type": "double",
        "description": "The CPU time in milliseconds used to complete the request. This field indicates the amount of activity taking place in the app server layer."
      },
      "DatabaseBlocks": {
        "type": "double",
        "description": "Indicates how much activity is occurring in the database. A high value for this field suggests that adding indexes or filters on your queries benefits performance."
      },
      "DatabaseCpuTime": {
        "type": "double",
        "description": "The CPU time in milliseconds to complete the request. Indicates the amount of activity taking place in the database layer during the request."
      },
      "DatabaseTotalTime": {
        "type": "double",
        "description": "The time in nanoseconds for a database round trip. Includes time spent in the JDBC driver, network to the database, and DatabaseCpuTime. Compare this field to CpuTime to determine whether performance issues are occurring in the database layer or in your own code."
      },
      "HttpMethod": {
        "type": "string",
        "description": "The HTTP method of the request. For example: GET, POST, PUT, and so on."
      },
      "IsAjaxRequest": {
        "type": "boolean",
        "description": "The value is true if the request is a partial page request. The default value is false."
      },
      "IsFirstRequest": {
        "type": "boolean",
        "description": "1 if this page is the first Visualforce transaction in the request, or 0 if it isn't. The default value is 0."
      },
      "LoginKey": {
        "type": "string",
        "description": "The string that ties together all events in a given user’s login session. It starts with a login event and ends with either a logout event or the user session expiring. For example: GeJCsym5eyvtEK2I."
      },
      "ManagedPackageNamespace": {
        "type": "string",
        "description": "If the page is part of a managed package, the namespace of that package."
      },
      "PageName": {
        "type": "string",
        "description": "The name of the Visualforce page that was requested."
      },
      "QueryString": {
        "type": "string",
        "description": "The query string used to access the requested Visualforce page."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "The unique ID of a single transaction. A transaction can contain one or more events. Each event in a given transaction has the same RequestIdentifier. For example: 3nWgxWbDKWWDIk0FKfF5DV."
      },
      "RequestSize": {
        "type": "double",
        "description": "The size of the callout response, in bytes."
      },
      "RequestStatus": {
        "type": "String",
        "description": "For example: S—Success. Salesforce handled the request successfully. If an Apex controller throws an exception, this status is also returned. F—Failure. Typically 4xx or 5xx HTTP codes, such as no permission to view page, page took too long to render, page is read-only. U—Undefined A—Authorization Error R—Redirect. Typically a 3xx HTTP code, possibly initiated by an Apex controller in a Visualforce page. N—Not Found. 404 error. This field can have a blank value."
      },
      "RequestType": {
        "type": "string",
        "description": "The request type."
      },
      "ResponseSize": {
        "type": "double",
        "description": "The size of the callout request body, in bytes."
      },
      "RunTime": {
        "type": "double",
        "description": "The amount of time that the request took in milliseconds."
      },
      "SessionKey": {
        "type": "string",
        "description": "The user’s unique session ID. You can use this value to identify all user events within a session. When a user logs out and logs in again, a new session is started. For example: d7DEq/ANa7nNZZVD."
      },
      "Timestamp": {
        "type": "dateTime",
        "description": "The access time of Salesforce services in GMT. For example, 2020-01-20T19:12:26.965Z. Milliseconds are the most granular setting."
      },
      "Uri": {
        "type": "string",
        "description": "The URI of the page that’s receiving the request. For example: /home/home.jsp."
      },
      "UserIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the user who’s using Salesforce services through the UI or the API. For example: 00530000009M943."
      },
      "UserType": {
        "type": "string",
        "description": "The category of user license."
      },
      "ViewStateSize": {
        "type": "double",
        "description": "The size of the Visualforce view state in bytes."
      }
    },
    "module": "Core Salesforce"
  }
}