{
  "CalculationMatrix": {
    "name": "CalculationMatrix",
    "description": "Matches input values to a table row and returns the row's output values. The label for this object is Decision Matrix.",
    "properties": {
      "DecisionMatrixDefinitionId": {
        "type": "reference",
        "description": "The decision matrix definition record associated with this calculation matrix."
      },
      "DecisionMatrixType": {
        "type": "picklist",
        "description": "Specifies the type of lookup table."
      },
      "Description": {
        "type": "textarea",
        "description": "A text description of the Decision Matrix."
      },
      "GroupKey": {
        "type": "string",
        "description": "A key for grouping matrix rows in different versions, such as geographic region or product code."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it's possible the user only accessed this record or list view (LastReferencedDate) but didn't view it."
      },
      "MigrationStatus": {
        "type": "textarea",
        "description": "The status of migrating the data from the Calculation Matrix object to the Decision Matrix Definition object."
      },
      "Name": {
        "type": "string",
        "description": "The Decision Matrix name."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who currently owns this matrix. Default value is the user logged in to the API to perform the create action."
      },
      "SubGroupKey": {
        "type": "string",
        "description": "A subkey for grouping matrix rows in different versions, such as geographic region or product code. For example, if the GroupKey is Country, the SubGroupKey can be State or Province."
      },
      "Type": {
        "type": "picklist",
        "description": "The Decision Matrix type. A Standard Decision Matrix has no special features. A Grouped Decision Matrix groups rows by one or two keys (GroupKey and SubGroupKey) such as geographic region or product code."
      },
      "UniqueName": {
        "type": "string",
        "description": "The unique identifier of the record, which is sourced from the value in the Name field of CalculationMatrix (decision matrix). For example, if the name of the calculation matrix is sample matrix, its UniqueName would be sample_matrix."
      },
      "UsageType": {
        "type": "picklist",
        "description": "A decision matrix’s usage type."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/sforce_api_objects_calculationmatrix.htm"
  }
}