{
  "CalendarView": {
    "name": "CalendarView",
    "description": "These calendars can be created and assigned to users other than the creator. Available calendars include object, shared, public, resource, and user list calendars. Object calendars represent a calendar based on a Salesforce object, either standard or custom.",
    "properties": {
      "Color": {
        "type": "string",
        "description": "Represents the color used in the background for records displayed in a user’s calendar view within the user interface."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for organizations with the multicurrency feature enabled. Contains the ISO code for any currency allowed by the organization."
      },
      "DateHandlingType": {
        "type": "picklist",
        "description": "Determined by the data type of the StartField. Valid values include:"
      },
      "DisplayField": {
        "type": "string",
        "description": "Represents the SobjectType field used as the subject for records displayed in a user’s calendar view within the user interface."
      },
      "EndField": {
        "type": "string",
        "description": "An optional field that represents the sObjectType field used as the end time for records displayed in a user’s calendar view within the user interface. Must be a date or dateTime field that matches the type in StartField."
      },
      "FillPattern": {
        "type": "string",
        "description": "Represents the pattern displayed as the background for records displayed in a user’s calendar view within the user interface. Valid values include: verticalStripes ascDiagonalStripes descDiagonalStripes"
      },
      "IsDisplayed": {
        "type": "boolean",
        "description": "Defines whether users can see a calendar’s records in their calendar view in the user interface. When true, records are visible in the user’s calendar view. When false, records are hidden from the user’s calendar view. The default is true. IsDisplayed can be true for up to 50 calendars."
      },
      "ListViewFilterId": {
        "type": "reference",
        "description": "References the ListView used to filter records represented by the CalendarView. ListView must have the same sObjectType. If no ListViewFilterId is defined, the calendar displays only records with the same owner as the CalendarView."
      },
      "Name": {
        "type": "string",
        "description": "A user-provided name that identifies the calendar. This isn’t an enumerated field; it can be any string to a maximum length of 80 characters."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Represents the owner of the CalendarView."
      },
      "PublisherId": {
        "type": "reference",
        "description": "Represents the user, user list, public, or resource calendar from where event data is populated."
      },
      "SobjectType": {
        "type": "picklist",
        "description": "The type of standard or custom Salesforce object that is used to create records for the CalendarView. Use the API name of the desired SobjectType."
      },
      "StartField": {
        "type": "string",
        "description": "Represents the SobjectType field used as the start time for records displayed in a user’s calendar view within the user interface. Must be a date or dateTime field type."
      }
    },
    "module": "Core Salesforce"
  }
}