{
  "CardPaymentMethod": {
    "name": "CardPaymentMethod",
    "description": "Represents a credit card or debit card payment method, which implements the PaymentMethod object.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "Customer account for the payment method."
      },
      "AuditEmail": {
        "type": "email",
        "description": "Email address of the card owner where audit information about payments gets sent."
      },
      "AutoCardType": {
        "type": "string",
        "description": "Card network type, derived from the card number."
      },
      "CardBin": {
        "type": "int",
        "description": "First six digits of the card number."
      },
      "CardCategory": {
        "type": "picklist",
        "description": "Defines whether the card is a credit card or debit card."
      },
      "CardHolderFirstName": {
        "type": "string",
        "description": "First name of the cardholder."
      },
      "CardHolderLastName": {
        "type": "string",
        "description": "Last name of the cardholder."
      },
      "CardHolderName": {
        "type": "string",
        "description": "Full name of the cardholder."
      },
      "CardLastFour": {
        "type": "int",
        "description": "Last four digits of the credit card or debit card."
      },
      "CardPaymentMethodNumber": {
        "type": "string",
        "description": "System-defined unique ID for the card payment method."
      },
      "CardType": {
        "type": "picklist",
        "description": "Identifies the credit card type."
      },
      "CardTypeCategory": {
        "type": "picklist",
        "description": "Further identifies the credit card. Used for internal reference."
      },
      "Comments": {
        "type": "textarea",
        "description": "Payment admin can add comments to provide additional details about a record. Maximum of 1000 characters."
      },
      "CompanyName": {
        "type": "string",
        "description": "Company of the cardholder."
      },
      "DisplayCardNumber": {
        "type": "string",
        "description": "Masked digits for the full credit card number except the last four digits."
      },
      "Email": {
        "type": "email",
        "description": "Email address of the payer."
      },
      "ExpiryMonth": {
        "type": "int",
        "description": "The card’s expiration month."
      },
      "ExpiryYear": {
        "type": "int",
        "description": "The card’s expiration year."
      },
      "GatewayDate": {
        "type": "dateTime",
        "description": "The date that the payment gateway logs a card activity."
      },
      "GatewayResultCode": {
        "type": "string",
        "description": "The result of the card payment method’s interaction with the payment gateway during a transaction request."
      },
      "GatewayResultCodeDescription": {
        "type": "string",
        "description": "Additional information about the gateway result code. Descriptions vary between payment gateway providers."
      },
      "GatewayToken": {
        "type": "string",
        "description": "Unencrypted unique token ID generated by the payment gateway to represent the card payment method during transactions. GatewayToken is for use with APIs earlier than version 52.0. For version 53.0 and latter, use the GatewayTokenEncrypted field. To secure the token, use the GatewayTokenEncrypted field."
      },
      "GatewayTokenDetails": {
        "type": "textarea",
        "description": "Additional information about the gateway token."
      },
      "GatewayTokenEncrypted": {
        "type": "encryptedstring",
        "description": "Encrypted unique token ID generated by the payment gateway to represent the card payment method during transactions. Encrypted using Salesforce Classic Encryption."
      },
      "InputCardNumber": {
        "type": "string",
        "description": "Used by a payer to enter a credit card number when storing an external-type card payment method. After entry, the credit card number isn’t saved, so the InputCardNumber value always appears blank. The credit card number appears as a masked value in DisplayCardNumber, which shows only the last four digits."
      },
      "IpAddress": {
        "type": "string",
        "description": "IP address of the card payment method holder."
      },
      "IsAutoPayEnabled": {
        "type": "boolean",
        "description": "Indicates whether the payment method can be used for recurring payments (True) or not (False). The default value is False."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record or list view related to this record, but didn’t access it directly."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it's possible the user referenced this record but didn’t view it directly."
      },
      "MacAddress": {
        "type": "string",
        "description": "MAC address of the card payment method holder."
      },
      "NickName": {
        "type": "string",
        "description": "Payer-defined nickname for the card payment method."
      },
      "PaymentGatewayId": {
        "type": "reference",
        "description": "The payment gateway used to create a gateway token. For transactions with a saved payment method in Salesforce, this field stores the payment gateway ID used in the transaction."
      },
      "PaymentMethodAddress": {
        "type": "address",
        "description": "Full address associated with the card payment method."
      },
      "PaymentMethodCity": {
        "type": "string",
        "description": "City of the address for the payment method."
      },
      "PaymentMethodCountry": {
        "type": "string",
        "description": "Country of the address for the payment method."
      },
      "PaymentMethodDetails": {
        "type": "string",
        "description": "Optional information about the payment method type. This field is available in API version 57.0 and later."
      },
      "PaymentMethodGeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the payment method address. An accuracy level contains information about the location of a latitude and longitude. For more information about geolocation fields, see Geolocation Compound Field."
      },
      "PaymentMethodLatitude": {
        "type": "double",
        "description": "Latitude of the payment method address. Used with the PaymentMethodLongitude to specify the precise geolocation of the address. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "PaymentMethodLongitude": {
        "type": "double",
        "description": "Latitude of the payment method address. Used with the PaymentMethodLatitude to specify the precise geolocation of the address. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "PaymentMethodPostalCode": {
        "type": "string",
        "description": "Postal Code of the address for the payment method."
      },
      "PaymentMethodState": {
        "type": "string",
        "description": "State of the address for the payment method."
      },
      "PaymentMethodStreet": {
        "type": "textarea",
        "description": "Street of the address for the payment method."
      },
      "PaymentMethodSubType": {
        "type": "string",
        "description": "A payment method that exists as a subtype of a payment method type. For example, Visa, Mastercard, and American Express exist as subtypes of payment method types such as Apple Pay and Google Pay. This field is available in API version 57.0 and later."
      },
      "PaymentMethodType": {
        "type": "picklist",
        "description": "Payment method used for the transaction. This field is available in API version 57.0 and later."
      },
      "Phone": {
        "type": "phone",
        "description": "Phone number of the payer."
      },
      "ProcessingMode": {
        "type": "picklist",
        "description": "Defines whether the card payment method is used for transactions made by Salesforce Payments or by an external third-party payment provider."
      },
      "SavedPaymentMethodId": {
        "type": "reference",
        "description": "The ID of the saved payment method record. This field is available in API version 60.0 and later."
      },
      "SfResultCode": {
        "type": "picklist",
        "description": "The results of the card payment method’s interaction with the payment gateway."
      },
      "StartMonth": {
        "type": "int",
        "description": "The month is activated."
      },
      "StartYear": {
        "type": "int",
        "description": "The year the card is activated."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the payment method."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_cardpaymentmethod.htm"
  }
}