{
  "CareProgramEnrolleeProduct": {
    "name": "CareProgramEnrolleeProduct",
    "description": "Represents the affiliation between a care program enrollee and a care program product, a care program provider, or both.",
    "properties": {
      "CareProgramEnrolleeId": {
        "type": "reference",
        "description": "The care program enrollee associated with this care program product or care program provider."
      },
      "CareProgramProductId": {
        "type": "reference",
        "description": "The care program product associated with this care program enrollee and care program provider."
      },
      "CareProgramProviderId": {
        "type": "reference",
        "description": "The care program provider associated with this care program enrollee and care program product."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Name of the product the enrollee participates in."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "ProgramId": {
        "type": "reference",
        "description": "The program that offers financial assistance for this product."
      },
      "": {
        "type": "",
        "description": ""
      },
      "SourceSystem": {
        "type": "string",
        "description": "System from which the record was sourced."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "ID of the system from which the record was sourced."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the care program product or service related to the care program provider and the recipient of the product or service."
      }
    },
    "module": "Health Cloud"
  }
}