{
  "CareProgramEligibilityRule": {
    "name": "CareProgramEligibilityRule",
    "description": "Represents a rule defining the criteria for patient care program enrollment eligibility. This entity creates an association between Care Program and an Enrollment Eligibility Criteria.",
    "properties": {
      "CareProgramId": {
        "type": "reference",
        "description": "Identifier of a care program. Represents a set of activities, such as therapy, wellness, or a fitness plan, offered to participants by a healthcare provider, life sciences organization, employer, or insurer."
      },
      "EligibilityCriteriaId": {
        "type": "reference",
        "description": "Criteria that define patient enrollment eligibility for a care program."
      },
      "IsInclusionRule": {
        "type": "boolean",
        "description": "Indicates whether the rule is included or excluded when determining care program eligibility. This field is available in API version 62.0 and later."
      },
      "IsRequired": {
        "type": "boolean",
        "description": "Indicates whether the care program eligibility rule is required."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Name for the care program eligibility rule."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "SourceSystem": {
        "type": "string",
        "description": "System from which the record was sourced."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "ID of the system from which the record was sourced."
      },
      "Status": {
        "type": "picklist",
        "description": "Defines whether the eligibility rule is in force or not."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of the eligibility Rule. This field is available for the Participant Management feature in API version 61.0 and later."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/sforce_api_objects_careprogrameligibilityrule.htm"
  }
}