{
  "CarePreauth": {
    "name": "CarePreauth",
    "description": "Represents the details of preauthorizations for care under a member’s plan.",
    "properties": {
      "EffectiveFrom": {
        "type": "date",
        "description": "The date from which this preauthorization is effective."
      },
      "EffectiveTo": {
        "type": "date",
        "description": "The date after which this preauthorization is no longer effective."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "MemberPlanId": {
        "type": "reference",
        "description": "The ID of the member plan for which this preauthorization is being provided."
      },
      "Name": {
        "type": "string",
        "description": "The name of this preauthorization."
      },
      "Notes": {
        "type": "textarea",
        "description": "Notes about this preauthorization."
      },
      "PayerId": {
        "type": "reference",
        "description": "The ID of the payer covering the cost of this treatment."
      },
      "PreauthIdentifier": {
        "type": "string",
        "description": "An identifier provided by the insurance company for preauthorization of a service."
      },
      "ReferringPhysician": {
        "type": "string",
        "description": "The name of the doctor who referred the member for this treatment."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the system this preauthorization record was obtained from."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of this preauthorization record on its source system."
      },
      "SourceSystemModified": {
        "type": "dateTime",
        "description": "The date on which this preauthorization was last changed on its source system."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of this preauthorization record. The default the picklist values are: Active Inactive"
      }
    },
    "module": "Health Cloud"
  }
}