{
  "CareObservation": {
    "name": "CareObservation",
    "description": "Represents the observed values for care metrics originating from external systems that contain biometric data",
    "properties": {
      "AdditionalCode1Id": {
        "type": "reference",
        "description": "The system-defined code that represents the type of the observation. This field is meant to be used if the CodeId field isn’t sufficient."
      },
      "AdditionalCode2Id": {
        "type": "reference",
        "description": "The system-defined code that represents the type of the observation. This field is meant to be used if the CodeId and AdditionalCode1Id fields aren’t sufficient."
      },
      "BasedOnId": {
        "type": "Polymorphic reference",
        "description": "The medication request or service request that the observation is based on."
      },
      "BaselineUnitId": {
        "type": "reference",
        "description": "The unit of measure for the baseline values of this observation."
      },
      "BaselineValueText": {
        "type": "string",
        "description": "The baseline value of an observation represented as a string."
      },
      "BodySiteId": {
        "type": "reference",
        "description": "The system-defined code that represents the site of the observation on the patient’s body."
      },
      "CaseId": {
        "type": "reference",
        "description": "The case associated with the patient's care observation."
      },
      "Category": {
        "type": "picklist",
        "description": "Specifies the category of the observation."
      },
      "CodeId": {
        "type": "reference",
        "description": "The system-defined code that represents the specific observation type."
      },
      "DerivationSourceId": {
        "type": "reference",
        "description": "Represents the document or observation from which the value of the observation is derived. If the observation value is derived from a document, reference the diagnostic summary record that represents the document. If the observation value is derived from another observation, reference the CareObservation record representing that observation."
      },
      "DeviceId": {
        "type": "reference",
        "description": "The ID of the device generating the observed value."
      },
      "EffectiveDateTime": {
        "type": "dateTime",
        "description": "The date and time when the observation was recorded or the start date and time of the observation’s clinically relevant period."
      },
      "EncounterId": {
        "type": "reference",
        "description": "The encounter related to the observation."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "The end date and time of the observation’s clinically relevant period."
      },
      "ExpectedValueId": {
        "type": "reference",
        "description": "The CodeSet ID related to the care metric target."
      },
      "HasMetExpectedValue": {
        "type": "boolean",
        "description": "Indicates whether the observed value aligns with the expected value or range."
      },
      "IdentifierId": {
        "type": "reference",
        "description": "The identifier for the observation."
      },
      "IsMonitoredRemotely": {
        "type": "boolean",
        "description": "Indicates whether the observed value is obtained via remote monitoring. This record can only be used in processing and charting if this field is set to True. The default value Is false."
      },
      "IsObserved": {
        "type": "boolean",
        "description": "Indicates the boolean value for the observation. The value is true if something is observed, and false if it’s not. The default value is false. This field is a duplicate field introduced in API version 51.0 that stores the same information as IsOutcomePositive. Use only one of these two fields for this type of information."
      },
      "IsOutcomePositive": {
        "type": "boolean",
        "description": "Indicates the boolean value for the observation. The value is true if something is observed, and false if it’s not. The IsObserved field is a duplicate of this field that stores the same information. Use only one of these two fields for this type of information. The default value is false."
      },
      "IssuedDateTime": {
        "type": "dateTime",
        "description": "The date and time the current version of the observation record is issued."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "LowerBaselineValue": {
        "type": "double",
        "description": "Represents the lower limit of the baseline value range for the observation."
      },
      "MethodId": {
        "type": "reference",
        "description": "The system-defined code that represents the method of the observation."
      },
      "Name": {
        "type": "string",
        "description": "The name of this care observation."
      },
      "NumericValue": {
        "type": "double",
        "description": "The numeric value of the care observation (6 decimal places)."
      },
      "ObservationEndTime": {
        "type": "dateTime",
        "description": "The date and time when the observation ended."
      },
      "ObservationStartTime": {
        "type": "dateTime",
        "description": "The date and time when the observation started."
      },
      "ObservationStatus": {
        "type": "picklist",
        "description": "Specifies the status of the observation"
      },
      "ObservedSubjectId": {
        "type": "Master-detail reference",
        "description": "The account ID of the subject being observed. For example, the ID of the patient being observed."
      },
      "ObservedValueCodeId": {
        "type": "reference",
        "description": "The system-defined code that represents the observed value."
      },
      "ObservedValueDenominator": {
        "type": "double",
        "description": "The denominator of the observed value."
      },
      "ObservedValueNumerator": {
        "type": "double",
        "description": "The numerator of the observed value."
      },
      "ObservedValueText": {
        "type": "string",
        "description": "The observed value in text form."
      },
      "ObservedValueType": {
        "type": "picklist",
        "description": "Specifies the type of observed values recorded in ObservedValueNumerator and ObservedValueDenominator."
      },
      "ObservedValueUnitId": {
        "type": "reference",
        "description": "The unit of measure for the observed value. This is a duplicate field introduced in API version 51.0 that stores the same information as UnitOfMeasureId. Use only one of these fields to store this information."
      },
      "ObserverId": {
        "type": "Polymorphic reference",
        "description": "The person who made the observation."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the record owner. Available in API version 56.0 and later."
      },
      "PartOfId": {
        "type": "Polymorphic reference",
        "description": "The medication statement, procedure, or immunization that this observation is a part of."
      },
      "ProcessingResult": {
        "type": "picklist",
        "description": "The processing result of this observation record. Applicable only if IsMonitoredRemotely is set to True"
      },
      "SourceSystem": {
        "type": "string",
        "description": "The source system from where the record was brought into Salesforce."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The identifier of the record in its source system."
      },
      "SourceSystemModified": {
        "type": "dateTime",
        "description": "The date and time when the record was last modified in its source system."
      },
      "UnitOfMeasureId": {
        "type": "reference",
        "description": "The unit of measure for the observed value. The ObservedValueUnitId field is a duplicate of this field that stores the same information. Use only one of these fields to store this information."
      },
      "UpperBaselineValue": {
        "type": "double",
        "description": "Represents the upper limit of the baseline value range for the observation."
      },
      "ValueInterpretation": {
        "type": "picklist",
        "description": "Specifies the interpretation of values observed."
      }
    },
    "module": "Health Cloud"
  }
}