{
  "CareProgram": {
    "name": "CareProgram",
    "description": "Represents a set of activities, such as a patient therapy, financial assistance, education, wellness, or fitness plan, offered to participants by an employer or insurer.",
    "properties": {
      "ActiveSiteCount": {
        "type": "int",
        "description": "The number of active sites for conducting the research study. This field is available in API version 64.0 and later when Site Management is enabled."
      },
      "BudgetAmount": {
        "type": "Currency",
        "description": "Approved budget for the care program."
      },
      "CareProgramName": {
        "type": "Text",
        "description": "The name of the care program."
      },
      "Category": {
        "type": "picklist",
        "description": "Represents the category of the care program."
      },
      "CurrentEnrolleeCount": {
        "type": "int",
        "description": "The number of enrollees who have joined the care program to date. This field is available for the Participant Management feature in API version 61.0 and later."
      },
      "Description": {
        "type": "Long Text Area",
        "description": "A short description explaining the program."
      },
      "EndDate": {
        "type": "Date",
        "description": "Program termination date."
      },
      "EnrollmentDurationMeasureId": {
        "type": "reference",
        "description": "The unit of measure for the participant enrollment duration. This field is available in API version 64.0 and later when Site Management is enabled."
      },
      "EnrollmentRate": {
        "type": "double",
        "description": "The rate of the participant enrollment at the site. This is calculated by dividing the target enrollment count by the target enrollment duration and the number of planned sites. This field is available in API version 64.0 and later when Site Management is enabled."
      },
      "FirstSiteClosedOutDate": {
        "type": "date",
        "description": "The date on which the first site is closed out."
      },
      "FirstSiteActivatedDate": {
        "type": "date",
        "description": "The date on which the first site is activated for conducting research studies. This field is available in API version 64.0 and later when Site Management is enabled."
      },
      "LastSiteActivatedDate": {
        "type": "date",
        "description": "The date on which the last site is activated for conducting research studies. This field is available in API version 64.0 and later when Site Management is enabled."
      },
      "LastSiteClosedOutDate": {
        "type": "date",
        "description": "The date on which the last site is closed out. This field is available in API version 64.0 and later when Site Management is enabled."
      },
      "ParentProgram": {
        "type": "Lookup(Care Program)",
        "description": "Name of another program that this program is a part of, if any."
      },
      "ProgramSponsor": {
        "type": "Lookup(Account)",
        "description": "Name of the third-party program sponsor, if any."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "ID of the system from which the record was sourced."
      },
      "StartDate": {
        "type": "Date",
        "description": "Effective start date of the program."
      },
      "Status": {
        "type": "Pick list",
        "description": "Status of the program."
      },
      "TargetEnrollmentDuration": {
        "type": "int",
        "description": "The duration in which the enrollment for the targeted number of participants must be completed. This field is available in API version 64.0 and later when Site Management is enabled."
      },
      "TargetEnrolleeCount": {
        "type": "int",
        "description": "The target enrollee count of the care program. This field is available for the Participant Management feature in API version 61.0 and later."
      },
      "TargetSiteCount": {
        "type": "int",
        "description": "The number of sites planned for conducting the research study. This field is available in API version 64.0 and later when Site Management is enabled."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/sforce_api_objects_careprogram.htm"
  }
}