{
  "CartDeliveryGroupMethod": {
    "name": "CartDeliveryGroupMethod",
    "description": "Represents the selected delivery method for a cart delivery group used in Lightning B2B Commerce checkout.",
    "properties": {
      "AdjustedShippingFee": {
        "type": "currency",
        "description": "Shipping fee, including TotalAdjustmentAmount, for the delivery method."
      },
      "Carrier": {
        "type": "picklist",
        "description": "The carrier that the buyer chose for their delivery method. Values are defined based on the user’s shipping service. This field is available in API version 59.0 or later."
      },
      "CartCheckoutSessionId": {
        "type": "reference",
        "description": "The unique ID used to identify your cart checkout session."
      },
      "CartDeliveryGroupId": {
        "type": "reference",
        "description": "The ID of the cart delivery group associated with the checkout session."
      },
      "ClassOfService": {
        "type": "picklist",
        "description": "The carrier class of service that the buyer chose for their delivery method. Values are defined based on the user’s shipping service. This field is available in API version 59.0 or later."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "The currency used for your shipping fee. Default value is USD."
      },
      "DeliveryMethodId": {
        "type": "reference",
        "description": "The ID of the selected order delivery method."
      },
      "ExternalProvider": {
        "type": "string",
        "description": "The ID of the external shipping method provider. Optional field."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Assign new delivery groups to active delivery methods. The default value is False. This field is available in API version 59.0 or later."
      },
      "Name": {
        "type": "string",
        "description": "Name of the delivery method."
      },
      "ProcessTime": {
        "type": "int",
        "description": "Merchant-specified process time for the delivery method. Process time includes the time between when an order is placed and when the shipment is given to the shipping carrier."
      },
      "ProcessTimeUnit": {
        "type": "picklist",
        "description": "Unit of time used to define ProcessTime."
      },
      "ProductId": {
        "type": "reference",
        "description": "Optional. This product represents a delivery charge order product for a delivery using this delivery method. For example, you could create a product that represents an overnight express charge and assign it to an overnight express delivery method. If your store uses Salesforce Native Shipping, the ProductId is selected from a non-variation product with Shipping in its name. The term Shipping in a product name isn’t localized. If no matching product is found, a random non-variation product is used. This field is available in API version 59.0 or later."
      },
      "ReferenceNumber": {
        "type": "string",
        "description": "Reference number for an external delivery method. This field is available in API version 59.0 or later."
      },
      "ShippingFee": {
        "type": "currency",
        "description": "Shipping fee associated with the delivery method. Required field."
      },
      "TotalAdjustmentAmount": {
        "type": "currency",
        "description": "The adjustment amount of a promotion applicable to the delivery method."
      },
      "TransitTimeMax": {
        "type": "int",
        "description": "Maximum estimate of transit time for the delivery method. Transit time includes the time between when a shipping carrier receives a shipment and when the shipment arrives at the delivery address."
      },
      "TransitTimeMin": {
        "type": "int",
        "description": "Minimum estimate of transit time for the delivery method. Transit time includes the time between when a shipping carrier receives a shipment and when the shipment arrives at the delivery address."
      },
      "TransitTimeUnit": {
        "type": "picklist",
        "description": "Unit of time used to define TransitTimeMax and TransitTimeMin."
      },
      "WebCartId": {
        "type": "reference",
        "description": "The ID of the WebCart associated with the cart delivery group method. Required field."
      }
    },
    "module": "Core Salesforce"
  }
}