{
  "Case": {
    "name": "Case",
    "description": "Represents a case, which is a customer issue or problem.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "ID of the account associated with this case."
      },
      "AssetWarrantyID": {
        "type": "reference",
        "description": "ID of the Asset associated with the warranty. Must be a valid asset warranty ID."
      },
      "BusinessHoursId": {
        "type": "reference",
        "description": "ID of the business hours associated with this case."
      },
      "Comments": {
        "type": "textarea",
        "description": "Used to insert a new CaseComment. Email textarea has a length of 4000 chars."
      },
      "CaseNumber": {
        "type": "string",
        "description": "Assigned automatically when each case is inserted. It can't be set directly, and it can't be modified after the case is created."
      },
      "ClosedDate": {
        "type": "dateTime",
        "description": "The date and time when the case was closed."
      },
      "CommunityId": {
        "type": "reference",
        "description": "ID of the zone associated with this case."
      },
      "ConnectionReceivedId": {
        "type": "reference",
        "description": "ID of the PartnerNetworkConnection that shared this record with your organization. This field is available if you enabled Salesforce to Salesforce."
      },
      "ConnectionSentId": {
        "type": "reference",
        "description": "ID of the PartnerNetworkConnection that you shared this record with. This field is available if you enabled Salesforce to Salesforce. This field is supported using API versions earlier than 15.0. In all other API versions, this field’s value is null. You can use the new PartnerNetworkRecordConnection object to forward records to connections."
      },
      "ContactEmail": {
        "type": "email",
        "description": "Email address for the contact. The Case.ContactEmail field displays the Email field on the contact that is referenced by Case.ContactId. Label is Contact Email. This field is available in API version 38.0 and later."
      },
      "ContactFax": {
        "type": "phone",
        "description": "Fax number for the contact. Label is Contact Fax. This field is available in API version 38.0 and later."
      },
      "ContactId": {
        "type": "reference",
        "description": "ID of the associated contact."
      },
      "ContactMobile": {
        "type": "phone",
        "description": "Mobile telephone number for the contact. Label is Contact Mobile. This field is available in API version 38.0 and later."
      },
      "ContactPhone": {
        "type": "phone",
        "description": "Telephone number for the contact. Label is Contact Phone. This field is available in API version 38.0 and later."
      },
      "CreatorFullPhotoUrl": {
        "type": "string",
        "description": "URL of the user’s profile photo from the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "CreatorName": {
        "type": "string",
        "description": "Name of the user who posted the question or reply. Only the first name of internal users (agents) appears to portal users in the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "CreatorSmallPhotoUrl": {
        "type": "string",
        "description": "URL of the user’s thumbnail photo from the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "Description": {
        "type": "textarea",
        "description": "A text description of the case. Limit: 32 KB."
      },
      "FeedItemId": {
        "type": "reference",
        "description": "ID of the question in Chatter associated with the case. This field is available in API version 33.0 and later, and is only accessible in organizations where Question-to-Case is enabled."
      },
      "HasCommentsUnreadByOwner": {
        "type": "boolean",
        "description": "Indicates whether a case contains comments that the case owner hasn’t read (true) or not (false)."
      },
      "HasSelfServiceComments": {
        "type": "boolean",
        "description": "Indicates whether a case has comments added by a Self-Service user (true) or not (false). Only visible when Customer Portal is enabled."
      },
      "IsClosed": {
        "type": "boolean",
        "description": "Indicates whether the case is closed (true) or open (false). This field is controlled by the Status field; it can't be set directly. Label is Closed."
      },
      "IsClosedOnCreate": {
        "type": "boolean",
        "description": "Indicates whether the case was closed at the same time that it was created (true) or not (false). This flag is read-only and is automatically set when a record is created. It can't be set to true unless the IsClosed flag is also true."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "IsEscalated": {
        "type": "boolean",
        "description": "Indicates whether the case has been escalated (true) or not. A case's escalated state does not affect how you can use a case, or whether you can query, delete, or update it. You can set this flag via the API. Label is Escalated."
      },
      "IsSelfServiceClosed": {
        "type": "boolean",
        "description": "Indicates whether the case is closed for Self-Service users (true) or not (false)."
      },
      "IsStopped": {
        "type": "boolean",
        "description": "Indicates whether an entitlement process on a case is stopped (true) or not (false)."
      },
      "IsVisibleInSelfService": {
        "type": "boolean",
        "description": "Indicates whether the case can be viewed in the Customer Service Portal, Partner Service Portal, and Self-Service Portal (true) or not (false). This field is applied for case visibility in the Partner Relationship Management, Customer Service Portal, and the earlier version of Self Service Portal. The field does not alter sharing and will not prevent usage of a direct URL to a case if a portal user has read or write access."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the case. The Language field is available when you enable Einstein Case Classification in Enterprise, Performance, and Unlimited edition orgs with Service Cloud. By default, only Einstein classification apps use this field."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "MasterRecordId": {
        "type": "reference",
        "description": "If this object was deleted as the result of a merge, this field contains the ID of the record that was kept. If this object was deleted for any other reason, or has not been deleted, the value is null."
      },
      "Origin": {
        "type": "picklist",
        "description": "The source of the case, such as Email, Phone, or Web. Label is Case Origin."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the contact who owns the case."
      },
      "ParentId": {
        "type": "reference",
        "description": "The ID of the parent case in the hierarchy. The label is Parent Case."
      },
      "Priority": {
        "type": "picklist",
        "description": "The importance or urgency of the case, such as High, Medium, or Low."
      },
      "QuestionId": {
        "type": "reference",
        "description": "The question in the answers zone that is associated with the case. This field does not appear if you don't have an answers zone enabled."
      },
      "Reason": {
        "type": "picklist",
        "description": "The reason why the case was created, such as Instructions not clear, or User didn’t attend training."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "ID of the record type assigned to this object."
      },
      "ServiceContractId": {
        "type": "reference",
        "description": "Required. ID of the ServiceContract associated with the entitlement. Must be a valid ID."
      },
      "SlaStartDate": {
        "type": "dateTime",
        "description": "Shows the time that the case entered an entitlement process. If you have the Edit permission on cases, you can update or reset the time."
      },
      "SourceId": {
        "type": "reference",
        "description": "The ID of the social post source."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the case, such as New, Closed, or Escalated. This field directly controls the IsClosed flag. Each predefined Status value implies an IsClosed flag value. For more information, see CaseStatus."
      },
      "StopStartDate": {
        "type": "dateTime",
        "description": "The date and time an entitlement process was stopped on the case.This field is available in API version 18.0 and later."
      },
      "Subject": {
        "type": "string",
        "description": "The subject of the case. Limit: 255 characters."
      },
      "SuppliedCompany": {
        "type": "string",
        "description": "The company name that was entered when the case was created. Label is Company."
      },
      "SuppliedEmail": {
        "type": "email",
        "description": "The email address that was entered when the case was created. Label is Email.If your organization has an active auto-response rule, SuppliedEmail is required when creating a case via the API. Auto-response rules use the email in the contact specified by ContactId. If no email address is in the contact record, the email specified here is used."
      },
      "SuppliedName": {
        "type": "string",
        "description": "The name that was entered when the case was created. Label is Name."
      },
      "SuppliedPhone": {
        "type": "string",
        "description": "The phone number that was entered when the case was created. Label is Phone."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of case, such as Feature Request or Question."
      },
      "assignmentRuleId": {
        "type": "",
        "description": ""
      },
      "useDefaultRule": {
        "type": "",
        "description": ""
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_case.htm"
  }
}