{
  "CaseParticipant": {
    "name": "CaseParticipant",
    "description": "Represents a junction between a case, and an account or a contact. This object stores the details of the participant associated with a case. This participant could be the applicant, co-applicant, a household, or even a business account.",
    "properties": {
      "AuthorizationProof": {
        "type": "picklist",
        "description": "How the participant communicated their consent. This field is available in API version 58.0 and later."
      },
      "CaseId": {
        "type": "reference",
        "description": "The case associated with the case participant record."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "The name of the case participant record."
      },
      "ParticipantId": {
        "type": "reference",
        "description": "The participant associated with the case participant record."
      },
      "PreferredCallTimeFrom": {
        "type": "time",
        "description": "The start of the preferred time window for contacting the participant. This field is available in API version 58.0 and later."
      },
      "PreferredCallTimeTo": {
        "type": "time",
        "description": "The end of the preferred time window for contacting the participant. This field is available in API version 58.0 and later."
      },
      "PreferredCommunicationMode": {
        "type": "picklist",
        "description": "How the participant prefers to receive messages. This field is available in API version 58.0 and later."
      },
      "Role": {
        "type": "picklist",
        "description": "Specifies the role of the case participant."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the case participant."
      }
    },
    "module": "Public Sector Cloud"
  }
}