{
  "CaseComment": {
    "name": "CaseComment",
    "description": "Represents a comment that provides additional information about the associated Case.",
    "properties": {
      "CommentBody": {
        "type": "textarea",
        "description": "Text of the CaseComment. The maximum size of the comment body is 4,000 bytes. Label is Body."
      },
      "ConnectionReceivedId": {
        "type": "reference",
        "description": "ID of the PartnerNetworkConnection that shared this record with your organization. This field is available if you enabled Salesforce to Salesforce."
      },
      "ConnectionSentId": {
        "type": "reference",
        "description": "ID of the PartnerNetworkConnection that you shared this record with. This field is available if you enabled Salesforce to Salesforce. This field is supported using API versions earlier than 15.0. In all other API versions, this field’s value is null. You can use the new PartnerNetworkRecordConnection object to forward records to connections."
      },
      "CreatorFullPhotoUrl": {
        "type": "string",
        "description": "URL of the user’s profile photo from the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "CreatorName": {
        "type": "string",
        "description": "Name of the user who posted the question or reply. Only the first name of internal users (agents) appears to portal users in the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "CreatorSmallPhotoUrl": {
        "type": "string",
        "description": "URL of the user’s thumbnail photo from the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "IsNotificationSelected": {
        "type": "boolean",
        "description": "Indicates whether an email notification is sent to the case contact when a CaseComment is created or updated. When this field is queried, it always returns null. This field is available only when the Enable Case Comment Notification to Contacts setting is enabled on the Support Settings page in Setup. To send email notifications for CaseComment, you must use the EmailHeader triggerUserEmail. Available in API version 43.0 and later."
      },
      "IsPublished": {
        "type": "boolean",
        "description": "Indicates whether the CaseComment is visible to customers in the Self-Service portal (true) or not (false). Label is Published. This is the only CaseComment field that can be updated via the API."
      },
      "ParentId": {
        "type": "reference",
        "description": "Required. ID of the parent Case of the CaseComment."
      }
    },
    "module": "Core Salesforce"
  }
}