{
  "CaseProceedingParticipant": {
    "name": "CaseProceedingParticipant",
    "description": "Represents a junction between the case proceeding and a participant, such as an account or a contact. This object stores the details of a participant who is involved in a case proceeding.",
    "properties": {
      "CaseProceedingId": {
        "type": "reference",
        "description": "The case proceeding associated with the case proceeding participant record."
      },
      "Comments": {
        "type": "string",
        "description": "The comments about why the participant has access to the case proceeding."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Specifies whether the participant's association with the case proceeding is active (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the case proceeding participant record."
      },
      "ParticipantId": {
        "type": "reference",
        "description": "The participant associated with the case proceeding record."
      },
      "ParticipantRoleId": {
        "type": "reference",
        "description": "The participant role associated with the case proceeding participant record."
      },
      "ParticipationType": {
        "type": "picklist",
        "description": "The actual type of presence of the participant during the case proceeding."
      },
      "Role": {
        "type": "picklist",
        "description": "The role of the participant associated with the case proceeding record."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the participant in the case proceeding."
      }
    },
    "module": "Public Sector Cloud"
  }
}