{
  "cgcloud__KPI_Map__c": {
    "name": "cgcloud__KPI_Map__c",
    "description": "Holds the information about the KPI Map configuration.",
    "properties": {
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Most recent date on which a user viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "Unique identification of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the record owner."
      },
      "cgcloud__Description__c": {
        "type": "string",
        "description": "KPI map description."
      },
      "cgcloud__Field_Name__c": {
        "type": "string",
        "description": "Defines the field that belongs to sObject Type and is used for KPI mapping."
      },
      "cgcloud__Fund_Template__c": {
        "type": "reference",
        "description": "Reference to the fund template. If the fund template isn't specified, then this is the default mapping for all fund records. If the fund template is specified, then the mapping is specific to the related fund records."
      },
      "cgcloud__KPI_Definition_Code__c": {
        "type": "string",
        "description": "Measure code from the KPI Definition lookup."
      },
      "cgcloud__KPI_Definition__c": {
        "type": "reference",
        "description": "Reference to the KPI definition to be used in the mapping."
      },
      "cgcloud__Precision__c": {
        "type": "double",
        "description": "Holds the total number of digits allowed for the target field."
      },
      "cgcloud__Promotion_Template__c": {
        "type": "reference",
        "description": "Reference to the promotion template. If the promotion template isn't specified, then this is the default mapping for all promotion records. If the promotion template is specified, then the mapping is specific to the related promotion records."
      },
      "cgcloud__RBF_Template__c": {
        "type": "reference",
        "description": "Reference to the rate-based funding (RBF) template. If the RBF template isn't specified, then this is the default mapping for all RBF records. If the RBF template is specified, then the mapping is specific to the related RBF records."
      },
      "cgcloud__SObject_Type__c": {
        "type": "string",
        "description": "Defines the type of sObject supported for KPI mapping."
      },
      "cgcloud__Sales_Org__c": {
        "type": "picklist",
        "description": "Describes the sales org that the KPI map belongs to."
      },
      "cgcloud__Scale__c": {
        "type": "double",
        "description": "Holds the number of decimal places allowed for the target field."
      },
      "cgcloud__Tactic_Template__c": {
        "type": "reference",
        "description": "Reference to the Tactic template. If the tactic template isn't specified, then this is the default mapping for all tactic records. If the tactic template is specified, then the mapping is specific to the related tactic records."
      }
    },
    "module": "Consumer Goods Cloud"
  }
}