{
  "ChatterExtension": {
    "name": "ChatterExtension",
    "description": "Represents a Rich Publisher App that’s integrated with the Chatter publisher.",
    "properties": {
      "CompositionComponentEnumOrId": {
        "type": "picklist",
        "description": "The ID of the composition component for the Rich Publisher App. This field requires a value."
      },
      "Description": {
        "type": "string",
        "description": "The description of your custom Rich Publisher App. This field requires a value."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The name of the developer who is responsible for the app."
      },
      "ExtensionName": {
        "type": "string",
        "description": "The name of your extension. This field requires a value."
      },
      "HeaderText": {
        "type": "string",
        "description": "The text to show in the header of your app composer. Header text is required for Lightning type extensions."
      },
      "HoverText": {
        "type": "string",
        "description": "The text to show when a user mouses over your extension’s icon. Mouse-over text is required for Lightning type extensions."
      },
      "IconId": {
        "type": "reference",
        "description": "The icon to show in the Chatter publisher. Use an existing file asset ID from your org. This field requires a value."
      },
      "IsProtected": {
        "type": "boolean",
        "description": "An auto-generated value. It currently has no impact."
      },
      "Language": {
        "type": "picklist",
        "description": "The language used for this instance of the ChatterExtension. This field requires a value."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The master label for the ChatterExtension object. This field requires a value."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The prefix to use for the extension’s namespace."
      },
      "RenderComponentEnumOrId": {
        "type": "picklist",
        "description": "The rendering component of the Rich Publisher App that you provide. It’s comprised of the lightning:availableForChatterExtensionRenderer interface. This field requires a value."
      },
      "Type": {
        "type": "picklist",
        "description": "Describes the type of the extension. Currently, the only value supported is Lightning. Included to allow for other possible types in the future."
      }
    },
    "module": "Core Salesforce"
  }
}