{
  "ClaimCoveragePaymentDetail": {
    "name": "ClaimCoveragePaymentDetail",
    "description": "Represents the claim coverage amount that must be paid to a claimant for a part replaced or replaced or a labor service performed to rectify a causal part in a defective asset.",
    "properties": {
      "ActualExpense": {
        "type": "currency",
        "description": "The actual expense of the part replacement or labor service."
      },
      "AdjustedAmount": {
        "type": "currency",
        "description": "The amount the manufacturer intends to pay to the claimant for the repair, replacement, or labor service to rectify a causal part."
      },
      "ChargeType": {
        "type": "picklist",
        "description": "The type of charge."
      },
      "ChargeTypeCodeId": {
        "type": "reference",
        "description": "The unique code that identifies the labor charge or expense."
      },
      "ClaimCoverageId": {
        "type": "reference",
        "description": "The ID of the claim coverage record associated with the Claim Coverage Payment Detail."
      },
      "ClaimedAmount": {
        "type": "currency",
        "description": "The amount claimed by the claimant as a part of the claim coverage payment detail."
      },
      "Comment": {
        "type": "textarea",
        "description": "The comments made by the warranty claims adjudicator while adjudicating the claim coverage payment detail."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the claim coverage payment detail."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view."
      },
      "Name": {
        "type": "string",
        "description": "The name of the claim coverage payment detail."
      },
      "PriceBookEntryId": {
        "type": "reference",
        "description": "The entry of the product related to the replacement part in the price book."
      },
      "ProductRelatedMaterialId": {
        "type": "reference",
        "description": "The ID of the product related material record that defines the association between the replacement part and the product associated with the claim."
      },
      "Quantity": {
        "type": "int",
        "description": "The quantity of parts replaced or the number of labor hours."
      },
      "ReplacementPartId": {
        "type": "reference",
        "description": "The product part that's a replacement for the defective part."
      },
      "ReturnOrderId": {
        "type": "reference",
        "description": "The ID of the return order related to the claim coverage payment detail."
      },
      "ReturnOrderLineItemId": {
        "type": "reference",
        "description": "The ID of the return order line item related to the claim coverage payment detail."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of claim coverage payment detail."
      }
    },
    "module": "Manufacturing Cloud"
  }
}