{
  "ClimateChgRiskOppSummary": {
    "name": "ClimateChgRiskOppSummary",
    "description": "Represents the climate-related risks and opportunities that a company discloses as part of ESRS E1 - Climate change.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the company's climate-related risks and opportunities disclosed as part of ESRS E1 - Climate change."
      },
      "DisclsReportingPeriodId": {
        "type": "reference",
        "description": "The unique identifier of the reporting period."
      },
      "E1AstAcutMtrlPhyRiskClimateChg": {
        "type": "double",
        "description": "The number of assets at acute material physical risk before considering climate change adaptation actions."
      },
      "E1AstChrncMtrlPhyRiskClimate": {
        "type": "double",
        "description": "The number of assets at chronic material physical risk before considering climate change adaptation actions."
      },
      "E1AstMtrlPhyRiskClimateChg": {
        "type": "double",
        "description": "The number of assets at material physical risk before considering climate change adaptation actions."
      },
      "E1AstMtrlTrnstRiskBefMitgAct": {
        "type": "double",
        "description": "The number of assets at material transition risk before considering climate mitigation actions."
      },
      "E1CarrValRealEstAstEnrgyEfcy": {
        "type": "double",
        "description": "The carrying value of real estate assets by energy efficiency classes."
      },
      "E1EstmtAmtPotStrandedAssets": {
        "type": "double",
        "description": "The estimated monetary amount of potentially stranded assets."
      },
      "E1ExpcChgNetRevLowCarbonPrdct": {
        "type": "double",
        "description": "The expected changes to net revenue from low-carbon products and services or adaptation solutions to which the company has or may have access."
      },
      "E1ExpcCostSavClimateChgAdpt": {
        "type": "double",
        "description": "The expected cost savings from climate change adaptation actions."
      },
      "E1ExpcCostSavClimateChgMitg": {
        "type": "double",
        "description": "The expected cost savings from climate change mitigation actions."
      },
      "E1GhgEmissionCostRate": {
        "type": "double",
        "description": "The greenhouse gas (GHG) emission cost rate, used to calculate monetized total GHG emissions and monetized scope 1 and 2 GHG emissions."
      },
      "E1LiabMtrlTrnstRisksFinclStmt": {
        "type": "double",
        "description": "The liabilities from material transition risks that may need to be recognized in financial statements."
      },
      "E1NbrEmssnAllowRptPeriod": {
        "type": "double",
        "description": "The number of emission allowances stored from the previous allowances at the beginning of the reporting period."
      },
      "E1NbrScp1GhgEmssnTrdSchemes": {
        "type": "double",
        "description": "The number of scope 1 greenhouse gas (GHG) emissions allowances within regulated emission trading schemes."
      },
      "E1NetRevBusActvMtrlPhyRisk": {
        "type": "double",
        "description": "The net revenue from business activities at material physical risk."
      },
      "E1NetRevBusActvMtrlTranstRisk": {
        "type": "double",
        "description": "The net revenue from business activities at material transition risk."
      },
      "E1NetRevCoalRelatedActivities": {
        "type": "double",
        "description": "The net revenue from customers operating in coal-related activities."
      },
      "E1NetRevGasRelatedActivities": {
        "type": "double",
        "description": "The net revenue from customers operating in gas-related activities."
      },
      "E1NetRevOilRelatedActivities": {
        "type": "double",
        "description": "The net revenue from customers operating in oil-related activities."
      },
      "E1PctAstMtrlPhyRiskClimateChg": {
        "type": "percent",
        "description": "The percentage of assets at material physical risk addressed by climate change adaptation actions."
      },
      "E1PctAstMtrlRiskBefClimateChg": {
        "type": "percent",
        "description": "The percentage of assets at material physical risk before considering climate change adaptation actions."
      },
      "E1PctAstMtrlTrnstRiskAddrMitg": {
        "type": "percent",
        "description": "The percentage of assets at material transition risk addressed by climate change mitigation actions."
      },
      "E1PctAstMtrlTrnstRiskBefMitg": {
        "type": "percent",
        "description": "The percentage of assets at material transition risk before considering climate mitigation actions."
      },
      "E1PctNetRevBusActvMtrlPhyRisk": {
        "type": "percent",
        "description": "The percentage of net revenue from business activities at material physical risk."
      },
      "E1PctNetRevBusMtrlTranstRisk": {
        "type": "percent",
        "description": "The percentage of net revenue from business activities at material transition risk."
      },
      "E1PctNetRevCoalRelatedActv": {
        "type": "percent",
        "description": "The percentage of net revenue from customers operating in coal-related activities."
      },
      "E1PctNetRevGasRelatedActv": {
        "type": "percent",
        "description": "The percentage of net revenue from customers operating in gas-related activities."
      },
      "E1PctNetRevOilRelatedActv": {
        "type": "percent",
        "description": "The percentage of net revenue from customers operating in oil-related activities."
      },
      "E1PctStrandedAstMtrlTranstRisk": {
        "type": "percent",
        "description": "The percentage of potentially stranded assets at material transition risk."
      },
      "E1PotFtrLiabCrbnCrCancFuture": {
        "type": "double",
        "description": "The potential future liabilities associated with carbon credits planned to be canceled in the near future."
      },
      "E1PotMktSizeLowCarbonProducts": {
        "type": "double",
        "description": "The potential market size of low-carbon products and services or adaptation solutions to which company has or may have access."
      },
      "E1TotalAmountRealEstateAssets": {
        "type": "double",
        "description": "The total carrying amount of real estate assets for which energy consumption is based on internal estimates."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "SubsidiaryAccountId": {
        "type": "reference",
        "description": "The account that's identified as a subsidiary company."
      }
    },
    "module": "Net Zero Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.netzero_cloud_dev_guide.meta/netzero_cloud_dev_guide/sforce_api_objects_climatechgriskoppsummary.htm"
  }
}