{
  "ClinicalMeasureCriteriaGrp": {
    "name": "ClinicalMeasureCriteriaGrp",
    "description": "Represents a group of computable criteria for a health-related measure. This object is available in API version 59.0 and later.",
    "properties": {
      "ClinicalMeasureId": {
        "type": "reference",
        "description": "The clinical measure that the criteria group belongs to."
      },
      "CriteriaGroupCodeId": {
        "type": "reference",
        "description": ""
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the clinical measure criteria group."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced the record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed the record."
      },
      "MeasureType": {
        "type": "picklist",
        "description": "Specifies the measure type the criteria group belongs to based on what the measure calculates."
      },
      "Name": {
        "type": "string",
        "description": "The name of the clinical measure criteria group."
      },
      "PopulationBasisTypeCodeId": {
        "type": "reference",
        "description": "Specifies the population basis type for a measure the criteria group belongs to, when the basis is different from the subject."
      },
      "ProgramName": {
        "type": "string",
        "description": "The program used for calculating the measure that the criteria group belongs to."
      },
      "ProgramType": {
        "type": "picklist",
        "description": "The type of program used for calculating the measure that the criteria group belongs to."
      },
      "ScoreAggregationMethod": {
        "type": "string",
        "description": "A description of the method used to combine the different measure scores of each population into one aggregated result."
      },
      "ScoreImprovementIndication": {
        "type": "picklist",
        "description": "Specifies whether an increase or decrease in score is the preferred result for the measure that the criteria group belongs to."
      },
      "ScoringType": {
        "type": "picklist",
        "description": ""
      },
      "ScoringUnitId": {
        "type": "reference",
        "description": "Specifies the expected unit of measure for the measure score when the unit can't be inferred from the measure logic."
      },
      "SubjectCategory": {
        "type": "picklist",
        "description": "Specifies the subject category of the measure that the criteria group belongs to."
      }
    },
    "module": "Health Cloud"
  }
}