{
  "CodeSet": {
    "name": "CodeSet",
    "description": "Represents various industry defined codes in the context of their systems and versions of those systems.",
    "properties": {
      "Code": {
        "type": "string",
        "description": "The system-defined code that’s represented by this code set."
      },
      "CodeDescription": {
        "type": "textarea",
        "description": "Additional information associated with the code set."
      },
      "CodeSetKey": {
        "type": "string",
        "description": "A unique key that identifies the concept represented by code sets across different systems and versions. This key is not case sensitive."
      },
      "CodeSetType": {
        "type": "picklist",
        "description": "The type of the code set."
      },
      "EndDate": {
        "type": "date",
        "description": "The end date of the code set’s effective period."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the code set is an active code set (true) or not (false)."
      },
      "IsCustomCode": {
        "type": "boolean",
        "description": "Indicates whether the code set is defined by a specific organization, as opposed to recognized across the industry."
      },
      "IsPrimary": {
        "type": "boolean",
        "description": "Indicates whether the code set is the primary code set for the concept (true) or not (false). That is, it was selected manually by a user instead of being selected by an automated process."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The textual representation of the meaning of the code."
      },
      "OwnerId": {
        "type": "reference",
        "description": "A reference to the person who owns the code set record."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The system that sets the context for the code and defines its meaning."
      },
      "StartDate": {
        "type": "date",
        "description": "The start date of the code set’s effective period."
      },
      "SystemVersion": {
        "type": "string",
        "description": "The version of the source system the code belongs to."
      }
    },
    "module": "Manufacturing Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.mfg_api_devguide.meta/mfg_api_devguide/sforce_api_objects_codeset.htm"
  }
}