{
  "CollaborationGroup": {
    "name": "CollaborationGroup",
    "description": "Represents a Chatter group.",
    "properties": {
      "AnnouncementId": {
        "type": "reference",
        "description": "Contains the ID of the Announcement last associated with the group. This field is available in API version 30.0 and later."
      },
      "BannerPhotoUrl": {
        "type": "url",
        "description": "The URL for the group's banner photo.The URL is updated every time a photo is uploaded and reflects the most recent photo. If a newer photo has been uploaded, the URL returned for an older photo is not guaranteed to return a photo. Query this field for the URL of the most recent photo. This field is available in API version 36.0 and later."
      },
      "CanHaveGuests": {
        "type": "boolean",
        "description": "If set to true, indicates that a group allows customers. Chatter customers are people outside your company's email domains. Customers can see only the groups they're invited to. They can interact only with members of those groups. Customers can’t see any Salesforce information.This field is available starting in API version 23.0, but groups that allow customers are accessible from earlier API versions. However, when accessed from earlier API versions, groups that allow customers aren't distinguishable from private groups. We strongly recommend that you upgrade to the latest API version. If you must use an earlier version, name groups that allow customers to indicate that they include customers."
      },
      "CollaborationType": {
        "type": "picklist",
        "description": "The type of Chatter group. Available values are: Public—Anyone can see and post updates. Anyone can join a public group. Private—Only members can see the group feed and post updates. Non-members can only see the group name and a few other details in list views, search, and on the group page. The group's owner or managers must add members who request to join the group. Unlisted—Only members and users with the Manage Unlisted Groups permission can see the group and post updates. Other users can’t access the group or see it in lists, search, and feeds."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the group."
      },
      "FullPhotoUrl": {
        "type": "url",
        "description": "The URL for the group's profile photo.The URL is updated every time a photo is uploaded and reflects the most recent photo. If a newer photo has been uploaded, the URL returned for an older photo is not guaranteed to return a photo. Query this field for the URL of the most recent photo. This field is available in API version 20.0 and later."
      },
      "GroupEmail": {
        "type": "email",
        "description": "The email address for posting to the group. For private groups, only visible to members and users with Modify All Data or View All Data permissions.This field is available in API version 29.0 and later."
      },
      "HasPrivateFieldsAccess": {
        "type": "boolean",
        "description": "If set to true, indicates that a user can see the InformationBody and InformationTitle fields in a private group. This field is set to true for members of a private group and users with Modify All Data or View All Data permissions."
      },
      "InformationBody": {
        "type": "textarea",
        "description": "The text of the Information section. For private groups, only visible to members and users with Modify All Data or View All Data permissions."
      },
      "InformationTitle": {
        "type": "string",
        "description": "The title of the Information section. For private groups, only visible to members and users with Modify All Data or View All Data permissions."
      },
      "IsArchived": {
        "type": "boolean",
        "description": "Indicates whether the group is archived (true) or not (false).This field is available in API version 28.0 and later."
      },
      "IsAutoArchiveDisabled": {
        "type": "boolean",
        "description": "Indicates whether automatic archiving is disabled for the group (true) or not (false).This field is available in API version 29.0 and later."
      },
      "IsBroadcast": {
        "type": "boolean",
        "description": "Indicates whether the group is a broadcast group (true) or not (false).This field is available in API version 36.0 and later."
      },
      "LastFeedModifiedDate": {
        "type": "dateTime",
        "description": "The date of the last post or comment on the group."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "MediumPhotoUrl": {
        "type": "url",
        "description": "The URL for the larger, cropped photo size."
      },
      "MemberCount": {
        "type": "int",
        "description": "The number of members in the group."
      },
      "Name": {
        "type": "string",
        "description": "Name of the group. Group names must be unique across public and private groups. Unlisted groups don’t require unique names."
      },
      "NetworkId": {
        "type": "reference",
        "description": "ID of the Experience Cloud site that this group is part of. This field is available only if digital experiences is enabled in your org.You can only add a NetworkId when creating a group. You can’t change or add a NetworkId for an existing group. This field is available in API version 26.0 and later."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of the group. Only the current group owner or people with the Modify All Data permission can update the OwnerId."
      },
      "SmallPhotoUrl": {
        "type": "url",
        "description": "The URL for a thumbnail of the group's profile photo.The URL is updated every time a photo is uploaded and reflects the most recent photo. If a newer photo has been uploaded, the URL returned for an older photo is not guaranteed to return a photo. Query this field for the URL of the most recent photo. This field is available in API version 20.0 and later."
      }
    },
    "module": "Core Salesforce"
  }
}