{
  "CommissionStatementLineItem": {
    "name": "CommissionStatementLineItem",
    "description": "",
    "properties": {
      "ApplyToDate": {
        "type": "date",
        "description": "The date to which the commission amount should be applied when crediting the commission to the producer."
      },
      "BasisAmount": {
        "type": "currency",
        "description": "Specifies the basis amount on which the commission percent was applied to calculate the commission amount."
      },
      "CarrierAccountName": {
        "type": "string",
        "description": "The name of the carrier associated with the insurance policy."
      },
      "ClientAccountName": {
        "type": "string",
        "description": "The name of the client associated with the insurance policy."
      },
      "CommissionAmount": {
        "type": "currency",
        "description": "The commission amount associated with the insurance policy in the commission statement line item."
      },
      "CommissionPercent": {
        "type": "percent",
        "description": "The rate that's used for the commission calculation."
      },
      "CommissionStatementId": {
        "type": "reference",
        "description": "The commission statement associated with the commission statement line."
      },
      "CommissionType": {
        "type": "picklist",
        "description": "Specifies the type of commission associated with the commission statement line item."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "If multiple currencies are enabled, this field contains the currency ISO code associated with the record."
      },
      "ExternalIdentifier": {
        "type": "string",
        "description": "The external reference number associated with the comission statement line item."
      },
      "FailureMessage": {
        "type": "string",
        "description": "The failure message when processing fails for the commission statement line item."
      },
      "InsurancePolicyEffectiveDate": {
        "type": "date",
        "description": "The effective date of the insurance policy that's specified in the commission statement."
      },
      "InsurancePolicyExpirationDate": {
        "type": "date",
        "description": "The date until when the insurance policy remains effective."
      },
      "InsurancePolicyNumber": {
        "type": "string",
        "description": "The insurance policy number specified in the commission statement."
      },
      "InsurancePolicyRenewalDate": {
        "type": "date",
        "description": "The renewal date of the insurance policy that's specified in the commission statement."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "LineOfBusiness": {
        "type": "picklist",
        "description": "Specifies the line of business for the commission statement line item."
      },
      "LineOfCoverage": {
        "type": "picklist",
        "description": "Specifies the coverage type for the commission statement line item."
      },
      "Name": {
        "type": "string",
        "description": "The name of the commission statement line item."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this object."
      },
      "ReferenceRecordId": {
        "type": "",
        "description": ""
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the commission statement line item."
      },
      "TransactionDate": {
        "type": "date",
        "description": "The date on which the transaction that generated the commission has occurred."
      },
      "TransactionType": {
        "type": "picklist",
        "description": "Specifies the transaction type of the commission statement line item."
      }
    },
    "module": "Financial Services Cloud"
  }
}