{
  "CondIntrctnHlthRskAdjFctr": {
    "name": "CondIntrctnHlthRskAdjFctr",
    "description": "Stores the risk adjustment factor for patients and members based on the set of interacting conditions they are diagnosed with and the status of their benefits eligibility.",
    "properties": {
      "CmnyFullBnftDualDisabled": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, has full benefits from both Medicare and Medicaid, and is enrolled in Medicare because of a disability."
      },
      "CmnyPartialBenefitDualAged": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, has partial benefits from both Medicare and Medicaid, and is enrolled in Medicare because of their age."
      },
      "CmnyPartialBnftDualDsbl": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, has partial benefits from both Medicare and Medicaid, and is enrolled in Medicare because of a disability."
      },
      "Community": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home."
      },
      "CommunityFullBnftDualAged": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, has full benefits from both Medicare and Medicaid, and is enrolled in Medicare because of their age."
      },
      "CommunityNonDualAged": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, is covered only by Medicare, and is enrolled in Medicare because of their age."
      },
      "CommunityNonDualDisabled": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, is covered only by Medicare, and is enrolled in Medicare because of a disability."
      },
      "ConditionCodeList": {
        "type": "string",
        "description": "Specifies the first set of condition codes for the condition interactions that the risk adjustment factors are defined for."
      },
      "Institutional": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at a healthcare facility."
      },
      "InteractingCondCodeList": {
        "type": "string",
        "description": "Specifies the codes of the interacting conditions for the condition interactions that the risk adjustment factors are defined for."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the specified condition interactions and risk adjustment factor combinations are currently active."
      },
      "IsDisabled": {
        "type": "boolean",
        "description": "Indicates whether the interaction is with a condition or a disability."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time when the record was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time when the record was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The system-generated name of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the record in the system."
      },
      "PublishedYear": {
        "type": "int",
        "description": "The year when the risk adjust factors were published."
      }
    },
    "module": "Health Cloud"
  }
}