{
  "ConnectedApplication": {
    "name": "ConnectedApplication",
    "description": "Represents a connected app and its details; all fields are read-only.",
    "properties": {
      "MobileSessionTimeout": {
        "type": "picklist",
        "description": "Length of time after which the system logs out inactive mobile users."
      },
      "MobileStartUrl": {
        "type": "url",
        "description": "Users are directed to this URL after they’ve authenticated when the app is accessed from a mobile device."
      },
      "Name": {
        "type": "string",
        "description": "The unique name for this object."
      },
      "NamedUserUvidTimeout": {
        "type": "picklist",
        "description": "The timeout value for a JSON Web Token (JWT)-based access token that's issued to a named user. This field defines the timeout only if the app is configured to have an app-specific timeout. If the app uses the user's session timeout, the timeout value is defined based on the user's profile or the org session settings. For more information about defining JWT-based access token timeout, see Configure a Connected App to Issue JWT-Based Access Tokens."
      },
      "OptionsAllowAdminApprovedUsersOnly": {
        "type": "boolean",
        "description": "Indicates whether access is limited to users granted approval to use the connected app by an administrator. Manage profiles for the app by editing each profile’s Access list."
      },
      "OptionsAppIssueJwtTokenEnabled": {
        "type": "boolean",
        "description": "If set to true, the connected app is enabled to issue JWT-based access tokens. Available in API version 59.0 and later."
      },
      "OptionsCodeCredentialGuestEnabled": {
        "type": "",
        "description": ""
      },
      "OptionsFullContentPushNotifications": {
        "type": "",
        "description": ""
      },
      "OptionsHasSessionLevelPolicy": {
        "type": "boolean",
        "description": "Specifies whether the connected app requires a High Assurance level session."
      },
      "OptionsIsInternal": {
        "type": "",
        "description": ""
      },
      "OptionsRefreshTokenValidityMetric": {
        "type": "boolean",
        "description": "Specifies whether the refresh token validity is based on duration or inactivity. If true, the token validity is measured based on the last use of the token; otherwise, it’s based on the token duration."
      },
      "OptionsTokenExchangeManageBitEnabled": {
        "type": "boolean",
        "description": "If true, the OAuth 2.0 token exchange flow is enabled."
      },
      "PinLength": {
        "type": "picklist",
        "description": "For mobile apps, this field is the PIN length requirement for users of the connected app. Valid values are 4, 5, 6, 7, or 8."
      },
      "RefreshTokenValidityPeriod": {
        "type": "int",
        "description": "The duration of an authorization token until it expires in hours, months, or days as set in the connected app management page."
      },
      "StartUrl": {
        "type": "url",
        "description": "If the app isn’t accessed from a mobile device, users are directed to this URL after they’ve authenticated."
      },
      "UvidTimeout": {
        "type": "picklist",
        "description": "The timeout value for a JWT-based access token that's issued to an unknown user as a result of the guest user variation of the Authorization Code and Credentials Flow. JWT-based access tokens issued during this flow variation always contain a UVID. This field defines the timeout only if the app is configured to have an app-specific timeout. If the app uses the user's session timeout, the timeout value is defined based on the user's profile or the org session settings. For more information about defining JWT-based access token timeout, see Configure a Connected App to Issue JWT-Based Access Tokens."
      }
    },
    "module": "Core Salesforce"
  }
}