{
  "ContractLineItem": {
    "name": "ContractLineItem",
    "description": "Represents a product covered by a service contract (customer support agreement).",
    "properties": {
      "AssetId": {
        "type": "reference",
        "description": "Required. ID of the Asset associated with the contract line item. Must be a valid asset ID."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the contract line item."
      },
      "Discount": {
        "type": "percent",
        "description": "The discount for the product as a percentage."
      },
      "EndDate": {
        "type": "date",
        "description": "The last day the contract line item is in effect."
      },
      "LastReferencedDate": {
        "type": "date",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "date",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "LineItemNumber": {
        "type": "string",
        "description": "Automatically-generated number that identifies the contract line item."
      },
      "ListPrice": {
        "type": "currency",
        "description": "Corresponds to the UnitPrice on the PricebookEntry that is associated with this line item, which can be in the standard pricebook or a custom pricebook. A client application can use this information to show whether the unit price (or sales price) of the line item differs from the pricebook entry list price."
      },
      "LocationId": {
        "type": "reference",
        "description": "The location associated with the contract line item."
      },
      "ParentContractLineItemId": {
        "type": "reference",
        "description": "The line item’s parent line item, if it has one."
      },
      "PricebookEntryId": {
        "type": "reference",
        "description": "Required. ID of the associated PricebookEntry."
      },
      "Product2Id": {
        "type": "reference",
        "description": "The product related to the contract line item."
      },
      "Quantity": {
        "type": "double",
        "description": "Number of units of the contract line item (product) included in the associated service contract."
      },
      "RootContractLineItemId": {
        "type": "reference",
        "description": "(Read only) The top-level line item in a contract line item hierarchy. Depending on where a line item lies in the hierarchy, its root could be the same as its parent."
      },
      "ServiceContractId": {
        "type": "reference",
        "description": "Required. ID of the ServiceContract associated with the contract line item. Must be a valid service contract ID."
      },
      "StartDate": {
        "type": "date",
        "description": "The first day the contract line item is in effect."
      },
      "Status": {
        "type": "picklist",
        "description": "Status of the contract line item."
      },
      "Subtotal": {
        "type": "currency",
        "description": "Contract line item's sales price multiplied by the Quantity."
      },
      "TotalPrice": {
        "type": "currency",
        "description": "This field is available only for backward compatibility. It represents the total price of the ContractLineItem"
      },
      "UnitPrice": {
        "type": "currency",
        "description": "The unit price for the contract line item. In the user interface, this field’s value is calculated by dividing the total price of the contract line item by the quantity listed for that line item. Label is Sales Price."
      }
    },
    "module": "Field Service Lightning"
  }
}