{
  "ContractLineOutcome": {
    "name": "ContractLineOutcome",
    "description": "Represents information on a contract line outcome’s captured data and other related parameters that are used when capturing data.",
    "properties": {
      "CalculationMethod": {
        "type": "picklist",
        "description": "The method used for calculating the contract line outcome’s captured data to determine the outcome value. Select Average or As Captured to calculate the contract line outcome. Average calculates the outcome value based on the average of all data captured to date. As Captured calculates the outcome value based on the asset’s current data at the time of the compliance check."
      },
      "CaptureFrequency": {
        "type": "picklist",
        "description": "The frequency at which data capturing and contract compliance check for the contract line outcome occurs."
      },
      "ComplianceStatus": {
        "type": "picklist",
        "description": "Indicates if the criteria were met. Compliant–The outcome is compliant with the contract. Not Compliant–The outcome isn’t compliant with the contract. Not Available–The outcome’s compliance information isn’t available yet. Invalid–The outcome isn’t valid because the option selected for the Criteria Field of the recordset filter criteria was deleted. To restart the calculation, create a new contract line outcome."
      },
      "ContractLineItemId": {
        "type": "reference",
        "description": "The contract line item associated with the contract line outcome."
      },
      "Description": {
        "type": "textarea",
        "description": "A description of the contract line outcome."
      },
      "EndDate": {
        "type": "dateTime",
        "description": "The contract line outcome's data capture end date."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time when the contract line outcome was last modified. Its UI label is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time when the contract line outcome was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the contract line outcome."
      },
      "NextDataCaptureDate": {
        "type": "dateTime",
        "description": "The date of the next data capture and compliance check based on the capture frequency. The date is auto-populated and updated after each capture"
      },
      "OwnerId": {
        "type": "reference",
        "description": "The contract line outcome’s owner. By default, the owner is the user who created the contract line outcome record. Its UI label is Contract Line Outcome Owner."
      },
      "RecordsetFilterCriteriaId": {
        "type": "reference",
        "description": "The ID of the recordset filter criteria in which the contract line outcome’s conditions are defined."
      },
      "ServiceContractId": {
        "type": "reference",
        "description": "The service contract associated with the contract line item and the contract line outcome."
      },
      "StartDate": {
        "type": "dateTime",
        "description": "The contract line outcome's data capture start date."
      }
    },
    "module": "Field Service Lightning"
  }
}