{
  "Contract": {
    "name": "Contract",
    "description": "Represents a contract (a business agreement) associated with an Account.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "Required. ID of the Account associated with this contract."
      },
      "ActivatedById": {
        "type": "reference",
        "description": "ID of the User who activated this contract."
      },
      "ActivatedDate": {
        "type": "dateTime",
        "description": "Date and time when this contract was activated."
      },
      "": {
        "type": "",
        "description": ""
      },
      "ActivityMetricId": {
        "type": "reference",
        "description": "When Einstein Activity Capture with Activity Metrics is enabled, the ID of the related activity metric."
      },
      "ActivityMetricRollupId": {
        "type": "reference",
        "description": "When Einstein Activity Capture with Activity Metrics is enabled, the ID of the related activity metric rollup."
      },
      "AggregationStrategy": {
        "type": "picklist",
        "description": "The aggregation strategy when creating a pricing contract."
      },
      "BillingAddress": {
        "type": "address",
        "description": "The compound form of the billing address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "BillingCity": {
        "type": "string",
        "description": "Details for the billing address. The maximum size is 40 characters."
      },
      "BillingCountry": {
        "type": "string",
        "description": "Details for the billing address of this account. The maximum size is 80 characters."
      },
      "BillingCountryCode": {
        "type": "picklist",
        "description": "The ISO country code for the contract's billing address."
      },
      "BillingGeocodeAccuracy": {
        "type": "picklist",
        "description": "The accuracy of the geocode for the billing address."
      },
      "BillingLatitude": {
        "type": "double",
        "description": "Used with BillingLongitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "BillingLongitude": {
        "type": "double",
        "description": "Used with BillingLatitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "BillingPostalCode": {
        "type": "string",
        "description": "Details for the billing address of this account. The maximum size is 20 characters."
      },
      "BillingState": {
        "type": "string",
        "description": "Details for the billing address. The maximum size is 80 characters."
      },
      "BillingStateCode": {
        "type": "picklist",
        "description": "The ISO state code for the contract's billing address."
      },
      "BillingStreet": {
        "type": "textarea",
        "description": "Street address for the billing address."
      },
      "CompanySignedDate": {
        "type": "date",
        "description": "The date your organization signed the contract."
      },
      "CompanySignedId": {
        "type": "reference",
        "description": "ID of the user who signed the contract."
      },
      "ContractNumber": {
        "type": "string",
        "description": "Number of the contract."
      },
      "ContractTerm": {
        "type": "int",
        "description": "Number of months that the contract is valid."
      },
      "CustomerSignedDate": {
        "type": "date",
        "description": "The date when the customer signed the contract."
      },
      "CustomerSignedId": {
        "type": "reference",
        "description": "ID of the Contact who signed this contract."
      },
      "CustomerSignedTitle": {
        "type": "string",
        "description": "Title of the customer who signed the contract."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the contract."
      },
      "EndDate": {
        "type": "date",
        "description": "Read-only. Calculated end date of the contract. This value is calculated by adding the ContractTerm to the StartDate. If the Auto-calculate Contract End Date setting is disabled, the contract end date is editable."
      },
      "HasContractCotermination": {
        "type": "boolean",
        "description": "Indicates whether the contract can be coterminated (true) or not (false)."
      },
      "IsPricingContract": {
        "type": "boolean",
        "description": "Indicates whether the contract has related contract item prices (true) or if there are no contract item prices for the contract (false). This field is available with Revenue Cloud in API version 63.0 and later."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). The label is Deleted."
      },
      "LastActivityDate": {
        "type": "date",
        "description": "Value is the most recent: The due date of the most recent event is logged against the record. The due date of the most recently closed task associated with the record."
      },
      "LastApprovedDate": {
        "type": "dateTime",
        "description": "Last date the contract was approved."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate) but didn’t view it."
      },
      "OwnerExpirationNotice": {
        "type": "picklist",
        "description": "Number of days ahead of the contract end date (15, 30, 45, 60, 90, and 120). Used to notify the owner in advance that the contract is ending."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who owns the contract."
      },
      "Pricebook2Id": {
        "type": "reference",
        "description": "ID of the pricebook, if any, associated with this contract."
      },
      "PricingSource": {
        "type": "picklist",
        "description": "Source of the pricing for the contract."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "ID of the record type assigned to this object."
      },
      "RenewalTerm2": {
        "type": "double",
        "description": "The default subscription term for renewals. For example, if the Renewal Term Unit is months and you want a 6-month term, set the Renewal Term to 6. Available in API version 60.0 and later."
      },
      "RenewalTermUnit": {
        "type": "picklist",
        "description": "The unit of time for a subscription term."
      },
      "ShippingAddress": {
        "type": "address",
        "description": "The compound form of the shipping address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "ShippingCity": {
        "type": "string",
        "description": "Details of the shipping address. City maximum size is 40 characters."
      },
      "ShippingCountry": {
        "type": "string",
        "description": "Details of the shipping address. Country maximum size is 80 characters."
      },
      "ShippingCountryCode": {
        "type": "picklist",
        "description": "The ISO country code for the contract's shipping address."
      },
      "ShippingGeocodeAccuracy": {
        "type": "picklist",
        "description": "The accuracy of the geocode for the shipping address."
      },
      "ShippingLatitude": {
        "type": "double",
        "description": "Used with ShippingLongitude to specify the precise geolocation of a shipping address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "ShippingLongitude": {
        "type": "double",
        "description": "Used with ShippingLatitude to specify the precise geolocation of an address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "ShippingPostalCode": {
        "type": "string",
        "description": "Details of the shipping address. The postal code maximum size is 20 characters."
      },
      "ShippingState": {
        "type": "string",
        "description": "Details of the shipping address. The maximum size for the state is 80 characters."
      },
      "ShippingStateCode": {
        "type": "picklist",
        "description": "The ISO state code for the contract's shipping address."
      },
      "ShippingStreet": {
        "type": "textarea",
        "description": "The street address of the shipping address. The maximum size is 255 characters."
      },
      "SourceQuoteId": {
        "type": "reference",
        "description": "ID of the source quote associated with this contract. This field is available with Revenue Cloud in API version 64.0 and later."
      },
      "SpecialTerms": {
        "type": "textarea",
        "description": "Special terms that apply to the contract."
      },
      "StartDate": {
        "type": "date",
        "description": "Start date for this contract. The label is Contract Start Date."
      },
      "Status": {
        "type": "picklist",
        "description": "The picklist of values that indicate order status. Each value is within one of two status categories defined in StatusCode. For example, the status picklist may contain: Ready to Ship, Shipped, Received as values within the Activated StatusCode."
      },
      "StatusCode": {
        "type": "picklist",
        "description": "The status category for the contract. A contract can be Draft, InApproval, or Activated. Label is Status Category."
      },
      "UnitPriceUplift": {
        "type": "percent",
        "description": "Indicates the percentage increase of a line item’s unit price. This field is available with Revenue Cloud in API version 64.0 and later."
      }
    },
    "module": "Core Salesforce"
  }
}