{
  "ContactRequest": {
    "name": "ContactRequest",
    "description": "Represents a customer’s request for support to get back to them about an issue.",
    "properties": {
      "IsCallback": {
        "type": "boolean",
        "description": "Determines how a voice call callback is handled after an agent accepts the callback work item."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The contact request number."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the Salesforce record that owns the request."
      },
      "PreferredChannel": {
        "type": "picklist",
        "description": "The channel the customer selected as their preferred method of communication in the contact request flow. For example: Phone"
      },
      "PreferredPhone": {
        "type": "phone",
        "description": "The phone number the customer provided when requesting help in the contact request flow."
      },
      "RequestDescription": {
        "type": "textarea",
        "description": "The description of the customer’s issue that they provided when requesting help in the contact request flow."
      },
      "RequestReason": {
        "type": "picklist",
        "description": "The reason the customer provided when requesting help in the contact request flow. These values are customizable in Object Manager. The default values are: Account Billing Case General Order Other Product"
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the contact request. For example: Abandoned Attempted Contacted New"
      },
      "WhatId": {
        "type": "reference",
        "description": "ID of the Salesforce record the contact request is related to, such as an account, case, opportunity, or work order."
      },
      "WhoId": {
        "type": "reference",
        "description": "ID of the Salesforce contact record the contact request is related to, such as a contact, lead, or user."
      }
    },
    "module": "Core Salesforce"
  }
}