{
  "ContentAsset": {
    "name": "ContentAsset",
    "description": "Represents a Salesforce file that has been converted to an asset file in a custom app in Lightning Experience. Use asset files for org setup and configuration. Asset files can be packaged and referenced by other components.",
    "properties": {
      "ContentDocumentId": {
        "type": "reference",
        "description": "ID of the document."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the asset file in the API. ContentAsset.DeveloperName: must be 40 characters or fewer must begin with a letter can contain only underscores and alphanumeric characters can’t include spaces can’t end with an underscore can’t contain 2 consecutive underscores In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization."
      },
      "IsVisibleByExternalUsers": {
        "type": "boolean",
        "description": "Indicates whether unauthenticated users can see the asset file."
      },
      "Language": {
        "type": "picklist",
        "description": "The language for this document. This field defaults to the user's language unless the org is multi-language enabled. Specifies the language of the labels returned. The value must be a valid user locale (language and country), such as de_DE or en_GB. For more information on locales, see the Language field on the CategoryNodeLocalization object."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label for the asset file. This internal label doesn’t get translated."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix associated with this object. Each Developer Edition organization that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation."
      }
    },
    "module": "Core Salesforce"
  }
}