{
  "ContentDocument": {
    "name": "ContentDocument",
    "description": "Represents a document that has been uploaded to a library in Salesforce CRM Content or Salesforce Files. This object is available in versions 17.0 and later for Salesforce CRM Content.",
    "properties": {
      "ArchivedById": {
        "type": "reference",
        "description": "The ID of the user who archived the document.This field is available in API version 24.0 and later."
      },
      "ArchivedDate": {
        "type": "date",
        "description": "The date when the document was archived.This field is available in API version 24.0 and later."
      },
      "ContentAssetId": {
        "type": "reference",
        "description": "If the ContentDocument is an asset file, this field points to the asset. For most entities, the value of this field is null.This field is available in API version 38.0 and later."
      },
      "ContentModifiedDate": {
        "type": "dateTime",
        "description": "Date the document was modified.ContentModifiedDate updates when, for example, the document is renamed or a new document version is uploaded. When you’re uploading the first version of a document, ContentModifiedDate can be set to the current time or anytime in the past. This field is available in API version 32.0 and later."
      },
      "ContentSize": {
        "type": "int",
        "description": "The size of the document in bytes for files smaller than 2 GB. If the file is 2 GB or larger, use the ContentSizeLong field This field is available in API version 31.0 and later."
      },
      "ContentSizeLong": {
        "type": "long",
        "description": "The size of the document in bytes. This field is available in API version 65.0 and later. We recommend that you use this field instead of ContentSize even for files smaller than 2 GB."
      },
      "Description": {
        "type": "textarea",
        "description": "A description of the document. This field is available in API version 31.0 and later."
      },
      "Division": {
        "type": "picklist",
        "description": "A logical segment of your organization's data. For example, if your company is organized into different business units, you could create a division for each business unit, such as “North America,” “Healthcare,” or “Consulting.” Available only if the organization has the Division permission enabled."
      },
      "FileExtension": {
        "type": "string",
        "description": "File extension of the document. This field is available in API version 31.0 and later."
      },
      "FileType": {
        "type": "string",
        "description": "Type of document, determined by the file extension. This field is available in API version 31.0 and later."
      },
      "IsArchived": {
        "type": "boolean",
        "description": "Indicates whether the document has been archived (true) or not (false)."
      },
      "IsInternalOnly": {
        "type": "boolean",
        "description": "Indicates that a file is for internal use only. When true, prevents users with the Query Non Vetoed Files permission from viewing and performing SOQL query on public and non vetoed files in a Data Cloud org. Default value is false."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "LatestPublishedVersionId": {
        "type": "reference",
        "description": "ID of the latest document version (ContentVersion)."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this document."
      },
      "ParentId": {
        "type": "reference",
        "description": "ID of the library that owns the document. Created automatically when inserting a ContentVersion via the API for the first time.This field is available in API version 24.0 and later when Salesforce CRM Content is enabled."
      },
      "PublishStatus": {
        "type": "picklist",
        "description": "Indicates if and how the document is published. Valid values are: P—The document is published to a public library and is visible to other users. Label is Public. R—The document is published to a personal library and is not visible to other users. Label is Personal Library. U—The document is not published because publishing was interrupted. Label is Upload Interrupted."
      },
      "SharingOption": {
        "type": "picklist",
        "description": "Controls whether sharing is frozen for a file. Only administrators and file owners with Collaborator access to the file can modify this field. Default is Allowed, which means that new shares are allowed. When set to Restricted, new shares are prevented without affecting existing shares.This field is available in API versions 35.0 and later."
      },
      "SharingPrivacy": {
        "type": "picklist",
        "description": "Controls sharing privacy for a file. Only administrators and file owners with Collaborator access to the file can modify this field."
      },
      "Title": {
        "type": "string",
        "description": "The title of a document."
      }
    },
    "module": "Core Salesforce"
  }
}