{
  "ContentWorkspacePermission": {
    "name": "ContentWorkspacePermission",
    "description": "Represents a library permission.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": ""
      },
      "Name": {
        "type": "string",
        "description": "Name of the library."
      },
      "PermissionsAddComment": {
        "type": "boolean",
        "description": "Permission for user to post comments to any content in the library and view all comments in the library. Users can edit or delete their own comments."
      },
      "PermissionsAddContent": {
        "type": "boolean",
        "description": "Permission for user to publish new content to the library, upload new content versions, or restore archived (deleted) content. Content authors can also change any tags associated with their content and archive or delete their own content."
      },
      "PermissionsAddContentOBO": {
        "type": "boolean",
        "description": "Permission for user to choose an author when publishing content in the library."
      },
      "PermissionsArchiveContent": {
        "type": "boolean",
        "description": "Permission for user to archive and restore any content in the library."
      },
      "PermissionsChatterSharing": {
        "type": "boolean",
        "description": "Permission for user to make content from this library accessible outside of the library, sharing with a record or in Chatter. From a record or from Chatter, select a file from the library and attach it to a record or a post."
      },
      "PermissionsDeleteContent": {
        "type": "boolean",
        "description": "Permission for user to delete any content in the library. Authors can undelete their own content from the Recycle Bin."
      },
      "PermissionsDeliverContent": {
        "type": "boolean",
        "description": "Permission for user to share content outside the org via a content delivery or public link."
      },
      "PermissionsFeatureContent": {
        "type": "boolean",
        "description": "Permission for user to identify any content in the library as “featured.”"
      },
      "PermissionsManageWorkspace": {
        "type": "boolean",
        "description": "Permission for user to perform any action in the library. This privilege is required to edit a library’s name and description, add or remove library members, or delete a library. Manage Library is a super permission which provides all other permission options listed except Deliver Content. Creating a library requires the Manage Salesforce CRM Content app permission or Create Libraries system permission."
      },
      "PermissionsModifyComments": {
        "type": "boolean",
        "description": "Permission for user to edit or delete comments made to any content in the library."
      },
      "PermissionsOrganizeFileAndFolder": {
        "type": "boolean",
        "description": "Permission for user to create, rename, and delete folders in libraries."
      },
      "PermissionsTagContent": {
        "type": "boolean",
        "description": "Permission for user to add tags when publishing content or editing content details in the library."
      },
      "PermissionsViewComments": {
        "type": "boolean",
        "description": "Permission for user to view comments."
      },
      "Type": {
        "type": "picklist",
        "description": "Provides the type of access a user has to a library. Valid values are: Library Administrator Author Viewer Custom"
      }
    },
    "module": "Core Salesforce"
  }
}