{
  "ContentDistribution": {
    "name": "ContentDistribution",
    "description": "Represents information about sharing a document externally.",
    "properties": {
      "ContentDocumentId": {
        "type": "reference",
        "description": "ID of the shared document."
      },
      "ContentDownloadUrl": {
        "type": "string",
        "description": "The link for downloading the file. This field is available in API version 40.0 and later."
      },
      "ContentVersionId": {
        "type": "reference",
        "description": "ID of the shared document version."
      },
      "DistributionPublicUrl": {
        "type": "string",
        "description": "URL of the link to the shared document."
      },
      "ExpiryDate": {
        "type": "dateTime",
        "description": "Date when the shared document becomes inaccessible."
      },
      "FirstViewDate": {
        "type": "dateTime",
        "description": "Date when the shared document is first viewed."
      },
      "LastViewDate": {
        "type": "dateTime",
        "description": "Date when the shared document was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "Name of the content delivery."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who owns the shared document."
      },
      "PdfDownloadUrl": {
        "type": "string",
        "description": "The link for downloading the file as a PDF. This field is available in API version 40.0 and later."
      },
      "Password": {
        "type": "string",
        "description": "A password that allows access to a shared document."
      },
      "PreferencesAllowOriginalDownload": {
        "type": "boolean",
        "description": "When true, the shared document can be downloaded as the file type that it was uploaded as.When false, download availability depends on whether a preview of the file exists. If a preview exists, the file can’t be downloaded. If a preview doesn’t exist, the file can still be downloaded. If the shared document is a link, it can’t be downloaded."
      },
      "PreferencesAllowPDFDownload": {
        "type": "boolean",
        "description": "When true, the shared document can be downloaded as a PDF if the original file type is PDF or if a PDF preview has been generated."
      },
      "PreferencesAllowViewInBrowser": {
        "type": "boolean",
        "description": "When true, a preview of the shared document can be viewed in a Web browser."
      },
      "PreferencesExpires": {
        "type": "boolean",
        "description": "When true, access to the shared document expires on the date that’s specified by ExpiryDate."
      },
      "PreferencesLinkLatestVersion": {
        "type": "boolean",
        "description": "When true, users see the most recent version of a shared document. When false, users see the version of the document that’s shared, even if it isn’t the most recent version."
      },
      "PreferencesNotifyOnVisit": {
        "type": "boolean",
        "description": "When true, the owner of the shared document is emailed the first time that someone views or downloads the shared document."
      },
      "PreferencesNotifyRndtnComplete": {
        "type": "boolean",
        "description": "When true, the owner of the shared document is emailed when renditions of the shared document that can be previewed in a Web browser are generated."
      },
      "PreferencesPasswordRequired": {
        "type": "boolean",
        "description": "When true, a password, specified by Password, is required to access the shared document."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "ID of the record, such as an Account, Campaign, or Case, that the shared document is related to."
      },
      "ViewCount": {
        "type": "int",
        "description": "The number of times that the shared document has been viewed."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_contentdistribution.htm"
  }
}