{
  "ContactPointPhone": {
    "name": "ContactPointPhone",
    "description": "Represents a contact’s phone number, which is associated with an individual or person account.",
    "properties": {
      "ActiveFromDate": {
        "type": "date",
        "description": "The date when the contact’s phone number became active."
      },
      "ActiveToDate": {
        "type": "date",
        "description": "The date when the contact’s phone number is no longer active."
      },
      "AreaCode": {
        "type": "string",
        "description": "The area code of the phone number’s location for the contact."
      },
      "BestTimeToContactEndTime": {
        "type": "time",
        "description": "The latest time to contact the individual."
      },
      "BestTimeToContactStartTime": {
        "type": "time",
        "description": "The earliest time to contact the individual."
      },
      "BestTimeToContactTimezone": {
        "type": "picklist",
        "description": "The timezone applied to the best time to contact the individual."
      },
      "ExtensionNumber": {
        "type": "string",
        "description": "The phone number extension for the contact."
      },
      "FormattedInternationalPhoneNumber": {
        "type": "string",
        "description": "The internationally recognized format for the contact’s phone number."
      },
      "FormattedNationalPhoneNumber": {
        "type": "string",
        "description": "The nationally recognized format for the contact’s phone number."
      },
      "IsBusinessPhone": {
        "type": "boolean",
        "description": "Indicates whether a contact’s phone number is a business number (true) or not (false)."
      },
      "IsFaxCapable": {
        "type": "boolean",
        "description": "Indicates whether a contact’s phone number is a fax number (true) or not (false)."
      },
      "IsPersonalPhone": {
        "type": "boolean",
        "description": "Indicates whether a contact’s phone number is a personal number (true) or not (false)."
      },
      "IsPrimary": {
        "type": "boolean",
        "description": "Indicates whether a contact’s phone number is their primary number (true) or not (false)."
      },
      "IsSmsCapable": {
        "type": "boolean",
        "description": "Indicates whether a contact’s phone number can receive text messages (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the contact point phone record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the account’s owner associated with this contact."
      },
      "ParentId": {
        "type": "reference",
        "description": "The ID of the contact’s parent. Only an individual or account can be a contact’s parent."
      },
      "PhoneType": {
        "type": "picklist",
        "description": "The type of phone number for the contact."
      },
      "PreferenceRank": {
        "type": "int",
        "description": "Specify how this phone numbers ranks in terms of preference among the contact’s other phone numbers."
      },
      "TelephoneNumber": {
        "type": "phone",
        "description": "Required. The phone number for the contact."
      },
      "UsageType": {
        "type": "picklist",
        "description": "Specify the usage type of this number. For instance, whether it’s a work phone or a home phone."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_contactpointphone.htm"
  }
}