{
  "ConversationEntry": {
    "name": "ConversationEntry",
    "description": "Represents a message or event in a voice call or a standard or enhanced messaging session.",
    "properties": {
      "ActorId": {
        "type": "reference",
        "description": "The ID of the author. The possible values can be null or any ID in the following domain set: BotDefinition LiveChatVisitor MessagingEndUser User"
      },
      "ActorName": {
        "type": "string",
        "description": "The name of the author sending the message or event."
      },
      "ActorType": {
        "type": "picklist",
        "description": "The author of this entry in the chat history. The valid values include: Agent Bot EndUser Supervisor System"
      },
      "ClientDuration": {
        "type": "int",
        "description": "The length in milliseconds for the entry. This field is used with voice messages and other applicable use cases. This value may be 0 if not set by the client. This field is available in API version 51.0 and later."
      },
      "ClientTimestamp": {
        "type": "dateTime",
        "description": "The timestamp sent by the client when it generated the entry. This field is available in API version 51.0 and later."
      },
      "ConversationId": {
        "type": "reference",
        "description": "The MessagingSession ID this entry belongs to."
      },
      "EntryEndTime": {
        "type": "datetime",
        "description": "The timestamp that this entry ended in the chat history. This field is available in API version 48.0 and later."
      },
      "EntryTime": {
        "type": "datetime",
        "description": "The timestamp of this entry in the chat history."
      },
      "EntryTimeMilliSecs": {
        "type": "int",
        "description": "The milliseconds value for the time when an entry was received by the server. Note that the related EntryTime field does not provide millisecond accuracy. This field is available in API version 51.0 and later."
      },
      "EntryType": {
        "type": "picklist",
        "description": "The type of entry in the chat history. Can be a message (text) or an event. The possible values include: Text AdminOptedIn AdminOptedOut BotEscalated ChatbotClosedIdleSession ChatbotEndedChatByAction—Conversation ended by automated action ChatbotEndedTransferNotConfigured—Conversation ended because transfer fail is not configured ChatbotEstablished ChatbotNotEstablished EndUserOptedIn EndUserOptedOut"
      },
      "HasAttachments": {
        "type": "boolean",
        "description": "Indicates whether a message has attachments associated with it (true) or not (false)."
      },
      "Message": {
        "type": "textarea",
        "description": "The message or event sent by the author. In ConversationEntry records for enhanced Messaging channels or Messaging for In-App and Web, the Message field is blank due to data storage differences from standard channels."
      },
      "MessageDeliverTime": {
        "type": "datetime",
        "description": "Unused field reserved for future use."
      },
      "MessageIdentifier": {
        "type": "string",
        "description": "The unique ID for the message. Maximum size is 36 characters."
      },
      "MessageReadTime": {
        "type": "datetime",
        "description": "Unused field reserved for future use."
      },
      "MessageSendTime": {
        "type": "datetime",
        "description": "Unused field reserved for future use."
      },
      "MessageStatus": {
        "type": "picklist",
        "description": "The status of the message sent by the author. The valid values include: Delivered Error Pending Read Sent"
      },
      "MessageStatusCode": {
        "type": "string",
        "description": "The code associated with a message status. MessageStatusCode is only populated when a message is undeliverable"
      },
      "Seq": {
        "type": "int",
        "description": "The sequence position of this entry in the chat history."
      },
      "ServerReceivedTimestamp": {
        "type": "dateTime",
        "description": "The timestamp recorded when the server received the entry. This is a unique value and is used for ordering. This value can also be referred to as the “transcripted timestamp.” This field is available in API version 51.0 and later."
      }
    },
    "module": "Core Salesforce"
  }
}