{
  "ConvAnalysisTopic": {
    "name": "ConvAnalysisTopic",
    "description": "Represents a topic generated from the Sales Signals refresh or run. For example, a product experiencing issues due to high pricing could be a topic identified through the analysis of multiple calls.",
    "properties": {
      "CallPercentage": {
        "type": "double",
        "description": "Required. The percentage of calls that apply to a topic, out of the total number of calls that were analyzed."
      },
      "Category": {
        "type": "string",
        "description": "Required. A classification or grouping used to filter topics. This field is used in conjunction with Keyword."
      },
      "ConvAnalysisSummaryId": {
        "type": "reference",
        "description": "Required. The conversation analysis summary associated with the topic."
      },
      "GenerationsIdentifier": {
        "type": "string",
        "description": "Required. The ID used to track the LLM-generated response for feedback purposes."
      },
      "Keyword": {
        "type": "string",
        "description": "Required. A specific word used in conjunction with Category to filter topics. For example, Product:Salesforce, where the keyword is Salesforce."
      },
      "MentionCount": {
        "type": "int",
        "description": "Required. The number of call insights associated with the topic."
      },
      "Order": {
        "type": "int",
        "description": "Required. A numerical value used to sort topics in a sequence."
      },
      "Summary": {
        "type": "textarea",
        "description": "Required. A detailed explanation of the topic."
      },
      "Title": {
        "type": "string",
        "description": "Required. The title of the topic that describes it."
      },
      "TopicSentiment": {
        "type": "string",
        "description": "The sentiment of the topic, whether it’s negative, neutral, or positive."
      },
      "TotalCalls": {
        "type": "int",
        "description": "The total number of calls analyzed for the topic."
      },
      "TotalCallsForCategoryKeyword": {
        "type": "int",
        "description": "The total number of calls analyzed for category:keyword. Multiple topics can be under a single category:keyword."
      },
      "TotalMentionsForCategoryKeyword": {
        "type": "int",
        "description": "The total number of mentions analyzed for category:keyword."
      },
      "TurnIdentifier": {
        "type": "string",
        "description": "UUID that is generated and used to track a group of LLM-generated content."
      }
    },
    "module": "Core Salesforce"
  }
}