{
  "CrbnCreditProject": {
    "name": "CrbnCreditProject",
    "description": "Represents information about the environmental project that generates carbon credits by removing greenhouse gasses or preventing a certain quantity of greenhouse gasses from being released.",
    "properties": {
      "AdditionalBenefits": {
        "type": "multipicklist",
        "description": "Specifies the additional benefits related to the carbon credit project."
      },
      "Country": {
        "type": "picklist",
        "description": "The country in which the carbon credit project is implemented."
      },
      "CrbnCrMethodology": {
        "type": "string",
        "description": "The method that's used to adjust the carbon credits during the lifecycle of the project."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the carbon credit project."
      },
      "DeveloperAccountId": {
        "type": "reference",
        "description": "The account of an organization that develops the emissions reduction project and provides the carbon credits."
      },
      "ExternalIdentifier": {
        "type": "string",
        "description": "The external identifier of the data that is imported for the carbon credit project."
      },
      "FundedBy": {
        "type": "string",
        "description": "The name of the organization that's funding the carbon credit project."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "MitigationType": {
        "type": "picklist",
        "description": "Specifies the mitigation strategy associated with this carbon credit project."
      },
      "Name": {
        "type": "string",
        "description": "The name of the environmental project that generates carbon credits by removing greenhouse gases or preventing a certain quantity of greenhouse gases from being released."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "ProjRegistryIdentifier": {
        "type": "string",
        "description": "The unique identifier that's assigned by the registry to the carbon credit project."
      },
      "ProjectType": {
        "type": "picklist",
        "description": "Specifies the type of the carbon credit project."
      },
      "ProjectUrl": {
        "type": "url",
        "description": "The URL that contains the carbon credit project details."
      },
      "Region": {
        "type": "picklist",
        "description": "The region within the country where the carbon credit project is implemented."
      },
      "StandardsAgencyName": {
        "type": "picklist",
        "description": "Specifies the organization name that defines the standards for voluntary emissions reduction credits."
      },
      "TotalCrbnCrAllocInTco2e": {
        "type": "double",
        "description": "The total carbon credits allocated for the carbon credit project, which is a cumulative value of all the associated sustainability credits."
      },
      "TotalCrbnCrAvlInTco2e": {
        "type": "double",
        "description": "The total carbon credits available for the carbon credit project."
      },
      "TotalCrbnCrPurchInTco2e": {
        "type": "double",
        "description": "The total carbon credit purchased for the carbon credit project, which is a cumulative value of all the associated sustainability credits."
      },
      "TotalSpend": {
        "type": "currency",
        "description": "The total spend for the carbon credit project, which is a cumulative value of all the associated sustainability credits."
      },
      "VerifiedBy": {
        "type": "string",
        "description": "The name of the organization that verified the carbon credit project."
      },
      "VoluntaryRegistryName": {
        "type": "string",
        "description": "The name of the registry that lists the carbon credit projects."
      }
    },
    "module": "Net Zero Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.netzero_cloud_dev_guide.meta/netzero_cloud_dev_guide/sforce_api_objects_crbncreditproject.htm"
  }
}