{
  "CreditMemoInvApplication": {
    "name": "CreditMemoInvApplication",
    "description": "Represents information about the application of a credit memo to an invoice.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "Required. The amount of the credit memo that was applied to or unapplied from the invoice."
      },
      "AppliedDate": {
        "type": "dateTime",
        "description": "The date when the credit memo was applied. If the credit memo invoice application's type is Unapplied, this value is inherited from the Applied date of the credit memo referenced in the AssociatedLineId field."
      },
      "AssociatedLineId": {
        "type": "reference",
        "description": "ID of the original credit memo invoice application for a credit memo invoice application that represents an unapplied credit memo."
      },
      "CreditMemoBalance": {
        "type": "currency",
        "description": "The balance of a credit memo after it's applied or unapplied. This field is a snapshot of the credit memo's balance after the action. This field isn't updated after further changes to the credit memo balance."
      },
      "CreditMemoId": {
        "type": "reference",
        "description": "Required. The credit memo that was applied or unapplied."
      },
      "CreditMemoInvoiceNumber": {
        "type": "string",
        "description": "Required. An auto-generated number identifying the credit memo invoice application."
      },
      "Date": {
        "type": "dateTime",
        "description": "The date when the credit memo amount was applied to the invoice."
      },
      "Description": {
        "type": "string",
        "description": "Additional details about the credit memo applied to an invoice."
      },
      "EffectiveDate": {
        "type": "dateTime",
        "description": "The effective date of the application or unapplication of credit. You can provide this value when applying or unapplying the credit memo. This field is optional and provided only for reporting purposes. It doesn't affect the credit memo invoice application's other fields."
      },
      "HasBeenUnapplied": {
        "type": "picklist",
        "description": "Specifies whether this credit memo application has been unapplied from the target invoice."
      },
      "ImpactAmount": {
        "type": "currency",
        "description": "The net adjustment to the invoice's balance after a credit memo is applied or unapplied. If a credit memo was applied, this value is the negative version of the credit memo invoice application's Amount field. If a credit memo was unapplied, this value is the positive version of the credit memo invoice application's Amount field."
      },
      "InvoiceBalance": {
        "type": "currency",
        "description": "The balance of the credit memo after a credit memo is applied or unapplied. This field is a snapshot of the credit memo's balance after the action. This field isn't updated after further changes to the credit memo balance."
      },
      "InvoiceId": {
        "type": "reference",
        "description": "Required. The invoice to which the credit memo is applied."
      },
      "Type": {
        "type": "picklist",
        "description": "Required. Specifies whether the credit memo line application was generated because of an apply action (application) or an unapply action (unapplication)."
      },
      "UnappliedDate": {
        "type": "dateTime",
        "description": "The date when this application was unapplied from the target invoice."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_creditmemoinvapplication.htm"
  }
}