{
  "CreditMemo": {
    "name": "CreditMemo",
    "description": "Represents a document that is used to reduce the amount that a buyer owes a seller under the terms of an earlier invoice.",
    "properties": {
      "AppType": {
        "type": "picklist",
        "description": "Read-only field that indicates which Salesforce application generated the credit memo."
      },
      "Balance": {
        "type": "currency",
        "description": "Amount of the credit memo that's available for allocation."
      },
      "BillToContactId": {
        "type": "reference",
        "description": "Inherited from the account’s Bill to Account field."
      },
      "BillingAccountId": {
        "type": "reference",
        "description": "The customer account associated with this credit memo."
      },
      "CreationMode": {
        "type": "picklist",
        "description": "Indicates whether the credit memo originated in Salesforce or an external system."
      },
      "CreditDate": {
        "type": "date",
        "description": "The date when the credit memo was posted."
      },
      "CreditMemoNumber": {
        "type": "string",
        "description": "A credit memo numbering alternative to DocumentNumber, containing a number in a format of your choice. Credit memo numbering is optional."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Three-letter ISO 4217 currency code associated with the credit memo."
      },
      "Description": {
        "type": "string",
        "description": "Description of the credit memo."
      },
      "DocumentNumber": {
        "type": "string",
        "description": "System-generated number for organizing financial documents, for example DOC-0000123."
      },
      "EffectiveDate": {
        "type": "date",
        "description": "Represents the effective date of the credit memo. If this field is empty, the credit date is used. For reporting purposes only; this field drives no other logic."
      },
      "ExternalReference": {
        "type": "string",
        "description": "Contains an external system’s ID for the credit memo."
      },
      "ExternalReferenceDataSource": {
        "type": "string",
        "description": "Contains the name of the external system that also contains the credit memo."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it's possible that this record was only referenced (LastReferencedDate) and not viewed."
      },
      "NetCreditsApplied": {
        "type": "currency",
        "description": "Represents the total difference between the credit applied to and credit unapplied from the invoice."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The user who owns a credit memo record."
      },
      "ReferenceEntityId": {
        "type": "reference",
        "description": "The ID of the record that this credit memo was generated from. For example, the order, order summary, or invoice."
      },
      "SourceAction": {
        "type": "picklist",
        "description": "Indicates which Salesforce API created the credit memo."
      },
      "Status": {
        "type": "picklist",
        "description": "Status of the credit memo."
      },
      "TotalAdjustmentAmount": {
        "type": "currency",
        "description": "Sum of TotalAmount values for the credit memo’s adjustment lines."
      },
      "TotalAdjustmentAmountWithTax": {
        "type": "currency",
        "description": "The sum of the credit memo’s adjustment line amounts, including tax."
      },
      "TotalAdjustmentTaxAmount": {
        "type": "currency",
        "description": "The sum of the credit memo’s adjustment line tax. Adjustment line balances are excluded."
      },
      "TotalAmount": {
        "type": "currency",
        "description": "Sum of the credit memo’s TotalLineAmount and TotalAdjustmentAmount."
      },
      "TotalAmountWithTax": {
        "type": "currency",
        "description": "Total credit memo amount, with tax included."
      },
      "TotalChargeAmount": {
        "type": "currency",
        "description": "Sum of TotalAmount values for the credit memo’s charge lines."
      },
      "TotalChargeAmountWithTax": {
        "type": "currency",
        "description": "The sum of the credit memo’s charge line amounts, including tax."
      },
      "TotalChargeTaxAmount": {
        "type": "currency",
        "description": "This field is available in API version 49.0 and later."
      },
      "TotalCreditAmountApplied": {
        "type": "currency",
        "description": "Credit memo amount that's been applied to invoices."
      },
      "TotalCreditAmountUnapplied": {
        "type": "currency",
        "description": "Credit memo amount that's been unapplied from invoices."
      },
      "TotalTaxAmount": {
        "type": "currency",
        "description": "Sum of TotalAmount values for the credit memo’s tax lines."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_creditmemo.htm"
  }
}