{
  "CronTrigger": {
    "name": "CronTrigger",
    "description": "Contains schedule information for a scheduled job. CronTrigger is similar to a cron job on UNIX systems. This object is available in API version 17.0 and later.",
    "properties": {
      "CronExpression": {
        "type": "string",
        "description": "The cron expression used to initiate the schedule."
      },
      "CronJobDetailId": {
        "type": "reference",
        "description": "The ID of the CronJobDetail record containing more details about this scheduled job."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The date and time when the job either finished or will finish."
      },
      "NextFireTime": {
        "type": "dateTime",
        "description": "The next date and time the job is scheduled to run. null if the job is not scheduled to run again."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Owner of the job."
      },
      "PreviousFireTime": {
        "type": "dateTime",
        "description": "The most recent date and time the job ran. null if the job has not run before current local time."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The date and time when the most recent iteration of the scheduled job started."
      },
      "State": {
        "type": "string",
        "description": "The current state of the job. The job state is managed by the system. Possible values are: WAITING—The job is waiting for execution. ACQUIRED—The job has been picked up by the system and is about to execute. EXECUTING—The job is executing. COMPLETE—The trigger has fired and is not scheduled to fire again. ERROR—The trigger definition has an error. DELETED—The job has been deleted. PAUSED—A job can have this state during patch and major releases. After the release has finished, the job state is automatically set to WAITING or another state. BLOCKED—Execution of a second instance of the job is attempted while one instance is running. This state lasts until the first job instance is completed. PAUSED_BLOCKED—A job has this state due to a release occurring. When the release has finished and no other instance of the job is running, the job’s status is set to another state."
      },
      "TimesTriggered": {
        "type": "int",
        "description": "The number of times this job has been triggered."
      },
      "TimeZoneSidKey": {
        "type": "picklist",
        "description": "Returns the timezone ID. For example, America/Los_Angeles."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_crontrigger.htm"
  }
}