{
  "CustodyItemRelation": {
    "name": "CustodyItemRelation",
    "description": "Represents the relationship between a custody item and the context in which it’s held. For example, a custody item related to a case or case proceeding.",
    "properties": {
      "CaseId": {
        "type": "reference",
        "description": "The case that's associated with the custody item."
      },
      "CaseProceedingId": {
        "type": "reference",
        "description": "The case proceeding that's associated with the custody item."
      },
      "ContextId": {
        "type": "reference",
        "description": "The context of the custody item record."
      },
      "ContextType": {
        "type": "picklist",
        "description": "The type of object of the custody item context."
      },
      "CustodyItemId": {
        "type": "reference",
        "description": "The custody item that's related to a context."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the custody item relation record."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "Name": {
        "type": "string",
        "description": "The name of the custody item relation record."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of custody item with reference to the context. Picklist values aren't predefined for this field. Before you create a record, ensure that your Salesforce admin has defined picklist values based on your organization’s requirement."
      }
    },
    "module": "Public Sector Cloud"
  }
}