{
  "CustomField": {
    "name": "CustomField",
    "description": "Represents a custom field on a custom object that stores data unique to your organization.",
    "properties": {
      "DeveloperName": {
        "type": "string",
        "description": "The developer’s internal name for the custom field. For example, the internal name for the custom field CF__c is CF."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "Metadata": {
        "type": "CustomFieldMetadata",
        "description": "CustomFieldMetadata includes these fields. For more information, see CustomField in the Metadata API Developer Guide. caseSensitive complianceGroup defaultValue deleteConstraint deprecated* description displayFormat displayLocationInDecimal elementType* escapeMarkup externalDeveloperName externalId formula formulaTreatBlanksAs inlineHelpText isAIPredictionField isFilteringDisabled isNameField isSortingDisabled label length maskChar maskType picklist populateExistingRows precision readOnlyProxy referenceTo relationshipLabel relationshipName relationshipOrder reparentableMasterDetai required restrictedAdminField scale startingNumber stripMarkup summarizedField summaryFilterItems summaryForeignKey summaryOperation trackFeedHistory trackHistory type unique visibleLines writeRequiresMasterRead * Reserved for future use."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace of the custom field. A custom field can be in an extension namespace different than the object."
      },
      "TableEnumOrId": {
        "type": "Restricted picklist",
        "description": "The enum (for example, Account) or ID of the object this field is on."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_customfield.htm"
  }
}