{
  "CustomMsgChannel": {
    "name": "CustomMsgChannel",
    "description": "Represents a custom conversation channel and stores event-driven Messaging settings. Custom conversation channels are implemented for Bring Your Own Channel for Messaging and Bring Your Own Channel for CCaaS Messaging channels.",
    "properties": {
      "ChannelDefinitionId": {
        "type": "reference",
        "description": "Specifies the ConversationChannelDefinition for the custom channel."
      },
      "EventCapabilitiesIsInboundAcknowledgementEnabled": {
        "type": "boolean",
        "description": "Indicates whether the Salesforce admin has enabled read receipts and delivery receipts for inbound messages in the Messaging settings (true) or whether the admin hasn’t enabled these inbound acknowledgments (false). The default value is false, meaning inbound acknowledgments are disabled by default even if supported by the partner."
      },
      "EventCapabilitiesIsProgressIndicatorEnabled": {
        "type": "boolean",
        "description": "Reserved for future use."
      },
      "EventCapabilitiesIsTypingIndicatorDisabled": {
        "type": "boolean",
        "description": "Indicates whether the Salesforce admin has enabled typing indicators for outbound messages in the Messaging settings (false) or whether the admin hasn’t enabled outbound typing indicators (true). The default value is false, meaning the outbound typing indicators are enabled by default."
      },
      "HasInboundReceipts": {
        "type": "boolean",
        "description": "Indicates whether the Salesforce admin has enabled read receipts and delivery receipts for inbound messages in the Messaging settings (true) or whether the admin hasn’t enabled these inbound acknowledgments (false). The default value is false, meaning inbound acknowledgments are disabled by default even if supported by the partner."
      },
      "HasTypingIndicator": {
        "type": "boolean",
        "description": "Indicates whether the Salesforce admin has enabled typing indicators for outbound messages in the Messaging settings (true) or whether the admin hasn’t enabled outbound typing indicators (false). The default value is true, meaning the outbound typing indicator feature is enabled by default if supported by the partner. To disable the outbound typing indicator feature, set this value to false."
      },
      "MessagingChannelId": {
        "type": "reference",
        "description": "Specifies the Messaging Channel ID for the custom channel. This field is unique within your organization."
      }
    },
    "module": "Core Salesforce"
  }
}