{
  "CustodyChainEntry": {
    "name": "CustodyChainEntry",
    "description": "Represents information about an entry or event in the chain of custody.",
    "properties": {
      "AssessmentTaskId": {
        "type": "reference",
        "description": "The assessment task for which a custody chain entry is created."
      },
      "CustodianId": {
        "type": "reference",
        "description": "The user, organization, or location that has custody of the item."
      },
      "CustodyItemId": {
        "type": "reference",
        "description": "The parent custody item that's associated with the custody chain entry record."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the custody chain entry record of the item."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "The end date and time of custody chain entry the item."
      },
      "ItemCustodySiteId": {
        "type": "reference",
        "description": "The place where the item is held in custody."
      },
      "ItemVerificationType": {
        "type": "picklist",
        "description": "Specifies the type of verification for the item."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced the record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed the record."
      },
      "Name": {
        "type": "string",
        "description": "The name of the custody chain entry record."
      },
      "ReferenceRecordId": {
        "type": "reference",
        "description": "The stage, step, task, or any custom object for which the custody entry is created."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "The start date and time of custody chain entry for the item."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the custody entry record. Picklist values aren't predefined for this field. Before you create a record, ensure that your Salesforce admin has defined picklist values based on your organization’s requirement."
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "Specifies the category of the custody entry record's status."
      }
    },
    "module": "Public Sector Cloud"
  }
}