{
  "CustomBrandAsset": {
    "name": "CustomBrandAsset",
    "description": "Represents a branding element in a custom branding scheme. For example, a color, logo image, header image, or footer text.",
    "properties": {
      "AssetCategory": {
        "type": "picklist",
        "description": "Values include: MotifZeronaryColor—The background color for the header. Label is Zeronary motif color.If this CustomBrandAsset is for a network, this is the header color for the network. If it is for an org, this is the header color when users access the Salesforce mobile app. MotifPrimaryColor—The color used for the active tab. Label is Primary motif color.Not used for the Salesforce mobile app branding. MotifSecondaryColor—The color used for the top borders of lists and tables. Label is Secondary motif color.Not used for the Salesforce mobile app branding. MotifTertiaryColor—The background color for section headers on edit and detail pages. Label is Tertiary motif color.Not used for the Salesforce mobile app branding. MotifQuaternaryColor—If this CustomBrandAsset is for a network, this is the background color for network pages. If it is for an org, this is the background color on a splash page. Label is Quaternary motif color. MotifZeronaryComplementColor—Font color used with zeronaryColor. Label is Zeronary motif colors complement color. MotifPrimaryComplementColor—Font color used with primaryColor. Label is Primary motif colors complement color.Not used for the Salesforce mobile app branding. MotifTertiaryComplementColor—Font color used with tertiaryColor. Label is Tertiary motif colors complement color.Not used for the Salesforce mobile app branding. MotifQuaternaryComplementColor—Font color used with quaternaryColor. Label is Quaternary motif colors complement color.Not used for the Salesforce mobile app branding. PageHeader—An image that appears on the header of the pages. Can be an .html, .gif, .jpg, or .png file. Label is Page Header.Not used for the Salesforce mobile app branding. PageFooter—An image that appears on the footer of the pages. Must be an .html file. Label is Page Footer.Not used for the Salesforce mobile app branding. LoginFooterText—The text that appears in the footer of the login page. Label is Footer text displayed on the login page.Not used for the Salesforce mobile app branding. LoginLogoImageId—The logo that appears on the login page for external users. In the Salesforce mobile app, this logo also appears on the Experience Cloud site splash page. Label is Logo image displayed on the login page. LargeLogoImageId—Only used for the Salesforce mobile app. The logo that appears on the splash page when you start the Salesforce mobile app. Label is Large logo image. SmallLogoImageId—Only used for the Salesforce mobile app. The logo that appears on the publisher in the Salesforce mobile app. Label is Small logo image. StaticLogoImageURL—The logo that appears on the login page for external users. Label is Static logo image url. LoginQuaternaryColor—The background color that appears on the Experience Cloud site login page for external users. Label is Login background color. LoginRightFrameUrl—The URL to the contents that appears on right side of the Experience Cloud site login page for external users. Label is Login right frame url. LogoAssetId—Navigation tile menu item images. Label is Logo asset image. LoginPrimaryColor—The background color of the login button. Label is Login primary color. LoginBackgroundImageUrl—The path to the image URL that appears as the background on the Experience Cloud site’s login page. Label is Background image url. LargeLogoAssetId—Navigational topic images. Label is Large logo asset image. MediumLogoAssetId—Featured topic images. Label is Medium logo asset image."
      },
      "AssetSourceId": {
        "type": "reference",
        "description": "ID of the document uploaded to the Documents folder if the value of AssetCategory is: PageHeader PageFooter LoginLogoImageId LargeLogoImageId SmallLogoImageId ID of the content asset if the value of the AssetCategory is: LogoAssetId LargeLogoAssetId MediumLogoAssetId"
      },
      "CustomBrandId": {
        "type": "reference",
        "description": "ID of the associated CustomBrand."
      },
      "ForeignKeyAssetId": {
        "type": "reference",
        "description": "This field was removed in API version 41.0, and is available in earlier versions for backward compatibility only. Use AssetSourceId instead. ID of the document used if the value of AssetCategory is PageHeader, PageFooter, or LoginLogoImageId."
      },
      "TextAsset": {
        "type": "string",
        "description": "Text used if the AssetCategory is LoginFooterText."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_custombrandasset.htm"
  }
}