{
  "HealthcareProviderTaxonomy": {
    "name": "HealthcareProviderTaxonomy",
    "description": "Represents the taxonomy or subspecialty codes for a provider or facility. A provider or facility can have multiple taxonomies.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The business account associated with the provider taxonomy."
      },
      "EffectiveFrom": {
        "type": "date",
        "description": "The date when the healthcare provider taxonomy is active."
      },
      "EffectiveTo": {
        "type": "date",
        "description": "The date when the healthcare provider taxonomy is no longer active."
      },
      "HealthcareProviderId": {
        "type": "reference",
        "description": "The healthcare provider associated with the healthcare provider taxonomy."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the healthcare provider taxonomy is active (true) or not (false)."
      },
      "IsPrimaryTaxonomy": {
        "type": "boolean",
        "description": "Indicates whether the healthcare provider taxonomy is the provider's primary taxonomy (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the healthcare provider taxonomy."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the record owner."
      },
      "PractitionerId": {
        "type": "reference",
        "description": "The practitioner associated with the healthcare provider taxonomy."
      },
      "SourceSystem": {
        "type": "string",
        "description": "System from which the record was sourced."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of the system from which the record was sourced."
      },
      "TaxonomyId": {
        "type": "reference",
        "description": "The care taxonomy associated with the heathcare provider taxonomy."
      }
    },
    "module": "Public Sector Cloud"
  }
}