{
  "HealthCareDiagnosis": {
    "name": "HealthCareDiagnosis",
    "description": "Represents information related to industry-standard healthcare diagnosis codes. Before the Spring ’21 release, the Healthcare Procedure and Healthcare Diagnosis objects stored codes specifically related to procedures and diagnoses. These codes were used for prior-authorization requests and approval processes. Since the Spring’21 release, Health Cloud uses the Code Set and Code Set Bundle objects for this purpose instead.",
    "properties": {
      "Category": {
        "type": "picklist",
        "description": "Indicates the category for this diagnosis such as newborn, pediatric, maternity, or adult."
      },
      "Code": {
        "type": "string",
        "description": "Industry-standard diagnosis code."
      },
      "CodeDescription": {
        "type": "string",
        "description": "Description of the diagnosis code."
      },
      "CodeType": {
        "type": "picklist",
        "description": "Type of diagnosis code represented in the record such as ICD-9 or ICD-10."
      },
      "EffectiveDate": {
        "type": "date",
        "description": "Start date for the code."
      },
      "EndDate": {
        "type": "date",
        "description": "End date for the code."
      },
      "Gender": {
        "type": "picklist",
        "description": "Indicates whether this diagnosis is for males, females, or all genders."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the diagnosis code is available for use."
      },
      "IsComplicationOrComorbidity": {
        "type": "boolean",
        "description": "Indicates whether this diagnosis is used to represent a complication or comorbidity."
      },
      "IsHospitalAcquiredCondition": {
        "type": "boolean",
        "description": "Indicates whether this diagnosis represents a condition acquired while in the hospital."
      },
      "IsMajorComplicationOrComorbidity": {
        "type": "boolean",
        "description": "Indicates whether this diagnosis is used to represent a major complication or comorbidity."
      },
      "IsPresentOnAdmissionExempt": {
        "type": "boolean",
        "description": "Indicates whether diagnosis code is exempt from the diagnosis present on admission requirement."
      },
      "IsPrimaryDiagnosis": {
        "type": "boolean",
        "description": "Indicates whether diagnosis code can be used as primary diagnosis only, or can be used in any diagnosis sequence."
      },
      "IsUnacceptablePrincipalDxIpAdmit": {
        "type": "boolean",
        "description": "Indicates whether diagnosis code is an unacceptable principal diagnosis for inpatient admission per Medicare Code Edits."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the code that displays in search and lookup fields. Salesforce recommends using the code along with the description to populate this field. For example, use <Code>: <Description> or <Code>-<Description> such as (E08.37X9 - Diabetes mellitus due to underlying condition)."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      }
    },
    "module": "Health Cloud"
  }
}