{
  "HealthcareProvider": {
    "name": "HealthcareProvider",
    "description": "Represents business-level details about the healthcare organization or the practitioner.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "Account that this healthcare provider is associated with. This field is a relationship field."
      },
      "Classification": {
        "type": "picklist",
        "description": "Specifies the classification of the healthcare provider. This field is available in API version 63.0 and later when Site Management is enabled."
      },
      "DoesParticipateInRsrchStudy": {
        "type": "boolean",
        "description": "Indicates whether the healthcare provider participates in research studies (true) or not (false). This field is available in API version 63.0 and later when Site Management is enabled."
      },
      "DoesUseElecDataCapture": {
        "type": "boolean",
        "description": "Indicates whether the healthcare provider uses Electronic Data Capture (EDC) system (true) or not (false). This field is available in API version 62.0 and later when Site Management is enabled."
      },
      "EffectiveFrom": {
        "type": "date",
        "description": "Specifies the date from which the provider becomes effective."
      },
      "EffectiveTo": {
        "type": "date",
        "description": "Specifies the date from which the provider is no longer effective."
      },
      "EhrSystem": {
        "type": "textarea",
        "description": "Name of the EHR system used at this facility or organization."
      },
      "InitialStartDate": {
        "type": "date",
        "description": "Specifies the date when the facility first became operational or the practitioner first began practicing."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last referenced a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Name of the provider."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record. This field is a polymorphic relationship field."
      },
      "PractitionerId": {
        "type": "reference",
        "description": "The practitioner that this healthcare provider record is associated with. This field is a relationship field."
      },
      "ProviderClass": {
        "type": "picklist",
        "description": "The class of facility, such as an IPA, medical group, or solo practitioner."
      },
      "ProviderPhotoId": {
        "type": "reference",
        "description": "The Content Document file that is a photo of the Healthcare Provider. This field is a relationship field."
      },
      "ProviderType": {
        "type": "picklist",
        "description": "Type of provider or facility. For example, pharmacist or ambulatory care facility."
      },
      "RelatedUserId": {
        "type": "reference",
        "description": "The User record that relates to the Healthcare Provider record. This field is a relationship field."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The system from which the record was sourced."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of the system from which the record was sourced. This field is unique within your organization"
      },
      "TerminationDate": {
        "type": "date",
        "description": "Termination date for this provider."
      },
      "TerminationReason": {
        "type": "string",
        "description": "Reason for termination."
      },
      "TotalLicensedBeds": {
        "type": "int",
        "description": "Total number of licensed beds at this facility, if applicable."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/sforce_api_objects_healthcareprovider.htm"
  }
}