{
  "HierCondHlthRskAdjFctr": {
    "name": "HierCondHlthRskAdjFctr",
    "description": "Stores the risk adjustment factor for patients and members based on the set of Hierarchical Condition Category (HCC) codes that apply to them and the status of their benefits eligibility.",
    "properties": {
      "CmnyFullBnftDualDisabled": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, has full benefits from both Medicare and Medicaid, and is enrolled in Medicare because of a disability."
      },
      "CmnyPartialBenefitDualAged": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, has partial benefits from both Medicare and Medicaid, and is enrolled in Medicare because of their age."
      },
      "CmnyPartialBnftDualDsbl": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, has partial benefits from both Medicare and Medicaid, and is enrolled in Medicare because of a disability."
      },
      "Community": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home."
      },
      "CommunityFullBnftDualAged": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, has full benefits from both Medicare and Medicaid, and is enrolled in Medicare because of their age."
      },
      "CommunityNonDualAged": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, is covered only by Medicare, and is enrolled in Medicare because of their age."
      },
      "CommunityNonDualDisabled": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at home, is covered only by Medicare, and is enrolled in Medicare because of a disability."
      },
      "Condition": {
        "type": "string",
        "description": "Specifies the condition for which the HCC code is defined."
      },
      "ConditionCategory": {
        "type": "picklist",
        "description": "Specifies the broader category that the specified condition belongs to. For instance, Respiratory Ailment."
      },
      "HierCondCategoryCodeId": {
        "type": "reference",
        "description": "The record ID of the HCC code."
      },
      "Institutional": {
        "type": "double",
        "description": "Specifies the risk adjustment factor for a patient who lives at a healthcare facility."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates that the risk adjustment factors defined in the record are active."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time when the record was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time when the record was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The system-generated name of the record."
      },
      "OverriddenCodes": {
        "type": "textarea",
        "description": "The list of HCC codes overridden by the specified HCC code."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the record in the system."
      },
      "PublishedYear": {
        "type": "int",
        "description": "The year when the specified risk adjustment factors were published."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/sforce_api_objects_hiercondhlthrskadjfctr.htm"
  }
}