{
  "Hostname Redirects Event Type": {
    "name": "Hostname Redirects Event Type",
    "description": "",
    "properties": {
      "EVENT_TYPE": {
        "type": "String",
        "description": ""
      },
      "TIMESTAMP": {
        "type": "String",
        "description": "20220715233322.670"
      },
      "REQUEST_ID": {
        "type": "String",
        "description": "0000000062_0000x8Lz-"
      },
      "ORGANIZATION_ID": {
        "type": "ID",
        "description": "00D000000000345"
      },
      "USER_ID": {
        "type": "ID",
        "description": ""
      },
      "RUN_TIME": {
        "type": "Number",
        "description": ""
      },
      "CPU_TIME": {
        "type": "Number",
        "description": ""
      },
      "URI": {
        "type": "String",
        "description": ""
      },
      "SESSION_KEY": {
        "type": "String",
        "description": ""
      },
      "LOGIN_KEY": {
        "type": "String",
        "description": ""
      },
      "MESSAGE": {
        "type": "String",
        "description": ""
      },
      "DOMAIN": {
        "type": "Url",
        "description": "This field is unused in the HostnameRedirects event type. The value is always null."
      },
      "SOURCE_HOSTNAME": {
        "type": "String",
        "description": "If https://oldMyDomainName.my.salesforce.com is redirected to https://newMyDomainName.my.salesforce.com, the value of this field is oldMyDomainName.my.salesforce.com"
      },
      "TARGET_HOSTNAME": {
        "type": "String",
        "description": "If https://oldMyDomainName.my.salesforce.com is redirected to https://newMyDomainName.my.salesforce.com, the value of this field is newMyDomainName.my.salesforce.com"
      },
      "PATH": {
        "type": "String",
        "description": "If the user is redirected from https://MyOldCompany.my.site.com/shop?q=sneakers to https://MyNewCompany.my.site.com/shop?q=sneakers, the value of this field is /shop."
      },
      "REDIRECT_REASON": {
        "type": "String",
        "description": "Redirected due to a hostname mismatch.—The referring hostname was redirected to the current My Domain equivalent. Redirection suppressed to prevent Lightning Out integration failure.—The *.force.com site URL can’t be redirected for use with Lightning Out. To prevent issues, the original URL was processed as-is. To avoid issues after *.force.com site hostname redirections are stopped, update hard-coded references to the hostname in your Lightning Out integrations. For a Lightning Out code example that uses a site hostname, see Share Lightning Out Apps with Unauthenticated Users in the Salesforce Lightning Component Library. Redirection was blocked because redirections for this hostname are disabled.—Only your last set of My Domain login hostnames is redirected. Those redirections are blocked when the My Domain Routing option Redirect previous My Domain URLs to your current My Domain is deselected or because you removed your previous My Domain. That option applies to legacy (non-enhanced) hostnames in production orgs until Spring ’25. In non-production orgs, that option has no impact on redirections for legacy hostnames in Winter ’25 and later. Non-production orgs include sandboxes, Developer Edition orgs, demo orgs, patch orgs, scratch orgs, and Trailhead Playgrounds. For information If the SOURCE_HOSTNAME is a legacy *.force.com site hostname, the redirection was blocked because the Redirect previousSiteHostnames URLs to your current My Domain site URLs Routing option was deselected on the My Domain Setup page. That option is available in production orgs until Spring ’25. In non-production orgs, that option was removed in Winter ’25. Non-production orgs include sandboxes, Developer Edition orgs, demo orgs, patch orgs, scratch orgs, and Trailhead Playgrounds. Redirection was blocked because redirections for the legacy SOURCE_HOSTNAME are no longer supported.—If your org was created before June 2022, Salesforce served the org on a different set of hostnames until enhanced domains were deployed. The SOURCE_HOSTNAME is one of those hostnames. For non-production orgs, redirections for those hostnames stopped in Winter ’25."
      },
      "IS_BLOCKED_REDIRECTION": {
        "type": "Boolean",
        "description": "1—The redirection was blocked and returned an HTTP 404 response. 0—The redirection proceeded and returned an HTTP 301 or 307 response."
      },
      "REFERRER": {
        "type": "String",
        "description": "For example, if a user clicked a link to the SOURCE_HOSTNAME from a web page, and that web page is on a different domain: if the Referrer-Policy HTTP Header is no-referrer-when-downgrade, REFERRER includes the origin, path, and query-string parameters up to the first hash (#), if present. if the Referrer-Policy HTTP Header is strict-origin-when-cross-origin, REFERRER includes the origin only. if the Referrer-Policy HTTP Header is same-origin, REFERRER is null."
      },
      "ORIGIN": {
        "type": "String",
        "description": "The port isn’t included in the origin information with all requests. ORIGIN can be null in a number of situations, including but not limited to cross-origin requests and origins with a restrictive Referrer-Policy header. For example, if the request to the SOURCE_HOSTNAME is sent from a site external to Salesforce with a RequestMode of no-cors, ORIGIN is null."
      },
      "TIMESTAMP_DERIVED": {
        "type": "DateTime",
        "description": "2022-07-27T11:32:59.555Z."
      },
      "USER_ID_DERIVED": {
        "type": "String",
        "description": ""
      },
      "CLIENT_IP": {
        "type": "String",
        "description": "111.43.144.26"
      },
      "URI_ID_DERIVED": {
        "type": "String",
        "description": ""
      }
    },
    "module": "Core Salesforce"
  }
}