{
  "HotelStayEnrgyUse": {
    "name": "HotelStayEnrgyUse",
    "description": "Represents the energy consumption related to hotel stay.",
    "properties": {
      "CarbonFootprintReportDate": {
        "type": "date",
        "description": "The date when the carbon footprint data of the associated stationary asset is due to be sent to a reporting body."
      },
      "CostCenter": {
        "type": "string",
        "description": "The cost center associated with this energy use record."
      },
      "EmissionFctrKgCo2eRoomPerNight": {
        "type": "double",
        "description": "The emissions that are calculated based on the impact of staying in a hotel. This value is measured in kg of CO2 equivalents per night."
      },
      "EndDate": {
        "type": "date",
        "description": "The date until when the values of this energy use record are valid."
      },
      "HotelCity": {
        "type": "string",
        "description": "The city in which the hotel is located"
      },
      "HotelCountry": {
        "type": "picklist",
        "description": "The country in which the hotel is located."
      },
      "HotelName": {
        "type": "string",
        "description": "The name of the hotel."
      },
      "HotelStayEmssnFctrId": {
        "type": "reference",
        "description": "The hotel stay mission factors that are used to calculate the emissions."
      },
      "IsRecordLocked": {
        "type": "boolean",
        "description": "Indicates whether the hotel stay energy use record is locked for editing because the associated carbon footprint is locked for editing."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name for this energy use record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "RoomCount": {
        "type": "double",
        "description": "The number of rooms in the hotel. This value is used to calculate the emissions."
      },
      "RoomType": {
        "type": "string",
        "description": "The type of room."
      },
      "Scope3CrbnFtprntId": {
        "type": "reference",
        "description": "The scope 3 carbon footprint record that's associated with this energy use record."
      },
      "Scope3EmissionsInTco2e": {
        "type": "double",
        "description": "The total scope 3 emissions in metric tonnes of carbon dioxide equivalent."
      },
      "Scope3EmssnSrcId": {
        "type": "reference",
        "description": "The scope 3 emission source that's associated with this energy use record."
      },
      "StartDate": {
        "type": "date",
        "description": "The date from when the values of this energy use record are valid."
      },
      "StayNightsCount": {
        "type": "double",
        "description": "The number of nights of hotel stay. This value is used to calculate the emissions."
      },
      "SuplScope3Emissions": {
        "type": "double",
        "description": "The supplemental scope 3 emissions value that’s added to the calculated total scope 3 emissions value."
      },
      "SupplierId": {
        "type": "reference",
        "description": ""
      },
      "TravelerName": {
        "type": "string",
        "description": "The name of the traveler."
      }
    },
    "module": "Net Zero Cloud"
  }
}