{
  "CalculationMatrixVersion": {
    "name": "CalculationMatrixVersion",
    "description": "Defines a version of a Decision Matrix. The label for this object is Decision Matrix Version.",
    "properties": {
      "ApiName": {
        "type": "string",
        "description": "The API name of the decision matrix version. This field is available in API version 56.0 and later."
      },
      "CalculationMatrixId": {
        "type": "reference",
        "description": "The ID of the Decision Matrix to which this version belongs."
      },
      "DecisionMatrixDefinitionVerId": {
        "type": "reference",
        "description": "The decision matrix definition version associated with this calculation matrix version."
      },
      "DscnModelNoteExportStatus": {
        "type": "reference",
        "description": "Indicates the export status of a decision matrix version in the Decision Model and Notation (DMN) format."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "The last date on which this matrix version is active."
      },
      "GroupKey": {
        "type": "string",
        "description": "A key for grouping matrix rows in different versions, such as geographic region or product code. Derived from the associated Decision Matrix (CalculationMatrix object)."
      },
      "GroupKeyValue": {
        "type": "string",
        "description": "The value of the GroupKey for this version. For example, if the GroupKey is Country, the GroupKeyValue can be United States."
      },
      "IsEnabled": {
        "type": "boolean",
        "description": "Specifies whether this version is active."
      },
      "LoadProcessStatus": {
        "type": "picklist",
        "description": "The status of a data upload from a .csv file."
      },
      "MatrixType": {
        "type": "string",
        "description": "The matrix type, either Standard or Grouped. A Grouped Decision Matrix groups rows in different Decision Matrix Versions by one or two keys such as geographic region or product code. Derived from the associated Decision Matrix (CalculationMatrix object)."
      },
      "Name": {
        "type": "string",
        "description": "The matrix version name."
      },
      "Rank": {
        "type": "int",
        "description": "When the invocation time of a matrix call is between the StartDateTime and EndDateTime of more than one enabled matrix version, the version with the highest Rank is chosen."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "The first date on which this matrix version is active."
      },
      "SubGroupKey": {
        "type": "string",
        "description": "A subkey for grouping matrix rows in different versions, such as geographic region or product code. For example, if the GroupKey is Country, the SubGroupKey can be State or Province. Derived from the associated Decision Matrix (CalculationMatrix object)."
      },
      "SubGroupKeyValue": {
        "type": "string",
        "description": "The value of the SubGroupKey for this version. For example, if the SubGroupKey is State or Province, the SubGroupKeyValue can be California."
      },
      "VersionNumber": {
        "type": "int",
        "description": "The version number."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/sforce_api_objects_calculationmatrixversion.htm"
  }
}