{
  "CareServiceVisit": {
    "name": "CareServiceVisit",
    "description": "Associates a service request or a referral request (ClinicalServiceRequest) with a visit (ServiceAppointment) that’s part of that service or referral.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The ID of the account associated with the patient who received the care service."
      },
      "AutoVerifiedVisitEndDtTm": {
        "type": "dateTime",
        "description": "The end date and time of the care service visit that's automatically updated from the care giver's mobile device."
      },
      "AutoVrfyVisitEndLoc": {
        "type": "location",
        "description": "The end location of the care service visit that's automatically updated from the care giver's mobile device."
      },
      "AutoVrfyVisitStartDtTm": {
        "type": "dateTime",
        "description": "The start date and time of the care service visit that's automatically updated from the care giver's mobile device."
      },
      "AutoVrfyVstStartLoc": {
        "type": "location",
        "description": "The start location of the care service visit that's automatically updated from the care giver's mobile device."
      },
      "CarePlanContextId": {
        "type": "reference",
        "description": "The ID of the care plan, care plan detail, goal assignment, or action plan associated with the care service visit."
      },
      "CareServiceVisitPlanId": {
        "type": "reference",
        "description": "The ID of the care service visit plan associated with the care service visit."
      },
      "ClinicalServiceRequestId": {
        "type": "reference",
        "description": "The service request that the visit is related to."
      },
      "EndedById": {
        "type": "reference",
        "description": "The ID of the care giver who ends the care service visit."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time when the record was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time when the record was last viewed."
      },
      "ManVerifiedVisitEndDtTm": {
        "type": "dateTime",
        "description": "The end date and time of the care service visit that's verified and updated by a care professional from the Home Health agency."
      },
      "ManVerifiedVisitStartDtTm": {
        "type": "dateTime",
        "description": "The start date and time of the care service visit that's verified and updated by a care professional from the Home Health agency."
      },
      "ManVrfyVisitEndLoc": {
        "type": "location",
        "description": "The end location of the care service visit that's verified and updated by a care professional from the Home Health agency."
      },
      "ManVrfyVisitStartLoc": {
        "type": "location",
        "description": "The start location of the care service visit that's verified and updated by a care professional from the Home Health agency."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the record."
      },
      "RelatedVisitId": {
        "type": "reference",
        "description": "Specifies the ID of a related care service visit that’s associated with a care service visit."
      },
      "RelatedVisitType": {
        "type": "picklist",
        "description": "Specifies the type of related visit that's associated with the care service visit."
      },
      "ServiceRequestId": {
        "type": "reference",
        "description": "A derived field that’s used for internal purposes."
      },
      "SourceReferenceRecordId": {
        "type": "reference",
        "description": "The quote or party appointment request that's the source of the care service visit."
      },
      "StartedById": {
        "type": "reference",
        "description": "The ID of the care giver who starts the care service visit."
      },
      "VisitId": {
        "type": "reference",
        "description": "The visit that’s related to the service request."
      },
      "VisitType": {
        "type": "picklist",
        "description": "The type of the care service visit."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/sforce_api_objects_careservicevisit.htm",
    "clouds": [
      "Health Cloud"
    ]
  }
}