{
  "ClaimParticipant": {
    "name": "ClaimParticipant",
    "description": "A junction object that associates the Claim object with the Account object. This object represents the participants of a claim. Claim participants include insured, claimants, and witnesses.",
    "properties": {
      "ClaimId": {
        "type": "reference",
        "description": "The ID of the claim in which this participant has one or more roles."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "An auto-generated number assigned to this record."
      },
      "Roles": {
        "type": "multipicklist",
        "description": "The roles that the claim participant can have in the claim. For example, witness, victim, defendant, claimant."
      },
      "ClaimInstanceIdentifier": {
        "type": "string",
        "description": "A unique identifier for the claim participant instance. This field is available from API version 65.0 and later."
      },
      "InsurancePolicyParticipantId": {
        "type": "reference",
        "description": "The ID of the insurance policy participant associated with this claim. This field is available from API version 51.0 and later."
      },
      "IsInjured": {
        "type": "boolean",
        "description": "Indicates whether the claim participant was injured in the accident. The default value is False."
      },
      "ParticipantAccountId": {
        "type": "reference",
        "description": "The ID of the claim participant's account."
      },
      "ParticipantContactId": {
        "type": "reference",
        "description": "The ID of the claim participant's contact."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the source system this record was obtained from."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of this record in the source system."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_claimparticipant.htm",
    "clouds": [
      "Manufacturing Cloud",
      "Financial Services Cloud"
    ]
  }
}