{
  "ContentVersion": {
    "name": "ContentVersion",
    "description": "Represents a specific version of a document in Salesforce CRM Content or Salesforce Files.",
    "properties": {
      "Checksum": {
        "type": "string",
        "description": "MD5 checksum for the file.",
        "maxLength": 50,
        "nullable": true,
        "readOnly": true
      },
      "ContentBodyId": {
        "type": "reference",
        "description": "Allows inserting a file version independently of the file blob being uploaded. This field is available for query and insert only. It can only point to a ContentBody record. This field is available in API version 40.0 and later.",
        "format": "salesforce-id",
        "x-object": "ContentBody",
        "maxLength": 18,
        "nullable": true,
        "readOnly": true
      },
      "ContentDocumentId": {
        "type": "reference",
        "description": "ID of the document.",
        "format": "salesforce-id",
        "x-object": "ContentDocument",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "ContentLocation": {
        "type": "picklist",
        "description": "Origin of the document. Valid values are: S—Document is located within Salesforce. Label is Salesforce. E—Document is located outside of Salesforce. Label is External. L—Document is located on a social network and accessed via Social Customer Service. Label is Social Customer Service.",
        "format": "enum",
        "enum": [
          "S",
          "E",
          "L",
          "SfDrive",
          "SCS"
        ],
        "maxLength": 40,
        "nullable": false,
        "readOnly": true
      },
      "ContentModifiedById": {
        "type": "reference",
        "description": "ID of the user who modified the document.",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": true,
        "readOnly": true
      },
      "ContentModifiedDate": {
        "type": "dateTime",
        "description": "Date the document was modified. ContentModifiedDate updates when, for example, the document is renamed or a new document version is uploaded. When uploading the first version of a document, ContentModifiedDate can be set to the current time or any time in the past.",
        "format": "date-time",
        "nullable": true,
        "readOnly": true
      },
      "ContentSize": {
        "type": "int",
        "description": "Size of the document in bytes. Always zero for links.",
        "nullable": true,
        "readOnly": true
      },
      "ContentUrl": {
        "type": "url",
        "description": "URL for links. This is only set for links. One of the fields that determines the FileType. The character limit in API versions 33.0 and later is 1,300. The character limit in API versions 32.0 and earlier was 255.",
        "format": "uri",
        "maxLength": 1333,
        "nullable": true
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the content version.",
        "maxLength": 1000,
        "nullable": true
      },
      "Division": {
        "type": "picklist",
        "description": "A logical segment of your organization's data. For example, if your company is organized into different business units, you could create a division for each business unit, such as “North America,” “Healthcare,” or “Consulting.” Available only if the org has the Division permission enabled."
      },
      "ExternalDataSourceId": {
        "type": "reference",
        "description": "ID of the external document referenced in the ExternalDataSource object.",
        "format": "salesforce-id",
        "x-object": "ExternalDataSource",
        "maxLength": 18,
        "nullable": true
      },
      "ExternalDocumentInfo1": {
        "type": "string",
        "description": "Stores the URL of the file in the external content repository. The integration from the external source determines the content for this string. After the reference or copy is created, the URL of the external file is updated when you: Republish a file reference in Lightning Experience Open the document Create a file reference in the Connect REST API with reuseReference set to true. When the file is updated, the shared link is updated to the most current version.",
        "maxLength": 1000,
        "nullable": true
      },
      "ExternalDocumentInfo2": {
        "type": "string",
        "description": "Contains the external file ID. Salesforce determines the content for this string, which is private. The content can change without notice, depending on the external system. After the file reference is created, this field isn’t updated, even if the file path changes.",
        "maxLength": 1000,
        "nullable": true
      },
      "FeaturedContentBoost": {
        "type": "int",
        "description": "Read only. Designates a document as featured.",
        "nullable": true,
        "readOnly": true
      },
      "FeaturedContentDate": {
        "type": "date",
        "description": "Date the document was featured.",
        "format": "date",
        "nullable": true,
        "readOnly": true
      },
      "FileExtension": {
        "type": "string",
        "description": "File extension of the document. This field is available in API version 31.0 and later.",
        "maxLength": 40,
        "nullable": true,
        "readOnly": true
      },
      "FileType": {
        "type": "string",
        "description": "Type of content determined by ContentUrl for links or PathOnClient for documents.",
        "maxLength": 20,
        "nullable": false,
        "readOnly": true
      },
      "FirstPublishLocationId": {
        "type": "reference",
        "description": "ID of the location where the version was first published. If the version is first published into a user's personal library or My Files, the field will contain the ID of the user who owns the personal library or My Files. In Lightning Experience, if the first version is published into a public library, the field will contain the ID of that library. Accepts all record IDs supported by ContentDocumentLink (anything a file can be attached to, like records and groups). Setting FirstPublishLocationId allows you to create a file and share it with an initial record/group in a single transaction, and have the option to create more links to share the file with other records or groups later. When a file is created, it’s automatically linked to the record, and PublishStatus will change to Public from Pending/Personal. This field is only set the first time a version is published via the API. FirstPublishLocationId can’t be set to another ID when a new content version is inserted. Note Salesforce updates the FirstPublishLocationId updates automatically when a new OwnerId is added to the ContentVersion. For example, when you publish a new version with a different OwnerId than the current OwnerId, the FirstPublishLocationId of all previous versions updates to the previous OwnerId. The new published version sets the FirstPublishLocationId to the new OwnerId.",
        "format": "salesforce-id",
        "x-objects": [
          "AD2C_propagerAffaireDistributeur__c",
          "Account",
          "Account_Opportunity_Junction__c",
          "ActionPlan",
          "ActivationTarget",
          "ActivationTrgtIntOrgAccess",
          "ApiAnomalyEventStore",
          "AssessmentIndicatorDefinition",
          "AssessmentTask",
          "AssessmentTaskContentDocument",
          "AssessmentTaskDefinition",
          "AssessmentTaskIndDefinition",
          "AssessmentTaskOrder",
          "Asset",
          "AssetContactRole__c",
          "AssetRelationship",
          "AuthorizationFormText",
          "BatchJob",
          "BatchJobPart",
          "BatchJobPartFailedRecord",
          "BenefitManagementRecertification__c",
          "BusinessLicense",
          "Campaign",
          "CampainTestCase__c",
          "Case",
          "CollaborationGroup",
          "CommSubscription",
          "CommSubscriptionChannelType",
          "CommSubscriptionConsent",
          "CommSubscriptionTiming",
          "Contact",
          "ContentWorkspace",
          "Contract",
          "ContractLineItem",
          "ConversationEntry",
          "CredentialStuffingEventStore",
          "Dashboard",
          "DashboardComponent",
          "DataStream",
          "DocumentChecklistItem",
          "EmailMessage",
          "EmailTemplate",
          "EngagementChannelType",
          "EnhancedLetterhead",
          "Entitlement",
          "EntityMilestone",
          "Entity__c",
          "Event",
          "GlobalSettings__c",
          "INSEE__c",
          "Image",
          "In_App_Checklist_Settings__c",
          "IndividualApplication",
          "Knowledge__ka",
          "Knowledge__kav",
          "Lead",
          "LinkedArticle",
          "ListEmail",
          "Location",
          "LogEntryTag__c",
          "LogEntry__c",
          "Log__c",
          "LoggerScenario__c",
          "LoggerSettings__c",
          "LoggerTag__c",
          "MarketSegment",
          "MarketSegmentActivation",
          "MessagingSession",
          "NewObject__c",
          "Opportunity",
          "Order",
          "OrderItem",
          "OrgBypass__c",
          "Organization",
          "OutgoingEmail",
          "PartyConsent",
          "Product2",
          "ProductCatalog",
          "ProductCategory",
          "ProductFulfillmentLocation",
          "ProductRequest",
          "ProductRequestLineItem",
          "ProfileSkill",
          "ProfileSkillEndorsement",
          "ProfileSkillUser",
          "Quote",
          "RFC_Bouchon_V1_getPersonneById_contact__c",
          "RedirectionURLCinkevol__c",
          "ReferenceAffaire__c",
          "ReferenceQueue__c",
          "RegionalDirectorate__c",
          "Report",
          "ReportAnomalyEventStore",
          "ServiceContract",
          "ServicePoint__c",
          "SessionHijackingEventStore",
          "Site",
          "SocialPost",
          "Solution",
          "Task",
          "TaskTypeMapping__c",
          "TeamMember__c",
          "ThreatDetectionFeedback",
          "Topic",
          "User",
          "Visit",
          "VisitedParty",
          "Visitor",
          "WorkBadgeDefinition",
          "WorkOrder",
          "WorkOrderLineItem",
          "WorkPlan",
          "WorkPlanTemplate",
          "WorkPlanTemplateEntry",
          "WorkStep",
          "WorkStepTemplate",
          "WorkTypeGroup",
          "canalDeContact__c",
          "omnistudio__CardFrameworkConfiguration__c",
          "omnistudio__DRBatchQueue__c",
          "omnistudio__DRBulkData__c",
          "omnistudio__DREncryption__c",
          "omnistudio__DRWorker__c",
          "omnistudio__Interface_DRGeneric__c",
          "omnistudio__TestResult__c",
          "omnistudio__TriggerSetup__c",
          "omnistudio__UISettings__c",
          "omnistudio__VlocityDataPack__c",
          "omnistudio__VlocityDocuSignTemplate__c",
          "omnistudio__VlocityErrorLogEntry__c",
          "omnistudio__VlocityScheduledJob__c",
          "omnistudio__VlocityTrackingEntry__c"
        ],
        "maxLength": 18,
        "nullable": true,
        "readOnly": true
      },
      "IsAssetEnabled": {
        "type": "boolean",
        "description": "Can be specified on insert of ContentVersion to automatically convert a ContentDocument file into a ContentAsset. This field can be SOQL queried, but it can’t be edited. This field is available in API version 38.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsLatest": {
        "type": "boolean",
        "description": "Indicates whether this is the latest version of the document (true) or not (false).",
        "nullable": false,
        "readOnly": true
      },
      "IsMajorVersion": {
        "type": "boolean",
        "description": "true if the document is a major version; false if the document is a minor version. Major versions can’t be replaced.",
        "nullable": false,
        "readOnly": true
      },
      "Language": {
        "type": "picklist",
        "description": "The language for this document. This field defaults to the org’s default language unless the multi language setting is enabled. Specifies the language of the labels returned. The value must be a valid user locale (language and country), such as de_DE or en_GB. For more information on locales, see the Language field on the CategoryNodeLocalization object.",
        "format": "enum",
        "enum": [
          "en_US",
          "de",
          "es",
          "fr",
          "it",
          "ja",
          "sv",
          "ko",
          "zh_TW",
          "zh_CN",
          "pt_BR",
          "nl_NL",
          "da",
          "th",
          "fi",
          "ru",
          "es_MX",
          "no"
        ],
        "maxLength": 40,
        "nullable": true
      },
      "NegativeRatingCount": {
        "type": "int",
        "description": "Read only. The number of times different users have given the document a thumbs down.Rating counts for the latest version are not version-specific. If Version 1 receives 10 thumbs-down votes, and Version 2 receives 2 thumbs-down votes, the NegativeRatingCount on Version 2 is 12. However, rating counts are not retroactive for prior versions. The NegativeRatingCount on Version 1 is 10.",
        "nullable": true,
        "readOnly": true
      },
      "NetworkId": {
        "type": "reference",
        "description": "ID of the Experience Cloud site that this file originated from. This field is available in API version 26.0 and later, if digital experiences is enabled for your org.You can add a NetworkId only when creating a file. You can’t change or add a NetworkId for an existing file.",
        "format": "salesforce-id",
        "x-object": "Network",
        "maxLength": 18,
        "nullable": true,
        "readOnly": true
      },
      "Origin": {
        "type": "picklist",
        "description": "The source of the content version. Valid values are: C—Content document from the user's personal library. Label is Content. The FirstPublishLocationId must be the user's ID. If FirstPublishLocationId is left blank, it defaults to the user's ID. H—Salesforce file from the user's My Files. Label is Chatter. The FirstPublishLocationId must be the user's ID. If FirstPublishLocationId is left blank, it defaults to the user's ID. Origin can only be set to H if Chatter is enabled for your organization. This field defaults to C. Label is Content Origin.",
        "format": "enum",
        "enum": [
          "C",
          "H"
        ],
        "maxLength": 40,
        "nullable": false,
        "readOnly": true
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this document.",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false
      },
      "PathOnClient": {
        "type": "string",
        "description": "The complete path of the document. One of the fields that determines the FileType. Note Specify a complete path including the file extension in order for the document to be visible in the Preview tab.",
        "maxLength": 500,
        "nullable": true,
        "readOnly": true
      },
      "PositiveRatingCount": {
        "type": "int",
        "description": "Read only. The number of times different users have given the document a thumbs up.Rating counts for the latest version are not version-specific. If Version 1 receives 10 thumbs-up votes, and Version 2 receives 2 thumbs-up votes, the PositiveRatingCount on Version 2 is 12. However, rating counts are not retroactive for prior versions. The PositiveRatingCount on Version 1 is 10.",
        "nullable": true,
        "readOnly": true
      },
      "PublishStatus": {
        "type": "picklist",
        "description": "Indicates if and how the document is published. Valid values are: P—The document is published to a public library and is visible to other users. Label is Public. R—The document is published to a personal library and is not visible to other users. Label is Personal Library. U—The document is not published because publishing was interrupted. Label is Upload Interrupted.",
        "format": "enum",
        "enum": [
          "U",
          "P",
          "R"
        ],
        "maxLength": 40,
        "nullable": false,
        "readOnly": true
      },
      "RatingCount": {
        "type": "int",
        "description": "Read only. Total number of positive and negative ratings.",
        "nullable": true,
        "readOnly": true
      },
      "ReasonForChange": {
        "type": "string",
        "description": "The reason why the document was changed. This field can only be set when inserting a new version (revising) a document.",
        "maxLength": 1000,
        "nullable": true
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "ID of the record type of the version.Custom fields are restricted in RecordTypeId. When an administrator creates a custom field via the API it must be added to at least one page layout: If the custom field is added to the page layout associated with the General record type, the RecordTypeId that corresponds to that record type does not have to be set on the version record. If the custom field is added to the page layout associated with a custom record type, the RecordTypeId that corresponds to that record type must be set on the version record.",
        "format": "salesforce-id",
        "x-object": "RecordType",
        "maxLength": 18,
        "nullable": true
      },
      "SharingOption": {
        "type": "picklist",
        "description": "Controls whether sharing is frozen for a file. Only administrators and file owners with Collaborator access to the file can modify this field. Default is Allowed, which means that new shares are allowed. When set to Restricted, new shares are prevented without affecting existing shares.This field is available in API versions 35.0 and later.",
        "format": "enum",
        "enum": [
          "A",
          "R"
        ],
        "maxLength": 40,
        "nullable": false
      },
      "SharingPrivacy": {
        "type": "picklist",
        "description": "Controls sharing privacy for a file. Only administrators and file owners with Collaborator access to the file can modify this field. Default is Visible to Anyone With Record Access. When set to Private on Records, the file is private on records but can be shared selectively with others.This field is available in API versions 41.0 and later.",
        "format": "enum",
        "enum": [
          "N",
          "P"
        ],
        "maxLength": 40,
        "nullable": false
      },
      "TagCsv": {
        "type": "textarea",
        "description": "Text used to apply tags to a content version via the API.",
        "maxLength": 2000,
        "nullable": true
      },
      "TextPreview": {
        "type": "string",
        "description": "A preview of a document. Available in API version 35.0 and later.",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "Title": {
        "type": "string",
        "description": "The title of a document.",
        "maxLength": 255,
        "nullable": false
      },
      "VersionData": {
        "type": "base64",
        "description": "The content or body of the note, which can include properly formatted HTML or plain text. When a document is uploaded or downloaded via the API, it should be base64 encoded (for upload) or decoded (for download). Any special characters within plain text in the Content field must be escaped. You can escape special characters by calling content.escapeHtml4().",
        "format": "byte",
        "nullable": true
      },
      "VersionDataURL": {
        "type": "string",
        "description": "The URL used to fetch a file from the binary data endpoint. This field is only populated on direct queries to ContentVersion, and not when queried through a related entity’s foreign key to ContentVersion."
      },
      "VersionNumber": {
        "type": "string",
        "description": "The version number. The number increments with each version of the document, for example, 1, 2, 3.",
        "maxLength": 20,
        "nullable": true,
        "readOnly": true
      },
      "Id": {
        "type": "string",
        "description": "ContentVersion ID",
        "format": "salesforce-id",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "IsDeleted": {
        "type": "boolean",
        "nullable": false,
        "readOnly": true
      },
      "CreatedById": {
        "type": "string",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "CreatedDate": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "LastModifiedById": {
        "type": "string",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "LastModifiedDate": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "SystemModstamp": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "IsEncrypted": {
        "type": "boolean",
        "description": "Is Encrypted",
        "nullable": false,
        "readOnly": true
      },
      "CurrencyIsoCode": {
        "type": "string",
        "description": "CurrencyIsoCode field",
        "format": "enum",
        "enum": [
          "USD"
        ],
        "maxLength": 3,
        "nullable": false
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_contentversion.htm",
    "keyPrefix": "068",
    "iconUrl": "standard/file_120.png",
    "iconColor": "939393",
    "createable": true,
    "updateable": true,
    "deletable": false,
    "queryable": true,
    "searchable": true,
    "childRelationships": [
      {
        "childObject": "AIInsightValue",
        "field": "SobjectLookupValueId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "AIRecordInsight",
        "field": "TargetId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "AuthorizationFormConsent",
        "field": "DocumentVersionId",
        "relationshipName": "AuthorizationFormConsents",
        "cascadeDelete": false
      },
      {
        "childObject": "AuthorizationFormConsentChangeEvent",
        "field": "DocumentVersionId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ContentDistribution",
        "field": "ContentVersionId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "ContentDocument",
        "field": "LatestPublishedVersionId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ContentNote",
        "field": "LatestPublishedVersionId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ContentNotification",
        "field": "EntityIdentifierId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ContentVersionComment",
        "field": "ContentVersionId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "ContentVersionHistory",
        "field": "ContentVersionId",
        "relationshipName": "Histories",
        "cascadeDelete": true
      },
      {
        "childObject": "ContentVersionRating",
        "field": "ContentVersionId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "FeedAttachment",
        "field": "RecordId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "FeedComment",
        "field": "RelatedRecordId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "FeedItem",
        "field": "RelatedRecordId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "FlowExecutionErrorEvent",
        "field": "ContextRecordId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "FlowRecordRelation",
        "field": "RelatedRecordId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "NetworkActivityAudit",
        "field": "EntityId",
        "relationshipName": "AuditableEntities",
        "cascadeDelete": false
      },
      {
        "childObject": "OcrDocumentScanResult",
        "field": "ContentVersionId",
        "relationshipName": "ContentVersionOcrDocumentScanResults",
        "cascadeDelete": true
      },
      {
        "childObject": "QuoteDocument",
        "field": "ContentVersionDocumentId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "ServiceReport",
        "field": "ContentVersionDocumentId",
        "relationshipName": null,
        "cascadeDelete": false
      }
    ],
    "accessRules": "All users with a content feature license can create versions in their personal library. Customer and Partner Portal users must also supply the NetworkId of the Experience Cloud site in the request. By default, users (including users with the “View All Data” permission) can only query files they have access to, including: Salesforce Files in their personal library and in libraries they're a member of, regardless of library permissions (API version 17.0 and later). Salesforce Files they own, shared directly with them, posted on their profile, or posted on groups they can see (API version 21.0 and later). Enable the Query All Files permission to let your View All Data users bypass the restrictions on querying files. Query All Files returns all files, including files in non-member libraries and files in unlisted groups. Users can’t edit, upload new versions, or delete files they don’t have access to. View All Data permission is required to enable Query All Files. Salesforce Files in their personal library and in libraries they're a member of, regardless of library permissions (API version 17.0 and later). Salesforce Files they own, shared directly with them, posted on their profile, or posted on groups they can see (API version 21.0 and later). Query All Files returns all files, including files in non-member libraries and files in unlisted groups. Users can’t edit, upload new versions, or delete files they don’t have access to. View All Data permission is required to enable Query All Files. All users can update versions in their personal library. The owner of a version or document can update the document if they’re a member of the library, regardless of library permissions. To update a Salesforce CRM Content document, the user must be a member of the library with one of these library privileges enabled: Add Content Add Content On Behalf of Others Manage Library Add Content Add Content On Behalf of Others Manage Library Customer and Partner Portal users must have the View Content in Portal permission to query content in libraries where they have access. Customer and Partner Portal users can only publish, version, or edit documents if they have a Salesforce CRM Content feature license. FileType is defined by either ContentUrl for links or PathOnClient for documents, but not both. In API version 34.0 and later, any file can be shared with libraries, whether the file originated in Chatter or in Salesforce CRM Content. In API version 39.0 and later, custom Apex download handlers can be created that can control access to documents. See the Apex Developer Guide for more information.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}