{
  "ContactShare": {
    "name": "ContactShare",
    "description": "Represents a list of access levels to a Contact along with an explanation of the access level. For example, if you have access to a record because you own it, the ContactAccessLevel is All and RowCause is Owner.",
    "properties": {
      "ContactId": {
        "type": "reference",
        "description": "ID of the Contact associated with this sharing entry. This field can't be updated."
      },
      "ContactAccessLevel": {
        "type": "picklist",
        "description": "Level of access that the User or Group has to cases associated with the account Contact. The possible values are: Read Edit All This value is not valid for create or update. This field must be set to an access level that is higher than the organization’s default access level for contacts."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "RowCause": {
        "type": "picklist",
        "description": "Reason that this sharing entry exists. If you’re creating a sharing entry, the only permitted value is Manual. If no value is specified, the field defaults to Manual. All other RowCause values are read-only. After the sharing entry is created, this field can’t be edited. Valid values include: Rule—The User or Group has access via a Contact sharing rule. GuestRule—The User or Group has access via a Contact guest user sharing rule. ImplicitChild—The User or Group has access to the Contact via sharing access on the associated Account. After faster account sharing recalculation is enabled for your org, sharing entries with this value aren’t returned in queries. Instead of storing implicit child shares, record access is determined dynamically. ImplicitPerson—The User or Group has access to the business contact of a person account via access to the person account itself. GuestPersonImplicit—The guest user has access to the business contact of a person account via a Contact sharing rule. PortalImplicit—The Contact is associated with the portal user. LpuImplicit—The User has access to records owned by high-volume Experience Cloud site users via a share group. ARImplicit—The User, who belongs to a partner or customer account, has access to the Contact via an account relationship data sharing rule. Manual—The User or Group has access because a User with “All” access manually shared the Contact with them. Owner—The User is the owner of the Contact."
      },
      "UserOrGroupId": {
        "type": "reference",
        "description": "ID of the User or Group that has been given access to the Contact. This field can't be updated."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_contactshare.htm",
    "accessRules": "As of Summer ’20 and later, only users with access to the Contact object can access this object.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}