{
  "ContentDocumentHistory": {
    "name": "ContentDocumentHistory",
    "description": "Represents the history of a document.",
    "properties": {
      "ContentDocumentId": {
        "type": "reference",
        "description": "ID of the document."
      },
      "DataType": {
        "type": "picklist",
        "description": "Data type of the field that was changed."
      },
      "Division": {
        "type": "picklist",
        "description": "A logical segment of your organization's data. For example, if your company is organized into different business units, you could create a division for each business unit, such as “North America,” “Healthcare,” or “Consulting.” Available only if the organization has the Division permission enabled."
      },
      "Field": {
        "type": "picklist",
        "description": "The name of the field that was changed. Possible values include: contentDocPublished—The document is published into a library. contentDocUnpublished—The document is archived or removed from a library, either directly or when the owning library is changed. contentDocRepublished—The document is removed from the archive. contentDocFeatured—The document is featured. contentDocSubscribed—The document is subscribed to. contentDocUnsubscribed—The document is no longer subscribed to."
      },
      "NewValue": {
        "type": "anyType",
        "description": "The new value of the field that was changed."
      },
      "OldValue": {
        "type": "anyType",
        "description": "The latest value of the field before it was changed."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_contentdocumenthistory.htm",
    "accessRules": "Customer and Partner Portal users must have the “View Content in Portal” permission to query content in libraries where they have access. A user can query all versions of a document from their personal library and any version that is part of or shared with a library where they are a member, regardless of library permissions.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}