{
  "ContainerAsyncRequest": {
    "name": "ContainerAsyncRequest",
    "description": "Allows you to compile and asynchronously deploy a MetadataContainer object to your organization.",
    "properties": {
      "DeployDetails": {
        "type": "string",
        "description": "Provides detailed XML for any compile errors reported during an asynchronous request. Includes componentFailures. Replaces the JSON field CompilerErrors in Tooling API version 31.0 and later."
      },
      "ErrorMsg": {
        "type": "string",
        "description": "Errors reported during an asynchronous request."
      },
      "IsCheckOnly": {
        "type": "boolean",
        "description": "Indicates whether the asynchronous request compiles the code without making any changes to the organization (true) or compiles and saves the code (false).This field is required. Note You can compile without saving but you can’t save without compiling."
      },
      "IsRunTests": {
        "type": "boolean",
        "description": "Reserved for future use."
      },
      "MetadataContainerId": {
        "type": "string",
        "description": "The ID of a MetadataContainer object. Specify a MetadataContainerId or a MetadataContainerMemberId, but not both."
      },
      "MetadataContainerMemberId": {
        "type": "string",
        "description": "The ID of an ApexClassMember, ApexTriggerMember, ApexPageMember or ApexComponentMember object.Specify a MetadataContainerId or a MetadataContainerMemberId, but not both."
      },
      "State": {
        "type": "string",
        "description": "The state of the request. Valid values are: Queued—the job is in the queue. Invalidated—Salesforce canceled the job because the results might not be valid. This state occurs if someone changes the container members while IsCheckOnly=true, or if a newer compile request is added to the queue. Completed—the compilation or deployment finished. The SymbolTable fields for the specified object(s) were successfully updated. If IsCheckOnly is false, the Body for each object was saved and the MetadataContainerId field for each object was reset from the ID of the deployed MetadataContainer to the ID of the corresponding ContainerAsyncRequest object. Failed—the compilation or deployment failed for the reasons stated in the CompilerError field. Error—an unexpected error occurred. The messages in the ErrorMsg field can be provided to Salesforce support if the issue persists. Aborted—use this value to delete a queued deployment. This field is required."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_containerasyncrequest.htm",
    "accessRules": "As of the Spring '20 release, to access ContainerAsyncRequest you must have both the View All Data and Customize Application user permissions.",
    "clouds": [
      "Tooling API"
    ]
  }
}