{
  "ConvMessageSendRequest": {
    "name": "ConvMessageSendRequest",
    "description": "Represents a request to send a template-based messaging component to a series of messaging users in an enhanced messaging channel or Messaging for In-App.",
    "properties": {
      "AllowExistingSessionStatus": {
        "type": "picklist",
        "description": "Indicates whether the message can be sent only at certain times."
      },
      "CommSubscriptionId": {
        "type": "reference",
        "description": "The related communication subscription, if applicable. This field is a relationship field that refers to CommSubscription."
      },
      "CompletedDate": {
        "type": "dateTime",
        "description": "Date and time when the request is completed and all messages associated with the request are processed, meaning they were sent or failed to be sent."
      },
      "FailedMessageCount": {
        "type": "int",
        "description": "The number of messages that failed to be delivered to a messaging user. For example, if a flow sends the message to a series of 50 messaging users and 4 don’t receive the message, this value is 4."
      },
      "FailedMessageErrorReasons": {
        "type": "textarea",
        "description": "The error reason for each of the failed messages. For example, if 4 messages fail to send, this field shows the error reason for each failed message."
      },
      "FailedMessageIdentifiers": {
        "type": "textarea",
        "description": "The IDs of the messages that failed to send. For example, if 4 messages fail to send, this field shows 4 message IDs."
      },
      "InProgressMessageCount": {
        "type": "int",
        "description": "The number of messages in the process of being sent."
      },
      "InProgressMessageIdentifiers": {
        "type": "string",
        "description": "A list of IDs of the messages being sent."
      },
      "MessageDefinition": {
        "type": "string",
        "description": "The name of the messaging component being sent. Only active messaging components can be sent."
      },
      "Name": {
        "type": "string",
        "description": "An auto-generated ID for the request that uses the format MSJ-{00000000}."
      },
      "PendingMessageCount": {
        "type": "int",
        "description": "The number of messages that haven’t yet been sent."
      },
      "PendingMessageIdentifiers": {
        "type": "textarea",
        "description": "A list of IDs of the pending messages."
      },
      "RequestConsentType": {
        "type": "picklist",
        "description": "Indicates whether the flow applies the consent settings of the messaging end user or the communication subscription."
      },
      "RequestStatus": {
        "type": "picklist",
        "description": "The status of the request."
      },
      "RequestType": {
        "type": "picklist",
        "description": "The type of request."
      },
      "SessionLongevityPreference": {
        "type": "picklist",
        "description": "Indicates whether to end the session after the message is sent."
      },
      "ShouldEnforceChannelConsent": {
        "type": "boolean",
        "description": "Indicates whether the existing Messaging channel consent preferences are applied when determining who receives the message. Setting this value to true is the most common approach. The default value, false, allows you to add custom consent logic—for example, to customize a flow to send the message to both implicitly opted-in users and explicitly opted-in users."
      },
      "SuccessMessageCount": {
        "type": "int",
        "description": "The number of messages that were successfully sent to messaging users. Delivery may occur much later than sending, depending on factors such as the connectivity status of the recipient. Delivery is reflected in the messaging session transcript."
      },
      "SuccessMessageIdentifiers": {
        "type": "textarea",
        "description": "A list of IDs of the messages that were sent."
      },
      "TotalMessageCount": {
        "type": "int",
        "description": "The number of messages that the related flow attempted to send."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_convmessagesendrequest.htm",
    "clouds": [
      "Core Salesforce"
    ]
  }
}