{
  "CoverageBenefit": {
    "name": "CoverageBenefit",
    "description": "Represents the benefits provided to a covered member by a purchaser’s plan.",
    "properties": {
      "BenefitNotes": {
        "type": "textarea",
        "description": "Additional information about the benefits available to the member under this plan’s coverage."
      },
      "BenefitPeriodEndDate": {
        "type": "date",
        "description": "Last day of the coverage benefit period."
      },
      "BenefitPeriodStartDate": {
        "type": "date",
        "description": "First day of the coverage benefit period."
      },
      "CareBenefitVerifyRequestId": {
        "type": "reference",
        "description": "The care benefit verify request associated with the coverage benefit."
      },
      "CoinsuranceNotes": {
        "type": "textarea",
        "description": "Additional information about the contribution the member makes towards treatment."
      },
      "CopayNotes": {
        "type": "textarea",
        "description": "Additional information on the copayment amounts members contributes."
      },
      "CoverageType": {
        "type": "picklist",
        "description": "General category of service covered."
      },
      "DeductibleNotes": {
        "type": "textarea",
        "description": "Additional information about the member’s deductibles under this plan."
      },
      "Disclaimer": {
        "type": "string",
        "description": "Overall plan benefit disclaimers."
      },
      "EmergencyDepartmentCopay": {
        "type": "currency",
        "description": "The amount the member contributes towards emergency treatment."
      },
      "FamilyInNetworkDeductibleApplied": {
        "type": "currency",
        "description": "The amount the member has paid for health care provided by the health plan’s preferred providers for all family members."
      },
      "FamilyInNetworkDeductibleLimit": {
        "type": "currency",
        "description": "The amount the member is required to pay for health care provided by the health plan’s preferred providers for all family members. When this amount is reached, the plan starts to contribute towards treatment."
      },
      "FamilyInNetworkDeductibleRemaining": {
        "type": "currency",
        "description": "The remaining amount the member still has to pay for health care provided by the health plan’s preferred providers for all family members. When this amount is reached, the plan starts to contribute towards treatment."
      },
      "FamilyInNetworkOutofPocketApplied": {
        "type": "currency",
        "description": "The amount of the member has paid in this coverage year for health care provided by the health plan’s preferred providers for all family members. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "FamilyInNetworkOutofPocketLimit": {
        "type": "currency",
        "description": "The most the member pays during the coverage year for health care provided by the health plan’s preferred providers for all family members. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "FamilyInNetworkOutofPocketRemaining": {
        "type": "currency",
        "description": "The remaining amount for the member to pay during this coverage year for care provided by the plan’s preferred providers for all family members. When this amount is reached, the plan starts to contribute towards treatment. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "FamilyOutofNetworkDeductibleApplied": {
        "type": "currency",
        "description": "The amount the member has paid for health care provided by non-preferred providers for all family members."
      },
      "FamilyOutofNetworkDeductibleLimit": {
        "type": "currency",
        "description": "The total amount the member has to pay for health care provided by non-preferred providers for all family members. When this amount is reached, the plan starts to contribute towards treatment."
      },
      "FamilyOutofNetworkDeductibleRemaining": {
        "type": "currency",
        "description": "The amount the member still has to pay for health care provided by non-preferred providers for all family members. When this amount is reached, the plan starts to contribute towards treatment."
      },
      "FamilyOutofNetworkOutofPocketApplied": {
        "type": "currency",
        "description": "The amount of the member has paid in this coverage year for health care provided by non-preferred providers for all family members. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "FamilyOutofNetworkOutofPocketLimit": {
        "type": "currency",
        "description": "The most the member pays during the coverage year for health care provided by non-preferred providers for all family members. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "FamilyOutofNetworkOutofPocketRemaining": {
        "type": "currency",
        "description": "The remaining amount for the member to pay during this coverage period for health care provided by non-preferred providers for all family members. When this amount is reached, the plan starts to contribute towards treatment. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "FinalCoverageStatusCodeId": {
        "type": "reference",
        "description": "The code that's determined after considering the restrictions and other status types that apply to the coverage benefit."
      },
      "IndividualInNetworkDeductibleApplied": {
        "type": "currency",
        "description": "The amount the member has paid for health care provided by the health plan’s preferred providers to the most costly family member."
      },
      "IndividualInNetworkDeductibleLimit": {
        "type": "currency",
        "description": "The amount the member has to pay for health care provided by the plan’s preferred providers for any family member. When this amount is reached, the plan starts to contribute towards treatment."
      },
      "IndividualInNetworkDeductibleRemaining": {
        "type": "currency",
        "description": "The remaining amount the member has to pay for care during the coverage year provided by the plan’s preferred providers for any family member. When this amount is reached, the plan starts to contribute towards treatment."
      },
      "IndividualInNetworkOutofPocketApplied": {
        "type": "currency",
        "description": "The amount of the member has paid in this coverage year for health care provided by the plan’s preferred providers to any one family member. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "IndividualInNetworkOutofPocketLimit": {
        "type": "currency",
        "description": "The most the member pays during the coverage year for health care provided by the health plan’s preferred providers for any family member. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "IndividualInNetworkOutofPocketRemaining": {
        "type": "currency",
        "description": "The amount remaining for the member to pay during the coverage year for care provided by the plan’s preferred providers for any family member. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "IndividualOutofNetworkDeductibleApplied": {
        "type": "currency",
        "description": "The amount the member has paid for health care provided by non-preferred providers to the most costly family member."
      },
      "IndividualOutofNetworkDeductibleLimit": {
        "type": "currency",
        "description": "The amount the member has to pay for health care provided by non-preferred providers to any one family member. When this amount is reached, the plan starts to contribute towards treatment."
      },
      "IndividualOutofNetworkDeductibleRemain": {
        "type": "currency",
        "description": "The remaining amount the member has to pay for health care during the coverage year provided by non-preferred providers to any family member. When this amount is reached, the plan starts to contribute towards treatment."
      },
      "IndividualOutofNetworkOutofPocketApplied": {
        "type": "currency",
        "description": "The amount of the member has paid in this coverage period for health care provided by non-preferred providers to any family members. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "IndividualOutofNetworkOutofPocketLimit": {
        "type": "currency",
        "description": "The most the member pays during the coverage year for health care provided by non-preferred providers to any family member. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "IndividualOutofNetworkOutofPocketRemain": {
        "type": "currency",
        "description": "The amount remaining for the member to pay during the coverage year for health care provided by non-preferred providers to any family member. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "InNetworkCoinsuranceAmount": {
        "type": "currency",
        "description": "The amount the member contributes towards treatment undertaken by the health plan’s preferred providers."
      },
      "InNetworkCoinsurancePercentage": {
        "type": "percent",
        "description": "The percentage of treatment cost the member pays for treatment undertaken by the health plan’s preferred providers."
      },
      "InNetworkLifetimeMaximum": {
        "type": "currency",
        "description": "The amount the member has to pay during lifetime coverage under this plan after which the provider covers all costs for treatment provided by its preferred providers. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Specifies whether the coverage benefit is currently in force."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "LifetimeMaximumNotes": {
        "type": "textarea",
        "description": "Additional information on the lifetime maximum payments the member Will be expected to make."
      },
      "MemberId": {
        "type": "reference",
        "description": "The ID of the member receiving these benefits."
      },
      "MemberPlanId": {
        "type": "reference",
        "description": "The ID of the member plan receiving these benefits."
      },
      "Name": {
        "type": "string",
        "description": "Name of these coverage benefits."
      },
      "OutcomeStatusCodeId": {
        "type": "reference",
        "description": "The outcome code set associated with the coverage benefit."
      },
      "OutofNetworkCoinsuranceAmount": {
        "type": "currency",
        "description": "The amount the member contributes towards treatment undertaken by non-preferred providers."
      },
      "OutofNetworkCoinsurancPercentage": {
        "type": "percent",
        "description": "The percentage of treatment cost the member pays for treatment undertaken by non-preferred providers."
      },
      "OutofNetworkLifetimeMaximum": {
        "type": "currency",
        "description": "The amount the member has to pay during lifetime coverage under this plan after which the plan provider covers all costs for treatment provided by its non-preferred providers. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "OutofPocketNotes": {
        "type": "textarea",
        "description": "Additional information about the out-of-pocket payment the member makes."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PharmaCopayAmount": {
        "type": "currency",
        "description": "The amount the member contributes towards the pharma products."
      },
      "": {
        "type": "",
        "description": ""
      },
      "PrimaryCareCopay": {
        "type": "currency",
        "description": "The amount the member contributes towards primary care treatment."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the system this benefits record was obtained from."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of this benefits record on its source system."
      },
      "SourceSystemModified": {
        "type": "date",
        "description": "The date on which these benefits were last changed on their source system."
      },
      "SpecialistCopay": {
        "type": "currency",
        "description": "The amount the member contributes towards specialist consultations."
      },
      "StatusCodeId": {
        "type": "reference",
        "description": "The status code set associated with the coverage benefit."
      },
      "UrgentCareCopay": {
        "type": "currency",
        "description": "The amount the member contributes towards urgent care."
      },
      "VerificationDate": {
        "type": "dateTime",
        "description": "Date on which the benefit was verified."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/sforce_api_objects_coveragebenefit.htm",
    "clouds": [
      "Health Cloud"
    ]
  }
}