{
  "CrbnCreditDistribution": {
    "name": "CrbnCreditDistribution",
    "description": "Represents a junction between the sustainability credit and carbon credit allocation objects. To offset emissions for carbon credit allocation items, specify the emissions activity on this junction object.",
    "properties": {
      "CrbnCrAllocDate": {
        "type": "date",
        "description": "The date when the carbon credit was allocated."
      },
      "CrbnCreditAllocId": {
        "type": "reference",
        "description": "The carbon credit allocation record that's associated with the carbon credits distribution."
      },
      "EmissionsActivityId": {
        "type": "reference",
        "description": "The emissions activity that's specified to offset emissions at carbon credit allocation items level."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the carbon credit allocation."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "SustainabilityCreditId": {
        "type": "reference",
        "description": "The sustainability credit record that's associated with the carbon credits distribution."
      },
      "TotalCrbnCrAllocCost": {
        "type": "currency",
        "description": "The total cost of the carbon credits that were allocated for all the emissions activities."
      },
      "TotalCrbnCrAllocInTco2e": {
        "type": "double",
        "description": "The total carbon credits that were allocated for all the emissions activities."
      }
    },
    "module": "Net Zero Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.netzero_cloud_dev_guide.meta/netzero_cloud_dev_guide/sforce_api_objects_crbncreditdistribution.htm"
  }
}