{
  "CreateAssetOrderDtlEvent": {
    "name": "CreateAssetOrderDtlEvent",
    "description": "Contains information about an attempt to create or update an asset as a result of /actions/standard/createOrUpdateAssetFromOrder. If the request was successful, the event shows information about the asset. If the request failed, the event shows error information.",
    "properties": {
      "AssetId": {
        "type": "reference",
        "description": "The ID of the asset that was created or updated."
      },
      "ErrorCode": {
        "type": "string",
        "description": "Reference code for the type of error that occurred."
      },
      "ErrorMessage": {
        "type": "string",
        "description": "Information about the error that occurred after the request was made."
      },
      "EventUuid": {
        "type": "string",
        "description": "A universally unique identifier (UUID) that identifies a platform event message."
      },
      "IsSuccess": {
        "type": "boolean",
        "description": "Indicates whether the request to create the asset for the order item was successful (true) or not (false)."
      },
      "OrderItemId": {
        "type": "reference",
        "description": "The ID of the order item used in the request. Available in API version 61.0 and later."
      },
      "ReplayId": {
        "type": "string",
        "description": "Represents an ID value that is populated by the system and refers to the position of the event in the event stream. Replay ID values aren’t guaranteed to be contiguous for consecutive events. A subscriber can store a replay ID value and use it on resubscription to retrieve missed events that are within the retention window."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_createassetorderdtlevent.htm",
    "accessRules": "This object is available if Subscription Management is installed in your org. Users must have Read access on this event to receive or view event notifications.",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}