{
  "CreditMemoLineInvoiceLine": {
    "name": "CreditMemoLineInvoiceLine",
    "description": "Represents a junction between a credit memo line and an invoice line.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "Required. The amount that's been applied to or unapplied from the invoice line."
      },
      "AppliedDateTime": {
        "type": "dateTime",
        "description": "The date and time when the credit memo line was applied to the invoice line."
      },
      "CreditMemoLineBalance": {
        "type": "currency",
        "description": "The balance of the credit memo line after it's applied to or unapplied from the invoice line."
      },
      "CreditMemoLineId": {
        "type": "reference",
        "description": "Required. The ID of the credit memo line record that's applied to or unapplied from the invoice line."
      },
      "CreditMemoLineInvoiceLineNumber": {
        "type": "string",
        "description": "Required. An auto-generated number identifying the credit memo line invoice line."
      },
      "Description": {
        "type": "textarea",
        "description": "Additional details about the credit memo line invoice line."
      },
      "EffectiveDateTime": {
        "type": "dateTime",
        "description": "The date and time when the credit memo line's application to or unapplication from the invoice line becomes effective."
      },
      "ImpactAmount": {
        "type": "currency",
        "description": "The credit memo line invoice line’s financial impact against the customer’s accounts receivable. If the credit memo line invoice line's type is Applied, the impact amount is the negative equivalent of the credit memo line invoice line's amount. Otherwise, the impact amount is equal to the credit memo line invoice line's amount."
      },
      "InvoiceLineBalance": {
        "type": "currency",
        "description": "The balance of the invoice line after the credit memo line was applied or unapplied."
      },
      "InvoiceLineId": {
        "type": "reference",
        "description": "Required. The ID of the invoice line record to which the credit memo line has been applied or unapplied."
      },
      "LegalEntityAccountingPeriodId": {
        "type": "reference",
        "description": "The ID of the legal entity accounting period record related to the credit memo line invoice line."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "The ID of the legal entity record related to the credit memo line invoice line."
      },
      "RelatedCrMemoLineInvcLineId": {
        "type": "reference",
        "description": "The ID of the related credit memo line invoice line record of the type Applied when the credit memo line invoice line's type is Unapplied."
      },
      "Type": {
        "type": "picklist",
        "description": "Required. Specifies whether the credit memo line has been applied to or unapplied from the invoice line."
      },
      "UnappliedDateTime": {
        "type": "dateTime",
        "description": "The date and time when the credit memo line was unapplied from the invoice line."
      },
      "UnappliedStatus": {
        "type": "picklist",
        "description": "Required. Specifies whether the credit memo line has been unapplied from the invoice line."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_creditmemolineinvoiceline.htm"
  }
}