{
  "CustomFulfillmentScopeCnfg": {
    "name": "CustomFulfillmentScopeCnfg",
    "description": "Represents a user-defined scope to define and customize scope-specific validation and orchestration for flexible fulfillment.",
    "properties": {
      "AssetContextTag": {
        "type": "string",
        "description": "Context tag that's used to derive custom scope value from assets. This field is available in API version 65.0 and later."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Required. Name of the custom fulfillment scope."
      },
      "DoesParticipatingAssetImpact": {
        "type": "boolean",
        "description": "Required. Indicates whether the technical assets related to sales transactions impact the fulfillment line item actions (true) or not (false). If set to true, Dynamic Revenue Orchestrator reuses the existing technical assets with the same custom value."
      },
      "FallbackScope": {
        "type": "picklist",
        "description": "Scope that's used when custom scope can't be determined."
      },
      "IsAssetized": {
        "type": "boolean",
        "description": "Indicates whether the fulfillment line items grouped by the custom scope are assetized true or not (false). If set to false, then the scope can't be associated with assetizable products."
      },
      "ItemContextTag": {
        "type": "string",
        "description": "Required. Context tag that's used to derive custom scope from item context nodes. The supported value is of string type only."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the CustomFulfillmentScopeCnfg tooling API object."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label of the custom fulfillment scope."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix associated with this object. Each Developer Edition organization that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values: In Developer Edition organizations, the namespace prefix is set to the namespace prefix of the organization for all objects that support it. There is an exception if an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition organization of the package developer. In organizations that are not Developer Edition organizations, NamespacePrefix is only set for objects that are part of an installed managed package. There is no namespace prefix for all other objects."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/tooling_api_objects_customfulfillmentscopecnfg.htm"
  }
}