{
  "CustomObject": {
    "name": "CustomObject",
    "description": "Represents a custom object that stores data unique to your organization. Includes access to the associated CustomObject object and related fields in Salesforce Metadata API.",
    "properties": {
      "CustomHelpId": {
        "type": "string",
        "description": "The control that contains the help content if this custom object has customized help content."
      },
      "Description": {
        "type": "string",
        "description": "The object’s description. This can be useful to describe the reason for creating the object or its intended use."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The developer’s internal name for the custom object. For example, the internal name for the custom object CO__c is CO."
      },
      "ExternalName": {
        "type": "string",
        "description": "Maps to a table in the external data source. If you created the external object using Validate and Sync for the data source, this name is automatically created."
      },
      "ExternalRepository": {
        "type": "string",
        "description": "Maps to a table in the external data source. If you created the external object using Validate and Sync for the data source, this name is automatically created; do not modify it."
      },
      "Language": {
        "type": "string",
        "description": "The language of the action. Valid values are: Chinese (Simplified): zh_CN Chinese (Traditional): zh_TW Danish: da Dutch: nl_NL English: en_US Finnish: fi French: fr German: de Italian: it Japanese: ja Korean: ko Norwegian: no Portuguese (Brazil): pt_BR Russian: ru Spanish: es Spanish (Mexico): es_MX Spanish (Mexico) defaults to Spanish for customer-defined translations. Swedish: sv Thai: th The Salesforce user interface is fully translated to Thai, but Help is in English."
      },
      "ManageableState": {
        "type": "string",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace of the package of which the custom object is a part."
      },
      "SharingModel": {
        "type": "string",
        "description": "The sharing model. Values are: Edit ControlledByparent None Read"
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_customobject.htm",
    "clouds": [
      "Tooling API"
    ]
  }
}