{
  "UserProvAccountStaging": {
    "name": "UserProvAccountStaging",
    "description": "Temporarily stores user account information while a user completes the User Provisioning Wizard. This information that is stored in the UserProvAccount object when you click the button to collect and analyze accounts on the target system.",
    "properties": {
      "ConnectedAppId": {
        "type": "reference",
        "description": "The 15 character connected app ID."
      },
      "ExternalEmail": {
        "type": "string",
        "description": "The email address as stored in the target system for the associated user account."
      },
      "ExternalFirstName": {
        "type": "string",
        "description": "The first name as stored in the target system for the associated user account."
      },
      "ExternalLastName": {
        "type": "string",
        "description": "The last name as stored in the target system for the associated user account."
      },
      "ExternalUserId": {
        "type": "string",
        "description": "The unique identifier for the user as stored in the target system."
      },
      "ExternalUsername": {
        "type": "string",
        "description": "The username as stored in the target system for the associated user account."
      },
      "LinkState": {
        "type": "picklist",
        "description": "The state of the current connection between the user account in the Salesforce organization and the associated user account in the target system. The valid values are: linked— a user account matches one in the target system. duplicate— an associated account in the target system exists. orphaned—no associated account exists in the target system. ignored— changes to the account in the Salesforce organization have no effect on the associated user account in the target system."
      },
      "Name": {
        "type": "string",
        "description": "The unique name for this object."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The user ID of the owner of this object—typically a Salesforce administrator."
      },
      "SalesforceUserId": {
        "type": "reference",
        "description": "The user ID for the user account in the Salesforce organization that is associated with the user account in the target system."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the account in the target system. The valid values are: Active Deactivated Deleted"
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_userprovaccountstaging.htm"
  }
}