{
  "UserRole": {
    "name": "UserRole",
    "description": "Represents a user role in your organization.",
    "properties": {
      "CaseAccessForAccountOwner": {
        "type": "picklist",
        "description": "The case access level for the account owner."
      },
      "ContactAccessForAccountOwner": {
        "type": "picklist",
        "description": "The contact access level for the account owner. Note When DefaultContactAccess is set to Controlled by Parent, you can’t create or update this field."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Corresponds to Role Name in the user interface. This field is available in API version 24.0 and later. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "ForecastUserId": {
        "type": "reference",
        "description": "The ID of the forecast manager associated with this role. Label is User ID."
      },
      "IsPartner": {
        "type": "boolean",
        "description": "Indicates whether the user role is a partner who has access to the partner portal (true) or not (false). This field is not available for release 9.0 and later. Instead, use PortalType with the value Partner."
      },
      "MayForecastManagerShare": {
        "type": "boolean",
        "description": "Indicates whether the forecast manager can manually share their own forecast."
      },
      "Name": {
        "type": "string",
        "description": "Required. Name of the role. Corresponds to Label on the user interface."
      },
      "OpportunityAccessForAccountOwner": {
        "type": "picklist",
        "description": "Required. The opportunity access level for the account owner. Note that you can’t set a user role with an opportunity access less than that specified in organization-wide defaults."
      },
      "ParentRoleId": {
        "type": "reference",
        "description": "The ID of the parent role."
      },
      "PortalAccountId": {
        "type": "reference",
        "description": "The ID of the role’s associated portal account. This field is read-only."
      },
      "PortalAccountOwnerId": {
        "type": "reference",
        "description": "The ID of the role’s associated portal account’s owner. This field is read-only."
      },
      "PortalRole": {
        "type": "picklist",
        "description": "The portal role: Executive, Manager, User, or PersonAccount."
      },
      "PortalType": {
        "type": "picklist",
        "description": "This value indicates the type of portal for the role: None: Salesforce application role. CustomerPortal: Customer portal role. Partner: partner portal role. The field IsPartner used in release 8.0 will map to this value. This field replaces IsPartner beginning with release 9.0."
      },
      "RollupDescription": {
        "type": "string",
        "description": "Description of the forecast rollup. Label is Description."
      }
    },
    "module": "Core Salesforce"
  }
}