{
  "UserCriteria": {
    "name": "UserCriteria",
    "description": "",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the user criteria."
      },
      "Developer Name": {
        "type": "string",
        "description": "API name of the developer. This name can contain only underscores and alphanumeric characters and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated metadata object in Metadata API. Query this field only if the query result contains no more than one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the moderation rule. Valid values are: Chinese (Simplified): zh_CN Chinese (Traditional): zh_TW Danish: da Dutch: nl_NL English: en_US Finnish: fi French: fr German: de Italian: it Japanese: ja Korean: ko Norwegian: no Portuguese (Brazil): pt_BR Russian: ru Spanish: es Spanish (Mexico): es_MX Spanish (Mexico) defaults to Spanish for customer-defined translations. Swedish: sv Thai: th The Salesforce user interface is fully translated to Thai, but Help is in English."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label for the user criteria."
      },
      "Metadata": {
        "type": "mns:UserCriteria",
        "description": "The user criteria metadata. Query this field only if the query result contains no more than one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_usercriteria.htm"
  }
}