{
  "UserServicePresence": {
    "name": "UserServicePresence",
    "description": "Represents a presence user’s real-time presence status.",
    "properties": {
      "AtCapacityDuration": {
        "type": "int",
        "description": "The duration that the user is at full capacity. This field is updated when the agent’s capacity changes, such as when the agent is assigned, declines, or closes a work item. Available in API versions 34.0 and later."
      },
      "AverageCapacity": {
        "type": "double",
        "description": "The user’s average capacity. This field is updated when the agent’s capacity changes, such as when the agent is assigned, declines, or closes a work item. Available in API versions 34.0 and later."
      },
      "ConfiguredCapacity": {
        "type": "int",
        "description": "The user’s total configured primary capacity."
      },
      "ConfiguredInterruptCapacity": {
        "type": "int",
        "description": "The user’s total configured interruptible capacity. Available in version 57.0 and later when the Interruptible Capacity feature is enabled."
      },
      "": {
        "type": "",
        "description": ""
      },
      "IdleDuration": {
        "type": "int",
        "description": "The duration that the user is idle. This field is updated when the agent’s capacity changes, such as when the agent is assigned, declines, or closes a work item. Available in API versions 34.0 and later."
      },
      "IsAway": {
        "type": "boolean",
        "description": "Indicates whether the user’s status is Away."
      },
      "IsCurrentState": {
        "type": "boolean",
        "description": "Indicates whether a presence status is the user’s current state. If true, the agent is in that presence status. Available in API versions 34.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "An automatically generated ID number that identifies the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the owner of the UserServicePresence entity. For external routing, allows the entity to be used in the Streaming API to listen to events whenever a UserServicePresence record is created, modified, or deleted."
      },
      "ServicePresenceStatusId": {
        "type": "reference",
        "description": "The ID of the presence status that’s associated with the presence user that’s specified by the UserId."
      },
      "StatusDuration": {
        "type": "int",
        "description": "The duration of the user service presence status. This field is set only when the current user service presence status ends, such as when the agent changes to another presence status or logs out. Available in API versions 34.0 and later."
      },
      "StatusEndDate": {
        "type": "dateTime",
        "description": "The end date of the user service presence status. This field is set only when the current user service presence status ends, such as when the agent changes to another presence status or logs out. Available in API versions 34.0 and later."
      },
      "StatusStartDate": {
        "type": "dateTime",
        "description": "The start date of the user service presence status. Available in API versions 34.0 and later."
      },
      "UserId": {
        "type": "string",
        "description": "The ID of the Omni-Channel user."
      }
    },
    "module": "Core Salesforce"
  }
}