{
  "User": {
    "name": "User",
    "description": "Standard and custom fields extend the standard User object for use in Consumer Goods Cloud to represent a user in your company.",
    "properties": {
      "AboutMe": {
        "type": "textarea",
        "description": "Information about the user, such as areas of interest or skills. This field is available even if Chatter is disabled."
      },
      "AccountId": {
        "type": "reference",
        "description": "ID of the Account associated with a Customer Portal user."
      },
      "Address": {
        "type": "address",
        "description": "Read-only. Compound form of the address. See Address Compound Fields for details on compound address fields."
      },
      "Alias": {
        "type": "string",
        "description": "Required. User’s alias. For example, jsmith."
      },
      "BadgeText": {
        "type": "string",
        "description": "Experience Cloud site role shown on the user profile page."
      },
      "BannerPhotoUrl": {
        "type": "url",
        "description": "URL for the user's banner photo."
      },
      "CallCenterId": {
        "type": "reference",
        "description": "If Salesforce CRM Call Center is enabled, represents the call center that the user is assigned to."
      },
      "City": {
        "type": "string",
        "description": "City associated with the user. Can have up to 40 characters."
      },
      "CommunityNickname": {
        "type": "string",
        "description": "Name used to identify the user in the Experience Cloud site."
      },
      "CompanyName": {
        "type": "string",
        "description": "Name of the user’s company."
      },
      "ContactId": {
        "type": "reference",
        "description": "ID of the Contact associated with this account. The Contact must have a value in the AccountId field, or an error occurs."
      },
      "Country": {
        "type": "string",
        "description": "Country associated with the user. Can have up to 80 characters."
      },
      "DefaultGroupNotificationFrequency": {
        "type": "picklist",
        "description": "Required. The default frequency for sending the user's Chatter group email notifications when the user joins groups:"
      },
      "DelegatedApproverId": {
        "type": "reference",
        "description": "ID of the user who’s a delegated approver for this user."
      },
      "Department": {
        "type": "string",
        "description": "Company department associated with the user."
      },
      "DigestFrequency": {
        "type": "picklist",
        "description": "Required. Send frequency of the user’s Chatter personal email digest:"
      },
      "Division": {
        "type": "string",
        "description": "Division associated with this user, similar to Department, and unrelated to DefaultDivision."
      },
      "Email": {
        "type": "email",
        "description": "Required. User’s email address."
      },
      "EmailEncodingKey": {
        "type": "picklist",
        "description": "Required. Email encoding for the user:"
      },
      "EmailPreferencesAutoBcc": {
        "type": "boolean",
        "description": "Determines whether the user receives copies of sent emails. This option applies only if compliance BCC emails aren’t enabled."
      },
      "EmployeeNumber": {
        "type": "string",
        "description": "User’s employee number."
      },
      "Extension": {
        "type": "phone",
        "description": "User’s phone extension number."
      },
      "Fax": {
        "type": "phone",
        "description": "User’s fax number."
      },
      "FederationIdentifier": {
        "type": "string",
        "description": "Indicates the value that must be listed in the Subject element of a Security Assertion Markup Language (SAML) IDP certificate to authenticate the user for a client application using single sign-on. This value must be specified if the SAML User ID Type is Assertion contains Federation ID from the User record. Otherwise, this field can’t be edited."
      },
      "FirstName": {
        "type": "string",
        "description": "User’s first name."
      },
      "ForecastEnabled": {
        "type": "boolean",
        "description": "Indicates whether the user is enabled as a forecast manager (true) or not (false). Forecast managers see forecast rollups from users below them in the forecast hierarchy."
      },
      "FullPhotoUrl": {
        "type": "url",
        "description": "URL for the user's profile photo. This field is available even if Chatter is disabled. The URL is updated every time a photo is uploaded and reflects the most recent photo. If a newer photo is uploaded, the URL returned for an older photo isn’t guaranteed to return a photo. Query this field for the URL of the most recent photo."
      },
      "GeocodeAccuracy": {
        "type": "picklist",
        "description": "The level of accuracy of a location’s geographical coordinates compared with its physical address. A geocoding service typically provides this value based on the address’s latitude and longitude coordinates."
      },
      "IndividualId": {
        "type": "reference",
        "description": "ID of the data privacy record associated with this user. This field is available if Data Protection and Privacy is enabled."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the user has access to log in (true) or not (false). You can modify a user's active status from the user interface or via the API."
      },
      "IsProfilePhotoActive": {
        "type": "boolean",
        "description": "Indicates whether a user has a profile photo (true) or not (false)."
      },
      "JigsawImportLimitOverride": {
        "type": "int",
        "description": "Data.com users’ monthly addition limit. The value must be between zero and the organization’s monthly addition limit."
      },
      "LanguageLocaleKey": {
        "type": "picklist",
        "description": "Required. User’s language."
      },
      "LastLoginDate": {
        "type": "dateTime",
        "description": "Date and time when the user last logged in successfully. This value is updated if 60 seconds elapses after the user’s last login."
      },
      "LastName": {
        "type": "string",
        "description": "Required. User’s last name."
      },
      "LastPasswordChangeDate": {
        "type": "dateTime",
        "description": "Date when the last password changed or reset."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Timestamp of when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Timestamp of when the current user last viewed this record. If this value is null, this record was probably referenced (LastReferencedDate) but not viewed."
      },
      "Latitude": {
        "type": "double",
        "description": "Used with Longitude to specify the geolocation of an address. Acceptable values are numbers between –90 and 90, up to 15 decimal places. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "LocaleSidKey": {
        "type": "picklist",
        "description": "Required. Restricted picklist field whose values are named based on the language and the country, if necessary, using two-letter ISO codes:"
      },
      "Longitude": {
        "type": "double",
        "description": "Used with Latitude to specify the geolocation of an address. Acceptable values are numbers between –180 and 180, up to 15 decimal places. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "ManagerId": {
        "type": "reference",
        "description": "The ID of the user who manages this user."
      },
      "MediumBannerPhotoUrl": {
        "type": "url",
        "description": "The URL for the medium-sized user profile banner photo."
      },
      "MediumPhotoUrl": {
        "type": "url",
        "description": "Url for medium profile photo"
      },
      "MobilePhone": {
        "type": "phone",
        "description": "The user’s mobile device number."
      },
      "Name": {
        "type": "string",
        "description": "Concatenation of FirstName and LastName. Limited to 203 characters, including whitespaces."
      },
      "NumberOfFailedLogins": {
        "type": "int",
        "description": "The number of failed login attempts for the user’s account. When the maximum number of failed login attempts is reached, the counter resets and the user’s account is locked. If there’s a successful login before the maximum number of failed login attempts is reached, the counter resets and the user’s account remains unlocked."
      },
      "OfflinePdaTrialExpirationDate": {
        "type": "dateTime",
        "description": "The date and time when the Sales Anywhere trial expires."
      },
      "OfflineTrialExpirationDate": {
        "type": "dateTime",
        "description": "The date and time when the user’s Connect Offline trial expires."
      },
      "OutOfOfficeMessage": {
        "type": "string",
        "description": "Out of office message"
      },
      "Phone": {
        "type": "phone",
        "description": "The user’s phone number."
      },
      "PostalCode": {
        "type": "string",
        "description": "The user’s postal or ZIP code."
      },
      "ProfileId": {
        "type": "reference",
        "description": "Required. ID of the user’s Profile. Use this value to cache metadata based on profile. In earlier releases, this was RoleId."
      },
      "ReceivesAdminInfoEmails": {
        "type": "boolean",
        "description": "Indicates whether the user receives email for administrators from Salesforce (true) or not (false)."
      },
      "ReceivesInfoEmails": {
        "type": "boolean",
        "description": "Indicates whether the user receives informational email from Salesforce true) or not (false)."
      },
      "SenderEmail": {
        "type": "email",
        "description": "The email address used as the From address when the user sends emails. This address is the same value shown in Setup on the My Email Settings page."
      },
      "SenderName": {
        "type": "string",
        "description": "The name used as the email sender when the user sends emails. This name is the same value shown in Setup on the My Email Settings page."
      },
      "Signature": {
        "type": "textarea",
        "description": "The signature text added to emails. This text is the same value shown in Setup on the My Email Settings page."
      },
      "SmallBannerPhotoUrl": {
        "type": "url",
        "description": "The URL for the small user profile banner photo."
      },
      "SmallPhotoUrl": {
        "type": "url",
        "description": "The URL for a thumbnail of the user's profile photo. This field is available even if Chatter is disabled."
      },
      "State": {
        "type": "string",
        "description": "The state associated with the User. Up to 80 characters allowed."
      },
      "StayInTouchNote": {
        "type": "string",
        "description": "Stay-in-Touch email note."
      },
      "StayInTouchSignature": {
        "type": "textarea",
        "description": "Stay-in-Touch email signature."
      },
      "StayInTouchSubject": {
        "type": "string",
        "description": "Stay-in-Touch email subject."
      },
      "Street": {
        "type": "textarea",
        "description": "The street address associated with the user."
      },
      "TimeZoneSidKey": {
        "type": "picklist",
        "description": "Required. This field is a restricted picklist field. A User time zone affects the offset used when displaying or entering times in the user interface. But the API doesn’t use a User time zone when querying or setting values."
      },
      "Title": {
        "type": "string",
        "description": "User’s business title. For example, Vice President."
      },
      "UserRoleId": {
        "type": "reference",
        "description": "ID of the user’s UserRole."
      },
      "UserType": {
        "type": "picklist",
        "description": "Type of user who can access the record:"
      },
      "Username": {
        "type": "string",
        "description": "Name of the user."
      },
      "cgcloud__Language_Postfix__c": {
        "type": "string",
        "description": "You can define up to 4 languages per sales org."
      },
      "cgcloud__Mobility_Sales_Org__c": {
        "type": "picklist",
        "description": "Mobility Sales org of the users mobile app:"
      },
      "cgcloud__Sales_Org__c": {
        "type": "picklist",
        "description": "Sales org of the template:"
      }
    },
    "module": "Consumer Goods Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.retail_api.meta/retail_api/sforce_api_objects_user.htm"
  }
}