{
  "UserEntityAccess": {
    "name": "UserEntityAccess",
    "description": "",
    "properties": {
      "DurableId": {
        "type": "string",
        "description": "Unique identifier for the field. Always retrieve this value before using it, as the value isn’t guaranteed to stay the same from one release to the next. To simplify queries, use this field."
      },
      "EntityDefinition": {
        "type": "EntityDefinition",
        "description": "The entity definition for the object associated with this user entity access record. Because this field represents a relationship, use only in subqueries."
      },
      "EntityDefinitionId": {
        "type": "string",
        "description": "ID of the EntityDefinition."
      },
      "IsActivateable": {
        "type": "boolean",
        "description": "If true, the user specified in the User field has access to activate records of the associated object type if the User owns them. For example, a user owns an Apex trigger or workflow rule, and can activate them if this field is true for ApexTrigger or WorkflowRule."
      },
      "IsCreatable": {
        "type": "boolean",
        "description": "If true, the user specified in the User field has access to create records of the associated object type."
      },
      "IsDeletable": {
        "type": "boolean",
        "description": "If true, the user specified in the User field has access to delete records of the associated object type."
      },
      "IsEditable": {
        "type": "boolean",
        "description": "If true, the user specified in the User field has access to edit records of the associated object type."
      },
      "IsFlsUpdatable": {
        "type": "boolean",
        "description": "If true, the user specified in the User field has access to change field-level security settings on appropriate fields of the associated object type. For example, an administrator could deny a group of users access to the Type field on Account."
      },
      "IsMergeable": {
        "type": "boolean",
        "description": "If true, the user specified in the User field has access to merge records of the associated object type."
      },
      "IsReadable": {
        "type": "boolean",
        "description": "If true, the user specified in the User field has access to view records of the associated object type."
      },
      "IsUndeletable": {
        "type": "boolean",
        "description": "If true, the user specified in the User field has access to undelete records of the associated object type."
      },
      "IsUpdatable": {
        "type": "boolean",
        "description": "If true, the user specified in the User field has access to edit records of the associated object type."
      },
      "User": {
        "type": "User",
        "description": "The user who has the access defined in this user entity access record, for the entity specified in the EntityDefinition field. Because this field represents a relationship, use only in subqueries."
      },
      "UserId": {
        "type": "ID",
        "description": "ID of the user specified in the User field."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_userentityaccess.htm"
  }
}