{
  "UserAccountTeamMember": {
    "name": "UserAccountTeamMember",
    "description": "Represents a User on the default account team of another User.",
    "properties": {
      "AccountAccessLevel": {
        "type": "picklist",
        "description": "Required. For Account records that the user has added to his or her default account team, the level of access the account team member has. . The possible values are: Read Edit This field must be set to an access level that is higher than the organization’s default access level for accounts."
      },
      "CaseAccessLevel": {
        "type": "picklist",
        "description": "Required. Level of access that the account team member has to Case records related to the account. The possible values are: None Read Edit This field must be set to an access level that is higher than the organization's default access level for cases."
      },
      "ContactAccessLevel": {
        "type": "picklist",
        "description": "Required. ForContact records related to the account, the level of access that the account team member has. The possible values are: None Read Edit This field must be set to an access level that is higher than the organization's default access level for contacts. Note When DefaultContactAccess is set to Controlled by Parent, you can’t create or update this field."
      },
      "OpportunityAccessLevel": {
        "type": "picklist",
        "description": "Required. Level of access that the team member has to Opportunity records related to the account. The possible values are: None Read Edit This field must be set to an access level that is higher than the organization’s default access level for opportunities."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Required. ID of the User who owns the default account team."
      },
      "TeamMemberRole": {
        "type": "picklist",
        "description": "Role that the team member has on opportunities for which the user has added his or her default account team. The valid values are set by the organization’s administrator in the Account Team Roles picklist. Label is Team Role."
      },
      "UserId": {
        "type": "reference",
        "description": "Required. ID of the User who is a member of the default account team. This field cannot be updated."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_useraccountteammember.htm"
  }
}