{
  "User": {
    "name": "User",
    "description": "Represents a user in your organization.",
    "properties": {
      "AboutMe": {
        "type": "textarea",
        "description": "Information about the user, such as areas of interest or skills. This field is available even if Chatter is disabled."
      },
      "AccountId": {
        "type": "reference",
        "description": "ID of the Account associated with a Customer Portal user.This field is null for Salesforce users."
      },
      "Address (beta)": {
        "type": "address",
        "description": "The compound form of the address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "Alias": {
        "type": "string",
        "description": "Required. The user’s alias. For example, jsmith."
      },
      "BadgeText": {
        "type": "string",
        "description": "The Experience Cloud site role, displayed on the user profile page just below the user name."
      },
      "BannerPhotoUrl": {
        "type": "url",
        "description": "The URL for the user's banner photo. This field is available in API version 36.0 and later."
      },
      "CallCenterId": {
        "type": "reference",
        "description": "If Salesforce CRM Call Center is enabled, represents the call center that this user is assigned to."
      },
      "City": {
        "type": "string",
        "description": "The city associated with the user. Up to 40 characters allowed."
      },
      "CommunityNickname": {
        "type": "string",
        "description": "Unique name used to identify this user in the Experience Cloud site."
      },
      "CompanyName": {
        "type": "string",
        "description": "The name of the user’s company."
      },
      "ContactId": {
        "type": "reference",
        "description": "ID of the Contact associated with this account. The contact must have a value in the AccountId field or an error occurs."
      },
      "Country": {
        "type": "string",
        "description": "The country associated with the user. Up to 80 characters allowed."
      },
      "CountryCode": {
        "type": "picklist",
        "description": "The ISO country code associated with the user."
      },
      "CurrentStatus": {
        "type": "textarea",
        "description": "Text that describes what the user is working on. Note If you update this field, the API automatically adds a post of type UserStatus on the user’s profile in Chatter.This field is deprecated in API version 25.0. To achieve similar behavior, post to the user directly by creating a FeedItem with the user’s ParentId."
      },
      "DefaultCurrencyIsoCode": {
        "type": "picklist",
        "description": "The user's default currency setting for new records. For example, if a user in France sets DefaultCurrencyIsoCode to euros, then that’s their default currency.Only applicable for organizations that use multiple currencies."
      },
      "DefaultDivision": {
        "type": "picklist",
        "description": "This record’s default division. Only applicable if divisions are enabled."
      },
      "DefaultGroupNotificationFrequency": {
        "type": "picklist",
        "description": "Required. The default frequency for sending the user's Chatter group email notifications when the user joins groups. The valid values are: P—Email on every post D—Daily digests W—Weekly digests N—Never The default value is N. For Professional, Enterprise, Unlimited, and Developer Edition organizations that existed before API version 22.0, the default value remains D.This field is available in API version 21.0 and later."
      },
      "DelegatedApproverId": {
        "type": "reference",
        "description": "Id of the user who is a delegated approver for this user."
      },
      "Department": {
        "type": "string",
        "description": "The company department associated with the user."
      },
      "DigestFrequency": {
        "type": "picklist",
        "description": "Required. The send frequency of the user’s Chatter personal email digest. The valid values are: D = Daily W = Weekly N = Never The default value is D."
      },
      "Division": {
        "type": "string",
        "description": "The division associated with this user, similar to Department, and unrelated to DefaultDivision."
      },
      "Email": {
        "type": "email",
        "description": "Required. The user’s email address."
      },
      "EmailEncodingKey": {
        "type": "picklist",
        "description": "Required. The email encoding for the user, such as ISO-8859-1 or UTF-8."
      },
      "EmailPreferencesAutoBcc": {
        "type": "boolean",
        "description": "Determines whether the user receives copies of sent emails. This option applies only if compliance BCC emails aren’t enabled."
      },
      "EmployeeNumber": {
        "type": "string",
        "description": "The user’s employee number."
      },
      "EndDay": {
        "type": "picklist",
        "description": "The time of day that the user generally stops working. Used to define the times that display in the user’s calendar. This field is available in API version 63.0 and later."
      },
      "Extension": {
        "type": "phone",
        "description": "The user’s phone extension number."
      },
      "Fax": {
        "type": "phone",
        "description": "The user’s fax number."
      },
      "FederationIdentifier": {
        "type": "string",
        "description": "Indicates the value that must be listed in the Subject element of a Security Assertion Markup Language (SAML) IDP certificate to authenticate the user for a client application using single sign-on. This value must be specified if the SAML User ID Type is Assertion contains Federation ID from the User record. Otherwise, this field can’t be edited."
      },
      "FirstName": {
        "type": "string",
        "description": "The user’s first name."
      },
      "ForecastEnabled": {
        "type": "boolean",
        "description": "Indicates whether the user is enabled for forecasts (true) or not (false). Forecast user has access to the forecasts page."
      },
      "FullPhotoUrl": {
        "type": "url",
        "description": "The URL for the user's profile photo. This field is available even if Chatter is disabled.The URL is updated every time a photo is uploaded and reflects the most recent photo. If a newer photo is uploaded, the URL returned for an older photo isn’t guaranteed to return a photo. Query this field for the URL of the most recent photo. This field is available in API version 20.0 and later."
      },
      "GeocodeAccuracy": {
        "type": "picklist",
        "description": "The level of accuracy of a location’s geographical coordinates compared with its physical address. A geocoding service typically provides this value based on the address’s latitude and longitude coordinates."
      },
      "HasUserVerifiedEmail": {
        "type": "boolean",
        "description": "Indicates whether the user's email is verified (true) or not (false). The default value is false. This field is available in API version 63.0 and later."
      },
      "HasUserVerifiedPhone": {
        "type": "boolean",
        "description": "Indicates whether the user's phone number is verified (true) or not (false). The default value is false. This field is available in API version 63.0 and later."
      },
      "IndividualId": {
        "type": "reference",
        "description": "ID of the data privacy record associated with this user. This field is available if Data Protection and Privacy is enabled."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the user has access to log in (true) or not (false). You can modify a User's active status from the user interface or via the API."
      },
      "IsPartner": {
        "type": "boolean",
        "description": "Indicates whether the user is a partner who has access to the partner portal (true) or not (false). This field isn’t available for release 9.0 and later. Instead, use UserType with the value Partner or Power Partner."
      },
      "IsPortalEnabled": {
        "type": "boolean",
        "description": "Indicates whether an active, external, user has access to Experience Cloud sites or portals (true) or not (false).This field is only available if one of these conditions is true: Digital experiences is enabled and you have community or portal user licenses Portals are enabled Note Users with External Identity licenses can access Experience Cloud sites even if the flag is false."
      },
      "IsPortalSelfRegistered": {
        "type": "boolean",
        "description": "Indicates whether the user is a Customer Portal user who self-registered for your organization's Customer Portal (true) or not (false). This field isn’t available for release 9.0 and earlier."
      },
      "IsPrmSuperUser": {
        "type": "boolean",
        "description": "Available for partner portal users only. Indicates whether the user has super user access in the partner portal (true) or not (false)."
      },
      "IsProfilePhotoActive": {
        "type": "boolean",
        "description": "Indicates whether a user has a profile photo (true) or not (false). This field is available in API version 36.0 and later."
      },
      "JigsawImportLimitOverride": {
        "type": "int",
        "description": "The Data.com user’s monthly addition limit. The value must be between zero and the organization’s monthly addition limit. Label is Data.com Monthly Addition Limit. This field is available in API version 27.0 and later."
      },
      "LanguageLocaleKey": {
        "type": "picklist",
        "description": "Required. The user’s language, such as French or Chinese (Traditional). Label is Language. Note In API version 47.0 and later, when using the DescribeSObjectResult API to return PicklistEntry values from this picklist, the active value indicates whether the language is in the user’s Displayed Languages (true) or the user’s Available Languages (false). All other languages aren’t in the returned active value array. In API version 46.0 and earlier, the PicklistEntry active values indicate whether the language is in either the user’s Displayed Languages or Available Languages lists (true) or not in either list (false)."
      },
      "LastLoginDate": {
        "type": "dateTime",
        "description": "The date and time when the user last successfully logged in. This value is updated if 60 seconds elapses since the user’s last login."
      },
      "LastName": {
        "type": "string",
        "description": "Required. The user’s last name."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) but not viewed."
      },
      "Latitude": {
        "type": "double",
        "description": "Used with Longitude to specify the geolocation of an address. Acceptable values are numbers between –90 and 90 up to 15 decimal places. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "LocaleSidKey": {
        "type": "picklist",
        "description": "Required. This field is a restricted picklist field. The value of the field affects formatting and parsing of values, especially numeric values, in the user interface. It doesn’t affect the API.The field values are named according to the language, and the country if necessary, using two-letter ISO codes. The set of names is based on the ISO standard. You can also manually set a user’s locale in the user interface, and then use that value for inserting or updating other users via the API."
      },
      "Longitude": {
        "type": "double",
        "description": "Used with Latitude to specify the geolocation of an address. Acceptable values are numbers between –180 and 180 up to 15 decimal places. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "Manager": {
        "type": "picklist",
        "description": "User lookup field used to select the user's manager. This field establishes a hierarchical relationship, preventing you from selecting a user that directly or indirectly reports to themselves."
      },
      "ManagerId": {
        "type": "reference",
        "description": "The Id of the user who manages this user."
      },
      "MediumBannerPhotoUrl": {
        "type": "url",
        "description": "The URL for the medium-sized user profile banner photo."
      },
      "MiddleName": {
        "type": "string",
        "description": "The user’s middle name. Maximum size is 40 characters. To enable this field, contact Salesforce Customer Support."
      },
      "MobilePhone": {
        "type": "phone",
        "description": "The user’s mobile device number."
      },
      "Name": {
        "type": "string",
        "description": "Concatenation of FirstName and LastName. Limited to 203 characters, including whitespaces."
      },
      "NumberOfFailedLogins": {
        "type": "int",
        "description": "The number of failed login attempts for the user’s account. When the maximum number of failed login attempts is reached, the counter resets and the user’s account is locked. If there’s a successful login before the maximum number of failed login attempts is reached, the counter resets and the user’s account remains unlocked."
      },
      "OfflineTrialExpirationDate": {
        "type": "dateTime",
        "description": "The date and time when the user’s Connect Offline trial expires."
      },
      "PasswordExpirationDate": {
        "type": "dateTime",
        "description": "The date and time when the user’s password expires. This field is available in API version 63.0 and later."
      },
      "Phone": {
        "type": "phone",
        "description": "The user’s phone number."
      },
      "PortalRole": {
        "type": "picklist",
        "description": "The role of the user in the Customer Portal (either Executive, Manager, User, or PersonAcount).In API version 15.0 and earlier, if you set this field to null, the system automatically included a portal role. In API version 16.0 and above, when you set this field to null, a portal role is not automatically created. When this field is null and a ContactId is provided, the user is assigned to the User role. The Update property is available in API version 43.0 and later. The field is available if Customer Portal is enabled OR digital experiences is enabled and Experience Cloud sites have available partner portal, Customer Portal, or High-Volume Portal User licenses."
      },
      "PostalCode": {
        "type": "string",
        "description": "The user’s postal or ZIP code. Label is Zip/Postal Code."
      },
      "ProfileId": {
        "type": "reference",
        "description": "Required. ID of the user’s Profile. Use this value to cache metadata based on profile. In earlier releases, this was RoleId."
      },
      "ReceivesAdminInfoEmails": {
        "type": "boolean",
        "description": "Indicates whether the user receives email for administrators from Salesforce (true) or not (false)."
      },
      "ReceivesInfoEmails": {
        "type": "boolean",
        "description": "Indicates whether the user receives informational email from Salesforce (true) or not (false)."
      },
      "SenderEmail": {
        "type": "email",
        "description": "The email address used as the From address when the user sends emails. This address is the same value shown in Setup on the My Email Settings page."
      },
      "SenderName": {
        "type": "string",
        "description": "The name used as the email sender when the user sends emails. This name is the same value shown in Setup on the My Email Settings page."
      },
      "Signature": {
        "type": "textarea",
        "description": "The signature text added to emails. This text is the same value shown in Setup on the My Email Settings page."
      },
      "SmallBannerPhotoUrl": {
        "type": "url",
        "description": "The URL for the small user profile banner photo."
      },
      "SmallPhotoUrl": {
        "type": "url",
        "description": "The URL for a thumbnail of the user's profile photo. This field is available even if Chatter is disabled.The URL is updated every time a photo is uploaded and reflects the most recent photo. If a newer photo is uploaded, the URL returned for an older photo isn’t guaranteed to return a photo. Query this field for the URL of the most recent photo. This field is available in API version 20.0 and later."
      },
      "StartDay": {
        "type": "picklist",
        "description": "The time of day that the user generally starts working. Used to define the times that display in the user’s calendar. This field is available in API version 63.0 and later."
      },
      "State": {
        "type": "string",
        "description": "The state associated with the User. Up to 80 characters allowed."
      },
      "StateCode": {
        "type": "picklist",
        "description": "The ISO state code associated with the user."
      },
      "Street": {
        "type": "textarea",
        "description": "The street address associated with the User."
      },
      "SuAccessExpirationDate": {
        "type": "date",
        "description": "The expiration date for allowing Salesforce Customer Support to log in as this user with Login As functionality. After this date, the user must grant login access to Salesforce Customer Support again. This field is available in API version 63.0 or later."
      },
      "Suffix": {
        "type": "string",
        "description": "The user’s name suffix. Maximum size is 40 characters. To enable this field, contact Salesforce Customer Support."
      },
      "TimeZoneSidKey": {
        "type": "picklist",
        "description": "Required. This field is a restricted picklist field. A User time zone affects the offset used when displaying or entering times in the user interface. But the API doesn’t use a User time zone when querying or setting values.Values for this field are named using region and key city, according to ISO standards. You can also manually set one User time zone in the user interface, and then use that value for creating or updating other User records via the API."
      },
      "Title": {
        "type": "string",
        "description": "The user’s business title, such as Vice President."
      },
      "Username": {
        "type": "string",
        "description": "Required. Contains the name that a user enters to log in to the API or the user interface. The value for this field must be in the form of an email address, using all lowercase characters. It must also be unique across all organizations. If you try to create or update a User with a duplicate value for this field, the operation is rejected.Each inserted User also counts as a license. Every organization has a maximum number of licenses. If you attempt to exceed the maximum number of licenses by inserting User records, the create request is rejected."
      },
      "UserPermissionsCallCenterAutoLogin": {
        "type": "boolean",
        "description": "Required if Salesforce CRM Call Center is enabled. Indicates whether the user is enabled to use the auto login feature of the call center (true) or not (false)."
      },
      "UserPermissionsChatterAnswersUser": {
        "type": "boolean",
        "description": "Indicates whether the portal user is enabled to use the Chatter Answers feature (true) or not (false). This field defaults to false when a Customer Portal user is created from the API."
      },
      "UserPermissionsInteractionUser": {
        "type": "boolean",
        "description": "Indicates whether the user can run flows or not. Label is Flow User."
      },
      "UserPermissionsJigsawProspectingUser": {
        "type": "boolean",
        "description": "Indicates whether the user is allocated one Data.com user license (true) or not (false). The Data.com user lets the user add Data.com contact and lead records to Salesforce in supported editions. Label is Data.com User."
      },
      "UserPermissionsKnowledgeUser": {
        "type": "boolean",
        "description": "Indicates whether the user is enabled to use Salesforce Knowledge (true) or not (false). Label is Knowledge User."
      },
      "UserPermissionsLiveAgentUser": {
        "type": "boolean",
        "description": "Indicates whether the user is enabled to use Chat (true) or not (false). Label is Live Agent User."
      },
      "UserPermissionsMarketingUser": {
        "type": "boolean",
        "description": "Required. Indicates whether the user is enabled to manage campaigns in the user interface (true) or not (false). Label is Marketing User."
      },
      "UserPermissionsOfflineUser": {
        "type": "boolean",
        "description": "Required. Indicates whether the user is enabled to use Offline Edition (true) or not (false). Label is Offline User."
      },
      "UserPermissionsSFContentUser": {
        "type": "boolean",
        "description": "Indicates whether the user is allocated one Salesforce CRM Content User License (true) or not (false). Label is Salesforce CRM Content User. The Salesforce CRM Content User license grants the user access to the Salesforce CRM Content application."
      },
      "UserPermissionsSiteforceContributorUser": {
        "type": "boolean",
        "description": "Indicates whether the user is allocated one Site.com Contributor feature license (true) or not (false). Label is Site.com Contributor User. The Site.com Contributor feature license grants the user access to the Site.com application. Users with a Contributor license can use Site.com Studio to edit site content only."
      },
      "UserPermissionsSiteforcePublisherUser": {
        "type": "boolean",
        "description": "Indicates whether the user is allocated one Site.com Publisher feature license (true) or not (false). Label is Site.com Publisher User. The Site.com Publisher feature license grants the user access to the Site.com application. Users with a Publisher license can build and style websites, control the layout and functionality of pages and page elements, and add and edit content."
      },
      "UserPermissionsSupportUser": {
        "type": "boolean",
        "description": "When true, the user can use the Salesforce console."
      },
      "UserPermissionsWirelessUser": {
        "type": "boolean",
        "description": "Required if the Wireless permission is enabled. Indicates whether the user is enabled to use Wireless Edition (true) or not (false). Label is Wireless User. Note As of November 2005, Salesforce Wireless Edition is no longer available for purchase. You can continue to use Wireless Edition through the end of your existing contract term if you are: A Professional Edition customer and purchased Wireless Edition before November 7, 2005. An Enterprise Edition customer who signed or renewed their Salesforce contract before November 7, 2005."
      },
      "UserPermissionsWorkDotComUserFeature": {
        "type": "boolean",
        "description": "Indicates whether the WDC feature is enabled for the user (true) or not (false)."
      },
      "UserPreferencesActivityRemindersPopup": {
        "type": "boolean",
        "description": "When true, a reminder window automatically opens when an activity reminder is due. Corresponds to the Trigger alert when reminder comes due checkbox at the Reminders page in the personal settings in the user interface."
      },
      "UserPreferencesAllowConversationReminders": {
        "type": "boolean",
        "description": "When true, voice and call reminders are displayed as notification cards in Lightning Experience. Corresponds to the Show conversation reminders in Lightning Experience checkbox in the Activity Reminders page in the personal settings in the user interface.This field is available in API version 55.0 and later."
      },
      "UserPreferencesApexPagesDeveloperMode": {
        "type": "boolean",
        "description": "When true, indicates that the user has enabled developer mode for editing Visualforce pages and controllers."
      },
      "UserPreferencesAutoForwardCall": {
        "type": "boolean",
        "description": "When true, the user receives Dialer calls simultaneously in their browser and on their forwarding number."
      },
      "UserPreferencesContentEmailAsAndWhen": {
        "type": "boolean",
        "description": "When false, a user with Salesforce CRM Content subscriptions receives a once-daily email summary if activity occurs on the subscribed content, libraries, tags, or authors. To receive email, the UserPreferencesContentNoEmail field must also be false. The default value is false. Note This field is only visible when Salesforce CRM Content is enabled."
      },
      "UserPreferencesContentNoEmail": {
        "type": "boolean",
        "description": "When false, a user with Salesforce CRM Content subscriptions receives email notifications if activity occurs on the subscribed content, libraries, tags, or authors. To receive real-time email alerts, set this field to false and set the UserPreferencesContentEmailAsAndWhen field to true. The default value is false. Note This field is only visible when Salesforce CRM Content is enabled."
      },
      "UserPreferencesEnableAutoSubForFeeds": {
        "type": "boolean",
        "description": "When true, the user automatically subscribes to feeds for any objects that the user creates. This field is available in API version 25.0 and later."
      },
      "UserPreferencesDisableAllFeedsEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email for all updates to Chatter feeds, based on the types of feed emails and digests the user has enabled. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableAutoSubForFeeds": {
        "type": "boolean",
        "description": "When false, the user automatically subscribes to feeds for any objects that the user creates. This field is deprecated in API version 25.0 and later. Starting with API version 25.0, use UserPreferencesEnableAutoSubForFeeds to enable or disable auto-follow for objects a user creates."
      },
      "UserPreferencesDisableBookmarkEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time someone comments on a Chatter feed item after the user has bookmarked it. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableChangeCommentEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time someone comments on a change the user has made, such as an update to their profile. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableEndorsementEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone endorses them for a topic."
      },
      "UserPreferencesDisableFileShareNotificationsForApi": {
        "type": "boolean",
        "description": "When false, email notifications are sent from the person who shared the file to the users that the file is shared with. This field is available in API version 25.0 and later."
      },
      "UserPreferencesDisableFollowersEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time someone starts following the user in Chatter. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableLaterCommentEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time someone comments on a feed item after the user has commented on the feed item. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableLikeEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time someone likes their post or comment. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableMentionsPostEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time they’re mentioned in posts. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableProfilePostEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time someone posts to the user’s profile. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableSharePostEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time their post is shared. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableFeedbackEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives emails related to WDC feedback. The user receives these emails when someone requests or offers feedback, shares feedback with the user, or reminds the user to answer a feedback request."
      },
      "UserPreferencesDisCommentAfterLikeEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time someone comments on a post that the user liked. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisMentionsCommentEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time the user is mentioned in comments. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableMessageEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email for Chatter messages sent to the user. This field is available in API version 24.0 and later."
      },
      "UserPreferencesDisableRewardEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives emails related to WDC rewards. The user receives these emails when someone gives a reward to the user."
      },
      "UserPreferencesDisableWorkEmail": {
        "type": "boolean",
        "description": "When false, the user receives emails related to WDC feedback, goals, and coaching. The user must also sign up for individual emails listed on the WDC email settings page. When true, the user doesn’t receive any emails related to WDC feedback, goals, or coaching even if they’re signed up for individual emails."
      },
      "UserPreferencesDisProfPostCommentEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time someone comments on posts on the user’s profile. This field is available in API version 24.0 and later."
      },
      "UserPreferencesEnableVoiceCallRecording": {
        "type": "boolean",
        "description": "When true, voice call recording is enabled for the user."
      },
      "UserPreferencesEnableVoiceLocalPresence": {
        "type": "boolean",
        "description": "When true, local numbers are shown when the user calls customers with Sales Dialer."
      },
      "UserPreferencesEventRemindersCheckboxDefault": {
        "type": "boolean",
        "description": "When true, a reminder popup is automatically set on the user's events. Corresponds to the By default, set reminder on Events to... checkbox on the Reminders page in the user interface. This field is related to UserPreference and customizing activity reminders."
      },
      "UserPreferencesHideBiggerPhotoCallout": {
        "type": "boolean",
        "description": "When true, users can choose to hide the callout text below the large profile photo."
      },
      "UserPreferencesHideChatterOnboardingSplash": {
        "type": "boolean",
        "description": "When true, the initial Chatter onboarding prompts don’t appear."
      },
      "UserPreferencesHideCSNDesktopTask": {
        "type": "boolean",
        "description": "When true, the Chatter recommendations panel never displays the recommendation to install Chatter Desktop. This field is available in API version 26.0 and later."
      },
      "UserPreferencesHideCSNGetChatterMobileTask": {
        "type": "boolean",
        "description": "When true, the Chatter recommendations panel never displays the recommendation to install Chatter Mobile. This field is available in API version 26.0 and later."
      },
      "UserPreferencesHideEndUserOnboardingAssistantModal": {
        "type": "boolean",
        "description": "Reserved for future use."
      },
      "UserPreferencesHideLightningMigrationModal": {
        "type": "boolean",
        "description": "Reserved for future use."
      },
      "UserPreferencesHideSecondChatterOnboardingSplash": {
        "type": "boolean",
        "description": "When true, the secondary Chatter onboarding prompts don’t appear."
      },
      "UserPreferencesHideS1BrowserUI": {
        "type": "boolean",
        "description": "Controls the interface that the user sees when logging in to Salesforce from a supported mobile browser. If false, the user is automatically redirected to the Salesforce mobile web. If true, the user sees the full Salesforce site. The default value is false. Label is Salesforce User.This field is available in API version 29.0 or later."
      },
      "UserPreferencesHideSfxWelcomeMat": {
        "type": "boolean",
        "description": "Controls whether a user sees the Lightning Experience new user message. That message welcomes users to the new interface and provides step-by-step instructions that describe how to return to Salesforce Classic."
      },
      "UserPreferencesJigsawListUser": {
        "type": "boolean",
        "description": "When true, the user is a Data.com List user so shares record additions from a pool. UserPermissionsJigsawProspectingUser must also be set to true. Label is Data.com List User. This field is available in API version 27.0 and later."
      },
      "UserPreferencesLightningExperiencePreferred": {
        "type": "boolean",
        "description": "When true, redirects the user to the Lightning Experience interface. Label is Switch to Lightning Experience. This field is available in API version 35.0 and later."
      },
      "UserPreferencesLiveAgentMiawSetupDeflection": {
        "type": "boolean",
        "description": "When true, disables the pop-up to deflect users on Chat setup nodes to the Messaging setup. The default value is false. This field is available in API version 59.0 and later."
      },
      "UserPreferencesNativeEmailClient": {
        "type": "boolean",
        "description": "Use this field to set a default email preference for the user’s native email client. This field is available in API version 47.0 and later. The default value is false, corresponding to the Salesforce docked email composer."
      },
      "UserPreferencesOptOutOfTouch": {
        "type": "boolean",
        "description": "This field is deprecated in API version 29.0. When false, the user automatically accesses the Salesforce Touch app when logging in to Salesforce from an iPad. If true, automatic access to the Salesforce Touch app is turned off and the user’s iPad is directed to the full Salesforce site instead. The default value is false. Note Salesforce Touch must be enabled before this field is visible."
      },
      "UserPreferencesOutboundBridge": {
        "type": "boolean",
        "description": "When true, outbound calls are made through the user’s phone."
      },
      "UserPreferencesPathAssistantCollapsed": {
        "type": "boolean",
        "description": "When true, Sales Path appears collapsed or hidden to the user. This field is available in API version 35.0 and later."
      },
      "UserPreferencesProcessAssistantCollapsed": {
        "type": "boolean",
        "description": "When true, Sales Path appears collapsed or hidden to the user. This field is available in API versions 33.0 and 34.0 only. In API versions 35.0 and later, use UserPreferencesPathAssistantCollapsed."
      },
      "UserPreferencesReceiveNoNotificationsAsApprover": {
        "type": "boolean",
        "description": "Controls email notifications from the approval process for approvers. If true, emails are disabled. If false, emails are enabled. The default value is false. Note The Receive Approval Request Emails setting in the UI controls this field and the UserPreferencesReceiveNotificationsAsDelegatedApprover field. Setting: If I’m an approver or delegated approverResult: UserPreferencesReceiveNoNotificationsAsApprover = false UserPreferencesReceiveNotificationsAsDelegatedApprover = true Setting: Only if I’m an approverResult: UserPreferencesReceiveNoNotificationsAsApprover = false UserPreferencesReceiveNotificationsAsDelegatedApprover = false Setting: Only if I’m a delegated approverResult: UserPreferencesReceiveNoNotificationsAsApprover = true UserPreferencesReceiveNotificationsAsDelegatedApprover = true Setting: NeverResult: UserPreferencesReceiveNoNotificationsAsApprover = true UserPreferencesReceiveNotificationsAsDelegatedApprover = false"
      },
      "UserPreferencesReceiveNotificationsAsDelegatedApprover": {
        "type": "boolean",
        "description": "Controls email notifications from the approval process for delegated approvers. If true, emails are enabled. If false, emails are disabled. The default value is false. Note The Receive Approval Request Emails setting in the UI controls this field and the UserPreferencesReceiveNoNotificationsAsApprover field. Setting: If I’m an approver or delegated approverResult: UserPreferencesReceiveNoNotificationsAsApprover = false UserPreferencesReceiveNotificationsAsDelegatedApprover = true Setting: Only if I’m an approverResult: UserPreferencesReceiveNoNotificationsAsApprover = false UserPreferencesReceiveNotificationsAsDelegatedApprover = false Setting: Only if I’m a delegated approverResult: UserPreferencesReceiveNoNotificationsAsApprover = true UserPreferencesReceiveNotificationsAsDelegatedApprover = true Setting: NeverResult: UserPreferencesReceiveNoNotificationsAsApprover = true UserPreferencesReceiveNotificationsAsDelegatedApprover = false"
      },
      "UserPreferencesReminderSoundOff": {
        "type": "boolean",
        "description": "When true, a sound automatically plays when an activity reminder is due. Corresponds to the Play a reminder sound checkbox on the Reminders page in the user interface."
      },
      "UserPreferencesShowCityToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the city field in the user’s contact information. City is visible only to internal members of the user’s organization when: This field is false. When false, this field returns the value #N/A. City is visible to external members in an Experience Cloud site when: This field is true, or This field is false but UserPreferencesShowCityToGuestUsers is true, which overrides this field’s value. External users are users with Community, Customer Portal, or partner portal licenses.The default value is false. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowCityToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the city field in the user’s contact information. When true, city is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When false, this field returns the value #N/A. When true, this field overrides the value false in UserPreferencesShowCityToExternalUsers, making the user’s city visible to external members. The default value is false. This field is available in API version 28.0 and later."
      },
      "UserPreferencesShowCountryToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the country field in the user’s contact information. Country is visible only to internal members of the user’s organization when: This field is false. When false, this field returns the value #N/A. Country is visible to external members in an Experience Cloud site when: This field is true, or This field is false but UserPreferencesShowCountryToGuestUsers is true, which overrides this field’s value. External users are users with Community, Customer Portal, or partner portal licenses. The default value is false. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowCountryToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the country field in the user’s contact information. When true, country is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When false, this field returns the value #N/A. When true, this field overrides the value false in UserPreferencesShowCountryToExternalUsers, making the user’s country visible to external members. The default value is false. This field is available in API version 28.0 and later."
      },
      "UserPreferencesShowEmailToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the email address field in the user’s contact information. Email address is visible only to internal members of the user’s organization when this field is false. Email address is visible to external members in an Experience Cloud site when this field is true. External users are users with Community, Customer Portal, or partner portal licenses.When false, this field returns the value #N/A. The default value is false. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowEmailToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the email address field in the user’s contact information. When true, the email address is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When true, this field overrides the value ​false in UserPreferencesShowEmailToExternalUsers, making the user’s email address visible to guests. When false, this field returns the value #N/A. The default value is false. This field is available in API version 34.0 and later."
      },
      "UserPreferencesShowFaxToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the fax number field in the user’s contact information. Fax number is visible only to internal members of the user’s organization when this field is false. Fax number is visible to external members in an Experience Cloud site when this field is true. External users are users with Community, Customer Portal, or partner portal licenses.When false, this field returns the value #N/A. The default value is false. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowFaxToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the fax number field in the user’s contact information. When true, the fax number field is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When true, this field overrides the value ​false in UserPreferencesShowFaxToExternalUsers, making the user’s fax number visible to guests. When false, this field returns the value #N/A. The default value is false. This field is available in API version 34.0 and later."
      },
      "UserPreferencesShowManagerToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the manager field in the user’s contact information. Manager is visible only to internal members of the user’s organization when this field is false. Manager is visible to external members in an Experience Cloud site when this field is true. External users are users with Community, Customer Portal, or partner portal licenses.When false, this field returns the value #N/A. The default value is false. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowManagerToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the manager field in the user’s contact information. When true, the manager field is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When true, this field overrides the value ​false in UserPreferencesShowManagerToExternalUsers, making the user’s manager visible to guests. When false, this field returns the value #N/A. The default value is false. This field is available in API version 34.0 and later."
      },
      "UserPreferencesShowMobilePhoneToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the mobile device number field in the user’s contact information. The number is visible only to internal members of the user’s organization when this field is false. The number is visible to external members in an Experience Cloud site when this field is true. External users are users with Community, Customer Portal, or partner portal licenses.When false, this field returns the value #N/A. The default value is false. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowMobilePhoneToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the mobile phone field in the user’s contact information. When true, the mobile phone field is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When true, this field overrides the value ​false in UserPreferencesShowMobilePhoneToExternalUsers, making the user’s mobile phone visible to guests. When false, this field returns the value #N/A. The default value is false. This field is available in API version 34.0 and later."
      },
      "UserPreferencesShowPostalCodeToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the postal or ZIP code field in the user’s contact information. Postal code is visible only to internal members of the user’s organization when: This field is false. When false, this field returns the value #N/A. Postal code is visible to external members in an Experience Cloud site when: This field is true, or This field is false but UserPreferencesShowPostalCodeToGuestUsers is true, which overrides this field’s value. External users are users with Community, Customer Portal, or partner portal licenses.The default value is false. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowPostalCodeToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the postal or ZIP code field in the user’s contact information. When true, postal code is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When false, this field returns the value #N/A. When true, this field overrides the value ​false in UserPreferencesShowPostalCodeToExternalUsers, making the user’s postal code visible to external members. The default value is false. This field is available in API version 28.0 and later."
      },
      "UserPreferencesShowProfilePicToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the user’s profile photo. When true, the photo is visible to guest users in an Experience Cloud site. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site.When false, this field returns the stock photo. The default value is false. This field is available in API version 28.0 and later."
      },
      "UserPreferencesShowStateToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the state field in the user’s contact information. State is visible only to internal members of the user’s organization when: This field is false. When false, this field returns the value #N/A. State is visible to external members in an Experience Cloud site when: This field is true, or This field is false but UserPreferencesShowStateToGuestUsers is true, which overrides this field’s value. External users are users with Community, Customer Portal, or partner portal licenses.When false, this field returns the value #N/A. The default value is false. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowStateToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the state field in the user’s contact information. When true, state is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When false, this field returns the value #N/A. When true, this field overrides the value false in UserPreferencesShowStateToExternalUsers, making the user’s state visible to external members. The default value is false. This field is available in API version 28.0 and later."
      },
      "UserPreferencesShowStreetAddressToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the street address field in the user’s contact information. The address is visible only to internal members of the user’s organization when this field is false. The address is visible to external members in an Experience Cloud site when this field is true. External users are users with Community, Customer Portal, or partner portal licenses.When false, this field returns the value #N/A. The default value is false. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowStreetAddressToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the street address field in the user’s contact information. When true, the street address field is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When true, this field overrides the value ​false in UserPreferencesShowStreetAddressToExternalUsers, making the user’s street address visible to guests. When false, this field returns the value #N/A. The default value is false. This field is available in API version 34.0 and later."
      },
      "UserPreferencesShowTitleToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the business title field in the user’s contact information. Title is visible only to internal members of the user’s organization when: This field is false. When false, this field returns the value #N/A. Title is visible to external members in an Experience Cloud site when: This field is true, or This field is false but UserPreferencesShowTitleToGuestUsers is true, which overrides this field’s value. External users are users with Community, Customer Portal, or partner portal licenses.The default value is true. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowTitleToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the business title field in the user’s contact information. When true, title is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When false, this field returns the value #N/A. When true, this field overrides the value false in UserPreferencesShowTitleToExternalUsers, making the user’s title visible to external members. The default value is false. This field is available in API version 28.0 and later."
      },
      "UserPreferencesShowWorkPhoneToExternalUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the work phone number field in the user’s contact information. The number is visible only to internal members of the user’s organization when this field is false. The number is visible to external members in an Experience Cloud site when this field is true. External users are users with Community, Customer Portal, or partner portal licenses.When false, this field returns the value #N/A. The default value is false. This field is available in API version 26.0 and later."
      },
      "UserPreferencesShowWorkPhoneToGuestUsers": {
        "type": "boolean",
        "description": "Indicates the visibility of the work phone field in the user’s contact information. When true, the work phone field is visible to guest users. Guest users can access public Site.com and Salesforce sites, and public pages in Experience Cloud sites, via the Guest User license associated with each site. When true, this field overrides the value ​false in UserPreferencesShowWorkPhoneToExternalUsers, making the user’s work phone visible to guests. When false, this field returns the value #N/A. The default value is false. This field is available in API version 34.0 and later."
      },
      "UserPreferencesSortFeedByComment": {
        "type": "boolean",
        "description": "Specifies the data value used in sorting a user’s feed. When true, the feed is sorted by most recent comment activity. When false, the feed is sorted by post date."
      },
      "UserPreferencesSuppressEventSFXReminders": {
        "type": "boolean",
        "description": "When true, event reminders don’t appear. Corresponds to the Show event reminders in Lightning Experience checkbox on the Activity Reminders page in the user interface. This field is related to UserPreference and customizing activity reminders."
      },
      "UserPreferencesSuppressTaskSFXReminders": {
        "type": "boolean",
        "description": "When true, task reminders don’t appear. Corresponds to the Show task reminders in Lightning Experience. checkbox on the Activity Reminders page in the user interface. This field is related to UserPreference and customizing activity reminders."
      },
      "UserPreferencesTaskRemindersCheckboxDefault": {
        "type": "boolean",
        "description": "When true, a reminder popup is automatically set on the user's tasks. Corresponds to the By default, set reminder on Tasks to... checkbox on the Reminders page in the user interface. This field is related to UserPreference and customizing activity reminders."
      },
      "UserPreferencesUserDebugModePref": {
        "type": "boolean",
        "description": "When true, the Lightning Component framework executes in debug mode for the user. Corresponds to the Debug Mode checkbox on the Advanced User Details page of personal settings in the user interface."
      },
      "UserRoleId": {
        "type": "reference",
        "description": "ID of the user’s UserRole. Label is Role ID."
      },
      "UserType": {
        "type": "picklist",
        "description": "The category of user license. Each UserType is associated with one or more UserLicense records. Each UserLicense is associated with one or more profiles. In API version 10.0 and later, valid values include: Standard: user license. This user type also includes Salesforce Platform and Salesforce Platform One user licenses. Label is Standard. PowerPartner: User whose access is limited because they’re a partner and typically access the application through a partner portal or Experience Cloud site. Label is Partner. CspLitePortal: user whose access is limited because they’re an org's customer and access the application through a Customer Portal or Experience Cloud site. Label is High Volume Portal. CustomerSuccess: user whose access is limited because they’re an org's customer and access the application through a Customer Portal. Label is Customer Portal User. PowerCustomerSuccess: user whose access is limited because they’re an org's customer and access the application through a Customer Portal. Label is Customer Portal Manager. Users with this license type can view and edit data they directly own or data owned by or shared with users below them in the Customer Portal role hierarchy. CsnOnly: user whose access to the application is limited to Chatter. This user type includes Chatter Free and Chatter moderator users. Label is Chatter Free. Guest: user whose access is limited because they’re an unauthenticated user without login credentials. Label is Guest."
      },
      "WirelessEmail": {
        "type": "email",
        "description": "Wireless email address associated with this user. For use with Salesforce Wireless Edition. This field is available only if the Wireless and Email permissions are enabled for your organization. Note As of November 2005, Salesforce Wireless Edition is no longer available for purchase. You can continue to use Wireless Edition through the end of your existing contract term if you are: A Professional Edition customer and purchased Wireless Edition before November 7, 2005. An Enterprise Edition customer who signed or renewed their Salesforce contract before November 7, 2005."
      }
    },
    "module": "Core Salesforce"
  }
}