{
  "UserProvisioningConfig": {
    "name": "UserProvisioningConfig",
    "description": "Represents information for a flow to use during a user provisioning request process, such as the attributes for an update.",
    "properties": {
      "ApprovalRequired": {
        "type": "textarea",
        "description": "Denotes whether approvals are required for provisioning users for the associated connected app. If the value is null, no approval is required."
      },
      "ConnectedAppId": {
        "type": "reference",
        "description": "The 18-digit application ID for the connected app."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package, and the changes are reflected in a subscriber’s organization."
      },
      "Enabled": {
        "type": "boolean",
        "description": "Indicates whether user provisioning is enabled for the associated connected app (true) or not (false)."
      },
      "EnabledOperations": {
        "type": "textarea",
        "description": "Lists the operations, as comma-separated values, that create a UserProvisioningRequest object for the associated connected app. Allowed values are: Create Update EnableAndDisable (activation and deactivation) SuspendAndRestore (freeze and unfreeze)"
      },
      "Language": {
        "type": "picklist",
        "description": "The two- to five-character code that represents the language and locale ISO. This code controls the language for labels displayed in an application."
      },
      "LastReconDateTime": {
        "type": "dateTime",
        "description": "The date and time when user accounts were last reconciled between Salesforce and the target system."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The primary label for this object. This value is the internal label that doesn’t get translated."
      },
      "NamedCredentialId": {
        "type": "reference",
        "description": "Salesforce ID of the named credential that’s used for a request. The named credential identifies the third-party system and the third-party authentication settings."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "Notes": {
        "type": "textarea",
        "description": "A utility field for administrators to add any additional information about the configuration. This field is for internal reference only, and is not used by any process."
      },
      "OnUpdateAttributes": {
        "type": "textarea",
        "description": "Lists the user attributes, as comma-separated values, that generate a UserProvisioningRequest object during an update."
      },
      "ReconFilter": {
        "type": "string",
        "description": "When collecting and analyzing users on a third-party system, the plug-in uses this filter to limit the scope of the collection."
      },
      "UserAccountMapping": {
        "type": "textarea",
        "description": "Stores the attributes used to link the Salesforce user to the account on the third-party system, in JSON format. For example: {\"linkingSalesforceUserAttribute\":\"Username\", \"linkingTargetUserAttribute\":\"Email\"}"
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_userprovisioningconfig.htm"
  }
}