{
  "UserProvAccount": {
    "name": "UserProvAccount",
    "description": "Represents information that links a Salesforce user account with an account in a third-party (target) system, such as Google, for users of connected apps with Salesforce user provisioning enabled.",
    "properties": {
      "ConnectedAppId": {
        "type": "reference",
        "description": "The 15 character application ID."
      },
      "DeletedDate": {
        "type": "dateTime",
        "description": "The date and time when the associated user account in the target system was deleted. This value is automatically updated during the provisioning and reconciling processes."
      },
      "ExternalEmail": {
        "type": "string",
        "description": "The email address as stored in the target system for the associated user account."
      },
      "ExternalFirstName": {
        "type": "string",
        "description": "The first name as stored in the target system for the associated user account."
      },
      "ExternalLastName": {
        "type": "string",
        "description": "The last name as stored in the target system for the associated user account."
      },
      "ExternalUserId": {
        "type": "string",
        "description": "The unique identifier for the user as stored in the target system."
      },
      "ExternalUsername": {
        "type": "string",
        "description": "The username as stored in the target system for the associated user account."
      },
      "IsKnownLink": {
        "type": "boolean",
        "description": "Setting the IsKnownLink value to true implies the administrator or another user is managing the relationship between the Salesforce user account and the third-party user account, manually. This field helps Salesforce coordinate updates between the UserProvAccountStaging object and the UserProvAccount object while committing staged accounts. Typically, for a matching user account (the same ExternalUserId for both objects), Salesforce copies the values from the UserProvAccountStaging object to the UserProvAccount object. However, if Salesforce encounters a UserProvAccountStaging object with a matching ExternalUserId but different LinkState and SalesforceUserId values during this process, Salesforce checks the UserProvAccount IsKnownLink value. If the IsKnownLinkvalue is true, Salesforce doesn’t copy the LinkState and SalesforceUserId values from the UserProvAccountStaging object to the UserProvAccount object (all other values are copied). The default is false, meaning Salesforce manages the account relationship."
      },
      "LinkState": {
        "type": "picklist",
        "description": "The state of the current connection between the user account in the Salesforce organization and the associated user account in the target system. The valid values are: linked— changes to the account in the Salesforce organization are queued to be updated for the associated user account in the target system. duplicate— an associated account in the target system exists. orphaned—no associated account exists in the target system. ignored— changes to the account in the Salesforce organization have no effect on the associated user account in the target system."
      },
      "Name": {
        "type": "string",
        "description": "The unique name for this object."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The user ID of the owner of this object—typically a Salesforce administrator."
      },
      "SalesforceUserId": {
        "type": "reference",
        "description": "The user ID for the user account in the Salesforce organization that is associated with the user account in the target system."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the account in the target system. The valid values are: Active Deactivated Deleted"
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_userprovaccount.htm"
  }
}