{
  "UserAuthCertificate": {
    "name": "UserAuthCertificate",
    "description": "Represents a user authentication certificate in your org. A user certificate is a unique PEM-encoded X.509 digital certificate to authenticate individual users to your org.",
    "properties": {
      "CertificateChain": {
        "type": "base64",
        "description": "The uploaded PEM files can contain a single certificate or up to 10 certificates in a certificate chain. Uploaded PEM files can’t be larger than 1 MB."
      },
      "CertificateChainLength": {
        "type": "int",
        "description": "The auto-generated length of the certificate or certificate chain in the uploaded PEM file."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, Salesforce generates one for each record, which slows performance. Note Only users with View DeveloperName OR View Setup and Configuration permission can view, group, sort, and filter this field."
      },
      "ExpirationDate": {
        "type": "dateTime",
        "description": "The expiration date of the uploaded certificate."
      },
      "Fingerprint": {
        "type": "string",
        "description": "The unique fingerprint of the uploaded certificate."
      },
      "Language": {
        "type": "picklist",
        "description": "The language in which to display the certificate."
      },
      "MasterLabel": {
        "type": "string",
        "description": "A descriptive name for the certificate."
      },
      "SerialNumber": {
        "type": "string",
        "description": "The serial number of the uploaded certificate."
      },
      "UserID": {
        "type": "reference",
        "description": "The user associated with the certificate."
      }
    },
    "module": "Core Salesforce"
  }
}