{
  "IdentityVerificationProcFld": {
    "name": "IdentityVerificationProcFld",
    "description": "Used to configure the questions or criteria for verifying the identity of a caller.",
    "properties": {
      "DataSourceType": {
        "type": "picklist",
        "description": "Specifies whether source of data for identity verification is external or within Salesforce."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Record Type Name. This field is automatically generated, but you can supply your own value if you create the record using the API. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow as a DeveloperName is generated for each record."
      },
      "FieldName": {
        "type": "string",
        "description": "The label of the field that contains the verification data based on the selected field type."
      },
      "FieldType": {
        "type": "picklist",
        "description": "Specifies the type of the field that contains the verification data."
      },
      "FieldValueFormula": {
        "type": "string",
        "description": "Stores the formula that's applied to the field value. Note This field isn’t supported as of API version 54.0"
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated IdentityVerificationProcFld type in Metadata API. The full name can include a namespace prefix."
      },
      "IdentityVerificationProcDtlId": {
        "type": "reference",
        "description": "The label of the relevant Identity Verification Process Detail record."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the record is active."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the IdentityVerificationProcFld."
      },
      "ManageableState": {
        "type": "picklist",
        "description": "Indicates the manageable state of the specified component that is contained in a package."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label that identifies the IdentityVerificationProcFld throughout the Salesforce user interface."
      },
      "Metadata": {
        "type": "complexvalue",
        "description": "The IdentityVerificationProcFld’s metadata."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation."
      },
      "SequenceNumber": {
        "type": "int",
        "description": "The sequence number of the field."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/tooling_api_objects_identityverificationprocfld.htm"
  }
}