{
  "IdentityVerificationProcDtl": {
    "name": "IdentityVerificationProcDtl",
    "description": "Used to configure the search function as well as the minimum number of verifiers for the identity verification process. Available in API version 54.0 and later.",
    "properties": {
      "ApexClassId": {
        "type": "reference",
        "description": "The ID of the Apex class."
      },
      "DataSourceType": {
        "type": "picklist",
        "description": "The source type of the data."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The developer name of a record."
      },
      "DisplayRecordFieldName": {
        "type": "string",
        "description": "The name of the field that contains information about the record that's shown to the user after identity verification is successful."
      },
      "IdentityVerificationProcDefId": {
        "type": "reference",
        "description": "The label of the relevant Identity Verification Process Definition record."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the record is active (true) or not (false)."
      },
      "Language": {
        "type": "picklist",
        "description": "The languages in which translation of record labels is supported."
      },
      "LinkedIdVerfProcessDetId": {
        "type": "reference",
        "description": "Configure multiple levels of identity verification. For example, suppose you have two process detail records, Contact Process Detail and Account Process Detail, and Account Process Detail is linked to the contact process detail record. In this case, the contact process detail record is used for primary verification and the account process detail record is used for secondary verification. Then, if your business requirement is to configure a third-level verification process, create another process detail record and set the value of the LinkedIdVerfProcessDetId field in the account process detail record to the third process detail record."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label of the Identity Verification Process Detail record."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix associated with this object. Each Developer Edition organization that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation."
      },
      "ObjectName": {
        "type": "string",
        "description": "The name of the object on which the search is performed and data is verified."
      },
      "OptionalVerifiersMinVerfCount": {
        "type": "int",
        "description": "The minimum number of additional verifiers that must be checked."
      },
      "SearchFilter": {
        "type": "string",
        "description": "Conditions to filter the search results."
      },
      "SearchRecordUniqueIdField": {
        "type": "string",
        "description": "The field storing the unique identifier of records displayed in the search results."
      },
      "SearchResultSortBy": {
        "type": "string",
        "description": "The values that are used to sort the search results."
      },
      "SearchSequenceNumber": {
        "type": "int",
        "description": "The sequence in which the search is performed and the search result is displayed."
      },
      "SearchType": {
        "type": "picklist",
        "description": "The type of search being performed."
      }
    },
    "module": "Public Sector Cloud"
  }
}