{
  "ImpactRiskOpportunity": {
    "name": "ImpactRiskOpportunity",
    "description": "Represents an impact, risk, or opportunity that can be evaluated and scored as a part of an organization's double-materiality assessment. Also known as an IRO.",
    "properties": {
      "BusinessUnit": {
        "type": "string",
        "description": "The business unit of the impact, risk, or opportunity."
      },
      "Country": {
        "type": "picklist",
        "description": "Specifies the country of the impact, risk, or opportunity."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the impact, risk, or opportunity."
      },
      "Effect": {
        "type": "picklist",
        "description": "Specifies the effect of the impact, risk, or opportunity, such as positive or negative."
      },
      "HasHumanRightsImpact": {
        "type": "boolean",
        "description": "Indicates whether the impact, risk, or opportunity has a human rights impact (true) or not (false)."
      },
      "ImpactType": {
        "type": "picklist",
        "description": "Specifies the impact type of the impact, risk, or opportunity, such as actual or potential."
      },
      "IsMaterial": {
        "type": "boolean",
        "description": "Indicates whether the impact, risk, or opportunity warrants a report (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the impact, risk, or opportunity."
      },
      "Organization": {
        "type": "string",
        "description": "The organization associated with the impact, risk, or opportunity."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "Timescale": {
        "type": "picklist",
        "description": "Specifies the timescale of the impact, risk, or opportunity."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the type of record, such as impact, risk, or opportunity."
      },
      "ValueChainSegment": {
        "type": "picklist",
        "description": "Specifies the segment of the value chain for the impact, risk, or opportunity."
      }
    },
    "module": "Net Zero Cloud"
  }
}