{
  "IndividualApplicationTask": {
    "name": "IndividualApplicationTask",
    "description": "Represents a task related to an application.",
    "properties": {
      "ApplicationStageDefinitionId": {
        "type": "reference",
        "description": "The application stage definition associated with the individual application task."
      },
      "Description": {
        "type": "string",
        "description": "Describes the details of the task to be completed."
      },
      "DueDate": {
        "type": "date",
        "description": "The date when the individual application task must be completed."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "The date and time when the individual application task ends."
      },
      "IndividualApplicationId": {
        "type": "reference",
        "description": "The individual application associated with the individual application task."
      },
      "IsRequired": {
        "type": "boolean",
        "description": "Indicates whether the individual application task is required (true) or not (false)."
      },
      "IsSubmitted": {
        "type": "boolean",
        "description": "Indicates whether the individual application task has been submitted."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "Name": {
        "type": "string",
        "description": "The name of the individual application task."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who owns the record."
      },
      "PreliminaryApplicationRefId": {
        "type": "reference",
        "description": "The parent funding award for this funding award."
      },
      "SavedApplicationUrl": {
        "type": "url",
        "description": "The URL of a saved application that's associated with the individual application task."
      },
      "SequenceNumber": {
        "type": "int",
        "description": "The sequence in which the individual application task must be performed."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "The date and time when the individual application task starts."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the individual application task."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the type of the individual application task."
      }
    },
    "module": "Public Sector Cloud"
  }
}