{
  "Individual": {
    "name": "Individual",
    "description": "Represents a customer’s data privacy and protection preferences. Data privacy records based on the Individual object store your customers’ preferences. Data privacy records are associated with related leads, contacts, person accounts, and users.",
    "properties": {
      "BirthDate": {
        "type": "date",
        "description": "The customer’s birthdate."
      },
      "CanStorePiiElsewhere": {
        "type": "boolean",
        "description": "Indication that you can store the customer’s personally identifiable information (PII) outside of their legislation area. For example, you could store an EU citizen’s PII data in the US."
      },
      "ChildrenCount": {
        "type": "int",
        "description": "The number of children the customer has."
      },
      "ConsumerCreditScore": {
        "type": "int",
        "description": "The person's credit score (for example, 740)."
      },
      "ConsumerCreditScoreProviderName": {
        "type": "string",
        "description": "The name of the company that provided the credit score."
      },
      "ConvictionsCount": {
        "type": "int",
        "description": "The number of convictions for the customer."
      },
      "DeathDate": {
        "type": "date",
        "description": "The customer’s death date."
      },
      "FirstName": {
        "type": "string",
        "description": "The customer’s first name. Maximum size is 40 characters."
      },
      "HasOptedOutGeoTracking": {
        "type": "boolean",
        "description": "Preference to not track geolocation on mobile devices."
      },
      "HasOptedOutProcessing": {
        "type": "boolean",
        "description": "Preference to not process personal data, which can include collecting, storing, and sharing personal data."
      },
      "HasOptedOutProfiling": {
        "type": "boolean",
        "description": "Preference to not process data for predicting personal attributes, such as interests, behavior, and location."
      },
      "HasOptedOutSolicit": {
        "type": "boolean",
        "description": "Preference to not solicit products and services."
      },
      "HasOptedOutTracking": {
        "type": "boolean",
        "description": "Preference to not track customer web activity and whether the customer opens email sent through Salesforce."
      },
      "IndividualsAge": {
        "type": "picklist",
        "description": "Indicates whether the customer is considered to be a minor."
      },
      "InfluencerRating": {
        "type": "int",
        "description": "A measure of the person's influence, irrespective of how we do business with them."
      },
      "IsHomeOwner": {
        "type": "boolean",
        "description": "Indicates whether the customer owns a home."
      },
      "LastName": {
        "type": "string",
        "description": "Required. The customer’s last name. Maximum size is 80 characters."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record."
      },
      "MasterRecordId": {
        "type": "reference",
        "description": "If this object was deleted as the result of a merge, this field contains the ID of the record that was kept. If this object was deleted for any other reason, or hasn’t been deleted, the value is null."
      },
      "MilitaryService": {
        "type": "picklist",
        "description": "Indicates whether the customer has served in the military."
      },
      "Name": {
        "type": "string",
        "description": "Concatenation of FirstName and LastName. Maximum size is 203 characters, including whitespaces."
      },
      "Occupation": {
        "type": "string",
        "description": "The customer’s occupation. Maximum size is 150 characters."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the owner of the account associated with this customer."
      },
      "Salutation": {
        "type": "picklist",
        "description": "The title for addressing the customer, such as Dr. or Mrs."
      },
      "SendIndividualData": {
        "type": "boolean",
        "description": "Preference to export personal data for delivery to the customer."
      },
      "ShouldForget": {
        "type": "boolean",
        "description": "Preference to delete records and personal data related to this customer."
      },
      "Website": {
        "type": "url",
        "description": "The URL for the customer’s website."
      }
    },
    "module": "Core Salesforce"
  }
}