{
  "IndicatorPerformancePeriod": {
    "name": "IndicatorPerformancePeriod",
    "description": "Represents information about a specified time period including the frequency at which indicator results should be calculated and the baseline value of the indicator.",
    "properties": {
      "BaselineDescription": {
        "type": "textarea",
        "description": "The description of the baseline value."
      },
      "BaselineValue": {
        "type": "double",
        "description": "The value of the indicator assignment at the beginning of the indicator performance period."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the indicator performance period."
      },
      "IndicatorAssignmentId": {
        "type": "reference",
        "description": "The indicator assignment that’s associated with the indicator performance period."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastResultMeasurementDate": {
        "type": "date",
        "description": "The date when the last result value was measured."
      },
      "LastResultValue": {
        "type": "double",
        "description": "The result value from the most recently measured indicator result."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view."
      },
      "Name": {
        "type": "string",
        "description": "The name of the indicator performance period."
      },
      "TargetProgress": {
        "type": "picklist",
        "description": "Specifies the progress of the target within the time period."
      },
      "TargetValue": {
        "type": "double",
        "description": "The target value of the indicator assignment within the time period."
      },
      "TimePeriodId": {
        "type": "reference",
        "description": "The time period that is associated with the indicator performance period."
      }
    },
    "module": "Health Cloud"
  }
}