{
  "InflationRate": {
    "name": "InflationRate",
    "description": "Represents the inflation rates that are used to adjust currency values from one year to another.",
    "properties": {
      "CalendarYear": {
        "type": "picklist",
        "description": "The year in which this inflation rate is valid."
      },
      "CurrencyCode": {
        "type": "picklist",
        "description": "The currency for this inflation rate record."
      },
      "DataSource": {
        "type": "string",
        "description": "The data source from where the inflation rate was obtained."
      },
      "ExternalIdentifier": {
        "type": "string",
        "description": "The external identifier for the inflation rate."
      },
      "InflationRate": {
        "type": "percent",
        "description": "The annual inflation rate that’s used to convert currency values. This rate is calculated based on the difference in the average consumer price index between the previous year and the current year."
      },
      "InflationRateUnqKeyIdentifier": {
        "type": "string",
        "description": "The unique external identifier for the inflation rate in the currency-calendar year format. This field is unique within your organization."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "ReferenceDataLoadLogId": {
        "type": "reference",
        "description": "The reference data load log record that's associated with the emissions factor."
      },
      "ShouldLockDtastUpdtForRec": {
        "type": "boolean",
        "description": "Indicates whether the inflation rate record is locked from dataset updates."
      }
    },
    "module": "Net Zero Cloud"
  }
}