{
  "InsPlcyLimitTracking": {
    "name": "InsPlcyLimitTracking",
    "description": "Represents the calculated values based on the consumption of the policy and coverage attributes during claims processing.",
    "properties": {
      "CalcInitialAmount": {
        "type": "currency",
        "description": "The calculated currency amount that's used as the base value for tracking the policy attribute consumption."
      },
      "CalcInitialValue": {
        "type": "int",
        "description": "The count that's used as the base for tracking the policy attribute consumption."
      },
      "ClaimCoverageId": {
        "type": "reference",
        "description": "The claim coverage that's associated with the insurance policy limit tracking."
      },
      "ClaimCoveragePaymentDetailId": {
        "type": "reference",
        "description": "The claim coverage payment detail that's associated with the insurance policy limit tracking."
      },
      "ClaimId": {
        "type": "reference",
        "description": "The claim that's associated with the insurance policy limit tracking."
      },
      "ClaimItemId": {
        "type": "reference",
        "description": "The claim item that's associated with the insurance policy limit tracking."
      },
      "InsPlcyLimitId": {
        "type": "reference",
        "description": "The insurance policy limit that's associated with the insurance limit tracking."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the insurance policy limit tracking."
      },
      "PostedAmount": {
        "type": "currency",
        "description": "The amount posted by the claimant when submitting the claim."
      },
      "PostedValue": {
        "type": "int",
        "description": "The count that's populated when submitting the claim."
      },
      "RemainingAmount": {
        "type": "currency",
        "description": "The remaining amount to carry forward for the next payment. It's the difference between the calculated initial amount and the requested amount."
      },
      "RemainingValue": {
        "type": "int",
        "description": "The remaining value to carry forward for the next payment. It's the difference between the calculated initial value and the requested value."
      },
      "RequestedDate": {
        "type": "date",
        "description": "The date on which the claim payment was requested."
      },
      "TotalUsedAmount": {
        "type": "currency",
        "description": "The total amount used till date."
      },
      "TotalUsedValue": {
        "type": "int",
        "description": "The total value used till date."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_insplcylimittracking.htm"
  }
}