{
  "InsPlcyLimit": {
    "name": "InsPlcyLimit",
    "description": "Represents the data that's used as a base to track the insurance policy consumption.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "The currency amount for the insurance policy or coverage attributes."
      },
      "AssociatedAttributeId": {
        "type": "reference",
        "description": "The insurance policy attribute or insurance policy coverage attribute that's associated with the insurance policy limit."
      },
      "InsurancePlcyLmtCode": {
        "type": "string",
        "description": "The unique code of the insurance policy limits across all policy versions."
      },
      "InsurancePolicyAssetId": {
        "type": "reference",
        "description": "The insurance policy asset that's associated with the insurance policy limit."
      },
      "InsurancePolicyCoverageId": {
        "type": "reference",
        "description": "The insurance policy coverage that's associated with the insurance policy limit."
      },
      "InsuredPolicyParticipantId": {
        "type": "reference",
        "description": "The insurance policy participant that's associated with the insurance policy limit."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Name of the insurance policy limit record."
      },
      "PolicyVersionId": {
        "type": "reference",
        "description": "The insurance policy version that's associated with the insurance policy limit."
      },
      "ProdtAttrMappedScopeId": {
        "type": "reference",
        "description": "The product attribute mapped scope that's associated with the insurance policy limit."
      },
      "Value": {
        "type": "int",
        "description": "The count for the insurance policy or coverage attributes."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_insplcylimit.htm"
  }
}