{
  "InsurancePolicyAsset": {
    "name": "InsurancePolicyAsset",
    "description": "Represents the customer property insured through the insurance policy.",
    "properties": {
      "AssetCode": {
        "type": "string",
        "description": "The unique code of the insurance policy asset across all the policy versions."
      },
      "AssetName": {
        "type": "string",
        "description": "The insured customer property. This field is available from API version 51.0 and later."
      },
      "CustomerPropertyId": {
        "type": "reference",
        "description": "The ID of the insured customer property."
      },
      "EffectiveFromDate": {
        "type": "date",
        "description": "The date from when the asset becomes active on the policy."
      },
      "EffectiveToDate": {
        "type": "date",
        "description": "The date after when the asset becomes inactive on the policy."
      },
      "InsurancePolicyId": {
        "type": "reference",
        "description": "The ID of the insurance policy that covers this customer property."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the insurance policy asset is active."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "An auto-generated number assigned to this record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the record owner."
      },
      "PrimaryPolicyParticipantId": {
        "type": "reference",
        "description": "The ID of the primary participant on the insurance policy. This field is available from API version 51.0 and later."
      },
      "ProductId": {
        "type": "reference",
        "description": "The product associated with the asset."
      },
      "RelatedInsurancePolicyAssetId": {
        "type": "reference",
        "description": "The related insurance policy asset id associated with the insurance policy asset. This field is available from API version 54.0 and later."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the source system this record was obtained from."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of this record in the source system."
      },
      "StandardFeeAmount": {
        "type": "currency",
        "description": "The expected fee for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "StandardPremiumAmount": {
        "type": "currency",
        "description": "The expected premium for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "StandardTaxAmount": {
        "type": "currency",
        "description": "The expected tax on the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "TermFeeAmount": {
        "type": "currency",
        "description": "The expected fee for the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TermPremiumAmount": {
        "type": "currency",
        "description": "The expected premium for the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TermTaxAmount": {
        "type": "currency",
        "description": "The expected tax on the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TotalStandardAmount": {
        "type": "currency",
        "description": "The sum of the expected premium, fee, and tax for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "TotalTermAmount": {
        "type": "currency",
        "description": "The sum of the expected premium, tax, and fee for the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_insurancepolicyasset.htm"
  }
}