{
  "InsurancePolicyCoverage": {
    "name": "InsurancePolicyCoverage",
    "description": "A junction object that associates the InsurancePolicy object with the ProductCoverage object.",
    "properties": {
      "BenefitPaymentFrequency": {
        "type": "picklist",
        "description": "The frequency of the payment if the benefit or coverage entails a recurring payout to the insured. For example, monthly, semi-monthly, quarterly, semi-annually, or annually."
      },
      "Category": {
        "type": "picklist",
        "description": "The category that the coverage belongs to. For example, benefit, clause, deductible, rider."
      },
      "CategoryCode": {
        "type": "string",
        "description": "A carrier-specific code that identifies the coverage. For example, benefit, clause, or deductible."
      },
      "CategoryGroup": {
        "type": "picklist",
        "description": "The specific category group. For example, for a liability coverage record, benefit is the category and liability is the category group."
      },
      "CategoryGroupType": {
        "type": "picklist",
        "description": "The type of the category group."
      },
      "ContractGroupPlanId": {
        "type": "reference",
        "description": "The contract group plan associated with the insurance policy coverage."
      },
      "CoverageCode": {
        "type": "string",
        "description": "The unique code of the insurance policy coverage across all the policy versions."
      },
      "CoverageName": {
        "type": "string",
        "description": "The name of the coverage."
      },
      "DeathBenefitOptionType": {
        "type": "picklist",
        "description": "The method for the payment of death benefit."
      },
      "DeductibleAmount": {
        "type": "currency",
        "description": "The deductible amount that the customer must pay."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the coverage."
      },
      "Discount": {
        "type": "currency",
        "description": "The discount that was given on the coverage or the benefit."
      },
      "EffectiveDate": {
        "type": "dateTime",
        "description": "The date from which the coverage is in effect."
      },
      "ExpirationDate": {
        "type": "dateTime",
        "description": "The date on which the coverage expires."
      },
      "IncomeOptionType": {
        "type": "picklist",
        "description": "The type of the income option given to the policy participant. For example, periodic payment is an income option type, and annuity is an income option."
      },
      "InsurancePolicyAssetId": {
        "type": "reference",
        "description": "The asset covered by this coverage."
      },
      "InsurancePolicyId": {
        "type": "reference",
        "description": "The insurance policy associated with this coverage."
      },
      "InsurancePolicyParticipantId": {
        "type": "reference",
        "description": "The insurance policy participant associated with this coverage."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "LimitAmount": {
        "type": "currency",
        "description": "The limit of the fixed coverage amount. For example, uninsured motorist coverage of USD 1000."
      },
      "LimitDate": {
        "type": "date",
        "description": "The date from which the coverage limit is in effect. For example, an annuity benefit is valid only after the insured is 60 years old."
      },
      "LimitPercentage": {
        "type": "percent",
        "description": "The percentage of the actuals covered by this coverage."
      },
      "LimitRange": {
        "type": "picklist",
        "description": "The range of the coverage limit. For example, bodily injury coverage with limits as USD 100,000 per person and USD 300,000 per accident."
      },
      "Name": {
        "type": "string",
        "description": "An auto-generated number assigned to this record."
      },
      "PremiumAmount": {
        "type": "currency",
        "description": "The premium paid by the customer for this coverage."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the source system this record was obtained from."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of this coverage record in the source system."
      },
      "StandardFeeAmount": {
        "type": "currency",
        "description": "The expected fee for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "StandardPremiumAmount": {
        "type": "currency",
        "description": "The expected premium for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "StandardTaxAmount": {
        "type": "currency",
        "description": "The expected tax on the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "TermFeeAmount": {
        "type": "currency",
        "description": "The expected fee for the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TermPremiumAmount": {
        "type": "currency",
        "description": "The expected premium for the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TermTaxAmount": {
        "type": "currency",
        "description": "The expected tax on the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TotalStandardAmount": {
        "type": "currency",
        "description": "The sum of the expected premium, fee, and tax for the policy over the policy period. This field is available from API version 51.0 and later."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_insurancepolicycoverage.htm"
  }
}