{
  "InventoryReservation": {
    "name": "InventoryReservation",
    "description": "Stores information about the status of cart inventory reservations in B2B and D2C Commerce.",
    "properties": {
      "ErrorCode": {
        "type": "string",
        "description": "The error code if the reservation isn’t successful."
      },
      "ErrorMessage": {
        "type": "textarea",
        "description": "If an error occurred, this field contains the error message."
      },
      "InventoryReservationName": {
        "type": "string",
        "description": "Name of the inventory reservation (autogenerated, for example: PIR-0033)."
      },
      "IsAsyncOperationInProgress": {
        "type": "boolean",
        "description": "Indicates if there’s an async operation in progress that could affect the reservation."
      },
      "IsSuccess": {
        "type": "boolean",
        "description": "Indicates whether the most recent inventory system operation was successful."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user could have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The user who owns the inventory reservation."
      },
      "ReservationDate": {
        "type": "dateTime",
        "description": "The timestamp when the inventory reservation was created."
      },
      "ReservationDurationInSeconds": {
        "type": "int",
        "description": "The total duration of the inventory reservation in seconds."
      },
      "ReservationIdentifier": {
        "type": "string",
        "description": "The unique identifier (text value) for the reservation."
      },
      "ReservationSourceId": {
        "type": "reference",
        "description": "The ID of the entity associated with the inventory reservation."
      }
    },
    "module": "Core Salesforce"
  }
}