{
  "InventoryCountPlan": {
    "name": "InventoryCountPlan",
    "description": "Represents a plan to count inventory at a location.",
    "properties": {
      "CountInterval": {
        "type": "int",
        "description": "The interval between the planned start dates of two consecutive assessments related to this plan. For example, if the Count Interval is 5 and the Count Interval Unit of Measure is Monthly, then the interval between the planned start dates of the assessments is five months."
      },
      "CountIntervalUnitOfMeasure": {
        "type": "picklist",
        "description": "The unit of measure of the interval between two consecutive assessments related to this plan. If you select Once, only one assessment is created."
      },
      "CountWindowDays": {
        "type": "int",
        "description": "The number of days between the planned start and end date of each assessment related to this plan. For example, if the count window days is 5, and the planned start date of an assessment in this plan is January 4, 2024 at 9:00 AM, then the planned end date of that assessment is January 9, 2024 at 9:00 AM. If you don't specify a value, then the count interval is considered as the count window."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the inventory count plan."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "The date when the inventory count is planned to end."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "LocationId": {
        "type": "reference",
        "description": "The location associated with the inventory count plan."
      },
      "Name": {
        "type": "string",
        "description": "The name of the inventory count plan."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this object."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "The date when the inventory count is planned to start."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the inventory count plan."
      }
    },
    "module": "Manufacturing Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.mfg_api_devguide.meta/mfg_api_devguide/sforce_api_objects_inventorycountplan.htm"
  }
}