{
  "InventoryCountProductItem": {
    "name": "InventoryCountProductItem",
    "description": "Represents the inventory count of a product at a location. Inventory Count Product Item is a child object of Inventory Count.",
    "properties": {
      "ActualEndDateTime": {
        "type": "dateTime",
        "description": "The planned end date for counting the product's inventory."
      },
      "ActualQuantity": {
        "type": "double",
        "description": "The actual quantity of the product's inventory."
      },
      "ActualStartDateTime": {
        "type": "dateTime",
        "description": "The actual start date for counting the product's inventory."
      },
      "AssigneeId": {
        "type": "reference",
        "description": "The person who counts the product's inventory."
      },
      "Comment": {
        "type": "textarea",
        "description": "A comment, note, or instruction that gives additional context for the count of the product's inventory."
      },
      "DiscrepancyReasonType": {
        "type": "picklist",
        "description": "Specifies the type of reason for the discrepancy in the actual quantity and the expected quantity."
      },
      "ExpectedQuantity": {
        "type": "double",
        "description": "The expected quantity of the product's inventory."
      },
      "InventoryAccuracy": {
        "type": "percent",
        "description": "The actual quantity, expressed as a percentage of the expected quantity."
      },
      "InventoryCountAssessmentId": {
        "type": "reference",
        "description": "The inventory count assessment that's associated with the inventory count product item."
      },
      "InventoryCountPlanItemId": {
        "type": "reference",
        "description": "The inventory count plan item that's associated with the inventory count product item."
      },
      "IsBlindCount": {
        "type": "boolean",
        "description": "Indicates whether the expected inventory quantity is hidden from the assignee when they count the inventory (true) or not (false)."
      },
      "IsSerializedProduct": {
        "type": "boolean",
        "description": "Indicates whether the product being counted is serialized (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "Name": {
        "type": "string",
        "description": "Name of the inventory count product item."
      },
      "PlannedEndDateTime": {
        "type": "dateTime",
        "description": "The planned end date for counting the product's inventory."
      },
      "PlannedStartDateTime": {
        "type": "dateTime",
        "description": "The planned start date for counting the product's inventory."
      },
      "Product": {
        "type": "string",
        "description": "The product that's associated with the inventory count product item."
      },
      "ProductItemId": {
        "type": "reference",
        "description": "The product item that's associated with the inventory count product item."
      },
      "QuantityUnitOfMeasure": {
        "type": "picklist",
        "description": "The unit of measure of the expected and actual quantities of the inventory count product item."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the inventory count product item."
      }
    },
    "module": "Manufacturing Cloud"
  }
}