{
  "InvoiceLine": {
    "name": "InvoiceLine",
    "description": "Represents the amount that a buyer must pay for a product, service, or fee. Invoice lines are created based on the amount of an order line.",
    "properties": {
      "AdjustmentAmount": {
        "type": "currency",
        "description": "The sum of adjustments made to the invoice line."
      },
      "AdjustmentAmountWithTax": {
        "type": "currency",
        "description": "The sum of adjustment amounts, including associated taxes related to the invoice line."
      },
      "AdjustmentTaxAmount": {
        "type": "currency",
        "description": "The sum of tax adjustments to the invoice line."
      },
      "Balance": {
        "type": "currency",
        "description": "The outstanding balance for an invoice line. This amount is equal to the invoice’s total amount with tax after deducting the payments made."
      },
      "BillingAddressId": {
        "type": "reference",
        "description": "This field is related to an InvoiceAddressGroup field containing the billing address for the invoice line. For example, one InvoiceAddressGroup field is related to the invoiceLine's BillingAddressID field, and another InvoiceAddressGroup field is related to the invoiceLine's ShippingAddressId field."
      },
      "BillingScheduleGroupId": {
        "type": "reference",
        "description": "The ID of the billing schedule group for the invoice line."
      },
      "BillingScheduleId": {
        "type": "reference",
        "description": "The ID of the billing schedule for the invoice line. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "ChargeAmount": {
        "type": "currency",
        "description": "The sum of charges made to the invoice line."
      },
      "ChargeAmountWithTax": {
        "type": "currency",
        "description": "The amount on a charge invoice line, including tax."
      },
      "ChargeConvertedNegAmount": {
        "type": "currency",
        "description": "The amount on a charge invoice line that’s converted to credit."
      },
      "ChargeTaxAmount": {
        "type": "currency",
        "description": "The tax to be applied on a charge invoice line."
      },
      "ConvertedNegAmount": {
        "type": "currency",
        "description": "The amount from an invoice line that’s converted to credit."
      },
      "CorpCurrencyCnvChargeAmt": {
        "type": "double",
        "description": "The sum of charges made to the invoice line in corporate currency. Available in API version 63.0 and later."
      },
      "CorpCurrencyCnvTotalTaxAmt": {
        "type": "double",
        "description": "The total tax amount of the invoice line in corporate currency. Available in API version 63.0 and later."
      },
      "CorporateCurrencyCvsnDate": {
        "type": "date",
        "description": "The date on which the invoice line amounts are converted to corporate currency. Available in API version 63.0 and later."
      },
      "CorporateCurrencyCvsnRate": {
        "type": "double",
        "description": "The exchange rate that's used to convert the invoice line amounts to corporate currency. Available in API version 63.0 and later."
      },
      "CorporateCurrencyIsoCode": {
        "type": "string",
        "description": "The currency ISO code of the corporate currency. Available in API version 63.0 and later."
      },
      "Description": {
        "type": "string",
        "description": "The description of the invoice line."
      },
      "GroupReferenceEntityItemId": {
        "type": "reference",
        "description": "The ID of the record that the invoice line corresponds to."
      },
      "HasMultipleItems": {
        "type": "boolean",
        "description": "Required. Indicates whether this field merges items from the same billing period (true) or not (false)."
      },
      "InvoiceId": {
        "type": "reference",
        "description": "Required. The ID of the invoice record that contains this invoice line."
      },
      "InvoiceLineEndDate": {
        "type": "date",
        "description": "Required. The end date of the billing for the service for invoice lines made from a time-based service."
      },
      "InvoiceLineStartDate": {
        "type": "date",
        "description": "Required. The first date of the billing for the service for invoice lines made from a time-based service."
      },
      "InvoiceStatus": {
        "type": "string",
        "description": "The status of the invoice line. This field is inherited from the invoice’s status."
      },
      "IsUsageBasedInvoiceLine": {
        "type": "boolean",
        "description": "Required. Indicates whether the product is usage-based (true) or not (false)."
      },
      "LegalEntityAccountingPeriodId": {
        "type": "reference",
        "description": "The ID of the legal entity accounting period record used in this invoice line."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "The ID of the legal entity record used in this invoice line."
      },
      "LineAmount": {
        "type": "currency",
        "description": "The amount of the invoice line."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the invoice line."
      },
      "NetCreditsApplied": {
        "type": "currency",
        "description": "The total credit memo line amount applied to the invoice line. This amount is calculated by subtracting the unapplied credit memo line amount from the applied credit memo line amount."
      },
      "NetPaymentsApplied": {
        "type": "currency",
        "description": "The total payment amount that’s applied to the invoice line after unapplication of payments. This amount is calculated by subtracting the unapplied payment line invoice line amount from the applied payment line invoice line amount. Available in API version 61.0 and later."
      },
      "OverageUnitOfMeasure": {
        "type": "string",
        "description": "The unit that’s used to measure the overage. For example, byte or minute. This field is available in API version 63.0 and later with Revenue Cloud Billing license."
      },
      "ParentInvoiceLineId": {
        "type": "reference",
        "description": "The ID of the parent invoice line record."
      },
      "Product2Id": {
        "type": "reference",
        "description": "The ID of the product that was charged or ordered to create the invoice line."
      },
      "Quantity": {
        "type": "double",
        "description": "The number of units of the order product that created the invoice line."
      },
      "ReferenceEntityItemId": {
        "type": "reference",
        "description": "The order item or adjustment item that created the invoice line."
      },
      "ReferenceEntityItemType": {
        "type": "picklist",
        "description": "The type of transaction that created the invoice line."
      },
      "ReferenceEntityItemTypeCode": {
        "type": "picklist",
        "description": "The type of object that created the invoice line."
      },
      "ShipFromAddressId": {
        "type": "reference",
        "description": "The shipping origin of the invoiced product. Available in API version 64.0 and later."
      },
      "ShippingAddressId": {
        "type": "reference",
        "description": "The ID of the shipping address record associated with the invoice line."
      },
      "TaxAmount": {
        "type": "currency",
        "description": "The total tax for the invoice line."
      },
      "TaxProcessingStatus": {
        "type": "picklist",
        "description": "The status of the tax processing of the invoice line."
      },
      "TaxTreatmentId": {
        "type": "reference",
        "description": "The tax treatment used on this invoice line."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of the invoice line."
      },
      "UnitOfMeasureId": {
        "type": "reference",
        "description": "The unit of measure of the product associated with the invoice line. Available in API version 63.0 and later."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "The price for one unit of the item on the invoice line."
      },
      "UsageOverageQuantity": {
        "type": "double",
        "description": "The quantity of the usage overage that’s being invoiced. This field is available in API version 63.0 and later with Revenue Cloud Billing license."
      },
      "UsageProductBillSchdGrpId": {
        "type": "reference",
        "description": "The ID of the usage-based product billing schedule group associated with the invoice line. This field is available in API version 63.0 and later with Revenue Cloud Billing license."
      },
      "UsageProductId": {
        "type": "reference",
        "description": "The ID of the usage-based product that was charged or ordered to create the invoice line. This field is available in API version 63.0 and later with Revenue Cloud Billing license."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_invoiceline.htm"
  }
}