{
  "Invoice": {
    "name": "Invoice",
    "description": "Represents a financial document describing the total amount a buyer must pay for goods or services provided.",
    "properties": {
      "Balance": {
        "type": "currency",
        "description": "The outstanding balance for this invoice. Equal to the invoice’s total amount with tax, ignoring payments and adjustments."
      },
      "BillToContactId": {
        "type": "reference",
        "description": "Inherited from the account’s Bill to Account."
      },
      "BillingAccountId": {
        "type": "reference",
        "description": "The customer account for this invoice."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "The three-letter ISO 4217 currency code associated with the invoice."
      },
      "DaysInvoiceOpen": {
        "type": "int",
        "description": "Number of days since the invoice was created before it was paid."
      },
      "DaysInvoiceOverdue": {
        "type": "int",
        "description": "Number of days since the date when payment was due."
      },
      "Description": {
        "type": "string",
        "description": "Users can add more information about this invoice. Maximum of 1,000 characters."
      },
      "DocumentNumber": {
        "type": "string",
        "description": "The system-generated number that is used to organize financial documents. The number can be sequential or random."
      },
      "DueDate": {
        "type": "date",
        "description": "The customer must pay the invoice by the due date. Unpaid invoices past the due date can be sent to collections."
      },
      "FullSettlementDate": {
        "type": "date",
        "description": "Date when the invoice is paid in full."
      },
      "InvoiceBatchRunId": {
        "type": "reference",
        "description": "Id of the invoice batch run that generated this invoice."
      },
      "InvoiceDate": {
        "type": "date",
        "description": "The date that the invoice was posted. Used with payment terms to determine the invoice’s DueDate. For example, an invoice with an InvoiceDate of 04/01 and Net 30 payment terms has a DueDate of 05/01."
      },
      "InvoiceNumber": {
        "type": "string",
        "description": "System-created unique ID for this invoice."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view. If this value is null, it's possible the user accessed this record or list view (LastReferencedDate) but didn't view it."
      },
      "NetCreditsApplied": {
        "type": "currency",
        "description": "Represents the net credits applied to an invoice. Calculated by subtracting the sum of all unapplied lines from the sum of all applied lines."
      },
      "NetPaymentsApplied": {
        "type": "currency",
        "description": "Represents net payments applied to an invoice. Calculated by subtracting the sum of unapplied payments from the sum of payments applied to the invoice."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The user who owns an invoice record."
      },
      "PaymentExclusionReason": {
        "type": "string",
        "description": "The reason for skipping creation of payment schedules and payment schedule items for the invoice. This field is only available if Commerce Subscriptions is enabled for your org. Available in API version 63.0 and later."
      },
      "PaymentTermId": {
        "type": "reference",
        "description": "ID of the payment term used on this invoice."
      },
      "PostedDate": {
        "type": "date",
        "description": "The date the invoice was posted."
      },
      "ReferenceEntityId": {
        "type": "reference",
        "description": "The ID of the order or order summary that created this invoice."
      },
      "SettlementStatus": {
        "type": "picklist",
        "description": "The state of the invoice's payment."
      },
      "ShouldExcludePayment": {
        "type": "boolean",
        "description": "Required. Indicates whether to skip creating payment schedules and payment schedule items for the invoice (true) or not (false). The default value is false. This field is only available if Commerce Subscriptions is enabled for your org. Available in API Version 63.0 and later."
      },
      "Status": {
        "type": "picklist",
        "description": "The state of the invoice."
      },
      "TaxLocaleType": {
        "type": "picklist",
        "description": "The system used to handle tax on the original Order associated with the Invoice. Gross usually applies to taxes like value-added tax (VAT), and Net usually applies to taxes like sales tax. This field is available when Order Management or B2B Commerce is enabled."
      },
      "TotalAdjustmentAmount": {
        "type": "currency",
        "description": "The sum of the invoice’s adjustment line amounts."
      },
      "TotalAdjustmentAmountWithTax": {
        "type": "currency",
        "description": "The sum of the amount fields on the invoice's adjustment-type invoice lines, including tax."
      },
      "TotalAdjustmentTaxAmount": {
        "type": "currency",
        "description": "The total amount of tax applied to the invoice line's adjustment lines."
      },
      "TotalAmount": {
        "type": "currency",
        "description": "The sum TotalAmount values on the invoice’s lines."
      },
      "TotalAmountWithTax": {
        "type": "currency",
        "description": "The sum of TotalAmountWithTax values on the invoice’s lines."
      },
      "TotalChargeAmount": {
        "type": "currency",
        "description": "The sum of the invoice’s charges."
      },
      "TotalChargeAmountWithTax": {
        "type": "currency",
        "description": "The sum of the amount fields on the invoice's charge-type invoice lines, including tax."
      },
      "TotalChargeTaxAmount": {
        "type": "currency",
        "description": "The total amount of tax applied to the invoice's charge lines."
      },
      "TotalConvertedNegAmount": {
        "type": "currency",
        "description": "The sum of all negative invoice lines that were converted to a credit memo. For example, if one negative invoice line was for -$10 and one was for -$15, the total amount that’s converted to a credit memo is -$25."
      },
      "TotalTaxAmount": {
        "type": "currency",
        "description": "The sum of TaxAmount values on the invoice lines."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_invoice.htm"
  }
}