{
  "InvoiceBatchRun": {
    "name": "InvoiceBatchRun",
    "description": "Represents a batch processing job in Subscription Management or Billing (Revenue Cloud). During an invoice batch run, all billing schedules that meet the specified criteria are processed, resulting in the generation of invoices.",
    "properties": {
      "BillingBatchSchedulerId": {
        "type": "reference",
        "description": "The ID of the related billing batch scheduler."
      },
      "Comments": {
        "type": "textarea",
        "description": "Optional user-defined information about the scheduler."
      },
      "CompletionTime": {
        "type": "dateTime",
        "description": "Timestamp when the invoice batch run finished processing."
      },
      "InvoiceBatchRunNumber": {
        "type": "string",
        "description": "System-generated sequential number."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the invoice batch run was last modified. Its UI label is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the invoice batch run was last viewed."
      },
      "OwnerId": {
        "type": "reference",
        "description": "System-generated field. The ID of the user who created the BillingBatchScheduler record. Its UI label is Owner."
      },
      "RecoveryStatus": {
        "type": "picklist",
        "description": "Indicates the state of the invoice batch run recovery process. This field is available in API version 56.0 and later."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "Timestamp when the invoice batch run started processing."
      },
      "Status": {
        "type": "picklist",
        "description": "The state of the invoice batch run."
      },
      "TotalBillSchedRecovered": {
        "type": "int",
        "description": "The number of billing schedules that were part of the recovery run that were reset to Ready for Invoicing. These billing schedules are included in the next scheduled invoice batch run."
      },
      "TotalBillSchedUnrecovered": {
        "type": "int",
        "description": "The number of billing schedules that were part of the recovery run that weren't reset to Ready for Invoicing. These billing schedules that weren’t successfully recovered must be manually reset to Ready for Invoicing so they can be processed."
      },
      "TotalBillingSchedulesFailed": {
        "type": "int",
        "description": "The total number of billing schedules that weren’t successfully processed. When a billing schedule isn’t successfully processed, then the system doesn’t generate an invoice for it. For details about errors, check the Revenue Transaction Error Log. This field is available in API version 56.0 and later."
      },
      "TotalBsSuccessfullyProcessed": {
        "type": "int",
        "description": "The total number of billing schedules for which the system was able to generate and process invoices. This field is available in API version 56.0 and later."
      },
      "TotalDraftInvoiceAmount": {
        "type": "currency",
        "description": "The sum of the invoice amounts for invoices in Draft status."
      },
      "TotalDraftInvoices": {
        "type": "int",
        "description": "The total number of invoices in Draft status generated in the batch run."
      },
      "TotalFilteredBillingSchedules": {
        "type": "int",
        "description": "The total number of billing schedules that met the invoice run scheduler’s matching criteria. The matching criteria specify which billing schedules are included in the invoice batch run. Its field label is Total Matching Billing Schedules. This field is available in API version 56.0 and later."
      },
      "TotalInvSuccessfullyProcessed": {
        "type": "int",
        "description": "The total number of invoices that were successfully processed."
      },
      "TotalInvoicedAmount": {
        "type": "currency",
        "description": "The total amount of income including taxes represented by the successfully processed invoices. This field is available in API version 56.0 and later."
      },
      "TotalInvoicesCanceled": {
        "type": "int",
        "description": "The total number of invoices that weren't processed. To find out what went wrong, check the Revenue Transaction Error Log. Fix the errors, then run the invoice batch run recovery process."
      },
      "TotalInvoicesFailed": {
        "type": "int",
        "description": "The total number of invoices that weren’t processed successfully. To find out what went wrong, check the Revenue Transaction Error Log. Then fix the errors and run the invoice batch run recovery process. This field is available in API version 56.0 and later."
      },
      "TotalInvoicesGenerated": {
        "type": "int",
        "description": "The total number of invoices that were generated from the billing schedules processed by the invoice batch run. This field is available in API version 56.0 and later."
      },
      "TotalPostedInvoices": {
        "type": "int",
        "description": "The total number of invoices in Posted status generated during the batch run."
      },
      "TotBillSchdUpdtDurDrftToPost": {
        "type": "int",
        "description": "The total billing schedules updated during the draft to posted run."
      }
    },
    "module": "Core Salesforce"
  }
}