{
  "InvoiceLineTax": {
    "name": "InvoiceLineTax",
    "description": "Represents tax information of an invoice line of type Tax.",
    "properties": {
      "BillingAddressId": {
        "type": "reference",
        "description": "The billing address of the parent invoice line. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "ConvertedNegAmount": {
        "type": "currency",
        "description": "The amount from the parent invoice line that's converted to credit. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "CorpCrcyCnvTaxAmount": {
        "type": "double",
        "description": "The total tax amount of the invoice line tax in corporate currency. Available in API version 63.0 and later."
      },
      "CorporateCurrencyCvsnDate": {
        "type": "date",
        "description": "The date on which the invoice line tax amounts are converted to the corporate currency. Available in API version 63.0 and later."
      },
      "CorporateCurrencyCvsnRate": {
        "type": "double",
        "description": "The exchange rate that's used to convert the invoice line tax amounts to the corporate currency. Available in API version 63.0 and later."
      },
      "CorporateCurrencyIsoCode": {
        "type": "string",
        "description": "The currency ISO code of the corporate currency. Available in API version 63.0 and later."
      },
      "Description": {
        "type": "string",
        "description": "Additional details about the invoice line tax."
      },
      "EndDate": {
        "type": "date",
        "description": "Required. The end date of an invoice line tax."
      },
      "InvoiceLineId": {
        "type": "reference",
        "description": "Required. The ID of the parent charge or adjustment invoice line record that an invoice line tax is related to."
      },
      "InvoiceLineTaxNumber": {
        "type": "string",
        "description": "Required. An auto-generated number identifying an invoice line tax."
      },
      "LegalEntityAccountingPeriodId": {
        "type": "reference",
        "description": "The ID of the legal entity accounting period record that's related to an invoice line tax."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "The ID of the legal entity that's related to an invoice line tax."
      },
      "Product2Id": {
        "type": "reference",
        "description": "The product that was charged or ordered to create the parent invoice line. Available in API version 62.0 only."
      },
      "Quantity": {
        "type": "double",
        "description": "The number of units of the order product that created the parent invoice line. Available in API version 62.0 only."
      },
      "ShipFromAddressId": {
        "type": "reference",
        "description": "The ship from address specified in the parent invoice line. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice. Available in API version 64.0 and later."
      },
      "ShippingAddressId": {
        "type": "reference",
        "description": "The ID of the shipping address record of the parent invoice line. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "StartDate": {
        "type": "date",
        "description": "Required. The start date of an invoice line tax."
      },
      "TaxAmount": {
        "type": "currency",
        "description": "The total amount of an invoice line tax. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice. Available in API version 65.0 and later."
      },
      "TaxCode": {
        "type": "string",
        "description": "The code that's used to calculate the tax rate for the parent invoice line. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "TaxDocumentNumber": {
        "type": "string",
        "description": "The number of the latest record in the external tax engine in which the parent invoice line is included. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "TaxEffectiveDate": {
        "type": "date",
        "description": "The date used to calculate the tax amount. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "TaxExemptAmount": {
        "type": "currency",
        "description": "The amount that's exempted from tax. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "TaxName": {
        "type": "string",
        "description": "The user-defined name for an invoice line tax. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "TaxProcessingStatus": {
        "type": "picklist",
        "description": "The processing status of the invoice line tax."
      },
      "TaxRate": {
        "type": "percent",
        "description": "The percentage of the order product price that's used to calculate tax. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "TaxTransactionNumber": {
        "type": "string",
        "description": "The number of the transaction in the external tax engine that calculated tax for the parent invoice line."
      },
      "TaxTreatmentId": {
        "type": "reference",
        "description": "The ID of the tax treatment record that's related to an invoice line tax. Edit access is enabled for this field. You must not modify this field when the invoice line is related to a posted invoice."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "The price per unit of the order product that's related to an invoice line tax. Available in API version 62.0 only."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_invoicelinetax.htm"
  }
}