{
  "Invoice": {
    "name": "Invoice",
    "description": "Represents information about a financial document describing the total amount a buyer must pay for provided products or services.",
    "properties": {
      "Balance": {
        "type": "currency",
        "description": "The outstanding balance of an invoice. The balance is equal to the invoice’s total amount with tax, excluding payments and adjustments."
      },
      "BalanceValue": {
        "type": "double",
        "description": "The balance value is derived from an existing balance field in an invoice. Available in API version 65.0 and later."
      },
      "BillToContactId": {
        "type": "reference",
        "description": "The bill to contact ID of the account that's related to an invoice."
      },
      "BillingAccountId": {
        "type": "reference",
        "description": "Required. The ID of the customer account related to an invoice."
      },
      "CorpCrcyCnvTotAmtWithTax": {
        "type": "double",
        "description": "The sum of the total amount with tax on the related invoice lines in corporate currency. Available in API version 63.0 and later."
      },
      "CorporateCurrencyCvsnDate": {
        "type": "date",
        "description": "The date on which the invoice's total amount with tax was converted to the corporate currency. Available in API version 63.0 and later."
      },
      "CorporateCurrencyCvsnRate": {
        "type": "double",
        "description": "The exchange rate that's used to convert invoice's total amount with tax to the corporate currency. Available in API version 63.0 and later."
      },
      "CorporateCurrencyIsoCode": {
        "type": "string",
        "description": "The currency ISO code of the corporate currency. Available in API version 63.0 and later."
      },
      "DaysInvoiceOpen": {
        "type": "int",
        "description": "The number of days from the day an invoice was created to the day it was paid."
      },
      "DaysInvoiceOverdue": {
        "type": "int",
        "description": "The number of days since the date when the payment for an invoice was due."
      },
      "Description": {
        "type": "string",
        "description": "Additional details about the invoice."
      },
      "DocumentNumber": {
        "type": "string",
        "description": "Required. An auto-generated number identifying an invoice."
      },
      "DueDate": {
        "type": "date",
        "description": "Required. The date by when the customer must pay an invoice."
      },
      "FullSettlementDate": {
        "type": "date",
        "description": "The date when the customer has paid an invoice in full."
      },
      "InvBatchDraftToPostedRunId": {
        "type": "reference",
        "description": "The ID of the invoice batch to posted run record that generated a posted invoice from a draft invoice."
      },
      "InvoiceBatchRunId": {
        "type": "reference",
        "description": "The ID of the invoice batch run record that generated an invoice."
      },
      "InvoiceDate": {
        "type": "date",
        "description": "Required. The date when an invoice was posted. The payment term's net is added to this date to calculate the invoice's due date. For example, an invoice with an invoice date of 04/01 and the related payment term's period as 30 days has a due date of 05/01."
      },
      "InvoiceLockedDateTime": {
        "type": "dateTime",
        "description": "The date and time at which an invoice is locked."
      },
      "InvoiceNumber": {
        "type": "string",
        "description": "Required. The user-specified reference number for the invoice."
      },
      "IsBillingScheduleGroupSkipped": {
        "type": "boolean",
        "description": "Indicates whether the invoice is generated from a billing transaction directly and if the billing schedule group wasn't created for the transaction (true), or if the invoice is generated from the billing schedule group that was created for the transaction (false)."
      },
      "IsInvoiceLocked": {
        "type": "boolean",
        "description": "Required. Indicates whether an invoice is locked for editing or not (true) or not (false)."
      },
      "LastEmailDispatchStatus": {
        "type": "picklist",
        "description": "Indicates the dispatch status of the last email that was sent for the invoice. Available in API version 65.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed an invoice record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed an invoice record. If this value is null, it’s possible that the user only accessed the invoice record or a related list view (LastReferencedDate), but not viewed the invoice record itself."
      },
      "LegalEntityAccountingPeriodId": {
        "type": "reference",
        "description": "The legal entity accounting period record that’s related to the invoice. Available in API version 65.0 and later."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "The legal entity used in this invoice. Available in API version 65.0 and later."
      },
      "NetCreditsApplied": {
        "type": "currency",
        "description": "The net credits applied to an invoice. This amount is calculated by subtracting the sum of all the unapplied lines from the sum of all the applied lines."
      },
      "NetPaymentsApplied": {
        "type": "currency",
        "description": "The net payments applied to an invoice. This field is visible from API version 62.0 but can only be used from API version 64.0 and later with the Revenue Cloud Billing license."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Required. The ID of the user who owns an Invoice record."
      },
      "PaymentExclusionReason": {
        "type": "string",
        "description": "The reason for skipping the creation of payment schedules and payment schedule items for the invoice. Available in API version 64.0 and later with the Revenue Cloud Billing license."
      },
      "PaymentTermId": {
        "type": "reference",
        "description": "The payment term used for an invoice."
      },
      "PostedDate": {
        "type": "date",
        "description": "The date when an invoice was posted."
      },
      "ReferenceEntityId": {
        "type": "reference",
        "description": "The ID of the Order record or Credit Memo record that created an invoice."
      },
      "SavedPaymentMethodId": {
        "type": "reference",
        "description": "The ID of the Saved Payment Method record that's used for the invoice. Available in API version 64.0 and later with the Revenue Cloud Billing license."
      },
      "SequencePolicyId": {
        "type": "reference",
        "description": "The sequence policy associated with the invoice. Available in API version 65.0 and later."
      },
      "SettlementLevel": {
        "type": "picklist",
        "description": "The level at which the credit was applied."
      },
      "SettlementStatus": {
        "type": "picklist",
        "description": "The status of an invoice's payment."
      },
      "ShouldExcludePayment": {
        "type": "boolean",
        "description": "Indicates whether to skip creating payment schedules and payment schedule items for the invoice (true). Available in API version 64.0 and later with the Revenue Cloud Billing license."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of an invoice."
      },
      "TotalAdjustmentAmount": {
        "type": "currency",
        "description": "The sum of the invoice’s adjustment line amounts."
      },
      "TotalAdjustmentAmountWithTax": {
        "type": "currency",
        "description": "The sum of the invoice’s adjustment line amounts, including tax."
      },
      "TotalAdjustmentTaxAmount": {
        "type": "currency",
        "description": "The total amount of tax applied to the invoice line's adjustment lines."
      },
      "TotalAmount": {
        "type": "currency",
        "description": "The sum of the total amount on the invoice’s lines."
      },
      "TotalAmountWithTax": {
        "type": "currency",
        "description": "The sum of the total amount with tax on the invoice’s lines."
      },
      "TotalChargeAmount": {
        "type": "currency",
        "description": "The sum of the amount fields on the invoice's charge-type invoice lines."
      },
      "TotalChargeAmountWithTax": {
        "type": "currency",
        "description": "The sum of the amount fields on the invoice's charge-type invoice lines, including tax."
      },
      "TotalChargeTaxAmount": {
        "type": "currency",
        "description": "The total amount of tax applied to the invoice's charge lines."
      },
      "TotalConvertedNegAmount": {
        "type": "currency",
        "description": "The sum of all negative invoice lines that were converted to a credit memo. For example, if one negative invoice line was for -$10 and one was for -$15, the total amount that’s converted to a credit memo is -$25."
      },
      "TotalTaxAmount": {
        "type": "currency",
        "description": "The sum of the tax amount on the invoice lines."
      },
      "UniqueIdentifier": {
        "type": "string",
        "description": "The unique identifier of an externally ingested invoice that's used to ensure that duplicate invoices aren't inserted. Available in API version 63.0 and later."
      },
      "WriteOffStatus": {
        "type": "picklist",
        "description": "The status of the invoice write-off request."
      },
      "WriteOffTotalChargeAmount": {
        "type": "currency",
        "description": "The total charge amount of the invoice that's written off."
      },
      "WriteOffTotalTaxAmount": {
        "type": "currency",
        "description": "The total tax amount of the invoice that's written off."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_invoice.htm"
  }
}