{
  "VisitedPartyFeed": {
    "name": "VisitedPartyFeed",
    "description": "This object represents the posts and feed-tracked changes of the VisitedParty object.",
    "properties": {
      "BestCommentId": {
        "type": "reference",
        "description": "The ID of the comment marked as best answer on a question post."
      },
      "Body": {
        "type": "textarea",
        "description": "The body of the post. Required when Type is TextPost. Optional when Type is ContentPost or LinkPost."
      },
      "CommentCount": {
        "type": "int",
        "description": "The number of comments associated with this feed item."
      },
      "InsertedById": {
        "type": "reference",
        "description": "ID of the user who added this item to the feed. For example, if an application migrates posts and comments from another application into a feed, the InsertedBy value is set to the ID of the context user."
      },
      "IsRichText": {
        "type": "boolean",
        "description": "Indicates whether the feed item Body contains rich text. Set IsRichText to true if you post a rich text feed item via SOAP API. Otherwise, the post is rendered as plain text.Rich text supports the following HTML tags: <p> Tip Though the <br> tag isn’t supported, you can use <p>&nbsp;</p> to create lines. <a> <b> <code> <i> <u> <s> <ul> <ol> <li> <img>The <img> tag is accessible only via the API and must reference files in Salesforce similar to this example: <img src=\"sfdc://069B0000000omjh\"></img>"
      },
      "LikeCount": {
        "type": "int",
        "description": "The number of likes associated with this feed item."
      },
      "LinkUrl": {
        "type": "url",
        "description": "The URL of a LinkPost."
      },
      "NetworkScope": {
        "type": "picklist",
        "description": "Specifies whether this feed item is available in the default Experience Cloud site, a specific Experience Cloud site, or all sites. This field is available in API version 26.0 and later, if digital experiences is enabled for your org. NetworkScope can have the following values: NetworkId—The ID of the Experience Cloud site in which the FeedItem is available. If left empty, the feed item is only available in the default Experience Cloud site. AllNetworks—The feed item is available in all Experience Cloud sites. Note the following exceptions for NetworkScope: Only feed items with a Group or User parent can set a NetworkId or a null value for NetworkScope. For feed items with a record parent, users can set NetworkScope only to AllNetworks. You can’t filter a feed item on the NetworkScope field."
      },
      "ParentId": {
        "type": "reference",
        "description": "ID of the record that is tracked in the feed. The detail page for the record displays the feed."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "ID of the ContentVersion record associated with a ContentPost. This field is null for all posts except ContentPost."
      },
      "Title": {
        "type": "string",
        "description": "The title of the feed item. When the Type is LinkPost, the LinkUrl is the URL and this field is the link name."
      },
      "Type": {
        "type": "picklist",
        "description": ""
      },
      "Visibility": {
        "type": "picklist",
        "description": "Specifies whether this feed item is available to all users or internal users only. This field is available if Salesforce Communities are enabled for your organization. Visibility can have the following values: AllUsers—The feed item is available to all users who have permission to see the feed item. InternalUsers—The feed item is available to internal users only. Note the following exceptions for Visibility: For record posts, Visibility is set to InternalUsers for all internal users by default. External users can set Visibility only to AllUsers. On user and group posts, only internal users can set Visibility to InternalUsers."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/sforce_api_objects_visitedpartyfeed.htm",
    "clouds": [
      "Health Cloud"
    ]
  }
}