{
  "VoiceCallMetrics": {
    "name": "VoiceCallMetrics",
    "description": "Represents metrics for a VoiceCall lifecycle event, aggregated daily.",
    "properties": {
      "AverageSCVCallDuration": {
        "type": "double",
        "description": "The average call duration, measured in minutes, for a given day."
      },
      "AvgMessagesPerCall": {
        "type": "int",
        "description": "The average number of transcription messages per call for a given day."
      },
      "InboundCallsAgentsConnected": {
        "type": "int",
        "description": "The number of inbound calls where agents connect with callers for a given day."
      },
      "MaxMessagesPerCall": {
        "type": "int",
        "description": "The number of transcription messages for the call with the highest number of said messages for a given day."
      },
      "MaxSCVCallDuration": {
        "type": "double",
        "description": "The longest call duration, measured in minutes, for a given day."
      },
      "MetricsDate": {
        "type": "date",
        "description": "The date and time (in UTC) when the metric was gathered. For example, daily metrics jobs run at 12am local instance time (not UTC)."
      },
      "NumACWInitiated": {
        "type": "int",
        "description": "The number of calls where After Conversation Work (ACW) is initiated for a given day."
      },
      "NumCallbackCallsCtrCompleted": {
        "type": "int",
        "description": "The number of callback calls where interactive voice response (IVR) data is fully and completely captured from a telephony provider for a given day."
      },
      "NumInboundCallsCtrCompleted": {
        "type": "int",
        "description": "The number of inbound calls where interactive voice response (IVR) data is fully and completely captured from a telephony provider for a given day."
      },
      "NumInboundIVRAbandonCalls": {
        "type": "int",
        "description": "The number of inbound calls where callers disconnected while waiting in the interactive voice response (IVR) system for a given day."
      },
      "NumInboundQueueAbandonCalls": {
        "type": "int",
        "description": "The number of inbound calls where callers disconnected while waiting in the queue for a given day."
      },
      "NumOutboundCallsCtrCompleted": {
        "type": "int",
        "description": "The number of outbound calls where interactive voice response (IVR) data is fully and completely captured from a telephony provider for a given day."
      },
      "NumRecordedCalls": {
        "type": "int",
        "description": "The number of calls where the conversation between an agent and caller is recorded for a given day."
      },
      "NumSCVCallbackCalls": {
        "type": "int",
        "description": "The number of callback calls for a given day."
      },
      "NumSCVInboundCalls": {
        "type": "int",
        "description": "The number of inbound calls for a given day."
      },
      "NumSCVOutboundCalls": {
        "type": "int",
        "description": "The number of outbound calls for a given day."
      },
      "NumSCVTransferCalls": {
        "type": "int",
        "description": "The number of transfer calls for a given day."
      },
      "NumTransferCallsCtrCompleted": {
        "type": "int",
        "description": "The number of transfer calls where interactive voice response (IVR) data is fully and completely captured from a telephony provider for a given day."
      },
      "OutboundCallsAgentsConnected": {
        "type": "int",
        "description": "The number of outbound calls where an agent is connected with a caller for a given day."
      },
      "TotalACWInboundMinutes": {
        "type": "double",
        "description": "The total number of minutes agents spent in After Conversation Work (ACW) for inbound calls for a given day."
      },
      "TotalACWOutboundMinutes": {
        "type": "double",
        "description": "The total number of minutes agents spent in After Conversation Work (ACW) for outbound calls for a given day."
      },
      "TotalAgentInboundMinutes": {
        "type": "double",
        "description": "The total number of minutes agents spent talking to callers on inbound calls for a given day."
      },
      "TotalHoldDurationMinutes": {
        "type": "double",
        "description": "The number of minutes callers were put on hold for a given day."
      },
      "TotalIVRInboundMinutes": {
        "type": "double",
        "description": "The total number of minutes callers spent in the IVR system on inbound calls for a given day."
      },
      "TotalMessages": {
        "type": "int",
        "description": "The total number of transcription messages for a given day."
      },
      "TotalOutboundMinutes": {
        "type": "double",
        "description": "The total number of minutes agents spent talking to callers on outbound calls for a given day."
      },
      "TotalQueueInboundMinutes": {
        "type": "double",
        "description": "For inbound calls, the total number of minutes callers spent in the queue waiting for a given day."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_voicecallmetrics.htm"
  }
}