{
  "SandboxInfo": {
    "name": "SandboxInfo",
    "description": "Represents a sandbox.",
    "properties": {
      "ActivationUserGroupId": {
        "type": "reference",
        "description": "A reference to the ID of the public group consisting of users who can access the sandbox. The user who created the sandbox is added to the group by default."
      },
      "ApexClassId": {
        "type": "reference",
        "description": "A reference to the ID of an Apex class that runs after each copy of the sandbox. Allows you to perform business logic on the sandbox to prepare it for use."
      },
      "AutoActivate": {
        "type": "boolean",
        "description": "If true, you can activate a sandbox refresh immediately."
      },
      "CopyArchivedActivities": {
        "type": "boolean",
        "description": "If true, archived activity data is copied to the sandbox."
      },
      "CopyChatter": {
        "type": "boolean",
        "description": "If true, archived Chatter data is copied to the sandbox."
      },
      "Description": {
        "type": "string",
        "description": "A description of the sandbox, which helps you distinguish it from other sandboxes."
      },
      "Features": {
        "type": "textarea",
        "description": "The add-on features to apply when creating or refreshing the sandbox."
      },
      "HistoryDays": {
        "type": "int",
        "description": "Represents the number of days of object history to be copied in the sandbox."
      },
      "LicenseType": {
        "type": "picklist",
        "description": "Represents the sandbox license type. Valid values: DEVELOPER DEVELOPER_PRO PARTIAL FULL"
      },
      "SandboxName": {
        "type": "string",
        "description": "Name of the sandbox."
      },
      "SourceId": {
        "type": "reference",
        "description": "A reference to the ID of a SandboxInfo that serves as the source org for a cloned sandbox."
      },
      "TemplateId": {
        "type": "reference",
        "description": "A reference to the PartitionLevelScheme that represents the sandbox template associated with this sandbox. A sandbox template lets you select which objects to copy in a sandbox."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_sandboxinfo.htm"
  }
}