{
  "SavedPaymentMethod": {
    "name": "SavedPaymentMethod",
    "description": "Represents a payment method saved by an authenticated customer.",
    "properties": {
      "AccountHolderEmail": {
        "type": "string",
        "description": "Email address of the payment method holder."
      },
      "AccountHolderName": {
        "type": "string",
        "description": "Full name of the payment method holder."
      },
      "BankAccountHolderType": {
        "type": "picklist",
        "description": "Determines whether the bank account is held by a business or an individual."
      },
      "BankAccountType": {
        "type": "string",
        "description": "Characterizes the bank account, such as a checking or savings account."
      },
      "BankCode": {
        "type": "string",
        "description": "Code that represents the bank who issued the payment method."
      },
      "BankName": {
        "type": "string",
        "description": "Name of the bank that issued the payment method."
      },
      "BillingAddress": {
        "type": "address",
        "description": "The billing address of the account holder of the payment method. This is the compound form of the billing address. Read-only. For details on compound address fields, see Address Compound Fields."
      },
      "BillingCity": {
        "type": "string",
        "description": "Details for the billing address. Maximum size is 40 characters."
      },
      "BillingCountry": {
        "type": "string",
        "description": "Details for the billing address. Maximum size is 80 characters."
      },
      "BillingGeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the billing address. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "BillingLatitude": {
        "type": "double",
        "description": "Used with BillingLongitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "BillingLongitude": {
        "type": "double",
        "description": "Used with BillingLatitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "BillingPostalCode": {
        "type": "string",
        "description": "Details for the billing address. Maximum size is 20 characters."
      },
      "BillingState": {
        "type": "string",
        "description": "Details for the billing address. Maximum size is 80 characters."
      },
      "BillingStreet": {
        "type": "textarea",
        "description": "Details for the billing address."
      },
      "ExpiryMonth": {
        "type": "int",
        "description": "Month the payment method expires."
      },
      "ExpiryYear": {
        "type": "int",
        "description": "Year the payment method expires."
      },
      "GatewayReference": {
        "type": "string",
        "description": "A reference to the saved payment owner at the payment gateway. For example, a Stripe customer ID."
      },
      "GatewayToken": {
        "type": "encryptedstring",
        "description": "Unencrypted unique token ID generated by the payment gateway to represent the card payment method during transactions. GatewayToken is for use with APIs earlier than version 52.0. For version 53.0 and latter, use the GatewayTokenEncrypted field. To secure the token, use the GatewayTokenEncrypted field."
      },
      "IsDefault": {
        "type": "boolean",
        "description": "Customer’s default payment method."
      },
      "IsMerchantCreated": {
        "type": "boolean",
        "description": "Indicates whether the merchant saved the payment method on behalf of the payer. The Payer must provide consent to the merchant to save this information."
      },
      "IsSharedWithinSameAccount": {
        "type": "boolean",
        "description": "Indicates whether the saved payment method is visible to all contacts in an account (true) or only to the contact who created it (false). The default value is false."
      },
      "Issuer": {
        "type": "string",
        "description": "Financial institution issuing the payment method."
      },
      "Last4": {
        "type": "string",
        "description": "Last four digits of the payment method account number."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record or list view related to this record, but didn’t access it directly."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it's possible the user referenced this record but didn’t view it directly."
      },
      "MerchantAccountId": {
        "type": "reference",
        "description": "Identifies the Salesforce Payments Merchant Account."
      },
      "Name": {
        "type": "string",
        "description": "Name of the saved payment method."
      },
      "Network": {
        "type": "string",
        "description": "Saved payment method card network, for example Visa or Union Pay."
      },
      "Nickname": {
        "type": "string",
        "description": "Additional name or label to easily identify the payment method."
      },
      "PaymentGatewayId": {
        "type": "reference",
        "description": "The payment gateway that is used to create a gateway token. For transactions with a saved payment method in Salesforce, this field stores the payment gateway ID used in the transaction. This field is a relationship field."
      },
      "ReferenceOwnerId": {
        "type": "reference",
        "description": "ID of the Account or Contact record that owns the payment method."
      },
      "StandardEntryClassCode": {
        "type": "picklist",
        "description": "A three-letter code that indicates how a customer or a business initiated and authorized an ACH payment."
      },
      "Status": {
        "type": "picklist",
        "description": "Status of the saved payment method."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of saved payment method."
      },
      "UsageType": {
        "type": "picklist",
        "description": "Indicates if the payment method is used on or off session."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_savedpaymentmethod.htm",
    "clouds": [
      "Core Salesforce"
    ]
  }
}