{
  "SchedulingObjective": {
    "name": "SchedulingObjective",
    "description": "Represents scheduling objective settings for Workforce Engagement.",
    "properties": {
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Record Type Name. This field is automatically generated, but you can supply your own value if you create the record using the API. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow while Salesforce generates one for each record."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated metadata type in Metadata API. The full name can include a namespace prefix."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the scheduling objective."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label for the scheduling objective. In the UI, this field is Scheduling Objective."
      },
      "Metadata": {
        "type": "mns:SchedulingObjective",
        "description": "The scheduling objective’s metadata."
      },
      "SchedulingCategory": {
        "type": "picklist",
        "description": "What the scheduling logic applies the objective to."
      },
      "SchedulingObjectiveType": {
        "type": "picklist",
        "description": "Specifies the type of scheduling objective."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_schedulingobjective.htm"
  }
}