{
  "SecurityHealthCheckRisks": {
    "name": "SecurityHealthCheckRisks",
    "description": "",
    "properties": {
      "DurableId": {
        "type": "string",
        "description": "Unique identifier for the field. Always retrieve this value before using it, as the value isn’t guaranteed to stay the same from one release to the next. To simplify queries, use this field."
      },
      "OrgValue": {
        "type": "string",
        "description": "The org’s value for the security setting."
      },
      "OrgValueRaw": {
        "type": "string",
        "description": "The org’s value for the security setting as it is stored in the database, usually without units of measure or extra text. For example, if the Minimum Password Length setting’s OrgValue is 8 characters, the OrgValueRaw is 8."
      },
      "RiskType": {
        "type": "picklist",
        "description": "The level of risk of the org’s security setting value. Valid values are: HIGH_RISK MEDIUM_RISK MEETS_STANDARD"
      },
      "SecurityHealthCheckId": {
        "type": "string",
        "description": "The ID of the Health Check score record associated with this field."
      },
      "Setting": {
        "type": "string",
        "description": "The name of the security setting. For example, Minimum password length."
      },
      "SettingGroup": {
        "type": "string",
        "description": "The name of the security setting group in which the setting resides in the Setup tree. For example, Password Policies."
      },
      "SettingRiskCategory": {
        "type": "picklist",
        "description": "The level of risk of the org’s security settings. Available in version 40.0 and later. Valid values are:"
      },
      "StandardValue": {
        "type": "string",
        "description": "Salesforce-recommended standard value for the security setting."
      },
      "StandardValueRaw": {
        "type": "string",
        "description": "Salesforce-recommended standard value for the security setting as it is stored in the database, usually without units of measure or extra text. For example, if the Minimum Password Length setting’s StandardValue is 8 characters, the StandardValueRaw is 8."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_securityhealthcheckrisks.htm"
  }
}