{
  "SelfServiceUser": {
    "name": "SelfServiceUser",
    "description": "Represents a Contact who has been enabled to use your organization’s Self-Service portal, where he or she can obtain online support.",
    "properties": {
      "ContactId": {
        "type": "reference",
        "description": "Required. All Self-Service users must be associated with a Contact. The contact’s email should match the Self-Service user email. The contact must have a value in the AccountId field or an error occurs."
      },
      "Email": {
        "type": "email",
        "description": "Required. Make this the same as the email address for the Contact associated with this SelfServiceUser. Password resets and other system communication will be sent to this email address."
      },
      "FirstName": {
        "type": "string",
        "description": "First name of the Self-Service user."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the Self-Service user is allowed to log in to the Self-Service portal (true) or not (false). Note that there is no way to delete a Self-Service user. They can only be marked as inactive."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "LanguageLocaleKey": {
        "type": "picklist",
        "description": "Required. This is a restricted picklist field. It is the primary language for the user. All on-screen text in the Self-Service portal is displayed in this language."
      },
      "LastLoginDate": {
        "type": "dateTime",
        "description": "The date and time when the Self-Service user last logged in."
      },
      "LastName": {
        "type": "string",
        "description": "Required. Last name of the Self-Service user."
      },
      "LocaleSidKey": {
        "type": "picklist",
        "description": "Required. This is a restricted picklist field. The value of this field affects the formatting and parsing of values, especially numeric values, in the Self-Service portal. Values are two-letter codes that indicate language and sometimes language and country. The codes are based on ISO standards."
      },
      "Name": {
        "type": "string",
        "description": "Concatenation of FirstName and LastName. Limited to 203 characters, including whitespaces."
      },
      "SuperUser": {
        "type": "boolean",
        "description": "Indicates whether this Self-Service user is a super user with additional access on his or her company's Self-Service portal (true) or not (false)."
      },
      "TimeZoneSidKey": {
        "type": "picklist",
        "description": "Required. This is a restricted picklist field. The time zone of a affects the offset used when displaying or entering times in the Self-Service portal."
      },
      "Username": {
        "type": "string",
        "description": "Required. This contains the name that a Self-Service user enters to log into the Self-Service portal. Value must be unique in your organization. If you try to create or update a user with a duplicate value, the operation is rejected and an error is returned."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_selfserviceuser.htm"
  }
}