{
  "SeqPolicySelectionCondition": {
    "name": "SeqPolicySelectionCondition",
    "description": "Represents the condition used to determine which sequence policy is applied to a record.",
    "properties": {
      "ConditionNumber": {
        "type": "int",
        "description": "Required. A unique number that’s assigned to a condition in a sequence policy."
      },
      "FilterField": {
        "type": "string",
        "description": "Required. The field used in the filter condition."
      },
      "FilterFieldType": {
        "type": "picklist",
        "description": "The data type of the filter field."
      },
      "FilterValue": {
        "type": "string",
        "description": "Required. The value in the filter condition."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a sequence policy selection condition record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a sequence policy selection condition record. If this value is null, it’s possible that the user only accessed the sequence policy selection condition record or a related list view (LastReferencedDate), but not viewed the sequence policy selection condition record itself."
      },
      "Operator": {
        "type": "picklist",
        "description": "Required. The relational operator used to compare the filter field with the filter value."
      },
      "SequencePolicyId": {
        "type": "reference",
        "description": "Required. The parent sequence policy associated with the sequence policy selection condition. Deleting a sequencing policy automatically removes all its associated criteria."
      },
      "SequencePolicySelectionConditionName": {
        "type": "string",
        "description": "Required. The name of the sequence policy selection condition."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_seqpolicyselectioncondition.htm",
    "accessRules": "the Billing Admin permission set to access this object",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}