{
  "ShiftWorkTopic": {
    "name": "ShiftWorkTopic",
    "description": "Represents the relationship between a Shift object and a Work Type or Work Type Group object for Salesforce Scheduler.",
    "properties": {
      "AreAllTopicsSupported": {
        "type": "boolean",
        "description": "Indicates whether the shift supports all work type or work type groups (true) or not (false)."
      },
      "AttendeeLimit": {
        "type": "int",
        "description": "The maximum number of attendees for a group service appointment in a shift. This field is considered when the appointment mode is Group. Available in API version 61.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that the current user last viewed a record related to this object."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this object."
      },
      "MaxAppointments": {
        "type": "int",
        "description": "The maximum number of appointments allowed for each time slot for a shift. This field is considered when WorkTypeId or WorkTypeGroupId is provided. This field is available in API version 60.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "The name of this shift-work topic relationship."
      },
      "ShiftId": {
        "type": "reference",
        "description": "The ID of the shift that’s related to the work type indicated in the WorkTypeId field or the work type group indicated in the WorkTypeGroupId field."
      },
      "WorkTypeGroupId": {
        "type": "reference",
        "description": "The ID of the work type group that’s related to the shift indicated in the ShiftId field."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The ID of the work type that’s related to the shift indicated in the ShiftId field."
      }
    },
    "module": "Scheduler",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.salesforce_scheduler_developer_guide.meta/salesforce_scheduler_developer_guide/sforce_api_objects_shiftworktopic.htm"
  }
}