{
  "ShippingCarrierMethod": {
    "name": "ShippingCarrierMethod",
    "description": "Shipping service provided by a shipping carrier. Examples include Ground, 2Day, and NextDay. Service depends on the range of transit times available for each carrier.",
    "properties": {
      "ExternalReference": {
        "type": "string",
        "description": "Unique code, reference, or identifier for the shipping carrier associated with the delivery. Can be used for internal tracking or integration purposes."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the record was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date the record was last viewed."
      },
      "MaxTransitTime": {
        "type": "integer",
        "description": "Maximum amount of time required for the carrier to transport and deliver an order. Measured in a specific unit, such as days, hours, or weeks."
      },
      "MinTransitTime": {
        "type": "integer",
        "description": "Minimum amount of time required for the carrier to transport and deliver an order. Measured in a specific unit, such as days, hours, or weeks."
      },
      "Name": {
        "type": "string",
        "description": "Name of the shipping carrier associated with the delivery."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who currently owns this ShippingCarrierMethod object. Default value is the user logged in to the API to perform the create."
      },
      "ShippingCarrierId": {
        "type": "reference",
        "description": "Id of the company or service responsible for transporting and delivering the order to the customer."
      },
      "TransitTimeUnit": {
        "type": "picklist",
        "description": "Unit of measurement used for transit time. Specifies the time interval in which the minimum and maximum transit times are expressed."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_shippingcarriermethod.htm"
  }
}