{
  "StandardAction": {
    "name": "StandardAction",
    "description": "Represents the buttons, links, and actions (standard actions) for a standard or custom object. This object is available in API version 34.0 and later.",
    "properties": {
      "ContentType": {
        "type": "string",
        "description": "Indicates whether the button or link is standard, URL, s-control, JavaScript action, or Visualforce page. This value maps to the Content Source field in the user interface."
      },
      "Description": {
        "type": "string",
        "description": "Text displayed to an administrator in the standard action setup page. Description can be different from the Label, which is the label displayed in the user interface to end users. It can also be different from Name, which is a unique string used in merge fields."
      },
      "DurableId": {
        "type": "string",
        "description": "Unique identifier for the field. Always retrieve this value before using it, as the value isn’t guaranteed to stay the same from one release to the next. DurableId in queries allows you to find the right record without having to retrieve the entire record."
      },
      "EntityDefinitionId": {
        "type": "string",
        "description": "The ID of the standard or custom object for which this standard action is defined."
      },
      "IsOverridden": {
        "type": "boolean",
        "description": "Indicates whether this standard action has been overridden (true, or not."
      },
      "Label": {
        "type": "string",
        "description": "The text that displays in a user interface for the standard action."
      },
      "ManageableState": {
        "type": "string",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "Name": {
        "type": "string",
        "description": "The unique name for the button or link when referenced from a merge field. This name can contain only underscores and alphanumeric characters, and must be unique in your organization. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores."
      },
      "OverrideContentId": {
        "type": "string",
        "description": "ID of an OverrideContent record."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_standardaction.htm",
    "clouds": [
      "Tooling API"
    ]
  }
}