{
  "RateAdjustmentByTier": {
    "name": "RateAdjustmentByTier",
    "description": "Represents the adjustments for the rate of a resource that’s determined based on the specified tiers. This object stores information about the type of adjustment used, the value of the adjustment type, and any applicable boundaries.",
    "properties": {
      "AdjustmentType": {
        "type": "picklist",
        "description": "Type of rate adjustment."
      },
      "AdjustmentValue": {
        "type": "double",
        "description": "Value of the rate adjustment based on the selected adjustment type."
      },
      "EffectiveFrom": {
        "type": "dateTime",
        "description": "Date and time when the associated rate card entry comes into effect."
      },
      "EffectiveTo": {
        "type": "dateTime",
        "description": "Date and time until when the associated rate card entry remains effective."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Timestamp for when the current user last referred to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Timestamp for when the current user last viewed a record related to this record."
      },
      "LowerBound": {
        "type": "double",
        "description": "Minimum quantity of the rate adjustment value that can be applied to the record. This value must be a positive integer and must be less than the upper bound of the tier."
      },
      "Name": {
        "type": "string",
        "description": "Auto-generated identifier for the rate adjustment by tier record."
      },
      "ProductId": {
        "type": "reference",
        "description": "ID of the product whose resource is being used as the associated rate card entry."
      },
      "ProductSellingModelId": {
        "type": "reference",
        "description": "ID of the product selling model for the associated rate card entry record."
      },
      "RateCardEntryId": {
        "type": "reference",
        "description": "ID of the rate card entry associated with this rate adjustment by tier record."
      },
      "RateCardEntryStatus": {
        "type": "picklist",
        "description": "Status of the rate card entry associated with this rate adjustment by tier."
      },
      "RateCardId": {
        "type": "reference",
        "description": "ID of the rate card of the associated rate card entry."
      },
      "RateUnitOfMeasureId": {
        "type": "reference",
        "description": "ID of the standard unit of measure record of the associated rate card entry."
      },
      "RateUnitOfMeasureName": {
        "type": "string",
        "description": "Name of the standard unit of measure record of the associated rate card entry."
      },
      "UpperBound": {
        "type": "double",
        "description": "Maximum quantity of the rate adjustment value that can be applied to the record. This value must be a positive double and must be greater than the lower bound of the tier."
      },
      "UsageResourceId": {
        "type": "reference",
        "description": "ID of the resource selected for the associated rate card entry."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_rateadjustmentbytier.htm"
  }
}