{
  "RecentlyViewed": {
    "name": "RecentlyViewed",
    "description": "Represents records or list views that the current user has recently viewed or referenced (by viewing a related record). List views are available in API version 29.0 and later.",
    "properties": {
      "Alias": {
        "type": "string",
        "description": "The alias on the record."
      },
      "Email": {
        "type": "email",
        "description": "The email address on the record."
      },
      "FirstName": {
        "type": "string",
        "description": "The first name on the record. If the recently viewed record is a user, the value is the user’s first name."
      },
      "Id": {
        "type": "ID",
        "description": "The ID of the recently viewed record or list view."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the recently viewed record is an active user (true) or not (false). This field contains a value only if the recently viewed record is a user."
      },
      "LastName": {
        "type": "string",
        "description": "The last name on the record."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last interacted with this record, directly or indirectly. Some sample scenarios are: Viewing or opening a record. Selecting a record in a lookup search or related list search."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "Name": {
        "type": "string",
        "description": "The name on the recently viewed record or list view. If the recently viewed record is a user, contact, or lead, the value is a concatenation of the firstname and lastname field values."
      },
      "NetworkId": {
        "type": "reference",
        "description": "ID of the Experience Cloud site that this group is part of. This field is available only if digital experiences is enabled in your org.You can add a NetworkId only when creating a group. You can’t change or add a NetworkId for an existing group. This field is available in API version 27.0 and later."
      },
      "Phone": {
        "type": "phone",
        "description": "The phone number on the record."
      },
      "ProfileId": {
        "type": "reference",
        "description": "If the recently viewed record is a user, this value is the user’s profile ID."
      },
      "Title": {
        "type": "string",
        "description": "If the recently viewed record is a user, this value is the title of the user; for example CFO or CEO."
      },
      "Type": {
        "type": "picklist",
        "description": "The object type for this recently viewed record or list view. Valid values include any standard or custom objects that RecentlyViewed supports."
      },
      "UserRoleId": {
        "type": "reference",
        "description": "The ID of the user role associated with this object."
      }
    },
    "module": "Core Salesforce"
  }
}