{
  "RecentlyViewed": {
    "name": "RecentlyViewed",
    "description": "Represents metadata entities typically found in Setup such as page layout definitions, workflow rule definitions, and email templates that the current user has recently viewed.",
    "properties": {
      "Alias": {
        "type": "string",
        "description": "The alias on the item."
      },
      "Email": {
        "type": "email",
        "description": "The email address on the item."
      },
      "FirstName": {
        "type": "string",
        "description": "The first name on the item."
      },
      "Id": {
        "type": "ID",
        "description": "The ID of the recently viewed item."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the recently viewed item is an active user (true) or not (false). This field contains a value only if the recently viewed item is a user."
      },
      "LastName": {
        "type": "string",
        "description": "The last name on the item."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed an item related to this item."
      },
      "LastViewedDate": {
        "type": "dateTimedateTime",
        "description": "The timestamp for when the current user last viewed this item. If this value is null, this item might only have been referenced (see LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "If the recently viewed item is a user, this is the user’s name. Specifically, it’s the concatenation of the FirstName and LastName field values."
      },
      "NetworkId": {
        "type": "reference",
        "description": "The ID of the Experience Cloud site that this recently viewed item is part of. This field is available only if digital experiences is enabled in your org."
      },
      "Phone": {
        "type": "phone",
        "description": "The phone number on the item."
      },
      "ProfileId": {
        "type": "reference",
        "description": "If the recently viewed item is a user, this is the user’s profile ID."
      },
      "RelatedObject": {
        "type": "picklist",
        "description": "The object that the recently viewed item is related to. For example, if the recently viewed item is an Account Custom Field, then the related object will be Account. Not all recently viewed items will have a related object."
      },
      "Title": {
        "type": "string",
        "description": "If the recently viewed item is a user, this is the user’s title. For example, CFO or CEO."
      },
      "Type": {
        "type": "picklist",
        "description": "The sObject type for this recently viewed item."
      },
      "UserRoleId": {
        "type": "reference",
        "description": "The ID of the user role associated with this object."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_recentlyviewed.htm"
  }
}