{
  "RecommendationStrategy": {
    "name": "RecommendationStrategy",
    "description": "",
    "properties": {
      "ContextRecordType": {
        "type": "string",
        "description": "The sObject type of the $Record used by the flow."
      },
      "Description": {
        "type": "string",
        "description": "Description of the recommendation strategy."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the recommendation strategy in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Record Type Name."
      },
      "Fullname": {
        "type": "string",
        "description": "The full name of the associated metadata type in Metadata API. Query this field only if the query result contains no more than one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance."
      },
      "IsTemplate": {
        "type": "boolean",
        "description": "Indicates whether the recommendation strategy is a template (true) or not (false). When installed from managed packages, recommendation strategies can’t be viewed or cloned by subscribers because of intellectual property (IP) protection. But when those recommendation strategies are templates, subscribers can open them in a builder, clone them, and customize the clones. The default value is false. Available in API version 47.0 and later."
      },
      "Label": {
        "type": "string",
        "description": "Required. Label for the recommendation strategy."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the recommendation strategy."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "Master label for the recommendation strategy. This display value is the internal label that is not translated. Limit: 40 characters."
      },
      "Metadata": {
        "type": "mns: RecommendationStrategy",
        "description": "The recommendation strategy’s metadata."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix associated with this object. Each Developer Edition organization that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values: In Developer Edition organizations, the namespace prefix is set to the namespace prefix of the organization for all objects that support it. There is an exception if an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition organization of the package developer. In organizations that are not Developer Edition organizations, NamespacePrefix is only set for objects that are part of an installed managed package. There is no namespace prefix for all other objects."
      },
      "OnBehalfOfExpression": {
        "type": "string",
        "description": "Formula expression defining the intended target of the recommendations (for example, the Contact associated with a Case). Mainly used for reaction tracking."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_recommendationstrategy.htm"
  }
}