{
  "RecordsetFilterCriteria": {
    "name": "RecordsetFilterCriteria",
    "description": "Represents a set of filters that can be used to match service appointments or assets based on your criteria fields.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the recordset filter criteria."
      },
      "FilteredObject": {
        "type": "picklist",
        "description": "The object used to define the filter criteria. Available in API version 52.0 or later."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the recordset filter criteria is associated with shifts or maintenance work rules (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the recordset filter criteria was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the recordset filter criteria was last viewed."
      },
      "LogicalOperator": {
        "type": "picklist",
        "description": "Defines the logic to evaluate multiple recordset filter criteria rules. Available in API version 53.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "The name of the recordset filter criteria."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the recordset filter criteria."
      },
      "SourceObject": {
        "type": "picklist",
        "description": "The source object that the filtered criteria are applied to. Shifts and maintenance work rules are available in API version 52.0 and later. Appointment bundle objects are available in API version 53.0 and later."
      },
      "Usage Rate Field": {
        "type": "picklist",
        "description": "Stores the daily usage rate of the asset. The unit for the usage rate must be per day."
      },
      "Usage Rate Unit": {
        "type": "picklist",
        "description": "Defines the rate for Usage Rate Field."
      }
    },
    "module": "Field Service Lightning"
  }
}