{
  "RecordActionDeployment": {
    "name": "RecordActionDeployment",
    "description": "",
    "properties": {
      "ChannelConfigurations": {
        "type": "mns:RecordActionDeploymentChannel",
        "description": "Channel default settings for the deployment. This field is visible only in the metadata for a record."
      },
      "ComponentName": {
        "type": "picklist",
        "description": "Specifies the name of the component used in the deployment."
      },
      "DeploymentContexts": {
        "type": "mns:RecordActionDeploymentContext",
        "description": "Object context for the deployment. This field is visible only in the metadata for a record. Available in API version 46.0 and later."
      },
      "DeveloperName": {
        "type": "string",
        "description": "A unique name for this record action deployment. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. Provides a globally unique identifier for the record action deployment, which prevents conflicts with other record action deployments that have the same MasterLabel. Note Only users with View DeveloperName OR View Setup and Configuration permission can view, group, sort, and filter this field."
      },
      "FullName": {
        "type": "string",
        "description": "The unique name used as the record action deployment identifier for API access. The fullName can contain only underscores and alphanumeric characters. It must be unique, begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores."
      },
      "HasGuidedActions": {
        "type": "boolean",
        "description": "If true, indicates that the component shows standard actions; for example, flows and quick actions. Available in API version 46.0 and later."
      },
      "HasComponents": {
        "type": "boolean",
        "description": "Indicates whether the record actions deployment includes components (true) or not (false)."
      },
      "HasOmniscripts": {
        "type": "boolean",
        "description": "Indicates whether the record actions deployment includes OmniScripts (true) or not (false). Available in API version 56.0 and later."
      },
      "HasRecommendations": {
        "type": "boolean",
        "description": "If true, indicates that the component shows recommendations from a Next Best Action strategy. Available in API version 46.0 and later."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the record action deployment. The following values are supported: Chinese (Simplified): zh_CN Chinese (Traditional): zh_TW Danish: da Dutch: nl_NL English: en_US Finnish: fi French: fr German: de Italian: it Japanese: ja Korean: ko Norwegian: no Portuguese (Brazil): pt_BR Russian: ru Spanish: es Spanish (Mexico): es_MX Spanish (Mexico) defaults to Spanish for customer-defined translations. Swedish: sv Thai: th The Salesforce user interface is fully translated to Thai, but Help is in English."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "The name of the deployment."
      },
      "Metadata": {
        "type": "mns:RecordActionDeployment",
        "description": "Metadata that defines record action deployments."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix associated with the record action deployment, which is assigned to the AppExchange package. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. The namespace helps differentiate custom objects and fields from those in use by other record action deployments."
      },
      "Recommendation": {
        "type": "mns:RecordActionRecommendation",
        "description": "Settings for how Next Best Action recommendations appear. This field is visible only in the metadata for a record. Available in API version 46.0 and later."
      },
      "SelectableItems": {
        "type": "mns:RecordActionSelectableItem",
        "description": "A subset of actions that users can launch at runtime. This field is visible only in the metadata for a record."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/tooling_api_objects_recordactiondeployment.htm"
  }
}