{
  "RecordAlertDataSource": {
    "name": "RecordAlertDataSource",
    "description": "Represents an internal or external source for record alert data.",
    "properties": {
      "ApexClass": {
        "type": "string",
        "description": ""
      },
      "ApexClassId": {
        "type": "reference",
        "description": "The ID of the Apex class to be used as the data source. Note This class must implement the fscwmgen.RecordAlertProvider interface."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "FullName": {
        "type": "string",
        "description": "Full name of the associated metadata type in Metadata API."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the data source is still active (true) or not (false). Note There can only be one active data source at a time."
      },
      "Language": {
        "type": "picklist",
        "description": "Language of the record alert data source."
      },
      "ManageableState": {
        "type": "picklist",
        "description": "Indicates the manageable state of the specified component that is contained in a package."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label of the record alert data source."
      },
      "Metadata": {
        "type": "complexvalue",
        "description": "Record alert data source metadata."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "Namespace prefix associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of active data source used to fetch a record alert. This field is available in API version 55.0 and later."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/tooling_api_objects_recordalertdatasource.htm"
  }
}