{
  "Recommendation": {
    "name": "Recommendation",
    "description": "Represents the recommendations surfaced as offers and actions for Einstein Next Best Action.",
    "properties": {
      "AcceptanceLabel": {
        "type": "string",
        "description": "Label that appears as the accept option on the surfaced recommendation. Maximum size is 80 characters."
      },
      "ActionReference": {
        "type": "string",
        "description": "Flow referenced for this recommendation. Label is Action."
      },
      "Description": {
        "type": "string",
        "description": "Text description of the recommendation. Maximum size is 255 characters."
      },
      "ExternalId": {
        "type": "string",
        "description": "Stores an identifier for the recommendation source, such as product, so Einstein can group all responses for a given recommendation."
      },
      "ImageId": {
        "type": "reference",
        "description": "Image referenced by this recommendation. Label is Image."
      },
      "IsActionActive": {
        "type": "boolean",
        "description": "Indicates whether the flow referenced in the Action field is active (true) or not (false). Read only."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time when the recommendation was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time when the recommendation was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the recommendation. Maximum size is 80 characters."
      },
      "NetworkId": {
        "type": "reference",
        "description": "ID of the Experience Cloud site associated with the recommendation (if applicable)."
      },
      "RecommendationKey": {
        "type": "string",
        "description": "Track responses to a recommendation when it doesn’t have an ID. Maximum size is 255 characters."
      },
      "RejectionLabel": {
        "type": "string",
        "description": "Label that appears as the reject option on the surfaced recommendation. Maximum size is 80 characters."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_recommendation.htm"
  }
}