{
  "RefundLinePayment": {
    "name": "RefundLinePayment",
    "description": "A refund line that has been applied to a payment.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "The total amount applied to or unapplied from a payment by the refund line."
      },
      "AppliedDate": {
        "type": "dateTime",
        "description": "The date that the refund was applied to the linked payment."
      },
      "AssociatedAccountId": {
        "type": "reference",
        "description": "The account for the payment that received the refund."
      },
      "AssociatedRefundLinePaymentId": {
        "type": "reference",
        "description": "The refundLine that was unapplied. Populated only when RefundLinePayment’s Type has a value of Unapplied."
      },
      "Comments": {
        "type": "textarea",
        "description": "Users can add comments to provide additional information on the refund line payment."
      },
      "Date": {
        "type": "dateTime",
        "description": "By default, the day the refund line payment record was created. Users can also enter a different date."
      },
      "EffectiveDate": {
        "type": "dateTime",
        "description": "Defines the date and time when the refund line application or unapplication becomes effective."
      },
      "EffectiveImpactAmount": {
        "type": "currency",
        "description": "Shows how this payment refund line impacts a customer’s accounts receivable. This value is positive when RefundLinePayment’s Type field is Applied, and negative when RefundLinePayment’s Type is Unapplied. If there’s an unapplied line related to this record, EffectiveImpactAmount has a value of 0."
      },
      "HasBeenUnapplied": {
        "type": "picklist",
        "description": "Shows whether this refund line has been unapplied."
      },
      "ImpactAmount": {
        "type": "currency",
        "description": "Shows how this payment refund line impacts a customer’s accounts receivable. This value is positive when RefundLinePayment’s Type field is Applied, and negative when RefundLinePayment’s Type is Unapplied."
      },
      "PaymentBalance": {
        "type": "currency",
        "description": "The payment record’s balance following the application or unapplication of this refund line."
      },
      "PaymentId": {
        "type": "reference",
        "description": "The payment record that this refund line targets. Refund applications and unapplications are made against this payment."
      },
      "RefundBalance": {
        "type": "currency",
        "description": "The refund record’s balance following the application or unapplication of this payment refund line."
      },
      "RefundId": {
        "type": "reference",
        "description": "The parent refund of this refund line."
      },
      "RefundLinePaymentNumber": {
        "type": "string",
        "description": "System-created unique ID for this refund line."
      },
      "Type": {
        "type": "picklist",
        "description": "Defines whether this line represents a refund that’s been applied or unapplied from a payment."
      },
      "UnappliedDate": {
        "type": "dateTime",
        "description": "The date that this refund line was unapplied from a payment."
      }
    },
    "module": "Core Salesforce"
  }
}