{
  "ReleaseUpdate": {
    "name": "ReleaseUpdate",
    "description": "",
    "properties": {
      "ApiVersion": {
        "type": "double",
        "description": "The API version to which the update is applied."
      },
      "Category": {
        "type": "string",
        "description": "Indicates the type of the release update. For example, “Security” or “Usability.”"
      },
      "Description": {
        "type": "string",
        "description": "The description of the update that appears on the front of the card."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the release update."
      },
      "DueDate": {
        "type": "date",
        "description": "The date by which test runs must be completed."
      },
      "DurableId": {
        "type": "string",
        "description": "The unique name of the release update."
      },
      "HasNewSteps": {
        "type": "boolean",
        "description": "Indicates if steps have been added to the release update since its original release (true) or not (false)."
      },
      "IsReleased": {
        "type": "boolean",
        "description": "Indicates if the update is released (true) or not (false)."
      },
      "NumCompSteps": {
        "type": "integer",
        "description": "Indicates how many steps have been completed in the update."
      },
      "NumReqSteps": {
        "type": "integer",
        "description": "Indicates the total number of required steps before proceeding with test run."
      },
      "NumSteps": {
        "type": "integer",
        "description": "Indicates the total number of all steps in the update."
      },
      "": {
        "type": "",
        "description": ""
      },
      "Release": {
        "type": "string",
        "description": "The release, including patch number, in which the update is available. For example, 50.00.00. Note Also see ReleaseDate and ReleaseLabel."
      },
      "ReleaseDate": {
        "type": "date",
        "description": "The date in which the update is enforced. Note Only specified if the update is part of a scheduled release, so either Release or ReleaseDate will be non-null. Also see Release and ReleaseLabel."
      },
      "ReleaseLabel": {
        "type": "string",
        "description": "The release label in which the update is enforced. For example, “Winter ‘21.” The label could also be a formatted date if Release is null and ReleaseDate is non-null."
      },
      "Status": {
        "type": "picklist",
        "description": "Values include: Complete: The update has been applied. Info: An information-only update; no actions to take. Invocable: The update is not yet applied; ready for invocation. Invoked: The update has been invoked but can’t be revoked yet. Nascent: The update has incomplete steps so test run can’t be run yet. Pending: The Complete Steps By date is in the past and update is awaiting enforcement. Revocable: The update is in test run mode."
      },
      "StepStage": {
        "type": "string",
        "description": "Indicates the stage in which the update is at. Options include Needs Action, Due Soon, Overdue, and Archived."
      },
      "SupportsRevoke": {
        "type": "boolean",
        "description": "Indicates if the update has a test run(true) or not (false). Default is false."
      },
      "Title": {
        "type": "string",
        "description": "The release update title that appears at the top of the release update in the UI."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_releaseupdate.htm"
  }
}