{
  "Reply": {
    "name": "Reply",
    "description": "Represents a reply that a user has submitted to a question in an answers zone.",
    "properties": {
      "Body": {
        "type": "textarea",
        "description": "Body of this reply."
      },
      "CommunityId": {
        "type": "reference",
        "description": "The zone ID associated with the question and its reply. This field is available in API version 27.0 and later."
      },
      "CreatorFullPhotoUrl": {
        "type": "string",
        "description": "URL of the user’s profile photo from the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "CreatorName": {
        "type": "string",
        "description": "Name of the user who posted the question or reply. Only the first name of internal users (agents) appears to portal users in the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later"
      },
      "CreatorSmallPhotoUrl": {
        "type": "string",
        "description": "URL of the user’s thumbnail photo from the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "DownVotes": {
        "type": "int",
        "description": "The total number of down votes for a reply."
      },
      "Name": {
        "type": "string",
        "description": "When creating a Reply, the Name field is automatically populated with a truncated, plain text version of the Reply Body field."
      },
      "NumReportAbuses": {
        "type": "int",
        "description": "Represents the number of reported abuses on the reply by users.This field is available in API version 24.0 and later."
      },
      "QuestionId": {
        "type": "reference",
        "description": "ID of the Question to which this reply was made."
      },
      "UpVotes": {
        "type": "int",
        "description": "The total number of up votes for a reply."
      },
      "VoteTotal": {
        "type": "double",
        "description": "The total number of all votes for a reply, including up and down votes."
      }
    },
    "module": "Core Salesforce"
  }
}