{
  "ReplyEmailSettings": {
    "name": "ReplyEmailSettings",
    "description": "Represents a reply mail management configuration, which is used to configure emails that are received by an email sending domain.",
    "properties": {
      "AutoReplyMessage": {
        "type": "textarea",
        "description": "The content of the reply message. This reply is sent when a message is received at the sending address."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. The name: must be 40 characters or fewer must begin with a letter can contain only underscores and alphanumeric characters can’t include spaces can’t end with an underscore can’t contain 2 consecutive underscores In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization."
      },
      "DomainName": {
        "type": "string",
        "description": "The domain that the reply mail management settings apply to. This field is unique within your organization."
      },
      "FwdEmailAddress": {
        "type": "string",
        "description": "The email address to forward a copy of each incoming message to. This value is honored only if the value of IsEmailForwardingEnabled is true."
      },
      "IsAutoReplyEnabled": {
        "type": "boolean",
        "description": "Indicates whether to forward automatic replies, such as out-of-office messages, to the address specified in the FwdEmailAddress field. This value is honored only if the value of IsEmailForwardingEnabled is true."
      },
      "IsDeleteAutoRepliesEnabled": {
        "type": "boolean",
        "description": "Indicates whether to delete automatic replies, such as out-of-office messages. This value is honored only if the value of IsEmailForwardingEnabled is true."
      },
      "IsEmailForwardingEnabled": {
        "type": "boolean",
        "description": "Indicates whether to forward email replies to the address specified in the FwdEmailAddress field."
      },
      "IsUnsubscribeManualRequestsEnabled": {
        "type": "boolean",
        "description": "Indicates whether subscribers can opt out of your campaigns by replying to your email with a keyword such as unsubscribe."
      },
      "Language": {
        "type": "picklist",
        "description": "The combined language and locale ISO code, which controls the language of the ReplyEmailSettings object."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label for this ReplyEmailSettings value. This value is the internal label that doesn’t get translated."
      }
    },
    "module": "Core Salesforce"
  }
}