{
  "Report": {
    "name": "Report",
    "description": "Represents a report, a set of data that meets certain criteria, displayed in an organized way. Access is read-only.",
    "properties": {
      "Description": {
        "type": "string",
        "description": "The description of the report. Limit: 255 characters."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Required. The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Report Unique Name. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "FolderName": {
        "type": "string",
        "description": "Name of the folder that contains the report. Available in API version 35.0 and later."
      },
      "Format": {
        "type": "picklist",
        "description": "Required. Indicates the format of the report. This field is available in API version 29.0 and later. Can have one of these values: Tabular for reports in that format. In the application, the label is Tabular. Summary for reports in that format. In the application, the label is Summary. Matrix for reports in that format. In the application, the label is Matrix. Multiblock for reports in joined format. In the application, the label is Joined."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastRunDate": {
        "type": "dateTime",
        "description": "Returns the date the report was last run. Label is Last Run."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "Name": {
        "type": "string",
        "description": "Required. The report label used in the user interface."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the folder that contains the report. There are 2 special folders: Private, where the ID is the user ID Public, where the ID is the org ID"
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_report.htm"
  }
}