{
  "RestrictionRule": {
    "name": "RestrictionRule",
    "description": "Represents a restriction rule or a scoping rule. A restriction rule has EnforcementType set to Restrict and controls the access that specified users have to designated records. A scoping rule has EnforcementType set to Scoping and controls the default records that your users see without restricting access.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "Required. The description of the rule."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name for the RestrictionRule object."
      },
      "EnforcementType": {
        "type": "picklist",
        "description": "Required. The type of rule."
      },
      "FullName": {
        "type": "string",
        "description": "Required. The full name of the associated RestrictionRule in Metadata API. The full name can include a namespaceprefix."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the rule is active (true) or not (false). The default value is false."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the rule. The value for this field is the language value of the org."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label for the rule."
      },
      "Metadata": {
        "type": "mns:RestrictionRule",
        "description": "The restriction rule’s metadata."
      },
      "RecordFilter": {
        "type": "textarea",
        "description": "Required. The criteria that determine which records are accessible via the rule."
      },
      "TargetEntity": {
        "type": "picklist",
        "description": "Required. The object for which you're creating the rule. We recommend that you don’t edit this field after the rule is created.If EnforcementType is set to Restrict, custom objects, external objects, and these objects are supported: Contract Event Quote Task TimeSheet TimeSheetEntry If EnforcementType is set to Scoping, custom objects and these objects are supported: Account Case Contact Event Lead Opportunity Task"
      },
      "UserCriteria": {
        "type": "textarea",
        "description": "Required. The users that this rule applies to, such as all active users or users with a specified role or profile."
      },
      "Version": {
        "type": "int",
        "description": "Required. The rule's version number."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_restrictionrule.htm"
  }
}