{
  "RetailVisitKpi": {
    "name": "RetailVisitKpi",
    "description": "Capture the actual information during a visit against the defined assessment indicator definition and target values.",
    "properties": {
      "ActualBooleanValue": {
        "type": "picklist",
        "description": "The actual one of two possible values for an assessment indicator definition that the sales rep can capture during the store visit audit."
      },
      "ActualDateTimeValue": {
        "type": "dateTime",
        "description": "The actual date and time for an assessment indicator definition that the sales rep can capture during the store visit audit."
      },
      "ActualDecimalValue": {
        "type": "double",
        "description": "The actual fractional value for an assessment indicator definition that the sales rep can capture during the store visit audit."
      },
      "ActualIntegerValue": {
        "type": "int",
        "description": "The actual whole number value for an assessment indicator definition that the sales rep can capture during the store visit audit."
      },
      "ActualStringValue": {
        "type": "textarea",
        "description": "The actual sequence of characters for an assessment indicator definition that the sales rep can capture during the store visit audit."
      },
      "AssessmentIndDefinitionId": {
        "type": "reference",
        "description": "The assessment indicator definition ID that indicates the kind of parameter that is audited. Values can include: Inventory, Facings, Competitor Facings, Share of Shelf."
      },
      "AssessmentTaskId": {
        "type": "reference",
        "description": "ID of the assessment task against which the actual data is captured."
      },
      "CustomContextId": {
        "type": "reference",
        "description": "ID of the custom object if the assessment indicator definition is associated for a custom task."
      },
      "DisplayOrder": {
        "type": "int",
        "description": "Sequence in which the retail visit KPI must be displayed. This field is available in API version 51.0 and later."
      },
      "InStoreLocationId": {
        "type": "reference",
        "description": "ID of the in-store location that is associated with the assessment indicator definition."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "Unique identifier for the visit KPI."
      },
      "PlanogramId": {
        "type": "reference",
        "description": "ID of the planogram."
      },
      "PrimaryDisplayOrder": {
        "type": "int",
        "description": "Sequence in which products, product categories, promotions, or other contexts are displayed for an assessment task. This field is available in API version 53.0 and later."
      },
      "ProductCategoryId": {
        "type": "reference",
        "description": "ID of the product category for which audit is done."
      },
      "ProductId": {
        "type": "reference",
        "description": "ID of the product for which the assessment indicator definition is tracked."
      },
      "PromotionId": {
        "type": "reference",
        "description": "ID of the promotion if the assessment task is a promotion check."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "ID of the record type."
      },
      "TargetBooleanValue": {
        "type": "picklist",
        "description": "The expected value among the two possible ones for an assessment indicator definition against which the actual value is captured."
      },
      "TargetDateTimeValue": {
        "type": "dateTime",
        "description": "The expected date and time for an assessment indicator definition against which the actual value is captured."
      },
      "TargetDecimalValue": {
        "type": "double",
        "description": "The expected fractional for an assessment indicator definition against which the actual value is captured."
      },
      "TargetIntegerValue": {
        "type": "int",
        "description": "The expected whole number value for an assessment indicator definition against which the actual value is captured."
      },
      "TargetStringValue": {
        "type": "textarea",
        "description": "The expected sequence of characters for an assessment indicator definition against which the actual value is captured."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of the assessment indicator definition."
      },
      "UnitOfMeasure": {
        "type": "picklist",
        "description": "The unit of measure for the combination of assessment indicator definition type and target value."
      },
      "VisitId": {
        "type": "reference",
        "description": "ID of the associated visit."
      }
    },
    "module": "Consumer Goods Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.retail_api.meta/retail_api/sforce_api_objects_retailvisitkpi.htm"
  }
}