{
  "RetailStoreKpi": {
    "name": "RetailStoreKpi",
    "description": "Map store groups to assessment indicator definition, products, and in-store location categories and define targets. Targets are the expected compliance values for each assessment indicator definition, which is a parameter based on which markers of compliance are decided for a task.",
    "properties": {
      "AssessmentIndDefinitionId": {
        "type": "reference",
        "description": "ID of the assessment indicator definition to track, such as inventory or facings."
      },
      "CustomContextId": {
        "type": "reference",
        "description": "ID of the custom object if the assessment indicator definition is associated for a custom task."
      },
      "EndDate": {
        "type": "date",
        "description": "Final date of the association between a store group and the assessment indicator definitions."
      },
      "InStoreLocationCategory": {
        "type": "picklist",
        "description": "ID of the in-store location category."
      },
      "KpiType": {
        "type": "picklist",
        "description": "Type of assessment indicator definition."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "Unique identifier for this association."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the retail store assessment indicator definition record owner."
      },
      "PlanogramId": {
        "type": "reference",
        "description": "ID of the planogram if the assessment task is planogram check."
      },
      "ProductCategoryId": {
        "type": "reference",
        "description": "ID of the product category, if the promotion level is for a product category and the assessment task is a promotion check."
      },
      "ProductId": {
        "type": "reference",
        "description": "Product for which the assessment indicator definition is tracked."
      },
      "PromotionId": {
        "type": "reference",
        "description": "ID of the promotion if the assessment indicator definition is for a promotion check."
      },
      "RetailStoreGroupId": {
        "type": "reference",
        "description": "ID of the retail store group for which the assessment indicator definition is defined."
      },
      "StartDate": {
        "type": "date",
        "description": "Start date of the association between a store group and the assessment indicator definitions."
      },
      "TargetBooleanValue": {
        "type": "picklist",
        "description": "The expected value among the two possible ones for the measuring parameter."
      },
      "TargetDateTimeValue": {
        "type": "dateTime",
        "description": "The expected date and time for the measuring parameter."
      },
      "TargetDecimalValue": {
        "type": "double",
        "description": "The expected fractional value for the measuring parameter."
      },
      "TargetIntegerValue": {
        "type": "int",
        "description": "The target whole number value for the measuring parameter."
      },
      "TargetStringValue": {
        "type": "textarea",
        "description": "The expected sequence of characters for the measuring parameter."
      },
      "UnitOfMeasure": {
        "type": "picklist",
        "description": "The unit used to measure the assessment indicator definition."
      }
    },
    "module": "Consumer Goods Cloud"
  }
}