{
  "ReturnOrder": {
    "name": "ReturnOrder",
    "description": "Represents the repair, return, or recall of product items.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The account associated with the return order."
      },
      "CaseId": {
        "type": "reference",
        "description": "The case associated with the return order."
      },
      "ContactId": {
        "type": "reference",
        "description": "The contact associated with the return order."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the return order."
      },
      "DestinationLocationId": {
        "type": "reference",
        "description": "The location where the items are being returned to. For example, if the return order tracks the return of products from a technician’s van to a warehouse, the warehouse is the destination location."
      },
      "ExpectedArrivalDate": {
        "type": "dateTime",
        "description": "The date when the items are expected to arrive at the destination location."
      },
      "ExpirationDate": {
        "type": "dateTime",
        "description": "The date after which authorizations can’t be captured."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate isn’t null, the user accessed this record or list view indirectly."
      },
      "OrderId": {
        "type": "reference",
        "description": "The order associated with the return order. When you associated a return order with an order, you can associate the return order’s line items with order products."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the return order."
      },
      "ProductRequestId": {
        "type": "reference",
        "description": "The product request associated with the return order. When you associated a return order with a product request, you can associate the return order’s line items with the product request’s line items.A return order might be related to a product request if the return order tracks the return of unused products or products to be repaired or replaced. For example, a technician creates a product request for three motors to prepare for a field visit. If the technician finds that only two motors are needed, they can create a return order to return the third to the original location, and list the product request in this field."
      },
      "ReturnOrderNumber": {
        "type": "string",
        "description": "The auto-generated number identifying the return order."
      },
      "ReturnedById": {
        "type": "reference",
        "description": "The user returning the items."
      },
      "ShipFromAddress": {
        "type": "address",
        "description": "The return shipping address. This address tracks the location of the items at the start of the return or repair. For example, if a customer is returning an item, the Ship From address is the customer’s address."
      },
      "ShipFromCity": {
        "type": "string",
        "description": "The city of the return shipping address. This address tracks the location of the items at the start of the return or repair. For example, if a customer is returning an item, the Ship From address is the customer’s address."
      },
      "ShipFromCountry": {
        "type": "string",
        "description": "The country of the return shipping address. This address tracks the location of the items at the start of the return or repair. For example, if a customer is returning an item, the Ship From address is the customer’s address."
      },
      "ShipFromGeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the return shipping address."
      },
      "ShipFromLatitude": {
        "type": "double",
        "description": "Used with Longitude to specify the precise geolocation of the return shipping address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "ShipFromLongitude": {
        "type": "double",
        "description": "Used with Latitude to specify the precise geolocation of the return shipping address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "ShipFromPostalCode": {
        "type": "string",
        "description": "The postal code of the return shipping address. This address tracks the location of the items at the start of the return or repair. For example, if a customer is returning an item, the Ship From address is the customer’s address."
      },
      "ShipFromState": {
        "type": "string",
        "description": "The state of the return shipping address. This address tracks the location of the items at the start of the return or repair. For example, if a customer is returning an item, the Ship From address is the customer’s address."
      },
      "ShipFromStreet": {
        "type": "textarea",
        "description": "The street of the return shipping address. This address tracks the location of the items at the start of the return or repair. For example, if a customer is returning an item, the Ship From address is the customer’s address."
      },
      "ShipmentType": {
        "type": "picklist",
        "description": "The type of shipment associated with the return order. Available values are: Standard (default value) Rush Overnight Next Business Day Pick Up"
      },
      "SourceLocationId": {
        "type": "reference",
        "description": "The items’ location at the start of the return or repair. For example, if the return order tracks the return of products from a technician’s service center to a warehouse, the service center is the source location."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the return order. Available values are: Draft Submitted Approved Canceled Closed"
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "Status category of the return order. Processing of the return order depends on this value. Each status category corresponds to one or more statuses."
      }
    },
    "module": "Manufacturing Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.mfg_api_devguide.meta/mfg_api_devguide/sforce_api_objects_returnorder.htm"
  }
}