{
  "ReturnOrderItemTax": {
    "name": "ReturnOrderItemTax",
    "description": "Represents the tax on a return order line item or return order item adjustment.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "Amount of tax represented by the return order item tax."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the return order item tax."
      },
      "OrderItemTaxLineItemSummaryId": {
        "type": "reference",
        "description": "ID of the order item tax line item summary associated with the order item summary that corresponds to the return order line item to which the tax applies."
      },
      "Rate": {
        "type": "percent",
        "description": "Tax rate used to calculate the Amount."
      },
      "ReturnOrderId": {
        "type": "reference",
        "description": "ID of the associated return order."
      },
      "ReturnOrderItemAdjustmentId": {
        "type": "reference",
        "description": "If this object represents a tax on an adjustment, this value is the ID of the return order item adjustment to which the tax applies. If this value is null, the adjustment applies to a return order line item."
      },
      "ReturnOrderItemTaxNumber": {
        "type": "string",
        "description": "ID of the return order item tax."
      },
      "ReturnOrderLineItemId": {
        "type": "reference",
        "description": "If this object represents a tax on a return order line item, this value is the ID of that return order line item. If this object represents a tax on an adjustment, this value is the ID of the return order line item to which the adjustment applies."
      },
      "TaxEffectiveDate": {
        "type": "date",
        "description": "Date on which the Amount was calculated. Important due to tax rate changes over time."
      },
      "Type": {
        "type": "picklist",
        "description": "Shows whether the amount on the tax line is an estimate or the final calculated amount. Doesn’t set a value by default. Users can define automation to set and change the value as needed."
      }
    },
    "module": "Core Salesforce"
  }
}