{
  "ReturnOrderLineItem": {
    "name": "ReturnOrderLineItem",
    "description": "Represents a product that is returned, recalled, or repaired as part of a return order.",
    "properties": {
      "AssetId": {
        "type": "reference",
        "description": "The asset associated with the return order line item."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the return order line item."
      },
      "DestinationLocationId": {
        "type": "reference",
        "description": "The location where the items are being returned to. For example, if the return order tracks the return of products from a technician center to a warehouse, the warehouse is the destination location."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate isn’t null, the user accessed this record or list view indirectly."
      },
      "OrderItemId": {
        "type": "reference",
        "description": "The order product associated with the return order line item."
      },
      "ProcessingPlan": {
        "type": "picklist",
        "description": "Specifies the preferred fate of the items after their return. Available values are: Repair—Repair the items and return them to the owner Discard—Discard the items Salvage—Salvage the items’ working parts Restock—Return the items to your inventory"
      },
      "Product2Id": {
        "type": "reference",
        "description": "The product associated with the return order line item."
      },
      "ProductItemId": {
        "type": "reference",
        "description": "The product item representing the location of the product at the start of the return."
      },
      "ProductRequestLineItemId": {
        "type": "reference",
        "description": "The product request line item associated with the return order line item."
      },
      "QuantityExpected": {
        "type": "double",
        "description": "The quantity of items expected to be returned."
      },
      "QuantityReceived": {
        "type": "double",
        "description": "The actual quantity of items received for return."
      },
      "QuantityRejected": {
        "type": "double",
        "description": "The quantity of items rejected for return."
      },
      "QuantityReturned": {
        "type": "double",
        "description": "The quantity of items being returned. If multiple types of products are being returned, track each product in a different return order line item."
      },
      "QuantityUnitOfMeasure": {
        "type": "picklist",
        "description": "Units of the returned items. For example, kilograms or liters. Quantity Unit of Measure picklist values are inherited from the Quantity Unit of Measure field on products."
      },
      "ReasonForRejection": {
        "type": "picklist",
        "description": "Reason for rejecting returned items on this return order line item."
      },
      "ReasonForReturn": {
        "type": "picklist",
        "description": "The reason the items are being returned. Available values are: Damaged Defective Duplicate Order Wrong Item Wrong Quantity Not Satisfied Outdated Other"
      },
      "ReasonForChangeText": {
        "type": "string",
        "description": "The details about the reason for the return change"
      },
      "RepaymentMethod": {
        "type": "picklist",
        "description": "The method by which the customer or owner will be reimbursed for the items being returned. Available values are: Replace—The items will be replaced Refund—The items will be returned and the owner will be refunded Credit—The items will be returned and the owner will receive credit for them Return—The items will be returned to the owner (for example, following their repair)"
      },
      "ReturnOrderId": {
        "type": "reference",
        "description": "The return order that the return order line item belongs to."
      },
      "ReturnOrderLineItemNumber": {
        "type": "string",
        "description": "The auto-generated number that identifies the return order line item."
      },
      "SourceLocationId": {
        "type": "reference",
        "description": "The items’ location at the start of the return or repair. For example, if the return order tracks the return of products from a technician’s service center to a warehouse, the service vehicle is the source location."
      }
    },
    "module": "Manufacturing Cloud"
  }
}