{
  "RevenueSourceObjectConfig": {
    "name": "RevenueSourceObjectConfig",
    "description": "Represents data from the underlying Salesforce standard or custom object that stores opportunity and product-related information.",
    "properties": {
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Record Type Name."
      },
      "": {
        "type": "",
        "description": ""
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the revenue source object configuration."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label for the revenue source object configuration. In the UI, this field is Revenue Source Object Configuration."
      },
      "PrimaryAccountFieldName": {
        "type": "string",
        "description": "The name of the field that stores the reference to account information. If there are multiple accounts for Revenue Source Dataset, then this field would be the reference to the primary account."
      },
      "ProductNameField": {
        "type": "string",
        "description": "The name of field from Revenue Data Source or Revenue Product Dataset that stores the product name information."
      },
      "ProductReferenceFieldName": {
        "type": "string",
        "description": "The name of the field from Revenue Data Source or Revenue Product Dataset that has a lookup to product information."
      },
      "ProductReferenceObjectName": {
        "type": "string",
        "description": "The name of the standard or custom object that stores product information."
      },
      "RevDataSourceRefFieldName": {
        "type": "string",
        "description": "The name of the field from Revenue Product Dataset that has a lookup to Revenue Data Source."
      },
      "RevenueDataSource": {
        "type": "string",
        "description": "The standard or custom object that stores opportunity information."
      },
      "RevenueProductDataset": {
        "type": "string",
        "description": "The standard or custom object that stores both opportunity and product information."
      },
      "UserIdentifierFieldName": {
        "type": "string",
        "description": "The name of the field that stores the user ID information of who owns the account."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/tooling_api_objects_revenuesourceobjectconfig.htm"
  }
}