{
  "Dashboard": {
    "name": "Dashboard",
    "description": "Represents a dashboard, which shows data from custom reports as visual components. Access is read-only.",
    "properties": {
      "BackgroundDirection": {
        "type": "picklist",
        "description": "Returns the direction of the background fade. Available values are: Top to Bottom Left to Right Diagonal (default value)"
      },
      "BackgroundEnd": {
        "type": "int",
        "description": "Returns the ending fade color in hexadecimal. Label is Ending Color."
      },
      "BackgroundStart": {
        "type": "int",
        "description": "Returns the starting fade color in hexadecimal. Label is Starting Color."
      },
      "ChartTheme": {
        "type": "picklist",
        "description": "Returns the background theme used for charts."
      },
      "ColorPalette": {
        "type": "picklist",
        "description": "Returns the color palette used for the dashboard."
      },
      "DashboardResultRefreshedDate": {
        "type": "string",
        "description": "Returns the date on which the dashboard results were last refreshed."
      },
      "DashboardResultRunningUser": {
        "type": "string",
        "description": "The user whose security settings were used to generate the dashboard results."
      },
      "Description": {
        "type": "string",
        "description": "Returns the description of the dashboard. Limit: 255 characters."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Required. The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Dashboard Unique Name. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow while Salesforce generates one for each record."
      },
      "FolderId": {
        "type": "reference",
        "description": "Required. Returns the ID of the Folder that contains the dashboard. See Folder."
      },
      "FolderName": {
        "type": "string",
        "description": "Name of the folder that contains the dashboard. Available in API version 35.0 and later."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "LeftSize": {
        "type": "picklist",
        "description": "Returns the size of the left column of the dashboard. Available values are: Narrow Medium Wide"
      },
      "MiddleSize": {
        "type": "picklist",
        "description": "Returns the size of the middle column of the dashboard. Available values are: Narrow Medium Wide"
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "RightSize": {
        "type": "picklist",
        "description": "Returns the size of the right column in the dashboard. Available values are: Narrow Medium Wide"
      },
      "RunningUserId": {
        "type": "reference",
        "description": "Returns the ID of the running user specified for the dashboard.If the dashboard was created in Lightning Experience and is configured to run as the viewing user, it returns the user ID of the dashboard creator. If the dashboard was created in Salesforce Classic and is configured to run as the logged-in user, returns the user ID of the last specified running user."
      },
      "TextColor": {
        "type": "int",
        "description": "Returns the body text color in hexadecimal. Label is Text Color."
      },
      "Title": {
        "type": "string",
        "description": "Returns the title of the dashboard. Limit: 80 characters."
      },
      "TitleColor": {
        "type": "int",
        "description": "Returns the title text color in hexadecimal. Label is Title Color."
      },
      "TitleSize": {
        "type": "int",
        "description": "Returns the title font size in points. Label is Title Size."
      },
      "Type": {
        "type": "picklist",
        "description": "Returns the dashboard type. Available values are: SpecifiedUser—The dashboard displays data according to the access level of one specific running user. LoggedInUser—The dashboard displays data according to the access level of the logged-in user. MyTeamUser—The dashboard displays data according to the access level of the logged-in user, and managers can view dashboards from the point of view of users beneath them in the role hierarchy."
      }
    },
    "module": "Core Salesforce"
  }
}