{
  "DataWeaveResource": {
    "name": "DataWeaveResource",
    "description": "Represents the DataWeaveScriptResource class that is generated for all DataWeave scripts.",
    "properties": {
      "ApiVersion": {
        "type": "double",
        "description": "The API version of this component."
      },
      "BodyLength": {
        "type": "int",
        "description": "Size of the DataWeave script (in bytes)."
      },
      "ContentType": {
        "type": "picklist",
        "description": "Possible value: dwl: The metadata file for the DataWeave scripts that are deployed to an org."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API."
      },
      "IsGlobal": {
        "type": "boolean",
        "description": "When set to true, the generatedDataWeaveScriptResource class is global. The default value is false."
      },
      "IsProtected": {
        "type": "boolean",
        "description": "Not used"
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the MasterLabel."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Required. The name of the resource."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that aren’t Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      }
    },
    "module": "Core Salesforce"
  }
}