{
  "DataDetectJobSession": {
    "name": "DataDetectJobSession",
    "description": "Represents a run of a DataDetect scan policy that's triggered manually.",
    "properties": {
      "DataDetectPolicyId": {
        "type": "reference",
        "description": "ID of the scan policy associated with this job session.This field is a relationship field."
      },
      "DataDetectPolicySnapshotId": {
        "type": "reference",
        "description": "ID of the snapshot of the scan policy associated with this job session.This field is a relationship field."
      },
      "SessionEndTime": {
        "type": "dateTime",
        "description": "Time and date when the data scan completes."
      },
      "Name": {
        "type": "string",
        "description": "Auto-generated name of the job session."
      },
      "NamedEntityCount": {
        "type": "int",
        "description": "Aggregate count of PII found during the data scan."
      },
      "PolicyJobStatus": {
        "type": "picklist",
        "description": "Status of the data scan. Valid values are: Cancelled Cancelled and CsvNoPiiData - Scan cancelled. No sensitive data detected. Cancelled and CsvUploadFailed - Scan cancelled. Results upload failed. Cancelled and CsvUploadInProgress - Scan cancelled. Results upload in progress. Cancelled and CsvUploadSuccess - Scan cancelled. Results upload completed successfully. Completed Completed and CsvNoPiiData - Scan completed. No sensitive data detected. Completed and CsvUploadFailed - Scan completed. Results upload failed. Completed and CsvUploadInProgress - Scan completed. Results upload in progress. Completed and CsvUploadSuccess - Scan completed. Results upload completed successfully. Failed Failed and CsvNoPiiData - Scan failed. No sensitive data detected. Failed and CsvUploadFailed - Scan failed. Results upload failed. Failed and CsvUploadInProgress - Scan failed. Results upload in progress. Failed and CsvUploadSuccess - Scan failed. Results upload completed successfully. PartialSuccess PartialSuccess and CsvNoPiiData - Scan partially successful. No sensitive data detected. PartialSuccess and CsvUploadFailed - Scan partially successful. Results upload failed. PartialSuccess and CsvUploadInProgress - Scan partially successful. Results upload in progress. PartialSuccess and CsvUploadSuccess - Scan partially successful. Results upload completed successfully. Running Scheduled TimedOut The default value is Scheduled."
      },
      "RunByUser": {
        "type": "string",
        "description": "User who started the job session or data scan."
      },
      "SessionStartTime": {
        "type": "dateTime",
        "description": "Time and date when the data scan begins."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_datadetectjobsession.htm"
  }
}