{
  "DatacloudCompany": {
    "name": "DatacloudCompany",
    "description": "Represents the fields for Data.com company records.",
    "properties": {
      "ActiveContacts": {
        "type": "int",
        "description": "The number of active contacts that are associated with a company."
      },
      "AnnualRevenue": {
        "type": "currency",
        "description": "The amount of money that the company makes in 1 year. Annual revenue is measured in US dollars."
      },
      "City": {
        "type": "string",
        "description": "The name of the city where the company is located."
      },
      "CompanyId": {
        "type": "string",
        "description": "A unique numerical identifier for the company and theData.com identifier for a company."
      },
      "Country": {
        "type": "string",
        "description": "A string that represents the standard abbreviation for the country where the company is located."
      },
      "CountryCode": {
        "type": "picklist",
        "description": "A standardized name for countries of the world."
      },
      "Description": {
        "type": "string",
        "description": "A brief synopsis of the company that provides a general overview of the company and what it does."
      },
      "DunsNumber": {
        "type": "string",
        "description": "A randomly generated nine-digit number that’s assigned by Dun & Bradstreet (D&B) to identify unique business establishments."
      },
      "EmployeeQuantityGrowthRate": {
        "type": "double",
        "description": "The yearly growth rate of the number of employees in a company expressed as a decimal percentage. The data includes the total employee growth rate for the past two years."
      },
      "ExternalId": {
        "type": "string",
        "description": "A unique numerical identifier for the company. The ExternalId is a system-generated number."
      },
      "Fax": {
        "type": "phone",
        "description": "The telephone number that’s used to send and receive faxes."
      },
      "FortuneRank": {
        "type": "int",
        "description": "The numeric value of the company’s Fortune 1000 ranking. A null or blank value means that the company isn’t ranked as a Fortune 1000 company."
      },
      "FullAddress": {
        "type": "string",
        "description": "The complete address of a company, including Street, City, State, and Zip."
      },
      "IncludedInSnP500": {
        "type": "string",
        "description": "A true or false value. If true, the company is listed in the S&P 500 Index. If false, the company isn’t listed in the S&P 500 Index."
      },
      "Industry": {
        "type": "string",
        "description": "A description of the type of industry such as Telecommunications, Agriculture, or Electronics."
      },
      "IsInCrm": {
        "type": "boolean",
        "description": "Whether the record is in Salesforce (true) or not (false)."
      },
      "IsInactive": {
        "type": "boolean",
        "description": "A true or false response. True, the company record is not active. False, the company record is active."
      },
      "IsOwned": {
        "type": "boolean",
        "description": "A true or false value. True, your organization owns the record. False, your organization doesn’t own the record."
      },
      "NaicsCode": {
        "type": "string",
        "description": "A value that represents the North American Industry Classification System (NAICS) code. NAICS was created to provide details about a business’s service orientation. The code descriptions are focused on what a business does."
      },
      "NaicsDesc": {
        "type": "string",
        "description": "A description of the NAICS classification."
      },
      "Name": {
        "type": "string",
        "description": "The company’s name."
      },
      "NumberOfEmployees": {
        "type": "int",
        "description": "The number of employees working for the company."
      },
      "Ownership": {
        "type": "string",
        "description": "The type of ownership of the company: Public Private Government Other"
      },
      "Phone": {
        "type": "phone",
        "description": "A numeric string containing the primary telephone number for the company."
      },
      "PremisesMeasure": {
        "type": "int",
        "description": "A numeric value for the measurement of the premises."
      },
      "PremisesMeasureReliability": {
        "type": "string",
        "description": "A descriptive accuracy of the measurement such as actual, estimated, or modeled."
      },
      "PremisesMeasureUnit": {
        "type": "string",
        "description": "A descriptive measurement unit such as acres, square meters, or square feet."
      },
      "PriorYearEmployees": {
        "type": "int",
        "description": "The total number of employees for the prior year."
      },
      "PriorYearRevenue": {
        "type": "double",
        "description": "The annual revenue for the prior year."
      },
      "SalesTurnoverGrowthRate": {
        "type": "double",
        "description": "The increase in annual revenue from the previous value for an equivalent period expressed as a decimal percentage."
      },
      "Sic": {
        "type": "string",
        "description": "A numeric value that represents the Standard Industrial Codes (SIC). SIC is a numbering convention that indicates what type of service a business provides. It is a four-digit value."
      },
      "SicCodeDesc": {
        "type": "string",
        "description": "The SIC numeric code and descsciption for a company."
      },
      "SicDesc": {
        "type": "string",
        "description": "A description of the SIC classification."
      },
      "Site": {
        "type": "picklist",
        "description": "An organizational status of the company. Branch: a secondary location to a headquarter location Headquarter: a parent company with branches or subsidiaries Single Location: a single business with no subsidiaries or branches"
      },
      "State": {
        "type": "string",
        "description": "The two-letter standard abbreviation for a state."
      },
      "StateCode": {
        "type": "picklist",
        "description": "A standard two-letter abbreviation for states and territories of the United States. The state where the company is located. The abbreviation can also be a province or other equivalent to a state, depending on the country where the company is located."
      },
      "Street": {
        "type": "string",
        "description": "A postal address for the company."
      },
      "TickerSymbol": {
        "type": "string",
        "description": "The symbol that uniquely identifies companies that are traded on public stock exchanges."
      },
      "TradeStyle": {
        "type": "string",
        "description": "A legal name under which a company conducts business."
      },
      "UpdatedDate": {
        "type": "dateTime",
        "description": "The last date and time when the information for this company was updated."
      },
      "Website": {
        "type": "url",
        "description": "The standard URL for the company’s home page."
      },
      "YearStarted": {
        "type": "string",
        "description": "The year when the company was founded."
      },
      "Zip": {
        "type": "string",
        "description": "A numeric postal code that’s designated for the address."
      }
    },
    "module": "Core Salesforce"
  }
}