{
  "DatacloudDandBCompany": {
    "name": "DatacloudDandBCompany",
    "description": "Represents a set of read-only fields that are used to return D&B company data from Data.com API calls.",
    "properties": {
      "City": {
        "type": "string",
        "description": "The name of the city where the company is physically located."
      },
      "CompanyCurrencyIsoCode": {
        "type": "picklist",
        "description": "The code used to represent a company’s local currency. This data is provided by the International Organization for Standardization (ISO) and is based on their three-letter currency codes. For example, USD is the ISO code for United States Dollar."
      },
      "CompanyId": {
        "type": "string",
        "description": "A unique numeric identifier for a company."
      },
      "Country": {
        "type": "string",
        "description": "The country where a company is physically located."
      },
      "CountryAccessCode": {
        "type": "string",
        "description": "The required code for international calls."
      },
      "CurrencyCode": {
        "type": "picklist",
        "description": "The currency in which the company’s sales volume is expressed."
      },
      "Description": {
        "type": "string",
        "description": "A brief description of the company, which may include information about its history, its products and services, and its influence on a particular industry."
      },
      "DomesticUltimateBusinessName": {
        "type": "string",
        "description": "The primary name of the Domestic Ultimate, which is the highest ranking subsidiary, specified by country, within an organization’s corporate structure."
      },
      "DomesticUltimateDunsNumber": {
        "type": "string",
        "description": "The D-U-N-S number for the Domestic Ultimate, which is the highest-ranking subsidiary, specified by country, within an organization’s corporate structure."
      },
      "DunsNumber": {
        "type": "string",
        "description": "The Data Universal Numbering System (D-U-N-S) number is a unique, nine-digit number assigned to every business location in the Dun & Bradstreet database that has a unique, separate, and distinct operation. D-U-N-S numbers are used by industries and organizations around the world as a global standard for business identification and tracking."
      },
      "EmployeeQuantityGrowthRate": {
        "type": "double",
        "description": "The yearly growth rate of the number of employees in a company expressed as a decimal percentage. The data includes the total employee growth rate for the past two years."
      },
      "EmployeesHere": {
        "type": "double",
        "description": "The number of employees at a specified location, such as a branch location."
      },
      "EmployeesHereReliability": {
        "type": "picklist",
        "description": "The reliability of the EmployeesHere figure. Available values are Actual number, Low, Estimated (for all records), Modeled (for non-US records). A blank value indicates this data is unavailable."
      },
      "EmployeesTotal": {
        "type": "double",
        "description": "The total number of employees in the company, including all subsidiary and branch locations. This data is available only on records that have a value of Headquarters/Parent in the LocationStatus field."
      },
      "EmployeesTotalReliability": {
        "type": "picklist",
        "description": "The reliability of the EmployeesTotal figure. Available values are Actual number, Low, Estimated (for all records), Modeled (for non-US records). A blank value indicates this data is unavailable."
      },
      "ExternalId": {
        "type": "string",
        "description": "A system generated numeric identification."
      },
      "FamilyMembers": {
        "type": "int",
        "description": "The total number of family members, worldwide, within an organization, including the Global Ultimate, its subsidiaries (if any), and its branches (if any)."
      },
      "Fax": {
        "type": "phone",
        "description": "The company’s facsimile number."
      },
      "FifthNaics": {
        "type": "string",
        "description": "A NAICS code that’s used to further classify an organization by industry."
      },
      "FifthNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding NAICS code."
      },
      "FifthSic": {
        "type": "string",
        "description": "A Standard Industrial Classification (SIC) code that’s used to further classify an organization by industry."
      },
      "FifthSic8": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "FifthSic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "FifthSicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code."
      },
      "FipsMsaCode": {
        "type": "string",
        "description": "The Federal Information Processing Standards (FIPS) and the Metropolitan Statistical Area (MSA) codes identify the organization’s location. The MSA codes are defined by the US Office of Management and Budget."
      },
      "FipsMsaDesc": {
        "type": "string",
        "description": "A brief description of an organization’s FIPS MSA code."
      },
      "FortuneRank": {
        "type": "int",
        "description": "The numeric value of the company’s Fortune 1000 ranking. A null or blank value means that the company isn’t ranked as a Fortune 1000 company."
      },
      "FourthNaics": {
        "type": "string",
        "description": "A NAICS code used to further classify an organization by industry."
      },
      "FourthNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding NAICS code."
      },
      "FourthSic": {
        "type": "string",
        "description": "A SIC code used to further classify an organization by industry."
      },
      "FourthSic8": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "FourthSic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "FourthSicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code."
      },
      "GeoCodeAccuracy": {
        "type": "picklist",
        "description": "The level of accuracy of a location’s geographical coordinates compared with its physical address. Available values include Rooftop level, Street level, Block level, Census tract level, Mailing address level, ZIP code level, Geocode could not be assigned, Places the address in the correct city, Not matched, State or Province Centroid, Street intersection, PO BOX location, Non-US rooftop accuracy, County Centroid, Sub Locality-Street Level, and Locality Centroid"
      },
      "GlobalUltimateBusinessName": {
        "type": "string",
        "description": "The primary name of the Global Ultimate, which is the highest entity within an organization’s corporate structure and may oversee branches and subsidiaries."
      },
      "GlobalUltimateDunsNumber": {
        "type": "string",
        "description": "The D-U-N-S number of the Global Ultimate, which is the highest-ranking entity within an organization’s corporate structure and can oversee branches and subsidiaries."
      },
      "GlobalUltimateTotalEmployees": {
        "type": "double",
        "description": "The total number of employees at the Global Ultimate, which is the highest entity within an organization’s corporate structure and may oversee branches and subsidiaries."
      },
      "ImportExportAgent": {
        "type": "picklist",
        "description": "Identifies whether a business imports goods or services, exports goods or services, and/or is an agent for goods."
      },
      "IncludedInSnP500": {
        "type": "string",
        "description": "A true or false value. If true, the company is listed in the S&P 500 Index. If false, the company isn’t listed in the S&P 500 Index."
      },
      "Industry": {
        "type": "string",
        "description": "A description of the type of industry such as Telecommunications, Agriculture, or Electronics."
      },
      "IsOwned": {
        "type": "boolean",
        "description": "A true or false value. True, your organization owns the record. False, your organization doesn’t own the record."
      },
      "IsParent": {
        "type": "boolean",
        "description": "A true or false value. True, the company is a parent company. False, the company isn’t a parent company. A parent company owns other companies."
      },
      "Latitude": {
        "type": "string",
        "description": "Used with longitude to specify a precise location, which is used to assess the Geocode Accuracy."
      },
      "LegalStatus": {
        "type": "picklist",
        "description": "Identifies the legal structure of an organization. Available values include Cooperative, Nonprofit organization, Local government body, Partnership of unknown type, and Foreign company."
      },
      "LocationStatus": {
        "type": "picklist",
        "description": "Identifies the organizational status of a company. A numeric value represents each value. Organizational status Numeric value Single location: The business has no branches or subsidiaries. 0 Headquarters/Parent: A parent company that owns more than 50 percent of another company. When the company also has branches, it’s the headquarters. 1 Branch: A secondary location of a business. 2 Note Only the numeric value is accepted in an API request."
      },
      "Longitude": {
        "type": "string",
        "description": "Used with latitude to specify a precise location, which is used to assess the Geocode Accuracy."
      },
      "MailingCity": {
        "type": "string",
        "description": "The city where a company has its mail delivered."
      },
      "MailingCountry": {
        "type": "string",
        "description": "The country where a company has its mail delivered."
      },
      "MailingState": {
        "type": "string",
        "description": "The state where a company has its mail delivered."
      },
      "MailingStreet": {
        "type": "string",
        "description": "The street address where a company has its mail delivered."
      },
      "MailingZip": {
        "type": "string",
        "description": "The postal zip code for the company."
      },
      "MarketingPreScreen": {
        "type": "picklist",
        "description": "The probability that a company pays with a significant delay compared to the agreed terms. The risk level is based on the standard Commercial Credit Score, and ranges from low risk to high risk. Available values are High risk of delinquency, Low risk of delinquency, and Moderate risk of delinquency. Important Use this information for marketing pre-screening purposes only."
      },
      "MarketingSegmentationCluster": {
        "type": "picklist",
        "description": "Twenty-two distinct, mutually exclusive profiles, created as a result of cluster analysis of Dun & Bradstreet data for US organizations. Available values include High-Tension Branches of Insurance/Utility Industries, Rapid-Growth Large Businesses, Labor-Intensive Giants, Spartans, Main Street USA."
      },
      "MinorityOwned": {
        "type": "picklist",
        "description": "Indicates whether an organization is owned or controlled by a member of a minority group."
      },
      "Name": {
        "type": "string",
        "description": "The primary or registered name of a company."
      },
      "NationalId": {
        "type": "string",
        "description": "The identification number used in some countries for business registration and tax collection."
      },
      "NationalIdType": {
        "type": "picklist",
        "description": "A code value that identifies the type of national identification number that’s used."
      },
      "OutOfBusiness": {
        "type": "picklist",
        "description": "Indicates whether the company at the specified address has discontinued operations."
      },
      "OwnOrRent": {
        "type": "picklist",
        "description": "Indicates whether a company owns or rents the building it occupies."
      },
      "ParentOrHqBusinessName": {
        "type": "string",
        "description": "The primary name of the parent or headquarters company."
      },
      "ParentOrHqDunsNumber": {
        "type": "string",
        "description": "The D-U-N-S number for the parent or headquarters."
      },
      "Phone": {
        "type": "phone",
        "description": "A company’s primary telephone number."
      },
      "PremisesMeasure": {
        "type": "int",
        "description": "A numeric value for the measurement of the premises."
      },
      "PremisesMeasureReliability": {
        "type": "string",
        "description": "A descriptive accuracy of the measurement such as actual, estimated, or modeled."
      },
      "PremisesMeasureUnit": {
        "type": "string",
        "description": "A descriptive measurement unit such as acres, square meters, or square feet."
      },
      "PrimaryNaics": {
        "type": "string",
        "description": "The six-digit North American Industry Classification System (NAICS) code is the standard used by business and government to classify business establishments according to their economic activity for the purpose of collecting, analyzing, and publishing statistical data related to the US business economy."
      },
      "PrimaryNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on its NAICS code."
      },
      "PrimarySic": {
        "type": "string",
        "description": "The four-digit SIC code that’s used to categorize business establishments by industry."
      },
      "PrimarySic8": {
        "type": "string",
        "description": "The eight-digit Standard Industrial Classification (SIC) code is used to categorize business establishments by industry. The full list of values can be found at the Optimizer Resources page maintained by Dun & Bradstreet. Maximum size is 8 characters."
      },
      "PrimarySic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "PrimarySicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on its SIC code."
      },
      "PriorYearEmployees": {
        "type": "int",
        "description": "The total number of employees for the prior year."
      },
      "PriorYearRevenue": {
        "type": "double",
        "description": "The annual revenue for the prior year."
      },
      "PublicIndicator": {
        "type": "picklist",
        "description": "Indicates whether ownership of the company is public or private."
      },
      "Revenue": {
        "type": "double",
        "description": "The annual revenue of a company in US dollars."
      },
      "SalesTurnoverGrowthRate": {
        "type": "double",
        "description": "The increase in annual revenue from the previous value for an equivalent period expressed as a decimal percentage."
      },
      "SalesVolume": {
        "type": "double",
        "description": "The total annual sales revenue in the headquarters’ local currency. Dun & Bradstreet tracks revenue data for publicly traded companies, Global Ultimates, Domestic Ultimates, and some headquarters."
      },
      "SalesVolumeReliability": {
        "type": "picklist",
        "description": "The reliability of the SalesVolume figure."
      },
      "SecondNaics": {
        "type": "string",
        "description": "A NAICS code used to further classify an organization by industry."
      },
      "SecondNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding NAICS code."
      },
      "SecondSic": {
        "type": "string",
        "description": "A SIC code used to further classify an organization by industry."
      },
      "SecondSic8": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "SecondSic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "SecondSicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code."
      },
      "SixthNaics": {
        "type": "string",
        "description": "A NAICS code used to further classify an organization by industry."
      },
      "SixthNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code."
      },
      "SixthSic": {
        "type": "string",
        "description": "A SIC code used to further classify an organization by industry."
      },
      "SixthSic8": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "SixthSic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "SixthSicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code."
      },
      "SmallBusiness": {
        "type": "picklist",
        "description": "Indicates whether the company is designated a small business as defined by the Small Business Administration of the US government."
      },
      "State": {
        "type": "string",
        "description": "The state where a company is physically located."
      },
      "StockExchange": {
        "type": "string",
        "description": "The corresponding exchange for a company’s stock symbol, for example, NASDAQ or NYSE."
      },
      "StockSymbol": {
        "type": "string",
        "description": "The abbreviation that’s used to identify publicly traded shares of a particular stock."
      },
      "Street": {
        "type": "string",
        "description": "The street address where a company is physically located."
      },
      "Subsidiary": {
        "type": "picklist",
        "description": "Indicates whether a company is more than 50 percent owned by another organization."
      },
      "ThirdNaics": {
        "type": "string",
        "description": "A NAICS code used to further classify an organization by industry."
      },
      "ThirdNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding NAICS code."
      },
      "ThirdSic": {
        "type": "string",
        "description": "A SIC code used to further classify an organization by industry."
      },
      "ThirdSic8": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "ThirdSic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "ThirdSicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code."
      },
      "TradeStyle1": {
        "type": "string",
        "description": "A name, different from its legal name, that an organization may use for conducting business. Similar to “Doing business as” or “DBA”."
      },
      "TradeStyle2": {
        "type": "string",
        "description": "A tradestyle used by the organization."
      },
      "TradeStyle3": {
        "type": "string",
        "description": "A tradestyle used by the organization."
      },
      "TradeStyle4": {
        "type": "string",
        "description": "A tradestyle used by the organization."
      },
      "TradeStyle5": {
        "type": "string",
        "description": "A tradestyle used by the organization."
      },
      "UsTaxId": {
        "type": "string",
        "description": "The identification number for the company used by the Internal Revenue Service (IRS) in the administration of tax laws. Also referred to as Federal Taxpayer Identification Number."
      },
      "Website": {
        "type": "url",
        "description": "An organization’s primary website address."
      },
      "WomenOwned": {
        "type": "picklist",
        "description": "Indicates whether a company is more than 50 percent owned or controlled by a woman."
      },
      "YearStarted": {
        "type": "string",
        "description": "The year when the company was established or the year when current ownership or management assumed control of the company."
      },
      "Zip": {
        "type": "string",
        "description": "A five or nine-digit code that’s used to help sort mail."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_dataclouddandbcompany.htm"
  }
}