{
  "DecisionTableParameter": {
    "name": "DecisionTableParameter",
    "description": "Represents an input or output field in a decision table. An input field is a field in the business rule object or custom metadata type that contains values used by the decision table to evaluate records and values. An output field is a field in the business rule object or custom metadata type that contains the values provided as outcomes for a rule.",
    "properties": {
      "DecisionTableId": {
        "type": "reference",
        "description": "The unique identifier of the associated decision table."
      },
      "DomainObject": {
        "type": "string",
        "description": "For polymorhpic fields, indicates the domain object in the field hierarchy."
      },
      "FieldName": {
        "type": "string",
        "description": "The API name of the field that’s selected as an input or output for the decision table."
      },
      "FieldPath": {
        "type": "string",
        "description": "The path of the field used in a decision table in relation to the object that the field belongs to."
      },
      "IsGroupByField": {
        "type": "boolean",
        "description": "Indicates whether an input field is used to group the business rules of the decision table (true) or not (false)."
      },
      "IsRequired": {
        "type": "boolean",
        "description": "Indicates whether a field is required to have input values when a look up is performed on the decision table (true) or not (false)."
      },
      "ManageableState": {
        "type": "picklist",
        "description": "Indicates the manageable state of the specified component that is contained in a package."
      },
      "Operator": {
        "type": "picklist",
        "description": "The operator used for the input field."
      },
      "Sequence": {
        "type": "int",
        "description": "The sequence in which input fields are processed."
      },
      "SortType": {
        "type": "picklist",
        "description": "Sort outputs of a decision table based on the values of the input or output parameter field. This field is available in API version 56.0 and later."
      },
      "Usage": {
        "type": "picklist",
        "description": "Required. The usage type of a field."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/tooling_api_objects_decisiontableparameter.htm"
  }
}