{
  "DigitalWallet": {
    "name": "DigitalWallet",
    "description": "Represents a customer’s digital wallet service. Salesforce Payments can use a digital wallet as a payment source when processing payments through a payment gateway.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The account of the customer owns the digital wallet."
      },
      "AuditEmail": {
        "type": "email",
        "description": "Email address of the digital wallet owner where audit information about payments gets sent."
      },
      "BillingName": {
        "type": "string",
        "description": "Billing name linked to customer's digital wallet. Available in API version 64.0 and later."
      },
      "Comments": {
        "type": "textarea",
        "description": "Users can provide additional details about the digital wallet. Supports a maximum of 1000 characters."
      },
      "CompanyName": {
        "type": "string",
        "description": "Company of the digital wallet owner."
      },
      "Customer": {
        "type": "string",
        "description": "Customer name of the digital wallet owner."
      },
      "DigitalWalletNumber": {
        "type": "string",
        "description": "System-generated reference number for the digital wallet."
      },
      "Email": {
        "type": "email",
        "description": "Email of the digital wallet owner."
      },
      "GatewayToken": {
        "type": "string",
        "description": "Unencrypted unique token ID generated by the payment gateway to represent the digital wallet during transactions. This field is available for backward compatibility. To secure the token, use the GatewayTokenEncrypted field."
      },
      "GatewayTokenDetails": {
        "type": "textarea",
        "description": "Unique ID generated by the payment gateway for the card for future transactions."
      },
      "GatewayTokenEncrypted": {
        "type": "encryptedstring",
        "description": "Encrypted unique token ID generated by the payment gateway to represent the digital wallet during transactions. Encrypted using Salesforce Classic Encryption for custom fields."
      },
      "IpAddress": {
        "type": "string",
        "description": "The IP address of the digital wallet owner."
      },
      "IsAutoPayEnabled": {
        "type": "boolean",
        "description": "Indicates whether the payment method can be used for recurring payments (True) or not (False). The default value is False."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it's possible the user only referenced this record (LastReferencedDate) but not viewed it."
      },
      "MacAddress": {
        "type": "string",
        "description": "The MAC address of the digital wallet owner."
      },
      "NickName": {
        "type": "string",
        "description": "User-defined nickname for the digital wallet."
      },
      "PaymentGatewayId": {
        "type": "reference",
        "description": "Gateway used with transactions for the digital wallet."
      },
      "PaymentMethodAddress": {
        "type": "address",
        "description": "Full address associated with the digital wallet payment method. For more information about address fields, see Address Compound Fields"
      },
      "PaymentMethodCity": {
        "type": "string",
        "description": "Part of the address for the payment method."
      },
      "PaymentMethodCountry": {
        "type": "string",
        "description": "Part of the address for the payment method."
      },
      "PaymentMethodDetails": {
        "type": "string",
        "description": "Optional information about the payment method type. This field is available in API version 57.0 and later."
      },
      "PaymentMethodGeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the payment method address. An accuracy level contains information about the location of a latitude and longitude. For more information about geolocation fields, see Geolocation Compound Field."
      },
      "PaymentMethodLatitude": {
        "type": "double",
        "description": "Latitude of the payment method address. Used with the PaymentMethodLongitude to specify the precise geolocation of the address. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "PaymentMethodLongitude": {
        "type": "double",
        "description": "Latitude of the payment method address. Used with the PaymentMethodLatitude to specify the precise geolocation of the address. For details on geolocation compound fields, see Compound Field Considerations and Limitations."
      },
      "PaymentMethodPostalCode": {
        "type": "string",
        "description": "Part of the address for the payment method."
      },
      "PaymentMethodState": {
        "type": "string",
        "description": "Part of the address for the payment method."
      },
      "PaymentMethodStreet": {
        "type": "textarea",
        "description": "Part of the address for the payment method."
      },
      "PaymentMethodSubType": {
        "type": "string",
        "description": "More information about the payment method. For example, if the PaymentMethodType is Visa, this field can be digital wallet. This field is available in API version 57.0 and later."
      },
      "PaymentMethodType": {
        "type": "picklist",
        "description": "Payment method used for the transaction. Possible values include credit cards such as Visa and American Express, digital wallets like Apple Pay and PayPal, direct debits such as ACH, BECS, Bacs, and non-card payments methods such as EPS, SEPA, and iDEAL. This field is available in API version 57.0 and later."
      },
      "Phone": {
        "type": "phone",
        "description": "Phone number of the digital wallet owner."
      },
      "ProcessingMode": {
        "type": "picklist",
        "description": "Defines whether the digital wallet is used for transactions made inside or outside the payment platform."
      },
      "SavedPaymentMethodId": {
        "type": "reference",
        "description": "The ID of the saved payment method record."
      },
      "Status": {
        "type": "picklist",
        "description": "Defines the state of the digital wallet as a payment source."
      }
    },
    "module": "Core Salesforce"
  }
}