{
  "DigitalSignature": {
    "name": "DigitalSignature",
    "description": "Represents a signature captured on a service report in field service.",
    "properties": {
      "DigitalSignatureNumber": {
        "type": "string",
        "description": "An auto-generated number identifying the signature."
      },
      "DocumentBody": {
        "type": "base64",
        "description": "The captured signature image."
      },
      "DocumentContentType": {
        "type": "picklist",
        "description": "The data type of the captured signature. Possible values are: audio/ogg video/3gpp2 video/3gpp image/avif text/calendar audio/x-caf image/webp"
      },
      "DocumentLength": {
        "type": "int",
        "description": "The length of the captured signature."
      },
      "DocumentName": {
        "type": "string",
        "description": "The name of the captured signature image."
      },
      "ParentId": {
        "type": "reference",
        "description": "ID of the service appointment, work order, or work order line item that the service report is generated for."
      },
      "Place": {
        "type": "string",
        "description": "The place where the report was signed."
      },
      "SignatureType": {
        "type": "picklist",
        "description": "The role of the person signing the service report. Your org comes with one signature type, Default. A service report template can only contain one signature per type. If you plan to collect multiple signatures on service reports, create additional values for the Signature Type field.Create at least one value for every role that might need to sign a service report. For example, Technician, Customer, Supervisor, or Supplier. If some service reports will be signed by multiple people in one role—for example, all technicians present at an appointment—create numbered types: Technician 1, Technician 2, and so forth. Note You can create up to 1,000 signature types. You can’t delete signature types, but you can deactivate them so they can’t be used in service report templates. When you deactivate a type, it still appears on service report templates that used it, but you can’t use it on new service report templates."
      },
      "SignedBy": {
        "type": "string",
        "description": "The name of the person signing."
      },
      "SignedDate": {
        "type": "dateTime",
        "description": "The date and time of the signing."
      }
    },
    "module": "Field Service Lightning"
  }
}