{
  "DisputeItemMerchantAlert": {
    "name": "DisputeItemMerchantAlert",
    "description": "Represents the alert sent by the card issuer to the merchant. The alert occurs through a chargeback prevention vendor like Ethoca Merchant Alerts™ for a transaction that’s being disputed.",
    "properties": {
      "AlertDeliveryStatus": {
        "type": "picklist",
        "description": "Specifies the delivery status of the alert associated with an individual transaction in a batch of disputed transactions."
      },
      "AlertDlvrStatusDescription": {
        "type": "string",
        "description": "The description of the delivery status of the alert."
      },
      "AlertIdentifier": {
        "type": "string",
        "description": "A unique identifier assigned to a merchant alert related to the transaction that's being disputed. The alert identifier is generated by a chargeback prevention system like Ethoca."
      },
      "DisputeItemId": {
        "type": "reference",
        "description": "The Dispute Item associated with the merchant alert."
      },
      "DisputedTrxnBatchIdentifier": {
        "type": "string",
        "description": "An unique identifier assigned to the request made by the issuer for submitting a group of disputed transactions. Each group of disputed transactions is called a batch. The batch identifier is generated by a chargeback prevention system like Ethoca."
      },
      "DisputedTrxnBatchStatus": {
        "type": "picklist",
        "description": "Specifies the status of the batch of disputed transactions that includes this transaction."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Name of the DisputeItem record."
      },
      "Outcome": {
        "type": "picklist",
        "description": "Specifies the outcome of the alert selected by the merchant."
      },
      "OutcomeDescription": {
        "type": "string",
        "description": "The description of the alert outcome."
      },
      "OutcomeUpdateDateTime": {
        "type": "dateTime",
        "description": "The date and time when the merchant last updated the alert outcome of the transaction that's being disputed. The timestamp is represented in the ISO 8601 format."
      },
      "RefundStatus": {
        "type": "picklist",
        "description": "Specifies the status of the refund issued by the merchant in response to the customer's dispute alert."
      },
      "Source": {
        "type": "picklist",
        "description": "Specifies the source of the merchant alert."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the type of alert associated with the transaction that's being disputed."
      }
    },
    "module": "Financial Services Cloud"
  }
}