{
  "DisputeItemChargeback": {
    "name": "DisputeItemChargeback",
    "description": "Represents the claim and chargeback created by the card issuer for a transaction that's being disputed.",
    "properties": {
      "ChargebackAmount": {
        "type": "currency",
        "description": "The total amount claimed by the issuer using a chargeback for the disputed transaction. Available in version 62.0 and later."
      },
      "ChargebackAmountCurrency": {
        "type": "string",
        "description": "The currency in which the chargeback amount is credited to the cardholder. Available in version 62.0 and later."
      },
      "ChargebackCreatedData": {
        "type": "date",
        "description": "TThe date when the chargeback was created for a disputed transaction. Available in version 62.0 and later."
      },
      "ChargebackIdentifier": {
        "type": "string",
        "description": "The unique identifier of the chargeback assigned by the dispute system."
      },
      "ChargebackReferenceNumber": {
        "type": "string",
        "description": "A unique reference number that's associated with the chargeback process, enabling the issuer to track the chargeback throughout its lifecycle, including pre-arbitration case."
      },
      "Description": {
        "type": "string",
        "description": "The description of the chargeback request provided by the member or the entity filing the chargeback."
      },
      "DisputeItemId": {
        "type": "reference",
        "description": "The Dispute Item associated with the chargeback."
      },
      "DisputeReasonId": {
        "type": "reference",
        "description": "The dispute reason associated with the chargeback."
      },
      "DocumentStatus": {
        "type": "string",
        "description": "The status of a document associated with the chargeback."
      },
      "IsDocumentRequired": {
        "type": "boolean",
        "description": "Indicates whether a supporting document is required (true) or not (false) for dispute resolution."
      },
      "IsPartialChargeback": {
        "type": "boolean",
        "description": "Indicates whether the cardholder has disputed only a portion of the transaction amount (true) or not (false)."
      },
      "IsRefundReceived": {
        "type": "boolean",
        "description": "Indicates whether the cardholder received the expected refund (true) or not (false) for the chargeback."
      },
      "RejectReason": {
        "type": "string",
        "description": "The reason for rejecting the chargeback by the dispute system."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of chargeback."
      },
      "StatusUpdateDateTime": {
        "type": "dateTime",
        "description": "The date and time when the chargeback status was last updated. The timestamp is represented in the ISO 8601 format."
      },
      "TransactionSettlementDate": {
        "type": "date",
        "description": "The date when the transaction was completed and the funds were transferred between the parties involved."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the type of chargeback based on the dispute reason."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_disputeitemchargeback.htm"
  }
}