{
  "DisputeItemArbitration": {
    "name": "DisputeItemArbitration",
    "description": "Represents the details of the arbitration or compliance case filed for a transaction that's being disputed.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "The amount that's claimed by a party in a disputed transaction."
      },
      "Description": {
        "type": "string",
        "description": "The description of the arbitration or compliance case."
      },
      "DisputeItemId": {
        "type": "reference",
        "description": "The Dispute Item asscoiated with an arbitration or compliance case."
      },
      "DisputeReasonId": {
        "type": "reference",
        "description": "The Dispute Reason associated with the disputed transaction for which an arbitration or compliance case is filed."
      },
      "DocumentUploadStatus": {
        "type": "picklist",
        "description": "Specifies the upload status of the document or an image related to the arbitration or compliance case."
      },
      "ExternalCaseIdentifier": {
        "type": "string",
        "description": "The uniqie identifier of the arbitration or compliance case assigned to a disputed transaction by a dispute management system, such as Mastercom or Visa."
      },
      "IsEscalated": {
        "type": "boolean",
        "description": "Indicates if the pre-arbitration case was escalated (true) or not (false) to create an arbitration case."
      },
      "IsReasonCodeUpdated": {
        "type": "boolean",
        "description": "Indicates if the reason code for the disputed transaction was updated (true) or not (fasle) before filing the arbitration or compliance case."
      },
      "Memo": {
        "type": "textarea",
        "description": "The memo content of the arbitration or compliance case."
      },
      "ReasonCodeUpdateReason": {
        "type": "string",
        "description": "The description for the reason code update."
      },
      "Role": {
        "type": "picklist",
        "description": "Specifies the role under which an entity filed the arbitration or compliance case."
      },
      "Status": {
        "type": "string",
        "description": "The status of the arbitration or compliance case retrieved from a dispute management system."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the type of case filed for the transaction that's being disputed."
      }
    },
    "module": "Financial Services Cloud"
  }
}