{
  "DsarPolicyLog": {
    "name": "DsarPolicyLog",
    "description": "Represents the history of Data Subject Access Request (DSAR) policy execution requests. This log records the status and results of executed DSAR policies for a customer. This object is available in API version 50.0 and later.",
    "properties": {
      "CompletionDateTime": {
        "type": "dateTime",
        "description": "The date and time when the data subject access request was completed. Available in API version 51.0 and later."
      },
      "DataSubjectId": {
        "type": "reference",
        "description": "The 15–18 character ID of the data subject making the request. Available in API version 51.0 and later."
      },
      "DeletedDateTime": {
        "type": "dateTime",
        "description": "The date and time when the file generated for the data subject’s request is deleted. Available in API version 51.0 and later."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Developer name of the policy."
      },
      "DownloadedDateTime": {
        "type": "dateTime",
        "description": "The most recent date and time when the data subject downloaded the file generated at their request. Available in API version 51.0 and later."
      },
      "DsarError": {
        "type": "picklist",
        "description": "Represents an error in generating the file for the data subject access request. Available in API version 51.0 and later."
      },
      "DsarPolicyId": {
        "type": "reference",
        "description": "The ID of the DSAR policy."
      },
      "FileURL": {
        "type": "string",
        "description": "The result of the DSAR policy execution. The URL links to a downloadable file that contains the customer data."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the MasterLabel."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label of the policy."
      },
      "RequestDateTime": {
        "type": "dateTime",
        "description": "The date and time when a data subject requested access to their data in the org. Available in API version 51.0 and later."
      },
      "RequestStatus": {
        "type": "picklist",
        "description": "The status of the policy execution."
      },
      "RequestUserId": {
        "type": "reference",
        "description": "The ID of the org employee or admin making the request on behalf of the data subject. Available in API version 51.0 and later."
      }
    },
    "module": "Core Salesforce"
  }
}