{
  "TaxEngineInteractionLog": {
    "name": "TaxEngineInteractionLog",
    "description": "Represents a record of a communication with an external tax engine following a tax calculation request.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "Additional details about the tax engine interaction log."
      },
      "DocumentCode": {
        "type": "string",
        "description": "Document code of the transaction for which the tax engine integration log was captured."
      },
      "EffectiveDate": {
        "type": "dateTime",
        "description": "The date that the tax engine request takes effect. This date is available for reference and bookkeeping only and doesn’t have any impact on tax calculation."
      },
      "InteractionHttpStatusCode": {
        "type": "int",
        "description": "The HHTP result code of the external callout made to a third-party tax engine provider. Refer to your third-party tax engine provider’s documentation for details about the specific codes returned."
      },
      "InteractionType": {
        "type": "picklist",
        "description": "Indicates the type of request made to the tax engine."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a tax engine interaction log record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a tax engine interaction log record. If this value is null, it’s possible that the user only accessed the tax engine interaction log record or a related list view (LastReferencedDate), but not viewed the tax engine interaction log record itself."
      },
      "ReferenceEntity": {
        "type": "string",
        "description": "The record on which tax was calculated."
      },
      "RequestBody": {
        "type": "base64",
        "description": "The content of the tax calculation API request."
      },
      "RequestContentType": {
        "type": "picklist",
        "description": "The type of data passed in the request. For example, application/html or text/csv."
      },
      "RequestLength": {
        "type": "int",
        "description": "The character length of text within the request body."
      },
      "RequestName": {
        "type": "string",
        "description": "The name of the request."
      },
      "RequestTaxTransactionType": {
        "type": "picklist",
        "description": "The type of tax transaction request sent to the tax engine provider. Available in API version 65.0 and later."
      },
      "ResponseContentType": {
        "type": "picklist",
        "description": "The method used to deliver the tax calculation API response, such as application/html or text/vnd.salesforce.quip-template."
      },
      "ResponseLength": {
        "type": "int",
        "description": "The character length of text within the response body."
      },
      "ResponseName": {
        "type": "string",
        "description": "The name of the response from the tax engine."
      },
      "ResponseTaxTransactionType": {
        "type": "picklist",
        "description": "The type of tax transaction response received from the tax engine provider. Available in API version 65.0 and later."
      },
      "ResultCode": {
        "type": "picklist",
        "description": "The code describing the result of the request."
      },
      "TaxEngineId": {
        "type": "reference",
        "description": "The ID of the tax engine used in the tax calculation process."
      },
      "TaxEngineInteractionLogNumber": {
        "type": "string",
        "description": "A system-generated number for a log entry."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_taxengineinteractionlog.htm"
  }
}