{
  "TaxPolicy": {
    "name": "TaxPolicy",
    "description": "A tax policy contains a group of tax treatments, where each treatment represents parameters to determine how a particular product is taxed for a transaction line item. Tax policies are related to products, which pass the policy on to the resulting order items. When you activate an order, Subscription Management assigns a tax treatment to each order item based on the tax policy's DefaultTaxTreatmentId, then uses the tax treatment to calculate tax.",
    "properties": {
      "DefaultTaxTreatmentId": {
        "type": "reference",
        "description": "When you order a product, the order product receives this tax treatment."
      },
      "Description": {
        "type": "textarea",
        "description": "Optional user-defined description for providing more information about the tax policy."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "Name": {
        "type": "string",
        "description": "Optional user-defined name for the tax policy."
      },
      "Status": {
        "type": "picklist",
        "description": "To calculate tax for order products, products must have an active tax policy. Tax policies are created with a Draft status before being assigned to a product or order product. After activating a tax policy, you can't edit certain policy fields."
      },
      "TreatmentSelection": {
        "type": "picklist",
        "description": "Defines how Subscription Management chooses a tax treatment to assign to order products related to this tax policy. In API version 55.0, only Default is supported."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_taxpolicy.htm"
  }
}