{
  "TaxTreatment": {
    "name": "TaxTreatment",
    "description": "Represents information about tax calculation by external engines. Each product requires a tax policy to determine whether to apply tax. Each tax policy requires at least one tax treatment. The tax treatments determine how taxable products are taxed.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "Additional details about the tax treatment."
      },
      "IsTaxable": {
        "type": "boolean",
        "description": "Required. Indicates whether to calculate tax for the order items covered by the tax treatment (true) or not (false). When this value is true, the CalculateTax API is called for the order item during the order item's creation."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a tax treatment record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a tax treatment record. If this value is null, it’s possible that the user only accessed the tax treatment record or a related list view (LastReferencedDate), but not viewed the tax treatment record itself."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "The ID of the legal entity record that's related to the tax treatment."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the tax treatment."
      },
      "ProductCode": {
        "type": "string",
        "description": "The code of the product that the tax treatment applies to."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the tax treatment record."
      },
      "TaxCode": {
        "type": "string",
        "description": "The reference code that's used when an external tax engine calculates tax."
      },
      "TaxEngineId": {
        "type": "reference",
        "description": "The ID of the tax engine record that's related to the tax treatment. When tax is calculated for an order item, the tax engine that's related to order item’s tax treatment is used. If the tax treatment’s IsTaxable field value is True, the treatment requires a tax engine."
      },
      "TaxPolicyId": {
        "type": "reference",
        "description": "The ID of the tax treatment’s parent tax policy."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_taxtreatment.htm"
  }
}