{
  "TenantSecret": {
    "name": "TenantSecret",
    "description": "This object stores an encrypted organization-specific key fragment that’s used with the primary secret (KDF seed) to produce org-specific data encryption keys.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the tenant secret."
      },
      "KeyDerivationMode": {
        "type": "picklist",
        "description": "The key derivation mode applied to customer-supplied key material. Modes are: PBKDF2 The customer-supplied key material is used by the Shield KMS to create a derived data encryption key. NONE The customer-supplied key material is used by the Shield KMS as the final data encryption key to directly encrypt and decrypt data. Available in API version 43.0 and later."
      },
      "RemoteKeyCertificate": {
        "type": "string",
        "description": "The name of the certificate whose public key is used to encrypt the SecretValue during a remote key callout.Available in API version 45.0 and later."
      },
      "RemoteKeyIdentifier": {
        "type": "string",
        "description": "A unique key identifier for key material fetched from a remote key service.Available in API version 45.0 and later."
      },
      "RemoteKeyServiceID": {
        "type": "reference",
        "description": "The named credential used to fetch remote key material from a remote key service.Available in API version 45.0 and later."
      },
      "SecretValue": {
        "type": "base64",
        "description": "The encrypted 256-bit secret value encoded in base64."
      },
      "SecretValueCertificate": {
        "type": "string",
        "description": "The certificate needed to upload a customer-supplied tenant secret. Each certificate has a unique name."
      },
      "SecretValueHash": {
        "type": "base64",
        "description": "The matching tenant secret hash for an uploaded customer-supplied tenant secret."
      },
      "Source": {
        "type": "picklist",
        "description": "The source of the encryption key material. Values are: HSM A Salesforce-generated tenant secret. Uploaded A customer-supplied tenant secret or data encryption key. Remote A tenant secret or data encryption key fetched from a key service outside of Salesforce. Available in API version 44.0 and later.Tenant secrets with a Source value of Remote are listed as Fetched on the Key Management page in Setup. Available in API version 43.0 and later."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the tenant secret. Values are: Active Can be used to encrypt and decrypt new or existing data. Archived Can’t encrypt new data. Can be used to decrypt data previously encrypted with this key when it was active. Destroyed Can’t encrypt or decrypt data. Data encrypted with this key when it was active can no longer be decrypted. Files and attachments encrypted with this key can no longer be downloaded."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of tenant secret. The Type field is available in API version 39.0 and later. The following values appear in the Type picklist: Analytics—CRM Analytics data (available in API version 39.0 and later). Data—data stored in the Salesforce database. Includes data in encrypted fields, files, and attachments but not search index files. Tenant secrets created in API version 34.0 and later default to the Data type. Database—transactional database including standard and custom fields, metadata, and Apex (available in API version 62.0 and later). DeterministicData—data stored in the Salesforce database. Includes data in encrypted fields, files, and attachments, but not search index files (available in API version 39.0 and later). EventBus—Change Data Capture event data (available in API version 43.0 and later). SearchIndex—search index files (available in API version 39.0 and later). For Hyperforce orgs on API version 63.0 and later, create secrets of type SearchIndex with the DataEncryptionKey object. For Hyperforce orgs on API version 62.0 and earlier, and for all non-Hyperforce orgs, create secrets of type SearchIndex with the TenantSecret object."
      },
      "Version": {
        "type": "int",
        "description": "The version number of this secret. The version number is unique within your org."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_tenantsecret.htm"
  }
}