{
  "Territory2": {
    "name": "Territory2",
    "description": "Represents a sales territory.",
    "properties": {
      "AccountAccessLevel": {
        "type": "picklist",
        "description": "Represents the default account record access levels for users that are assigned to the territory. Values are: Read Only Read/Write Owner"
      },
      "CaseAccessLevel": {
        "type": "picklist",
        "description": "Represents the default case record access levels for users that are assigned to the territory. Values are: Private Read Only Read/Write"
      },
      "ContactAccessLevel": {
        "type": "picklist",
        "description": "Represents the default contact record access levels for users that are assigned to the territory. Values are: Private Read Only Read/Write"
      },
      "Description": {
        "type": "string",
        "description": "The description of the territory. The field label in the user interface is Territory Description."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Required. The unique name of the object in the API. This name can contain only underscores and alphanumeric characters and must be unique in your organization. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. The field label in the user interface is Territory Name. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "ForecastUserId": {
        "type": "reference",
        "description": "Unique identifier of a territory’s forecast manager. To select a ForecastUserId, select someone in the list of users assigned to the territory."
      },
      "Name": {
        "type": "string",
        "description": "The name of the territory. The field label in the user interface is Territory Label."
      },
      "OpportunityAccessLevel": {
        "type": "picklist",
        "description": "Represents the default opportunity record access levels for users that are assigned to the territory. Values are: Private Read Only Read/Write"
      },
      "ParentTerritory2Id": {
        "type": "reference",
        "description": "The ID of the territory’s parent territory (if any). If the territory has no parent territory, this value is null."
      },
      "Territory2ModelId": {
        "type": "reference",
        "description": "The ID of the territory model that the territory belongs to."
      },
      "Territory2TypeId": {
        "type": "reference",
        "description": "The ID of the territory type that the territory belongs to."
      }
    },
    "module": "Core Salesforce"
  }
}