{
  "Territory2Model": {
    "name": "Territory2Model",
    "description": "Represents a territory model.",
    "properties": {
      "ActivatedDate": {
        "type": "dateTime",
        "description": "The date when the territory model was activated."
      },
      "DeactivatedDate": {
        "type": "dateTime",
        "description": "The date when the territory model was archived."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the territory model."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Required. The unique name of the object in the API. This name can contain only underscores and alphanumeric characters and must be unique in your organization. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. The field label in the user interface is Territory Model Name. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "LastOppTerrAssignEndDate": {
        "type": "dateTime",
        "description": "Read-only. The date when the opportunity territory assignment filter was last run. Used for Filter-Based Opportunity Territory Assignment (Pilot in Spring ’15 / API version 33)."
      },
      "LastRunRulesEndDate": {
        "type": "dateTime",
        "description": "The date when the last rules run was completed."
      },
      "Name": {
        "type": "string",
        "description": "The territory model name. The field label in the user interface is Label."
      },
      "State": {
        "type": "picklist",
        "description": "The state of the territory model. Values are: Planning, Activating, Activation Failed, Active, Archiving, Archiving Failed, Archived, Deleting, and Deletion Failed."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_territory2model.htm"
  }
}