{
  "TimeSheetWageTypeSummary": {
    "name": "TimeSheetWageTypeSummary",
    "description": "Represents a summary of the type of wages earned by a field service resource.",
    "properties": {
      "DoubleTimeHours": {
        "type": "double",
        "description": "The number of hours that a service resource works during a double-time shift as defined in labor agreements."
      },
      "DoubleTimeMinutes": {
        "type": "int",
        "description": "The number of minutes that a service resource works during a double-time shift, as defined in labor agreements."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The time when the time sheet entry ends."
      },
      "RegularTimeHours": {
        "type": "double",
        "description": "The number of hours that a service resource works during a regular shift as defined in labor agreements."
      },
      "RegularTimeMinutes": {
        "type": "int",
        "description": "The number of minutes that a service resource works during a regular shift, as defined in labor agreements."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The service resource associated with the time sheet."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The time when the time sheet entry starts."
      },
      "TimeAndHalfMinutes": {
        "type": "int",
        "description": "The number of minutes that a service resource works during a time-and-a-half shift, as defined in labor agreements."
      },
      "TimeSheetId": {
        "type": "reference",
        "description": "The time sheet associated with the time sheet wage type summary."
      },
      "TimeandHalfHours": {
        "type": "double",
        "description": "The number of hours that a service resource works during a time-and-a-half shift as defined in labor agreements."
      },
      "UnpaidTimeHours": {
        "type": "double",
        "description": "The number of unpaid hours when a service resource takes a break during working hours, as defined in labor agreements. This time isn't part of the service resource’s working hours."
      },
      "UnpaidTimeMinutes": {
        "type": "int",
        "description": "The number of unpaid minutes when a service resource takes a break during working hours, as defined in labor agreements. This time isn't part of the service resource’s working hours."
      }
    },
    "module": "Energy and Utilities Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.eu_developer_guide.meta/eu_developer_guide/sforce_api_objects_timesheetwagetypesummary.htm"
  }
}