{
  "TimeSlot": {
    "name": "TimeSlot",
    "description": "Represents a period of time on a specified day of the week during which work can be performed in Salesforce Scheduler. Operating hours consist of one or more time slots.",
    "properties": {
      "DayOfWeek": {
        "type": "picklist",
        "description": "The day of the week when the time slot takes place."
      },
      "EndTime": {
        "type": "time",
        "description": "The time when the time slot ends."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record can only have been referenced (LastReferencedDate) and not viewed."
      },
      "MaxAppointments": {
        "type": "int",
        "description": "Maximum number of appointments for a single time slot. Available in API version 47.0 and later."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The operating hours that the time slot belongs to. An operating hours’ time slots appear in the Operating Hours related list."
      },
      "StartTime": {
        "type": "time",
        "description": "The time when the time slot starts."
      },
      "TimeSlotNumber": {
        "type": "string",
        "description": "The name of the time slot. The name is auto-populated to a day and time format—for example, Monday 9:00 AM - 10:00 PM—but you can manually update it."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of time slot. Possible values are Normal and Extended. Default value must be Normal. You can choose to use Extended to represent overtime shifts."
      },
      "WorkTypeGroupId": {
        "type": "reference",
        "description": "Work type group assigned to the time slot. Available in API version 47.0 and later."
      }
    },
    "module": "Scheduler"
  }
}