{
  "TimeSheet": {
    "name": "TimeSheet",
    "description": "Represents a schedule of a service resource’s time in Field Service or Workforce Engagement.",
    "properties": {
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only if the multicurrency feature is enabled. Contains the ISO code for any currency allowed by the organization. The label in the user interface is Currency ISO Code."
      },
      "EndDate": {
        "type": "date",
        "description": "The last day the time sheet covers."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last interacted with this record, directly or indirectly. Some sample scenarios are:"
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the time sheet."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The service resource whose time is being tracked with the time sheet."
      },
      "StartDate": {
        "type": "date",
        "description": "The first day the time sheet covers."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the time sheet. The picklist includes the following values, which can be customized: New Submitted Approved"
      },
      "TimeSheetEntryCount": {
        "type": "int",
        "description": "(Read Only) The number of related time sheet entries."
      },
      "TimeSheetNumber": {
        "type": "string",
        "description": "An auto-generated number identifying the time sheet."
      },
      "TotalDurationInHours": {
        "type": "double",
        "description": "Represents the sum total of the duration field of all the time sheet entries related to the time sheet object in hours."
      },
      "TotalDurationInMinutes": {
        "type": "int",
        "description": "Represents the sum total of the duration field of all the time sheet entries related to the time sheet object in minutes."
      }
    },
    "module": "Field Service Lightning"
  }
}