{
  "TimeSheetTemplate": {
    "name": "TimeSheetTemplate",
    "description": "",
    "properties": {
      "Active": {
        "type": "boolean",
        "description": "Indicates whether the time sheet template is active (true) or not (false)."
      },
      "Description": {
        "type": "textarea",
        "description": "The time sheet template's description."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The API name of the time sheet template. Can contain alphanumeric characters and underscores, and must begin with a letter."
      },
      "Frequency": {
        "type": "picklist",
        "description": "Defines the frequency of the time sheet creation period. One of the following values: Daily Weekly EveryTwoWeeks TwiceAMonth Monthly"
      },
      "Fullname": {
        "type": "string",
        "description": "The full name of the associated metadata object in Metadata API. Query this field only if the query result contains no more than one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance."
      },
      "Language": {
        "type": "picklist",
        "description": "The language associated with the time sheet template."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "The name of the time sheet template."
      },
      "Metadata": {
        "type": "mns:TimeSheetTemplate",
        "description": "The TimeSheetTemplate metadata."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace that identifies the package that manages the time sheet template. Available in API version 48.0 and later."
      },
      "StartDate": {
        "type": "date",
        "description": "The date when the time sheet takes effect."
      },
      "TimeSheetTemplateAssignments": {
        "type": "QueryResult",
        "description": "A list of profiles that the template is assigned to. This field is only visible when the template has been assigned to at least one user profile. Available in API version 48.0 and later."
      },
      "WorkWeekEndDay": {
        "type": "picklist",
        "description": "The end day of the template's work week. One of the following values: Monday Tuesday Wednesday Thursday Friday Saturday Sunday (default)"
      },
      "WorkWeekStartDay": {
        "type": "picklist",
        "description": "The start day of the template's work week. One of the following values: Monday Tuesday Wednesday Thursday Friday Saturday Sunday (default)"
      }
    },
    "module": "Field Service Lightning",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.field_service_dev.meta/field_service_dev/tooling_api_objects_timesheettemplate.htm"
  }
}