{
  "TimeSheetEntry": {
    "name": "TimeSheetEntry",
    "description": "Represents a span of time that a service resource spends on a field service task.",
    "properties": {
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only if the multicurrency feature is enabled. Contains the ISO code for any currency allowed by the organization. The label in the user interface is Currency ISO Code.Time sheet entries inherit their time sheet’s currency code. Updates to a time sheet’s currency code aren’t reflected in existing time sheet entries’ currency code."
      },
      "Description": {
        "type": "textarea",
        "description": "Notes on how the time was spent. For example, “This service took longer than normal because the machine was jammed.”"
      },
      "DurationInMinutes": {
        "type": "int",
        "description": "Minutes recorded on the time sheet entry."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The date and time the activity finished."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last interacted with this record, directly or indirectly. Some sample scenarios are:"
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "LocationTimeZone": {
        "type": "picklist",
        "description": "Time zone of the location where the activity occurred."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The date and time the activity began."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the time sheet entry. The picklist includes the following values, which can be customized: New Submitted Approved"
      },
      "Subject": {
        "type": "string",
        "description": "Activity performed; for example, repair, lunch, or travel."
      },
      "TimeSheetEntryNumber": {
        "type": "string",
        "description": "An auto-generated number identifying the time sheet entry."
      },
      "TimeSheetId": {
        "type": "reference",
        "description": "The time sheet associated with the time sheet entry."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of work performed. The picklist includes the following values, which can be customized: Direct Indirect"
      },
      "WorkOrderId": {
        "type": "reference",
        "description": "The work order related to the time sheet entry. Work orders are searchable by their content."
      },
      "WorkOrderLineItemId": {
        "type": "reference",
        "description": "The work order line item related to the time sheet entry. Work order line items are searchable by their content."
      }
    },
    "module": "Field Service Lightning"
  }
}