{
  "TimeSheetEntryItem": {
    "name": "TimeSheetEntryItem",
    "description": "Represents the details of the time sheet entry that is used by an Enterprise Asset Management system to pay the field service worker accroding to labor laws and company policy.",
    "properties": {
      "CostCenterId": {
        "type": "reference",
        "description": "The cost center associated with the time sheet entry item."
      },
      "DurationHours": {
        "type": "double",
        "description": "The difference in hours between the end time and the start time of the time sheet entry item."
      },
      "DurationMinutes": {
        "type": "int",
        "description": "The difference in minutes beetween the end time and the start time of the time sheet entry item"
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The time when the item from the time sheet entry ends."
      },
      "JobExpenseTypeId": {
        "type": "reference",
        "description": "The job expense type associated with the time sheet entry item."
      },
      "OvertimeApproverId": {
        "type": "reference",
        "description": "The overtime approver associated with the time sheet entry item."
      },
      "OvertimeTypeId": {
        "type": "reference",
        "description": "The overtime type associated with the time sheet entry item."
      },
      "PayTypeId": {
        "type": "reference",
        "description": "The pay type associated with the time sheet entry item, used to classify the time sheet entry."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The service resource associated with the time sheet entry."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The time when the item from the time sheet entry starts."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the approval status of the time sheet entry item by the crew lead or supervisor."
      },
      "StatusComment": {
        "type": "string",
        "description": "The comment added with a status change to a time sheet entry item."
      },
      "SubmitDate": {
        "type": "date",
        "description": "The date when the crew lead or supervisor submits the time sheet entry item record."
      },
      "TimeSheetEntryId": {
        "type": "reference",
        "description": "The time sheet associated with the time sheet entry item."
      }
    },
    "module": "Energy and Utilities Cloud"
  }
}