{
  "TransactionSecurityEventLog": {
    "name": "TransactionSecurityEventLog",
    "description": "Transaction Security event logs contain details about policy execution. Legacy transaction security policy details are supported in API version 38.0 and later. Enhanced transaction security policy details are supported in API version 61.0 and later.",
    "properties": {
      "ApexIdentifier": {
        "type": "string",
        "description": "The ID of the Apex code used to evaluate the policy."
      },
      "ClientIp": {
        "type": "string",
        "description": "The IP address of the client that’s using Salesforce services. A Salesforce internal IP, such as a login from AppExchange, is shown as “Salesforce.com IP”. For example: 96.43.144.26."
      },
      "CpuTime": {
        "type": "double",
        "description": "The CPU time in milliseconds used to complete the request. This field indicates the amount of activity taking place in the app server layer."
      },
      "EvaluationTime": {
        "type": "double",
        "description": "The time in milliseconds used to evaluate the policy."
      },
      "EventName": {
        "type": "string",
        "description": "The name of the event, which is Transaction Security Event."
      },
      "FlowIdentifier": {
        "type": "string",
        "description": "The ID of the flow used to evaluate the policy."
      },
      "LoginKey": {
        "type": "string",
        "description": "The string that ties together all events in a given user’s login session. It starts with a login event and ends with either a logout event or the user session expiring. For example: GeJCsym5eyvtEK2I."
      },
      "PolicyIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the policy being evaluated. For example: 00530000009M943."
      },
      "PolicyOutcome": {
        "type": "string",
        "description": "The result of the transaction policy."
      },
      "PolicyType": {
        "type": "string",
        "description": "The real time action selected for the policy."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "Globally unique id for a given request. For example: 3nWgxWbDKWWDIk0FKfF5DV."
      },
      "Result": {
        "type": "string",
        "description": "The outcome of evaluating the policy. For example: NOT TRIGGERED."
      },
      "RunTime": {
        "type": "double",
        "description": "The amount of time that the request took in milliseconds."
      },
      "SendEmailNotification": {
        "type": "boolean",
        "description": "Indicates whether to send an email notification. The default value is false."
      },
      "SendInAppNotification": {
        "type": "boolean",
        "description": "Indicates whether to send an in-app notification. The default value is false."
      },
      "SessionKey": {
        "type": "string",
        "description": "The user’s unique session ID. You can use this value to identify all user events within a session. When a user logs out and logs in again, a new session is started. For example: d7DEq/ANa7nNZZVD."
      },
      "Timestamp": {
        "type": "dateTime",
        "description": "The access time of Salesforce services in GMT. For example, 2020-01-20T19:12:26.965Z. Milliseconds are the most granular setting."
      },
      "TriggeredTimestamp": {
        "type": "string",
        "description": "The time at which the Transaction Security event was generated in ISO8601-compatible format. For example: 2015-07-27T11:32:59.555Z."
      },
      "Uri": {
        "type": "string",
        "description": "The URI of the page that’s receiving the request. For example: /home/home.jsp."
      },
      "UserIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the user who’s using Salesforce services through the UI or the API. For example: 00530000009M943."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_transactionsecurityeventlog.htm"
  }
}