{
  "TwoFactorMethodsInfo": {
    "name": "TwoFactorMethodsInfo",
    "description": "Stores information about which identity verification methods a user has registered.",
    "properties": {
      "ExternalId": {
        "type": "string",
        "description": "A unique system-generated numerical identifier for the user."
      },
      "HasBuiltInAuthenticator": {
        "type": "boolean",
        "description": "If true, the user has registered a built-in authenticator on their device, such as Touch ID or Windows Hello. The user can verify their identity by using the built-in authenticator."
      },
      "HasSalesforceAuthenticator": {
        "type": "boolean",
        "description": "If true, the user has connected the Salesforce Authenticator mobile app. The user can verify identity by approving a notification sent to the app. If the user sets a trusted location in the app, Salesforce Authenticator verifies automatically when the user is in the trusted location."
      },
      "HasSecurityKey": {
        "type": "boolean",
        "description": "If true, the user has registered a WebAuthn-compatible security key. This field includes all security keys registered or used after Summer ’22. The user can verify their identity by inserting the security key into a USB port to generate credentials."
      },
      "HasTempCode": {
        "type": "boolean",
        "description": "If true, the user has a temporary verification code generated by a Salesforce admin or user with Manage Multi-Factor Authentication in User Interface permission."
      },
      "HasTotp": {
        "type": "boolean",
        "description": "If true, the user has connected an authenticator app that generates verification codes, also known as time-based one-time passwords (TOTP). The user can verify identity by entering a code generated by the app."
      },
      "HasU2F": {
        "type": "boolean",
        "description": "If true, the user has registered a U2F security key. The user can verify identity by inserting the security key into a USB port to generate credentials."
      },
      "HasUserVerifiedEmailAddress": {
        "type": "boolean",
        "description": "If true, the user's email address is verified.This parameter is available in API version 43.0 and later."
      },
      "HasUserVerifiedMobileNumber": {
        "type": "boolean",
        "description": "If true, the user has self-registered and verified a mobile phone number. Salesforce can text a verification code to the user at that number.This parameter is available in API version 43.0 and later."
      },
      "HasVerifiedMobileNumber": {
        "type": "boolean",
        "description": "If true, the user has a mobile phone number that was added by an administrator or self-registered by the user. Salesforce can text a verification code to the user at that number."
      },
      "UserId": {
        "type": "reference",
        "description": "ID of the user who’s associated with the identity verification methods."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_twofactormethodsinfo.htm"
  }
}