{
  "MailmergeTemplate": {
    "name": "MailmergeTemplate",
    "description": "Represents a mail merge template (a Microsoft Word document) used for performing mail merges for your organization.",
    "properties": {
      "Body": {
        "type": "base64",
        "description": "Required. Microsoft Word document to use as a mail merge template. Due to limitations with Microsoft Word mail merge templates, your client application can specify the Body field when creating these records, but not when updating them. Limit: 5 MB."
      },
      "BodyLength": {
        "type": "int",
        "description": "Length of the Microsoft Word document."
      },
      "Category": {
        "type": "picklist",
        "description": "The type of document template. Possible values are: Document Envelope Label The default value is Document."
      },
      "Description": {
        "type": "string",
        "description": "Required. Text description of this mail merge template. Limit: 255 characters."
      },
      "Filename": {
        "type": "string",
        "description": "Required. File name of the Microsoft Word document that was uploaded as a mail merge template. Limit: 255 characters in length."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "LastUsedDate": {
        "type": "dateTime",
        "description": "Date and time when this MailmergeTemplate was last used."
      },
      "Name": {
        "type": "string",
        "description": "Required. Name of this mail merge template."
      },
      "SecurityOptionsAttachmentHasFlash": {
        "type": "boolean",
        "description": "Required. True if Flash Injection was detected in the attachment."
      },
      "SecurityOptionsAttachmentHasXSSThreat": {
        "type": "boolean",
        "description": "Required. True if a cross site scripting threat was detected in the attachment."
      },
      "SecurityOptionsAttachmentScannedforFlash": {
        "type": "boolean",
        "description": "Required. True if the attachment has been scanned for Flash Injection."
      },
      "SecurityOptionsAttachmentScannedForXSS": {
        "type": "boolean",
        "description": "Required. True if the attachment has been scanned for a cross site scripting threat."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_mailmergetemplate.htm"
  }
}