{
  "MaintenanceAsset": {
    "name": "MaintenanceAsset",
    "description": "Represents an asset covered by a maintenance plan in field service. Assets can be associated with multiple maintenance plans.",
    "properties": {
      "AssetId": {
        "type": "reference",
        "description": "The asset associated with the maintenance asset."
      },
      "ContractLineItemId": {
        "type": "reference",
        "description": "Contract line item associated with the maintenance asset. This field can only list a contract line item that is associated with the asset, and whose parent service contract is associated with the parent maintenance plan."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the maintenance asset was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the product request was last viewed."
      },
      "MaintenanceAssetNumber": {
        "type": "string",
        "description": "An auto-assigned number that identifies the maintenance asset."
      },
      "MaintenancePlanId": {
        "type": "reference",
        "description": "Maintenance plan associated with the maintenance asset."
      },
      "NextSuggestedMaintenanceDate": {
        "type": "date",
        "description": "The suggested date of service for the maintenance asset’s first work order (not the date the work order is created). This corresponds to the work order’s SuggestedMaintenanceDate. If left blank when the maintenance asset is created, this field inherits its initial value from the related maintenance plan. This field auto-updates after each batch is generated. Its label in the user interface is Date of the first work order in the next batch."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "Work type associated with the maintenance asset. Work orders generated from the maintenance plan inherit its work type’s duration, required skills and products, and linked articles. Maintenance assets covered by the plan use the same work type, though you can update them to use a different one."
      }
    },
    "module": "Field Service Lightning"
  }
}