{
  "ManagedContentNodeType": {
    "name": "ManagedContentNodeType",
    "description": "",
    "properties": {
      "HelpText": {
        "type": "textarea",
        "description": "Provides assistive text in the UI, displayed as an info bubble for the field. If this field is empty, no info bubble icon or text is displayed."
      },
      "NodeLabel": {
        "type": "string",
        "description": "Declares the label for the field as it appears in the UI."
      },
      "NodeName": {
        "type": "string",
        "description": "Unique name of the NodeType within the content type."
      },
      "NodeOptionsIsLocalizable": {
        "type": "boolean",
        "description": "Declares a field as localizable so it’s exported (true) or not (false) by the content translation service in the Digital Experiences app. Default is false."
      },
      "NodeOptionsIsRequired": {
        "type": "boolean",
        "description": "Declares a field as required (true) or not (false). Fields declared as a required are indicated by a red asterisk. If a value isn’t added to the field, the form can't be saved and a standard error is displayed. Default is false."
      },
      "NodeType": {
        "type": "picklist",
        "description": "Identifies the supported type of content in the node. Passed as a string. There’s a maximum of 15 node types per content type. Valid values are: TEXT—Simple text node (maximum length 255 characters) MTEXT—Multi-line text node (maximum length 2000 characters) RTE—Rich text node (maximum length 65536 characters) IMG—Image node URL—URL node (maximum length 255 characters)URL accepts protocol string values starting with http://, https://, mailto:, tel:, and /. DATE—Date node DATE accepts dates only in the format yyyy-MM-dd. DATETIME—Datetime node DATETIME accepts date and time in the format: yyyy-MM-dd'T'HH:mm:ss.SSS'Z' (UTC datetime in ISO 8601 format). NAMEFIELD—Declares the field as the name that represents the content when referenced in the UI. For example, in a list of available content in the Digital Experiences app or as available for inclusion in a collection in Experience Cloud sites. Declare only one NodeType in your managed content type as NAMEFIELD. NAMEFIELD is a string type of 200 characters or less. When NAMEFIELD is used, isRequired must also be set to True for the field."
      },
      "PlaceholderText": {
        "type": "textarea",
        "description": "Provides assistive text in the UI, displayed as placeholder, or ghost text, in a field before any entry is made. For example, Enter a title for your article..."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_managedcontentnodetype.htm"
  }
}