{
  "MenuItem": {
    "name": "MenuItem",
    "description": "Represents a menu item.",
    "properties": {
      "Active": {
        "type": "boolean",
        "description": "Indicates whether the item in the menu is active (true) or not (false)."
      },
      "AppId": {
        "type": "string",
        "description": "The ID of the app that this menu item is associated with. Can be an enum (such as Feed or People) or an alphanumeric ID."
      },
      "Color": {
        "type": "string",
        "description": "The color of the menu item that appears in the user interface. This field is described in Web color RGB format, such as 00FF00."
      },
      "IconURL": {
        "type": "url",
        "description": "The URL of an icon in the menu item."
      },
      "Label": {
        "type": "string",
        "description": "The menu item label that appears in the user interface."
      },
      "MenuType": {
        "type": "picklist",
        "description": "The type of menu that this menu item belongs to. Valid values are: AppSwitcher: the app menu, a drop-down menu that’s displayed at the top of every app page Salesforce1: the Salesforce mobile app navigation menu NetworkTabs: the Digital Experiences tab set"
      },
      "SortOrder": {
        "type": "int",
        "description": "The SortOrder value determines the order in which a menu item is displayed in the user interface. This field must be an ordinal number greater than 0, and must be unique in the list. Inactive menu items have a value of -1."
      },
      "Theme": {
        "type": "string",
        "description": "The associated theme, which must be one of the following values. theme2: the Salesforce theme that was used prior to Spring ’10 theme3: the Salesforce theme that was introduced in Spring ’10 theme4: the theme that was introduced in Winter ’14 for the mobile touchscreen version of Salesforce custom: the theme that’s associated with a custom icon"
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_menuitem.htm"
  }
}