{
  "MerchantAccount": {
    "name": "MerchantAccount",
    "description": "A type of bank account that lets a merchant accept payments from a variety of payment methods, including credit or debit cards, or digital wallets. A Salesforce Payments merchant account is linked to an underlying payment gateway to process payments",
    "properties": {
      "AccountDescription": {
        "type": "textarea",
        "description": "Information about the merchant account."
      },
      "CountryIsoCode": {
        "type": "string",
        "description": "Country where the legal entity representing the account is."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Contains the ISO code for any currency allowed by the organization. Available only for organizations with multi-currency enabled."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user can have accessed this record or list view but not viewed it."
      },
      "Mode": {
        "type": "picklist",
        "description": "The operational mode of the merchant account. This field determines the account’s ability to accept payments. For production, the account must be in Live mode."
      },
      "Name": {
        "type": "string",
        "description": "Name of the merchant account."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Name of the individual or group assigned to the merchant account."
      },
      "PaymentStatus": {
        "type": "picklist",
        "description": "Merchant account is active and can accept payments."
      },
      "PayoutStatus": {
        "type": "picklist",
        "description": "Money can be moved from the payment provider account to the designated merchant account."
      },
      "Status": {
        "type": "picklist",
        "description": "Indicates the state of the merchant account."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_merchantaccount.htm"
  }
}