{
  "MessagingChannelUsage": {
    "name": "MessagingChannelUsage",
    "description": "Represents the status of an enhanced Messaging channel or of an application in a Unified Messaging channel.",
    "properties": {
      "ConsentType": {
        "type": "picklist",
        "description": "The level of customer consent required for your business to message a customer on this channel. Customers can opt out at any time."
      },
      "DeploymentStatus": {
        "type": "picklist",
        "description": "The status of the connected channel or application. If the DeploymentStatus is Active, messages can be sent or received (if permitted)."
      },
      "DeploymentType": {
        "type": "picklist",
        "description": "Indicates whether the record is related to Service Cloud or Marketing Cloud."
      },
      "DisabledTime": {
        "type": "dateTime",
        "description": "The time the MessagingChannelUsage record entered the Disabled state after an admin clicked Disconnect or Deactivate on the application or channel."
      },
      "ErrorReason": {
        "type": "picklist",
        "description": "If an error occurs during connection, activation, disconnection, or deactivation of a MessagingChannelUsage record, the ErrorReason provides more information about what went wrong. For example, if an associated Service Cloud application for a Unified Messaging channel is missing a fallback queue or consent keywords, the connection attempt fails with an ErrorReason of ProvisioningError."
      },
      "MessagingChannelId": {
        "type": "reference",
        "description": "The enhanced Messaging channel or Unified Messaging channel that the MessagingChannelUsage record is associated with. A MessagingChannel can be associated with up to three MessagingChannelUsage records."
      },
      "RoutingOverride": {
        "type": "picklist",
        "description": "Applicable only to MessagingChannelUsage records with a deployment type of MJ (Marketing Cloud). RoutingOverride indicates how messages are delivered in a unified channel where both the Service and Marketing applications are connected."
      }
    },
    "module": "Core Salesforce"
  }
}