{
  "MessagingEndUser": {
    "name": "MessagingEndUser",
    "description": "Represents a single address—such as a phone number or Facebook page—communicating with a single Messaging channel.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "ID of the Account associated with this Messaging end user. Available in API version 43.0 and later."
      },
      "ContactId": {
        "type": "reference",
        "description": "ID of the associated Contact. Available in API version 43.0 and later."
      },
      "HasInitialResponseSent": {
        "type": "boolean",
        "description": "Indicates whether an initial response has been sent to the Messaging end user (true) or not (false)."
      },
      "IsFullyOptedIn": {
        "type": "boolean",
        "description": "Indicates whether the Messaging end user has opted in to receiving messages (true) or not (false). This field compares the related messaging channel’s consent requirement to the user’s consent status; if the user’s status meets the channel’s required consent level, IsFullyOptedIn is set to true. Available in API version 48.0 and later."
      },
      "IsOptedOut": {
        "type": "boolean",
        "description": "Indicates whether the Messaging end user has opted out of receiving messages. Available in API version 48.0 and earlier. Use MessagingConsentStatus and IsFullyOptedIn instead."
      },
      "IsoCountryCode": {
        "type": "string",
        "description": "The ISO country code associated with the Messaging end user."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "LeadId": {
        "type": "reference",
        "description": "ID of the associated lead. Available in API version 57.0 and later."
      },
      "Locale": {
        "type": "string",
        "description": "Reserved for future use."
      },
      "Language": {
        "type": "picklist",
        "description": "The preferred language of the messaging user who participated in the messaging session. SUpported for Messaging for In-App and Web and Apple Messages for Business only."
      },
      "MessageType": {
        "type": "picklist",
        "description": "Type of message. Possible values are: AppleBusinessChat—Represents Apple Messages for Business. Custom—Represents Bring Your Own Channel. Available in API version 58.0 and later. EmbeddedMessaging—Represents Messaging for In-App and Web. Available in API version 50.0 and later. Facebook Phone Text Voice WhatsApp"
      },
      "MessagingChannelId": {
        "type": "reference",
        "description": "The ID of the Messaging channel associated with the Messaging end user."
      },
      "MessagingConsentStatus": {
        "type": "picklist",
        "description": "The consent status of the messaging user. This field is available in API version 48.0 and later. Possible values are: DoublyOptedIn ExplicitlyOptedIn ImplicitlyOptedIn OptedOut"
      },
      "MessagingPlatformKey": {
        "type": "string",
        "description": "The phone number, Facebook page ID, or unique key associated with this Messaging end user."
      },
      "Name": {
        "type": "string",
        "description": "The name of the Messaging end user. Because this field is editable, we don’t recommend referencing it in automation. Instead, use the Messaging Platform Key."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner associated with this Messaging end user."
      },
      "ProfilePictureUrl": {
        "type": "url",
        "description": "The URL of the Messaging end user's profile picture."
      }
    },
    "module": "Core Salesforce"
  }
}