{
  "MessagingSession": {
    "name": "MessagingSession",
    "description": "Represents a session on a Messaging channel.",
    "properties": {
      "AcceptTime": {
        "type": "dateTime",
        "description": "The time when an agent accepts an incoming Messaging session."
      },
      "AgentMessageCount": {
        "type": "int",
        "description": "The number of messages sent by the agent during the session."
      },
      "AgentType": {
        "type": "picklist",
        "description": "The type of agent that is assigned to the Messaging session. Possible values are: Agent Bot BotToAgent—Bot & Agent System—Used for triggered outbound messages"
      },
      "CaseId": {
        "type": "reference",
        "description": "The ID of the case associated with this Messaging session."
      },
      "ChannelEndUserFormula": {
        "type": "string",
        "description": "A concatenation of the Messaging channel and Messaging user."
      },
      "": {
        "type": "",
        "description": ""
      },
      "ChannelKey": {
        "type": "string",
        "description": "The unique identifier for the associated Messaging channel."
      },
      "ChannelLocale": {
        "type": "string",
        "description": "The locale of the associated Messaging channel."
      },
      "ChannelName": {
        "type": "string",
        "description": "The name of the associated Messaging channel."
      },
      "ChannelType": {
        "type": "picklist",
        "description": "The type of the associated Messaging channel. Possible values are: Alexa AppleBusinessChat—Represents Apple Messages for Business. EmbeddedMessaging—Available in API version 55.0 and later. Facebook GoogleHome Line Omega Phone Text Voice WeChat WebChat WhatsApp"
      },
      "ConversationId": {
        "type": "reference",
        "description": "The ID of the related conversation. Available in API version 55.0 and later."
      },
      "EndedByType": {
        "type": "picklist",
        "description": "Who or what ended the enhanced messaging session. Possible values are: Agent Bot EndUser System: The session is inactive for a while, so the session ends. An automation ends the session. The session ended because of an error."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The time when the Messaging session ended."
      },
      "EndUserAccountId": {
        "type": "reference",
        "description": "The ID of the end user's account record."
      },
      "EndUserContactId": {
        "type": "reference",
        "description": "The ID of the end user's contact record."
      },
      "EndUserLanguage": {
        "type": "picklist",
        "description": "The preferred language of the messaging user who participated in the messaging session."
      },
      "EndUserMessageCount": {
        "type": "int",
        "description": "The number of messages sent by the Messaging end user."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "LeadId": {
        "type": "reference",
        "description": "The ID of the Lead associated with this Messaging session."
      },
      "MessagingChannelId": {
        "type": "reference",
        "description": "The ID of the Messaging channel associated with this Messaging session."
      },
      "MessagingEndUserId": {
        "type": "reference",
        "description": "The ID of the Messaging end user associated with this Messaging session."
      },
      "Name": {
        "type": "string",
        "description": "The name of this Messaging session."
      },
      "OpportunityId": {
        "type": "reference",
        "description": "The ID of the opportunity record associated with this Messaging session."
      },
      "Origin": {
        "type": "picklist",
        "description": "The origin of this Messaging session. Possible values are: AgentInitiated ConversationClose—Messaging user deleted the conversation in Apple Messages ConversationControlLost—Third-party bot resumes control from Salesforce bot or agent Help InboundInitiated OptIn—Opt In Status Change OptOut—Opt Out Status Change TriggeredOutbound Messaging sessions can’t be created using Apex code. They can be created only through customer initiation or by using Process Builder, flows, or the Start Conversation action."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the owner associated with this Messaging session."
      },
      "PreviewDetails": {
        "type": "string",
        "description": "The preview shown to an agent for this Messaging session."
      },
      "SessionKey": {
        "type": "string",
        "description": "The identifier for the Messaging session."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The time when the Messaging session started."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the Messaging session. Possible values are: New (standard channels only) Active Consent (enhanced channels only) Waiting Paused (enhanced channels only) Inactive (enhanced channels only) Ended Error (enhanced channels only) To learn more about these statuses, see Lifecycle of a Messaging Session in Salesforce Help."
      },
      "TargetUserId": {
        "type": "reference",
        "description": "The ID of the target user associated with this Messaging session."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_messagingsession.htm"
  }
}