{
  "MfgProgramForecastFact": {
    "name": "MfgProgramForecastFact",
    "description": "Represents information about the generated manufacturing program forecast records.",
    "properties": {
      "AdjustedForecastedQuantity": {
        "type": "double",
        "description": "The adjusted value of the forecasted quantity."
      },
      "AdjustedForecastedRevenue": {
        "type": "currency",
        "description": "The adjusted value of the forecasted revenue."
      },
      "AdvAcctForecastSetUseId": {
        "type": "reference",
        "description": "The advanced account forecast set context associated with the manufacturing program forecast fact record."
      },
      "ExpectedRevenuePerUnit": {
        "type": "currency",
        "description": "The expected revenue per unit of the product."
      },
      "ExternalReferenceNumber": {
        "type": "string",
        "description": "The external identifier for the manufacturing program forecast fact record."
      },
      "ForecastedQuantity": {
        "type": "double",
        "description": "The forecasted quantity of the product associated with the manufacturing program that’s calculated by multiplying the product quantity with the market share percentage."
      },
      "ForecastedRevenue": {
        "type": "currency",
        "description": "The forecasted revenue of the manufacturing program that’s calculated by multiplying the forecasted quantity with the market share percentage."
      },
      "ManufacturingProgramId": {
        "type": "reference",
        "description": "The manufacturing program associated with the manufacturing program forecast fact record."
      },
      "MarketSharePercent": {
        "type": "percent",
        "description": "The market share of the total number of product units in percent. For example, if an OEM is planning to manufacture 10,000 cars of the ABC model in December 2021 and 25% will be manufactured at plant XYZ, 25% is the market share."
      },
      "Name": {
        "type": "string",
        "description": "The name of the manufacturing program forecast fact record."
      },
      "PeriodId": {
        "type": "reference",
        "description": "The calendar period associated with the manufacturing program forecast fact record."
      },
      "PeriodStartDate": {
        "type": "date",
        "description": "The start date of the period for which the manufacturing program forecast fact records are generated."
      },
      "PreviousPeriodProgramQuantity": {
        "type": "double",
        "description": "The product quantity in the previous period."
      },
      "ProductionLocationId": {
        "type": "reference",
        "description": "The production location of the account."
      },
      "ProductionModelId": {
        "type": "reference",
        "description": "The production model associated with the manufacturing program forecast fact record."
      },
      "ProgramQuantity": {
        "type": "double",
        "description": "The total number of units of the product that is manufactured as part of the program."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the manufacturing program forecast fact record."
      }
    },
    "module": "Manufacturing Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.mfg_api_devguide.meta/mfg_api_devguide/sforce_api_objects_mfgprogramforecastfact.htm"
  }
}