{
  "MfgProgramCpntFrcstFact": {
    "name": "MfgProgramCpntFrcstFact",
    "description": "Represents information about the generated manufacturing program component forecast records.",
    "properties": {
      "AdjustedForecastedQuantity": {
        "type": "double",
        "description": "The adjusted value of the forecasted quantity."
      },
      "AdjustedForecastedRevenue": {
        "type": "currency",
        "description": "The adjusted value of the forecasted revenue."
      },
      "AdvAcctForecastSetUseId": {
        "type": "reference",
        "description": "The advanced account forecast set context associated with the manufacturing program component forecast fact record."
      },
      "CostUnitOfMeasurementId": {
        "type": "reference",
        "description": ""
      },
      "ExpectedProfitPerUnit": {
        "type": "currency",
        "description": "The expected profit per unit from the product variant component."
      },
      "ExpectedProfitPercent": {
        "type": "percent",
        "description": "The expected profit from the product variant component in percent."
      },
      "ExternalReferenceNumber": {
        "type": "string",
        "description": "The external identifier for the manufacturing program component forecast fact record."
      },
      "ForecastedQuantity": {
        "type": "double",
        "description": "The forecasted quantity of the product variant component that’s calculated by multiplying the forecasted quantity of the associated manufacturing program with the number of component units per product variant unit."
      },
      "ForecastedRevenue": {
        "type": "currency",
        "description": "The forecasted revenue from the product variant component."
      },
      "ManufacturingProgramId": {
        "type": "reference",
        "description": "The manufacturing program associated with the manufacturing program product variant component forecast fact record."
      },
      "Name": {
        "type": "string",
        "description": "The name of the Manufacturing Program Component Forecast Fact record."
      },
      "PeriodId": {
        "type": "reference",
        "description": "The period associated with the manufacturing program product variant component forecast fact record."
      },
      "PeriodStartDate": {
        "type": "date",
        "description": "The start date of the period for which the manufacturing program component forecast fact records are generated."
      },
      "ProductComponentId": {
        "type": "reference",
        "description": "The component of the product variant that’s associated with the manufacturing program product variant component forecast fact record."
      },
      "ProductId": {
        "type": "reference",
        "description": "The manufacturing program product associated with the manufacturing program product component forecast fact record."
      },
      "ProductionLocationId": {
        "type": "reference",
        "description": "The production location of the account."
      },
      "ProductionModelId": {
        "type": "reference",
        "description": "The model associated with the manufacturing program component forecast fact record."
      },
      "SellingPricePerUnit": {
        "type": "currency",
        "description": "The selling price of a unit of the product variant component."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the manufacturing program product variant component forecast fact record."
      },
      "TotalCostPerUnit": {
        "type": "currency",
        "description": "The total cost of a unit of the product variant component that's calculated by adding the total fixed cost per unit and the variable cost per unit."
      },
      "TotalFixedCostPerUnit": {
        "type": "double",
        "description": "The total fixed cost of a unit of the product variant component."
      },
      "VariableCostPerUnit": {
        "type": "currency",
        "description": "The variable cost of a unit of the product variant component."
      }
    },
    "module": "Manufacturing Cloud"
  }
}