{
  "MLPredictionDefinition": {
    "name": "MLPredictionDefinition",
    "description": "Represents a prediction definition that specifies details about the prediction.",
    "properties": {
      "ApplicationId": {
        "type": "reference",
        "description": "The unique ID of the parent AI Application."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the prediction. Possible values are: da—Danish de—German en_US—English es—Spanish es_MX—Spanish (Mexico) fi—Finnish fr—French it—Italian ja—Japanese ko—Korean nl_NL—Dutch no—Norwegian pt_BR—Portuguese (Brazil) ru—Russian sv—Swedish th—Thai zh_CN—Chinese (Simplified) zh_TW—Chinese (Traditional)"
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label that identifies the prediction throughout the Salesforce user interface."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "Specifies the namespace of the prediction, if installed with a managed package."
      },
      "PredictionField": {
        "type": "string",
        "description": "Field that the prediction is based on."
      },
      "PushbackField": {
        "type": "string",
        "description": "Field that the prediction writes scores to."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the prediction. Possible values are: Disabled Draft Enabled"
      },
      "Type": {
        "type": "picklist",
        "description": "The type of model that returns the prediction values. Possible values are: BinaryClassification DeepLearningIntentClassification DeepLearningNameEntityRecognition GlobalDeepLearningIntentClassification GlobalDeepLearningNameEntityRecognition LanguageDetection MulticlassClassification Regression ScoringSpecificOutcome"
      }
    },
    "module": "Core Salesforce"
  }
}