{
  "GeneratedWaste": {
    "name": "GeneratedWaste",
    "description": "Represents the information on the waste generated in operations, the waste generated while treating end-of-life products that were sold, and so on.",
    "properties": {
      "CrbnEmssnScopeAlloc": {
        "type": "picklist",
        "description": "The allocation of scope emissions that override the scope allocation defined for the waste type and the disposal type."
      },
      "Description": {
        "type": "textarea",
        "description": ""
      },
      "DisposalSiteType": {
        "type": "picklist",
        "description": "The type of disposal site. The emissions from waste disposal are considered as scope 3 emissions when you select Offsite and as scope 1 emissions when you select Onsite."
      },
      "DisposalType": {
        "type": "picklist",
        "description": "Specifies the method used to remove waste from the environment after it has been collected and processed."
      },
      "DisposedWasteQtyUnitRefId": {
        "type": "reference",
        "description": "The custom disposed waste quantity unit of measure that's associated with the generated waste."
      },
      "DisposedWasteQuantity": {
        "type": "double",
        "description": ""
      },
      "DisposedWasteQuantityUnit": {
        "type": "picklist",
        "description": ""
      },
      "DisposedWasteQuantityinTonnes": {
        "type": "double",
        "description": "The quantity of disposed waste in tonnes that’s calculated based on the disposed waste quantity and disposed waste quantity unit."
      },
      "EndDate": {
        "type": "date",
        "description": "The date until when the waste-related data is sent for reporting."
      },
      "IsHazardous": {
        "type": "boolean",
        "description": "Indicates whether the waste material is hazardous (true) or not (false)."
      },
      "IsRadioactive": {
        "type": "boolean",
        "description": "Indicates whether the waste material is radioactive (true) or not (false)."
      },
      "IsRecordLocked": {
        "type": "boolean",
        "description": ""
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "Scope1EmissionsInTco2e": {
        "type": "double",
        "description": "The scope 1 emissions from associated stationary assets for waste that’s disposed onsite."
      },
      "Scope3CrbnFtprntId": {
        "type": "reference",
        "description": "The scope 3 carbon footprint record associated with this generated waste record. This specified record is used to aggregate scope 3 waste-related emissions and the other scope 3 emissions."
      },
      "Scope3EmssnSrcId": {
        "type": "reference",
        "description": "The scope 3 emissions source record associated with the waste related to non-stationary assets, such as waste related to the end-of-life treatment of sold products."
      },
      "Scp3DnstrmEndLifeSoldPrdct": {
        "type": "double",
        "description": "The scope 3 downstream emissions from the end-of-life treatment of sold products. This value is calculated based on the waste associated with scope 3 emissions source."
      },
      "Scp3UpstrmWstGenInOper": {
        "type": "double",
        "description": "The scope 3 upstream emissions from the waste generated in operations. This value is calculated based on the waste associated with the stationary asset environmental source that’s disposed offsite."
      },
      "StartDate": {
        "type": "date",
        "description": "The date from when the waste-related data is sent for reporting."
      },
      "StnryAssetEnvrSrcId": {
        "type": "reference",
        "description": "The stationary asset environmental source record associated with the waste related to stationary assets, such as the waste generated in operations."
      },
      "SuplScope1EmissionsInTco2e": {
        "type": "double",
        "description": "The supplemental scope 1 emissions value that’s added to the total scope 1 emissions."
      },
      "SuplScp3DnstrmEndLifeSoldPrdct": {
        "type": "double",
        "description": "The supplemental downstream scope 3 emissions from the end-of-life treatment of sold products. This value is added to the total scope 3 downstream emissions from the end-of-life treatment of sold products."
      },
      "SuplScp3UpstrmWstGenInOper": {
        "type": "double",
        "description": "The supplemental upstream scope 3 emissions from the waste generated in operations. This value is added to the total scope 3 upstream emissions from waste generated in operations."
      },
      "SupplierId": {
        "type": "reference",
        "description": "The supplier associated with this generated waste record."
      },
      "WasteFootprintId": {
        "type": "reference",
        "description": "The waste footprint record associated with this generated waste record. This value is used to aggregate the waste quantity and the waste-related emissions data."
      },
      "WasteType": {
        "type": "picklist",
        "description": ""
      },
      "WstDispoEmssnFctrId": {
        "type": "reference",
        "description": "The waste disposal emissions factor set record that's used to calculate emissions based on the waste type and disposal type."
      }
    },
    "module": "Net Zero Cloud"
  }
}