{
  "GenericVisitTaskContext": {
    "name": "GenericVisitTaskContext",
    "description": "Represents the context or purpose for a generic visit task.",
    "properties": {
      "ContextId": {
        "type": "reference",
        "description": "The ID of the record that’s taken as the context for the visit task. For example, if a key performance indicator is recorded for a warranty of an asset, the Asset and the Warranty records are the contexts of the visit task."
      },
      "DefinitionReferenceId": {
        "type": "reference",
        "description": "The definition record associated with the runtime record. The value is null when the definition record is created."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the visit task context."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "The end date and time of the visit task context in a visit."
      },
      "IsDefinition": {
        "type": "boolean",
        "description": "Indicates whether the record is a definition record."
      },
      "IsRequired": {
        "type": "boolean",
        "description": "Indicates whether the visit task context associated with the record is mandatory."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "Autogenerated unique identifier for the visit task context record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the visit task context record owner."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "The start date and time of the visit task context in a visit."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the visit task context."
      },
      "StatusCode": {
        "type": "picklist",
        "description": "Specifies the status code of the visit task context."
      },
      "VisitId": {
        "type": "reference",
        "description": "The visit associated with the record."
      }
    },
    "module": "Public Sector Cloud"
  }
}