{
  "GnrcVstKeyPerformanceInd": {
    "name": "GnrcVstKeyPerformanceInd",
    "description": "Represents the key performance indicators that can be recorded while performing a task during a visit. You can compare the expected and actual metric values with the key performance indicator records.",
    "properties": {
      "ActualBooleanValue": {
        "type": "picklist",
        "description": "The actual boolean value recorded by the visitor for a key performance indicator."
      },
      "ActualDateTimeValue": {
        "type": "dateTime",
        "description": "The actual date and time value recorded by the visitor for a key performance indicator."
      },
      "ActualDecimalValue": {
        "type": "double",
        "description": "The actual decimal value recorded by the visitor for a key performance indicator."
      },
      "ActualIntegerValue": {
        "type": "int",
        "description": "The actual integer value recorded by the visitor for a key performance indicator."
      },
      "ActualStringValue": {
        "type": "textarea",
        "description": "The actual string value recorded by the visitor for a key performance indicator."
      },
      "AssessmentIndDefinitionId": {
        "type": "reference",
        "description": "The assessment indicator definition associated with the record."
      },
      "DefinitionReferenceId": {
        "type": "reference",
        "description": "The definition record associated with the runtime record. The value is null when the definition record is created."
      },
      "ExpectedBooleanValue": {
        "type": "picklist",
        "description": "The expected boolean value defined by a manager for a key performance indicator."
      },
      "ExpectedDateTimeValue": {
        "type": "dateTime",
        "description": "The expected date and time value defined by a manager for a key performance indicator."
      },
      "ExpectedDecimalValue": {
        "type": "double",
        "description": "The expected decimal value defined by a manager for a key performance indicator."
      },
      "ExpectedIntegerValue": {
        "type": "int",
        "description": "The expected integer value defined by a manager for a key performance indicator."
      },
      "ExpectedStringValue": {
        "type": "textarea",
        "description": "The expected string value defined by a manager for a key performance indicator."
      },
      "IsDefinition": {
        "type": "boolean",
        "description": "Indicates whether the record is a definition (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "Autogenerated unique identifier for the key performance indicator record."
      },
      "SequenceNumber": {
        "type": "int",
        "description": "The sequence in which the key performance indicator can be recorded."
      },
      "UnitOfMeasure": {
        "type": "picklist",
        "description": "The unit of measure associated with the key performance indicator."
      },
      "VisitTaskContextId": {
        "type": "reference",
        "description": "The visit task context associated with the record."
      }
    },
    "module": "Public Sector Cloud"
  }
}