{
  "Group": {
    "name": "Group",
    "description": "A set of User records.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the group. This field is available in API version 62.0 and later."
      },
      "DefaultDivision": {
        "type": "picklist",
        "description": "This record’s default division. Only applicable if divisions are enabled."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. This name is unique by group type and corresponds to Group Name in the user interface. This field is available in API version 24.0 and later. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow while Salesforce generates one for each record."
      },
      "DoesIncludeBosses": {
        "type": "boolean",
        "description": "Indicates whether records shared with users in this group are also shared with users higher in the role hierarchy (true) or not (false). This field is only available for public groups. This field corresponds to the Grant Access Using Hierarchies checkbox in Setup. This field is available in API version 18.0 and later."
      },
      "DoesSendEmailToMembers": {
        "type": "boolean",
        "description": "Indicates whether the email is sent (true) or not sent (false) to the group members. The email is sent to queue members as well."
      },
      "Email": {
        "type": "email",
        "description": "Email address for a group of type Case. Applies only for a case queue."
      },
      "Name": {
        "type": "string",
        "description": "Required. Name of the group. Corresponds to Label on the user interface."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who owns the group."
      },
      "QueueRoutingConfigId": {
        "type": "reference",
        "description": "The ID of the queue routing configuration associated with the queue."
      },
      "RelatedId": {
        "type": "reference",
        "description": "Represents the ID of the associated groups. For groups of type “Role,” the ID of the associated UserRole. The RelatedId field is polymorphic."
      },
      "Type": {
        "type": "picklist",
        "description": "Required. Type of the group. One of the following values: AllCustomerPortal—Public group that includes all Customer Portal or Customer Community Plus users. This type is only available when a Customer Portal or a Customer Site is enabled for your org. ChannelProgramGroup—Public group for partners in a channel program. CollaborationGroup—Chatter group. Manager—Public group that includes a user’s direct and indirect managers. This group is read-only. ManagerAndSubordinatesInternal—Public group that includes a user and the user’s direct and indirect reports. This group is read-only. Organization—Public group that includes all the User records in the organization. This group is read-only. Participant—Compliant Data Sharing group that includes internal users who have the Use Compliant Data Sharing permission. A group can contain other participant groups only, or a group can contain both internal users with the Use Compliant Data Sharing permission and other participant groups. This value is only available when Compliant Data Sharing is enabled for your org. PRMOrganization—Public group that includes all the partners in an organization that has the partner site or portal feature enabled. Queue—Public group that includes all the User records that are members of a queue. Regular—Standard public group. When you create() a group, its type must be Regular, unless a partner site or portal is enabled for the organization, in which case the type can be Regular or PRMOrganization. Role—Public group that includes all the User records in a particular UserRole. RoleAndSubordinates—Public group that includes all the User records in a particular UserRole and all the User records in any subordinate UserRole. Only available when digital experiences is enabled for your org. RoleAndSubordinatesInternal—Public group that includes all the User records in an internal UserRole, excluding customer and partner roles, and all the User records in any subordinate internal UserRole. SharingRecordCollGroup—Public group that has access to a SharingRecordCollection. Territory—Public group that includes all the User records in an organization that has the territory feature enabled. TerritoryAndSubordinates—Public group that includes all the User records in a particular UserRole and all the User records in any subordinateUserRole in an organization that has the territory feature enabled. Only Personal, Regular, and Queue can be used when creating a group. The other values are reserved."
      }
    },
    "module": "Core Salesforce"
  }
}