{
  "Group": {
    "name": "Group",
    "description": "",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the group. This field is available in API version 62.0 and later."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Corresponds to Group Name in the user interface. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "DoesIncludeBosses": {
        "type": "boolean",
        "description": "Indicates whether records shared with users in this group are also shared with users higher in the role hierarchy (true) or not (false). This field is only available for public groups. This field corresponds to the Grant Access Using Hierarchies checkbox in Setup."
      },
      "Name": {
        "type": "string",
        "description": "The name of the group. This value corresponds to the value of the Label field in the user interface."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns the group."
      },
      "RelatedId": {
        "type": "reference",
        "description": "Represents the ID of the associated records. For example, for Groups of type “Role,” this field is the ID of the associated UserRole. The RelatedId field is polymorphic."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of the group. One of the following values: AllCustomerPortal—All your Customer Portal or Customer Community Plus users. This type is only available when a Customer Portal or a Customer Site is enabled for your org. CollaborationGroup—Chatter group. Manager—Public group that includes a user’s direct and indirect managers. This Group is read-only. ManagerAndSubordinatesInternal—Public group that includes a user and the user’s direct and indirect reports. This group is read-only. Organization—Public group that includes all the User records in the organization. This group is read-only. PRMOrganization—Public group that includes all the partners in an organization that has the partner site or portal feature enabled. Queue—Public group that includes all the User records that are members of a queue. Regular—Standard public group. When you create a group through the create() call, its type must be Regular, unless a site or partner portal is enabled for the org. If so, the type can be Regular or PRMOrganization. Role—Public group that includes all the User records in a particular UserRole. RoleAndSubordinates—Public group that includes all the User records in a particular UserRole and all the User records in any subordinate UserRole. Only available when digital experiences is enabled for your org and Experience Cloud site users are created with external account roles other than a shared person account role. RoleAndSubordinatesInternal—Public group that includes all the User records in an internal UserRole, excluding customer and partner roles, and all the User records in any subordinate internal UserRole. SharingRuleGroup—Group associated with a criteria-based sharing rule. Territory—Public group that includes all the User records in a particular Territory. TerritoryAndSubordinates—Public group that includes all the User records in a particular Territory and all the User records in any subordinate Territory. Only Regular can be used when creating a group. The other values are reserved for system-managed groups."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_group.htm"
  }
}