{
  "GtwyProvPaymentMethodType": {
    "name": "GtwyProvPaymentMethodType",
    "description": "The gateway provider payment method type allows integrators and payment providers to choose an active payment to receive an order's payment data rather than allowing the Salesforce Order Management platform to select a default payment method.",
    "properties": {
      "Comments": {
        "type": "textarea",
        "description": "Users can provide additional details about the gateway provider payment method type record. Supports a maximum of 1000 characters."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, Salesforce generates one for each record, which slows performance."
      },
      "GtwyProviderPaymentMethodType": {
        "type": "string",
        "description": "Links the Salesforce payment method to the payment method used in the Salesforce Order Management storefront. Your payment gateway integration uses this field when finding a payment method to link to a payment."
      },
      "Language": {
        "type": "picklist",
        "description": "Language of the payment gateway integration."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Required. The gateway provider payment method type name that appears in the user interface."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "Namespace of the payment gateway integration classes."
      },
      "PaymentGatewayProviderId": {
        "type": "reference",
        "description": "Specifies the payment gateway provider that Salesforce Order Management should use when processing payments. One payment gateway provider can be related to multiple payment method types."
      },
      "PaymentMethodType": {
        "type": "picklist",
        "description": "Specifies the type of payment method used on an order in Salesforce Order Management."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "ID of the record type entity related to the gateway provider payment method type."
      }
    },
    "module": "Core Salesforce"
  }
}