{
  "EducationalInfoRequest": {
    "name": "EducationalInfoRequest",
    "description": "Represents details about a request for information (RFI) raised by prospective students, parents, or counselors.",
    "properties": {
      "AcademicDurationId": {
        "type": "reference",
        "description": "The academic term or academic year that's associated with the Educational Information Request."
      },
      "CaseId": {
        "type": "reference",
        "description": "The case that's associated with the request for information."
      },
      "Category": {
        "type": "picklist",
        "description": "Specifies the category for which the Request for Information is raised."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates whether the record is locked (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "LearningId": {
        "type": "reference",
        "description": "The learning that's associated with the request for information."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates whether the record can be edited (true) or not (false)."
      },
      "Name": {
        "type": "string",
        "description": "The name for this record."
      },
      "OpportunityId": {
        "type": "reference",
        "description": "The Opportunity associated with the Educational Info Request."
      },
      "RequesterId": {
        "type": "reference",
        "description": "The account of the person associated with the request for information."
      },
      "SubCategory": {
        "type": "picklist",
        "description": "Specifies the sub-category for which the Request for Information is raised."
      }
    },
    "module": "Education Cloud"
  }
}