{
  "ElectricityEmssnFctrSet": {
    "name": "ElectricityEmssnFctrSet",
    "description": "Represents the factors that are used to convert electricity usage into CO₂e, CO₂, CH₄, and N₂O values. This record holds data on the breakdown of sources of electricity by fuel type (grid mixes).",
    "properties": {
      "Ch4EmissionRate": {
        "type": "double",
        "description": "The CH4 emissions rate. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "Ch4EmissionRateInTgwh": {
        "type": "double",
        "description": "The CH4 emissions rate in tonnes per gigawatt hour. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "Ch4EmissionRateUnit": {
        "type": "picklist",
        "description": "The unit of measure for the CH4 output emission rate."
      },
      "City": {
        "type": "string",
        "description": "The city for which this electricity emissions factor set is valid."
      },
      "Co2EmissionRate": {
        "type": "double",
        "description": "The CO2 emissions rate. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "Co2EmissionRateInTmwh": {
        "type": "double",
        "description": "The CO2 emissions rate in tonnes per megawatt-hour. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "Co2EmissionRateUnit": {
        "type": "picklist",
        "description": "The unit of measure for the CO2 output emission rate."
      },
      "Co2eEmissionRate": {
        "type": "double",
        "description": "The total annual CO2 equivalent output emission rate for a grid subregion that’s calculated using the location-based method. This value will override the value calculated by using CO2, CH4, and N2O factors."
      },
      "Co2eEmissionRateInTmwh": {
        "type": "double",
        "description": "The total annual CO2 equivalent output emission rate in tonnes per megawatt-hour."
      },
      "Co2eEmissionRateUnit": {
        "type": "picklist",
        "description": "The unit of measure for the total CO2 equivalent output emission rate."
      },
      "Country": {
        "type": "picklist",
        "description": "The country for which this electricity emissions factor set is valid."
      },
      "EmissionFactorDataSource": {
        "type": "textarea",
        "description": "The source of the emissions factor reference data."
      },
      "EmissionFactorUpdateYear": {
        "type": "picklist",
        "description": "The year in which this reference data for the emissions factor was most recently updated."
      },
      "EmissionsFactorType": {
        "type": "picklist",
        "description": "Indicates if this Electricity Emissions Factor is Location-based, Market-Based, or both."
      },
      "ExternalIdentifier": {
        "type": "string",
        "description": "External Id of this emissions factor"
      },
      "GenlConversionFctrRevisionDate": {
        "type": "date",
        "description": "The date when the electricity grid reference data for the emissions factors record is revised by the publishing authority."
      },
      "GridSubregion": {
        "type": "string",
        "description": "The electricity grid subregion for which this electricity emissions factor set is valid."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "LocBasedGeothermalMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from geothermal source based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocBasedOtherFossilFuelMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from other fossil fuels based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocBasedRenewableEnergyPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from renewable resources such as biomass, geothermal, solar, wind, and hydroelectricity that's calculated based on the location-based data."
      },
      "LocBsdRenewableEnrgyNonHydro": {
        "type": "percent",
        "description": "The percentage of electricity generated from renewable resources such as biomass, geothermal, solar, and wind that's calculated based on the location-based data."
      },
      "LocationBasedBiomassMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from biomass based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocationBasedCoalMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from coal based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocationBasedGasMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from gas based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocationBasedHydroMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from hydroelectric power source based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocationBasedMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from all sources based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocationBasedNuclearMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from nuclear power source based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocationBasedOilMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from oil based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocationBasedOtherFuelMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from other fuels based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocationBasedSolarMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from solar photovoltaic cells based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "LocationBasedWindMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from wind based on the region's grid mix data from governmental or non-governmental organizations."
      },
      "MarketBasedBiomassMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from biomass based on the grid mix data from the electricity supplier."
      },
      "MarketBasedCoalMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from coal based on the grid mix data from the electricity supplier."
      },
      "MarketBasedGasMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from gas based on the grid mix data from the electricity supplier."
      },
      "MarketBasedHydroMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from hydroelectric power source based on the grid mix data from the electricity supplier."
      },
      "MarketBasedMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from all sources based on the grid mix data from the electricity supplier."
      },
      "MarketBasedNuclearMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from nuclear power source based on the grid mix data from the electricity supplier."
      },
      "MarketBasedOilMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from oil based on the grid mix data from the electricity supplier."
      },
      "MarketBasedOtherFuelMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from other fuels based on the grid mix data from the electricity supplier."
      },
      "MarketBasedSolarMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from solar photovoltaic cells based on the grid mix data from the electricity supplier."
      },
      "MarketBasedWindMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from wind based on the grid mix data from the electricity supplier."
      },
      "MktBasedGeothermalMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from geothermal power source based on the grid mix data from the electricity supplier."
      },
      "MktBasedOtherFossilFuelMixPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from other fossil fuels based on the grid mix data from the electricity supplier."
      },
      "MktBasedRenewableEnergyPct": {
        "type": "percent",
        "description": "The percentage of electricity generated from renewable resources such as biomass, geothermal, solar, wind, and hydroelectricity that's calculated based on the market-based data."
      },
      "MktBsdCh4EmssnRate": {
        "type": "double",
        "description": "The rate of market-based CH4 emissions. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "MktBsdCh4EmssnRateUnit": {
        "type": "picklist",
        "description": "Specifies the unit of measure for the rate of market-based CH4 emissions output."
      },
      "MktBsdCh4EmssnRtInTgwh": {
        "type": "double",
        "description": "The rate of market-based CH4 emissions in tonnes per gigawatt hour. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "MktBsdCo2EmssnRate": {
        "type": "double",
        "description": "The rate of market-based CO2 emissions. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "MktBsdCo2EmssnRateUnit": {
        "type": "picklist",
        "description": "Specifies the unit of measure for the rate of market-based CO2 emissions output."
      },
      "MktBsdCo2EmssnRtInTmwh": {
        "type": "double",
        "description": "The rate of market-based CO2 emissions in tonnes per megawatt hour. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "MktBsdCo2eEmissionRate": {
        "type": "double",
        "description": "The annual carbon dioxide equivalent output emission rate that's calculated based on the market-based data of the electricity grid subregion."
      },
      "MktBsdCo2eEmissionRateInTmwh": {
        "type": "double",
        "description": "The annual carbon dioxide equivalent output emission rate that's calculated based on the market-based data."
      },
      "MktBsdCo2eEmissionRateUnit": {
        "type": "picklist",
        "description": "The unit of measure for the carbon dioxide equivalent market-based output emission rate."
      },
      "MktBsdDataSrcType": {
        "type": "picklist",
        "description": "Specifies the type of data source of the market-based conversion factor for the electricity emissions factor."
      },
      "MktBsdElectrSupplierId": {
        "type": "reference",
        "description": "The supplier of electricity associated with this electricity emissions factor."
      },
      "MktBsdN2oEmssnRate": {
        "type": "double",
        "description": "The rate of market-based N2O emissions. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "MktBsdN2oEmssnRateUnit": {
        "type": "picklist",
        "description": "Specifies the unit of measure for the rate of market-based N2O emissions output."
      },
      "MktBsdN2oEmssnRtInTgwh": {
        "type": "double",
        "description": "The rate of market-based N2O emissions in tonnes per gigawatt hour. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "MktBsdRenewableEnrgyNonHydro": {
        "type": "percent",
        "description": "The percentage of electricity generated from renewable resources such as biomass, geothermal, solar, and wind that's calculated based on the market-based data."
      },
      "N2oEmissionRate": {
        "type": "double",
        "description": "The N2O emissions rate. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "N2oEmissionRateInTgwh": {
        "type": "double",
        "description": "The N2O emissions rate in tonnes per gigawatt hour. This field is informational only and doesn’t impact the carbon dioxide equivalent calculations."
      },
      "N2oEmissionRateUnit": {
        "type": "picklist",
        "description": "The unit of measure for the N2O output emission rate."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "OtherEmssnFctrId": {
        "type": "reference",
        "description": "The other emissions factor set record containing global warming potential values for CH4 and N2O."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PostalCodeSet": {
        "type": "textarea",
        "description": "The valid postal codes for this electricity emissions factor set."
      },
      "ReferenceDataLoadLogId": {
        "type": "reference",
        "description": "The reference data load log record that's associated with the emissions factor."
      },
      "ShouldLockDtastUpdtForRec": {
        "type": "boolean",
        "description": "Indicates whether the emissions factor record can be locked from dataset updates."
      },
      "State": {
        "type": "string",
        "description": "The state for which this electricity emissions factor set is valid."
      }
    },
    "module": "Net Zero Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.netzero_cloud_dev_guide.meta/netzero_cloud_dev_guide/sforce_api_objects_electricityemssnfctrset.htm"
  }
}