{
  "EmailTemplate": {
    "name": "EmailTemplate",
    "description": "Represents a template for an email, mass email, list email, or Sales Engagement email. Supported in first-generation managed packages only.",
    "properties": {
      "ApiVersion": {
        "type": "double",
        "description": "The API version for this class. Every class has an API version specified at creation."
      },
      "Body": {
        "type": "textarea",
        "description": "Content of the email. Limit: 384 KB."
      },
      "BrandTemplateId": {
        "type": "reference",
        "description": "Required. ID of the BrandTemplate associated with this email template. The brand template supplies letterhead information for the email template."
      },
      "DeliveryRate": {
        "type": "percent",
        "description": "Read-only. The percentage of the emails that were delivered compared to the number that bounced (soft and hard). Note: this data includes emails that were delivered to the recipient's spam folder. This field is available in API version 46.0 and later. To access this field, your org must use Sales Engagement and users need the Sales Engagement User or Sales Engagement Cadence Creator permission set. This field value includes emails sent via the ListEmail object or Sales Engagement cadences."
      },
      "Description": {
        "type": "string",
        "description": "Description of the template, for example, Promotion Mass Mailing."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Template Unique Name. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow while Salesforce generates one for each record."
      },
      "Encoding": {
        "type": "picklist",
        "description": "Character set encoding for the template."
      },
      "EnhancedLetterheadId": {
        "type": "reference",
        "description": "ID of the enhanced letterhead associated with the email template. Note To use an enhanced letterhead, associate it with a Lightning email template that uses the HML merge language."
      },
      "EntityType": {
        "type": "picklist",
        "description": "When UIType is 2 (Lightning Experience) or 3 (Lightning ExperienceSample), EntityType indicates which entities this template can be used with (for example, account or lead). Valid values are standard object ID prefixes: 001 for account, 003 for contact, 006 for opportunity, and 00Q for lead, 500 for case, and 701 for campaign."
      },
      "FolderId": {
        "type": "reference",
        "description": "ID of the folder that contains the template."
      },
      "FolderName": {
        "type": "string",
        "description": "The name of the folder that contains the template."
      },
      "HasSalesforceFiles": {
        "type": "boolean",
        "description": "If the email template has attachments from Salesforce Files. The default value is false."
      },
      "HtmlValue": {
        "type": "textarea",
        "description": "This field contains the content of the email message, including HTML coding to render the email message. Limit: 384 KB."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates that this template is active if true, or inactive if false."
      },
      "IsBuilderContent": {
        "type": "boolean",
        "description": "If the email template was made in Email Template Builder. The default value is false."
      },
      "LastUsedDate": {
        "type": "dateTime",
        "description": "Date and time when this email template was last used."
      },
      "Markup": {
        "type": "textarea",
        "description": "The Visualforce markup, HTML, JavaScript, or any other Web-enabled code that defines the content of the template."
      },
      "Name": {
        "type": "string",
        "description": "Name of the template. Label is Email Template Name."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of the template."
      },
      "RelatedEntityType": {
        "type": "picklist",
        "description": "When UIType is 2 (Lightning Experience) or 3 (Lightning ExperienceSample), RelatedEntityType indicates which entities this template can be used with. Valid values are the entity API name: \"Account\" for account, \"Contact\" for contact, \"Opportunity\" for opportunity, \"Lead\" for lead, and so on. The value can be any entity the user has read access to (including custom entities) but not virtual entities, setup entities, or platform entities."
      },
      "Subject": {
        "type": "string",
        "description": "Content of the subject line."
      },
      "TemplateStyle": {
        "type": "picklist",
        "description": "Style of the template."
      },
      "TemplateType": {
        "type": "picklist",
        "description": "Type of template."
      },
      "TimesUsed": {
        "type": "int",
        "description": "Number of times this email template has been used."
      },
      "TotalDelivered": {
        "type": "int",
        "description": "Read-only. The total number of emails sent minus hard and soft bounces. Note: this data includes emails that were delivered to the recipient's spam folder. This field is available in API version 46.0 and later. To access this field, your org must use Sales Engagement and users need the Sales Engagement User or Sales Engagement Cadence Creator permission set. This field value includes emails sent via the ListEmail object or Sales Engagement cadences."
      },
      "TotalHardBounced": {
        "type": "int",
        "description": "Read-only. The total number of emails that permanently bounced back to the sender because the address is invalid. A hard bounce can occur because the domain name doesn't exist or because the recipient is unknown. This field is available in API version 46.0 and later. To access this field, your org must use Sales Engagement and users need the Sales Engagement User or Sales Engagement Cadence Creator permission set. This field value includes emails sent via the ListEmail object or Sales Engagement cadences."
      },
      "TotalOpens": {
        "type": "int",
        "description": "Read-only. The total number of times a prospect’s email client loaded the images in the HTML version of the email. We also record an open if the prospect clicks a link within the HTML or text email without downloading images. A click indicates that they viewed the message. Some email clients (Outlook, Apple Mail, Thunderbird) don’t display images by default. Pardot counts an open each time the images load. This field is available in API version 46.0 and later. To access this field, your org must use Sales Engagement and users need the Sales Engagement User or Sales Engagement Cadence Creator permission set. This field value includes emails sent via the ListEmail object or Sales Engagement cadences."
      },
      "TotalSent": {
        "type": "int",
        "description": "Read-only. The total number of emails sent, including bounced, opted-out, and invalid To: addresses. This field is available in API version 46.0 and later. To access this field, your org must use Sales Engagement and users need the Sales Engagement User or Sales Engagement Cadence Creator permission set. This field value includes emails sent via the ListEmail object or Sales Engagement cadences."
      },
      "TotalSoftBounced": {
        "type": "int",
        "description": "Read-only. The total number of times a recipient’s mail server acknowledged the email, but returned it to the sender. Sometimes it is because the recipient's mailbox is full or the mail server is temporarily unavailable. A soft bounce message can sometimes be delivered at another time. After 5 soft bounces, Pardot opts the prospect out of emails. This field is available in API version 46.0 and later. To access this field, your org must use Sales Engagement and users need the Sales Engagement User or Sales Engagement Cadence Creator permission set. This field value includes emails sent via the ListEmail object or Sales Engagement cadences."
      },
      "UIType": {
        "type": "picklist",
        "description": "Indicates the user interface where this template is usable."
      }
    },
    "module": "Core Salesforce"
  }
}