{
  "EmailTemplateMonthlyMetric": {
    "name": "EmailTemplateMonthlyMetric",
    "description": "Represents the monthly engagement metrics for an email template.",
    "properties": {
      "AllEmailsBouncedCount": {
        "type": "int",
        "description": "The total of hard and soft bounced emails for this email template in the month."
      },
      "AllEmailsDeliveredCount": {
        "type": "int",
        "description": "The number of successfully delivered emails for this email template in the month."
      },
      "AllEmailsHardBouncedCount": {
        "type": "int",
        "description": "The number of hard bounced emails for this email template in the month."
      },
      "AllEmailsLinkClickedCount": {
        "type": "int",
        "description": "The number of emails containing a link clicked by the recipient for this email template in the month."
      },
      "AllEmailsNotDeliveredCount": {
        "type": "int",
        "description": "The number of emails not delivered for this email template in the month. This field is available in API version 54.0 and later."
      },
      "AllEmailsOpenedCount": {
        "type": "int",
        "description": "The number of emails opened by the recipient for this email template in the month."
      },
      "AllEmailsOutOfOfficeCount": {
        "type": "int",
        "description": "The number of emails that triggered an out-of-office reply for this email template in the month."
      },
      "AllEmailsRepliedCount": {
        "type": "int",
        "description": "The number of emails replied to for this email template in the month."
      },
      "AllEmailsSentCount": {
        "type": "int",
        "description": "The number of emails sent for this email template in the month."
      },
      "AllEmailsSoftBouncedCount": {
        "type": "int",
        "description": "The number of emails soft bounced for this email template in the month."
      },
      "AllEmailsTrackedSentCount": {
        "type": "int",
        "description": "The number of emails sent with engagement tracking enabled for this email template in the month."
      },
      "AllEmailsUntrackedSentCount": {
        "type": "int",
        "description": "The number of emails sent without engagement tracking for this email template in the month."
      },
      "DeliveredRecipientCount": {
        "type": "int",
        "description": "The number of recipients who were successfully delivered an email for this email template in the month. This field is available in API version 54.0 and later."
      },
      "DeliveredRecipientRate": {
        "type": "percent",
        "description": "The percentage of unique recipients that received an email you sent. This field is available in API version 54.0 and later."
      },
      "EmailTemplateId": {
        "type": "reference",
        "description": "The ID of the related email template."
      },
      "HardBounceTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with hard bounce tracking. This field is available in API version 54.0 and later."
      },
      "HrdBncTrackableRecipientSends": {
        "type": "int",
        "description": "The number of recipients who received an email with hard bounce tracking. This field is available in API version 54.0 and later."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates whether the monthly metric record is locked or not."
      },
      "LinkClickTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with link click tracking for the email template in the month. This field is available in API version 54.0 and later."
      },
      "LinkClkTrackableRecipientSends": {
        "type": "int",
        "description": "The number of recipients who received an email with link tracking for the email template in the month. This field is available in API version 54.0 and later."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates whether the monthly metric record can be edited or not."
      },
      "Month": {
        "type": "date",
        "description": "The month in which the engagement occurred."
      },
      "MonthInt": {
        "type": "int",
        "description": "The month in which the engagement occurred, in yyyymm format."
      },
      "OooTrackableRecipientSends": {
        "type": "int",
        "description": "The number of recipients who received an email with out-of-office tracking for the email template in the month. Out-of-office tracking requires Inbox. This field is available in API version 54.0 and later."
      },
      "OpenTrackableRecipientSends": {
        "type": "int",
        "description": "The number of recipients who received an email with open tracking for the email template in the month. This field is available in API version 54.0 and later."
      },
      "OpenTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with open tracking for the email template in the month. This field is available in API version 54.0 and later."
      },
      "OutOfOfficeTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with out-of-office tracking for the email template in the month. This field is available in API version 54.0 and later."
      },
      "RecipientReplies": {
        "type": "int",
        "description": "The number of unique recipients who replied to an email for this email template in the month. This field is available in API version 54.0 and later."
      },
      "RecipientSends": {
        "type": "int",
        "description": "The number of unique email recipients for this email template in the month. This field is available in API version 54.0 and later."
      },
      "RecipientsHardBounced": {
        "type": "int",
        "description": "The number of recipients that hard-bounced an email for this email template in the month. Hard bounces can mean that the recipient's email address doesn't exist or is misspelled. This field is available in API version 54.0 and later."
      },
      "RecipientsOutOfOffice": {
        "type": "int",
        "description": "The number of recipients that responded with an out-of-office reply for the email template in the month. This field is available in API version 54.0 and later."
      },
      "RecipientsSoftBounced": {
        "type": "int",
        "description": "The number of recipients that soft-bounced an email for the email template in the month. A soft bounce often indicates a temporary issue with the recipient's email server, such as a full inbox. This field is available in API version 54.0 and later."
      },
      "ReplyTrackableRecipientSends": {
        "type": "int",
        "description": "The number of recipients who received an email with reply tracking for this email template in the month. This field is available in API version 54.0 and later."
      },
      "ReplyTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with reply tracking for the email template in the month. This field is available in API version 54.0 and later."
      },
      "SftBncTrackableRecipientSends": {
        "type": "int",
        "description": "The number of recipients who received an email with soft bounce tracking for the email template in the month. This field is available in API version 54.0 and later."
      },
      "SoftBounceTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with soft bounce tracking for the email template in the month. This field is available in API version 54.0 and later."
      },
      "SomeEmailsDeliveredCount": {
        "type": "int",
        "description": "The number of sent emails that were successfully delivered to at least one of its recipients for the email template in the month. This field is available in API version 54.0 and later."
      },
      "SomeEmailsDeliveredRate": {
        "type": "percent",
        "description": "The percentage of sent and tracked emails that were successfully delivered to at least one of their recipients for the email template in the month. This field is available in API version 54.0 and later."
      },
      "TrackableRecipientSendHrdBncRt": {
        "type": "percent",
        "description": "The percentage of emails sent to unique recipients with hard bounce tracking that hard bounced for the email template in the month. This field is available in API version 54.0 and later."
      },
      "TrackableRecipientSendOooRate": {
        "type": "percent",
        "description": "The percentage of emails sent with out-of-office tracking that received out-of-office replies from unique recipients for the email template in the month. This field is available in API version 54.0 and later."
      },
      "TrackableRecipientSendReplyRt": {
        "type": "percent",
        "description": "The percentage of emails sent with reply tracking that received replies from unique recipients for the email template in the month. This field is available in API version 54.0 and later."
      },
      "TrackableRecipientSendSftBncRt": {
        "type": "percent",
        "description": "The percentage of emails sent to unique recipients with soft bounce tracking that soft-bounced for the email template in the month. This field is available in API version 54.0 and later."
      },
      "TrackableSendHardBounceRate": {
        "type": "percent",
        "description": "The percentage of emails sent with hard bounce tracking that hard bounced for the email template in the month. This field is available in API version 54.0 and later."
      },
      "TrackableSendLinkClickRate": {
        "type": "percent",
        "description": "The percentage of emails sent with link tracking that had link clicks for the email template in the month. This field is available in API version 54.0 and later."
      },
      "TrackableSendOpenRate": {
        "type": "percent",
        "description": "The percentage of emails sent with open tracking that were opened by the recipient for the email template in the month. This field is available in API version 54.0 and later."
      },
      "TrackableSendOutOfOfficeRate": {
        "type": "percent",
        "description": "The percentage of emails sent with out-of-office tracking that received out-of-office replies for the email template in the month. This field is available in API version 54.0 and later."
      },
      "TrackableSendReplyRate": {
        "type": "percent",
        "description": "The percentage of emails sent with reply tracking that received replies for the email template in the month. This field is available in API version 54.0 and later."
      },
      "TrackableSendSoftBounceRate": {
        "type": "percent",
        "description": "The percentage of emails sent with soft bounce tracking that soft bounced for the email template in the month. This field is available in API version 54.0 and later."
      },
      "UniqueEmailsLinkClickedCount": {
        "type": "int",
        "description": "The number of link clicks by unique recipients for the email template in the month."
      },
      "UniqueEmailsOpenedCount": {
        "type": "int",
        "description": "The number of times an email you sent was opened by a unique recipient for the email template in the month. When you send a list email, this field increments each time a recipient opens the received email."
      },
      "UniqueEmailsRepliedCount": {
        "type": "int",
        "description": "The number of replies from unique recipients for the email template in the month."
      }
    },
    "module": "Core Salesforce"
  }
}