{
  "EmailServicesAddress": {
    "name": "EmailServicesAddress",
    "description": "An email service address.",
    "properties": {
      "AuthorizedSenders": {
        "type": "textarea",
        "description": "Configures the email service address to only accept messages from the email addresses or domains listed in this field. If the email service address receives a message from an unlisted email address or domain, the email service performs the action specified in the AuthorizationFailureAction field of its associated email service. Leave this field blank if you want the email service address to receive email from any email address."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The name of the object in the API. This name can contain only underscores and alphanumeric characters and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. This 25-character field must be unique among other EmailServicesAddress records under the same EmailServiceFunction parent.In managed packages, this field prevents naming conflicts on package installations. This field is automatically generated, but you can supply your own value if you create the record using the API. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance might be slow while Salesforce generates one for each record."
      },
      "EmailDomainName": {
        "type": "string",
        "description": "A read only field you can query that contains the system-generated domain part of this email service address. The system generates a unique domain-part for each email service address to ensure that no two email service addresses are identical."
      },
      "FunctionId": {
        "type": "reference",
        "description": "The ID of the email service for which the email service address receives messages."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether this object is active (true) or not (false)."
      },
      "LocalPart": {
        "type": "string",
        "description": "The local-part of the email service address. The local-part of the address is the string that comes before the @ symbol."
      },
      "RunAsUserId": {
        "type": "reference",
        "description": "The username of the user whose permissions the email service assumes when processing messages sent to this address."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_emailservicesaddress.htm"
  }
}