{
  "EmbeddedServiceDetail": {
    "name": "EmbeddedServiceDetail",
    "description": "Represents a metadata catalog object that exposes fields from the underlying Embedded Service setup objects defined in each EmbeddedServiceConfig deployment for guest users. Guest users don’t have direct access to the Embedded Service setup objects.",
    "properties": {
      "AvatarImg": {
        "type": "string",
        "description": "URL of the image used as the agent avatar image."
      },
      "ContrastInvertedColor": {
        "type": "string",
        "description": "Accent branding color used in the embedded component, displayed as a hexadecimal value. Changes made to this field in the API aren’t reflected in the embedded component."
      },
      "ContrastPrimaryColor": {
        "type": "string",
        "description": "Value of the ContrastPrimaryColor field in the EmbeddedServiceBranding setup object."
      },
      "CustomMinimizedComponent": {
        "type": "string",
        "description": "The custom Aura component that’s used for the minimized state for this Embedded Chat deployment."
      },
      "CustomPrechatComponent": {
        "type": "string",
        "description": "The custom Aura component that’s used for the pre-chat page for this Embedded Chat deployment."
      },
      "DurableId": {
        "type": "string",
        "description": "Developer name for the EmbeddedServiceConfig."
      },
      "FieldServiceConfirmCardImg": {
        "type": "string",
        "description": "URL of the image used for the confirmation card in embedded Appointment Management (beta)."
      },
      "FieldServiceHomeImg": {
        "type": "string",
        "description": "URL of the image used for the home screen in embedded Appointment Management (beta)."
      },
      "FieldServiceLogoImg": {
        "type": "string",
        "description": "URL of the logo used for the home screen in embedded Appointment Management (beta)."
      },
      "Font": {
        "type": "string",
        "description": "Font used in the chat text of the Embedded Chat window."
      },
      "FontSize": {
        "type": "picklist",
        "description": "Font size for the embedded component.Possible values are: Small Medium Large"
      },
      "HeaderBackgroundImg": {
        "type": "string",
        "description": "URL of the image used for the header background in Embedded Chat. This field is removed in API version 49.0 and later. The header background image is no longer supported."
      },
      "Height": {
        "type": "int",
        "description": "Height of the embedded component."
      },
      "IsFieldServiceEnabled": {
        "type": "boolean",
        "description": "Specifies whether Field Service is enabled for this Embedded Service deployment (true) or not (false). Embedded Appointment Management is currently beta."
      },
      "IsLiveAgentEnabled": {
        "type": "boolean",
        "description": "Specifies whether Chat is enabled for this Embedded Service deployment (true) or not (false)."
      },
      "IsOfflineCaseEnabled": {
        "type": "boolean",
        "description": "Specifies whether offline support is enabled for this Embedded Chat deployment (true) or not (false)."
      },
      "IsPrechatEnabled": {
        "type": "boolean",
        "description": "Value of the PrechatEnabled field in the EmbeddedServiceLiveAgent setup object."
      },
      "IsQueuePositionEnabled": {
        "type": "boolean",
        "description": "Specifies whether queue position (displaying the customer’s place in line while they wait for an agent) is enabled for this Embedded Chat deployment (true) or not (false)."
      },
      "NavBarColor": {
        "type": "string",
        "description": "Value of the NavBarColor field in the EmbeddedServiceBranding setup object."
      },
      "NavBarTextColor": {
        "type": "string",
        "description": "This field is used to set the text color for the header."
      },
      "OfflineCaseBackgroundImg": {
        "type": "string",
        "description": "URL of the image used for the background for the offline support case form in Embedded Chat."
      },
      "PrechatBackgroundImg": {
        "type": "string",
        "description": "URL of the image used for the background for the pre-chat form in Embedded Chat."
      },
      "PrimaryColor": {
        "type": "string",
        "description": "Value of the PrimaryColor field in the EmbeddedServiceBranding setup object."
      },
      "SecondaryColor": {
        "type": "string",
        "description": "Value of the SecondaryColor field in the EmbeddedServiceBranding setup object."
      },
      "SecondaryNavBarColor": {
        "type": "string",
        "description": "This field is used to set the color of a secondary header."
      },
      "ShouldHideAuthDialog": {
        "type": "boolean",
        "description": "Specifies whether the prompt that the customer log in again during a flow should be hidden (true) or not (false). When it’s hidden, the customer is taken directly to your login page."
      },
      "ShouldShowExistingAppointment": {
        "type": "boolean",
        "description": "Specifies whether to display a button on the home screen for customers to access their existing appointments (true) or not (false) for embedded Appointment Management (beta)."
      },
      "ShouldShowNewAppointment": {
        "type": "boolean",
        "description": "Specifies whether to display a button on the home screen for customers to create a new appointment (true) or not (false) for embedded Appointment Management (beta)."
      },
      "Site": {
        "type": "string",
        "description": "Value of the Site field in the EmbeddedServiceConfig setup object."
      },
      "SmallCompanyLogoImg": {
        "type": "string",
        "description": "URL of the logo image used with Embedded Chat."
      },
      "WaitingStateBackgroundImg": {
        "type": "string",
        "description": "URL of the image used for the background image in Embedded Chat while the customer waits to be connected with a support agent."
      },
      "Width": {
        "type": "int",
        "description": "Width of the embedded component."
      }
    },
    "module": "Core Salesforce"
  }
}