{
  "EmbeddedServiceConfig": {
    "name": "EmbeddedServiceConfig",
    "description": "Represents a setup node for creating an Embedded Service deployment.",
    "properties": {
      "AreGuestUsersAllowed": {
        "type": "",
        "description": ""
      },
      "Type boolean Properties Defaulted on Create, Filter, Group, Sort Description Specifies whether a user must be logged in to access an embedded component. Available in API version 45.0 and later.": {
        "type": "",
        "description": ""
      },
      "AuthMethod": {
        "type": "",
        "description": ""
      },
      "Type picklist Properties Filter, Group, Nillable, Restricted picklist, Sort Description Type of login method selected for this Embedded Service deployment. Valid values are: CommunitiesLogin CustomLogin Available in API version 43.0 and later.": {
        "type": "",
        "description": ""
      },
      "BrandingId": {
        "type": "",
        "description": ""
      },
      "Type reference Properties Filter, Group, Nillable, Sort Description The developer name of the associated BrandingSet. Used only for Embedded Service Deployments of the Messaging type. Used only when DeploymentFeature is EmbeddedMessaging. Available in API version 52.0 and later. This is a relationship field. Relationship Name Branding Relationship Type Lookup Refers To BrandingSet": {
        "type": "",
        "description": ""
      },
      "CustomMinimizedComponentId": {
        "type": "",
        "description": ""
      },
      "Type reference Properties Filter, Group, Nillable, Sort Description Removed. The custom Lightning component that’s used for the minimized state for this Embedded Chat deployment. Available in API version 38.0 to 45.0.": {
        "type": "",
        "description": ""
      },
      "DeveloperName": {
        "type": "",
        "description": ""
      },
      "Type string Properties Filter, Group, Sort Description Unique name for the Embedded Service configuration setup node. Note Only users with View DeveloperName OR View Setup and Configuration permission can view, group, sort, and filter this field.": {
        "type": "",
        "description": ""
      },
      "DeploymentFeature": {
        "type": "",
        "description": ""
      },
      "Type picklist Properties Filter, Group, Restricted picklist, Sort Description Where the Embedded Service deployment is used. After the value is set, it can’t be updated. Available in API version 52.0 and later. Possible values are: EmbeddedMessaging FieldService Flows LiveAgent None": {
        "type": "",
        "description": ""
      },
      "DeploymentType": {
        "type": "",
        "description": ""
      },
      "Type picklist Properties Filter, Group, Restricted picklist, Sort Description Set a conversation type for your embedded deployment. This field is available in version 51.0 and later. Possible values are: Mobile Web": {
        "type": "",
        "description": ""
      },
      "FullName": {
        "type": "",
        "description": ""
      },
      "Type string Properties Create, Group, Nillable Description The unique name used for this Embedded Service deployment. The fullName can contain only underscores and alphanumeric characters. It must be unique, begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores.Query this field only if the query result contains no more than one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance.": {
        "type": "",
        "description": ""
      },
      "IsEnabled": {
        "type": "",
        "description": ""
      },
      "Type boolean Properties Defaulted on Create, Filter, Group, Sort Description Specifies if the Embedded Service Deployment is enabled for use. Available in API version 52.0 and later.": {
        "type": "",
        "description": ""
      },
      "isTermsAndConditionsEnabled": {
        "type": "",
        "description": ""
      },
      "Type boolean Properties Defaulted on create, Filter, Group, Sort Description Indicates whether Terms and Conditions are displayed. Displaying Terms and Conditions is supported if the deploymentFeature is either EmbeddedMesssaging or LiveAgent. Available in API version 59.0 and later. The default value is false.": {
        "type": "",
        "description": ""
      },
      "isTermsAndConditionsRequired": {
        "type": "",
        "description": ""
      },
      "Type boolean Properties Defaulted on create, Filter, Group, Sort Description Indicates whether acceptance of the Terms and Conditions is required before starting a chat. Displaying Terms and Conditions is supported if the deploymentFeature is either EmbeddedMesssaging or LiveAgent. Available in API version 59.0 and later. The default value is false.": {
        "type": "",
        "description": ""
      },
      "Language": {
        "type": "",
        "description": ""
      },
      "Type picklist Properties Defaulted on create, Filter, Group, Nillable, Restricted picklist, Sort Description Languages supported in the Embedded Service deployment. Chinese (Simplified): zh_CN Chinese (Traditional): zh_TW Danish: da Dutch: nl_NL English: en_US Finnish: fi French: fr German: de Italian: it Japanese: ja Korean: ko Norwegian: no Portuguese (Brazil): pt_BR Russian: ru Spanish: es Spanish (Mexico): es_MX Spanish (Mexico) defaults to Spanish for customer-defined translations. Swedish: sv Thai: th The Salesforce user interface is fully translated to Thai, but Help is in English.": {
        "type": "",
        "description": ""
      },
      "ManageableState": {
        "type": "",
        "description": ""
      },
      "Type ManageableState enumerated list Properties Filter, Group, Nillable, Restricted picklist, Sort Description Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged": {
        "type": "",
        "description": ""
      },
      "MasterLabel": {
        "type": "",
        "description": ""
      },
      "Type string Properties Filter, Group, Sort Description Name of the embedded service configuration node.": {
        "type": "",
        "description": ""
      },
      "Metadata": {
        "type": "",
        "description": ""
      },
      "Type mns:EmbeddedServiceConfig Properties Create, Nillable, Update Description The Embedded Service configuration metadata.Query this field only if the query result contains no more than one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance.": {
        "type": "",
        "description": ""
      },
      "NamespacePrefix": {
        "type": "",
        "description": ""
      },
      "Type string Properties Filter, Group, Nillable, Sort Description The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix.": {
        "type": "",
        "description": ""
      },
      "ShouldHideAuthDialog": {
        "type": "",
        "description": ""
      },
      "Type boolean Properties Defaulted on create, Filter, Group, Sort Description Specifies whether the prompt that the customer login again during a flow is hidden (true) or not (false). When it’s hidden, the customer is taken directly to your login page. This field is set to false by default. Available in API version 43.0 and later.": {
        "type": "",
        "description": ""
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_embeddedserviceconfig.htm"
  }
}