{
  "EmissionsForecastFact": {
    "name": "EmissionsForecastFact",
    "description": "Represents information about the time periods, measures, and dimensions used to forecast the emissions of a company. The emissions forecast of the company is generated based on its business measures such as revenue or employee count, and the actual emissions data from previous years.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The account for which the emissions are being forecasted."
      },
      "ActualEmissions": {
        "type": "double",
        "description": "The actual emissions for the emissions activity in the specified forecasting year. This value is from the annual emissions inventory record and is based on the activity source type. For example, if the source of the emissions activity is business travel, the emissions from business travel value in the annual emissions inventory record is used."
      },
      "ActualEmissionsIntensity": {
        "type": "double",
        "description": "The ratio of actual emissions of an emissions activity to the value of the underlying forecasting measure, such as revenue, number of employees, or office space."
      },
      "ActualEnergyConsumption": {
        "type": "double",
        "description": "The actual energy consumption for commercial buildings or data centers generating scope 2 emissions. This value is the total energy consumption value in the annual emissions inventory record. The appropriate value is determined based on whether the emissions activity is related to commercial buildings or data centers."
      },
      "ActualLocationBasedEmissions": {
        "type": "double",
        "description": "The actual location-based emissions from electricity-related emissions activity in the forecasting year. This value is the total scope 2 location-based emissions value in the annual emissions inventory record. The appropriate value is determined based on whether the emissions activity is related to commercial buildings or data centers."
      },
      "ActualMarketBasedEmissions": {
        "type": "double",
        "description": "The actual market-based emissions from electricity-related emissions activity in the forecasting year. This value is the total scope 2 market-based emissions value in the annual emissions inventory record. The appropriate value is determined based on whether the emissions activity is related to commercial buildings or data centers."
      },
      "ActualRenewableEnergyCnsmpPct": {
        "type": "double",
        "description": "The consumption percentage of electricity generated from renewable energy by commercial buildings and data centers generating scope 2 emissions. This value is the total renewable energy consumption value in the annual emissions inventory record. The appropriate value is determined based on whether the emissions activity is related to commercial buildings or data centers."
      },
      "AdvAcctForecastSetPartnerId": {
        "type": "reference",
        "description": "The advanced account forecast set partner record that associates a partner with a forecast set. This value is required to view the forecasting grid."
      },
      "CarbonCreditCost": {
        "type": "double",
        "description": "The forecasted cost of the carbon credits in USD per tCO2e."
      },
      "EmissionsActivityId": {
        "type": "reference",
        "description": "The emissions activity record for which the emissions are being forecasted."
      },
      "FinalForecastedEmissions": {
        "type": "double",
        "description": "The final forecasted emissions value is calculated by deducting the planned internal and external emissions reductions from the forecasted emissions. If a forecasted emissions override is specified, the override becomes the final forecasted emissions."
      },
      "ForcstEmssnIntensityRdctnPct": {
        "type": "percent",
        "description": "The forecasted percentage of emissions intensity reduction for the emissions activity of the previous year. This value is required to reduce emissions. For example, as the revenue increases, this intensity reduction percentage ensures that the forecasted emissions don't increase."
      },
      "ForcstRenewableEnergyCnsmpPct": {
        "type": "percent",
        "description": "The forecasted consumption percentage of electricity generated from renewable energy that overrides the target renewable energy consumption percentage."
      },
      "ForecastedEmissions": {
        "type": "double",
        "description": "The forecasted emissions for the specified emissions activity in the forecasting year that’s calculated based on the forecasting measures and emissions activity."
      },
      "ForecastedEmissionsIntensity": {
        "type": "double",
        "description": "The forecasted emissions intensity that’s calculated by dividing the emissions intensity for the emissions activity by the forecasting metric."
      },
      "ForecastedEmissionsOverride": {
        "type": "double",
        "description": "The emissions value that overrides the forecasted emissions value."
      },
      "ForecastedEnergyConsumption": {
        "type": "double",
        "description": "The forecasted energy consumption for the year."
      },
      "ForecastedLocationBasedEmssn": {
        "type": "double",
        "description": "The forecasted location-based emissions from the electricity consumed for the year."
      },
      "ForecastedMarketBasedEmssn": {
        "type": "double",
        "description": "The forecasted market-based emissions from the electricity consumed for the year."
      },
      "Headcount": {
        "type": "double",
        "description": "The number of employees and contractors of the company by year."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates if the record is locked or not."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates if the record can be edited or not."
      },
      "Name": {
        "type": "string",
        "description": "Name of the record."
      },
      "NetEmissionsForecast": {
        "type": "double",
        "description": "The forecasted value of the emissions that must be reduced after accounting for the planned carbon offsets for a year."
      },
      "OtherApplnForecastedEmissions": {
        "type": "double",
        "description": "The emissions value that’s forecasted by an application other than Sustainability Cloud. This value can be added in Sustainability Cloud through an automated process or by manual entry. Users can refer to this value when generating forecasts in Sustainability Cloud."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PeriodId": {
        "type": "reference",
        "description": "The period for which the forecasting data is created. This period is typically a year for Sustainability Cloud."
      },
      "PlannedCarbonCredits": {
        "type": "double",
        "description": "The carbon credits that have been planned to be allocated for an emissions activity for a year."
      },
      "PlannedCarbonCreditsInvst": {
        "type": "currency",
        "description": "The cost incurred to invest in the carbon credits that are planned for the future."
      },
      "PlnOperationalEmissionsRdctn": {
        "type": "double",
        "description": "The planned reduction of emissions from the operational initiatives of the annual emissions activity."
      },
      "PlnSupplierEmissionsRdctn": {
        "type": "double",
        "description": "The planned reduction of emissions from the supplier initiatives of the annual emissions activity."
      },
      "ProcurementSpend": {
        "type": "currency",
        "description": "The amount spent on procurement of material and services from suppliers."
      },
      "RequiredCarbonCredits": {
        "type": "double",
        "description": "The carbon credits that are required to meet target compensated emissions. This value is the difference between the valid forecasted emissions and the target compensated emissions."
      },
      "RequiredCarbonCreditsInvst": {
        "type": "currency",
        "description": "The cost incurred to invest in the carbon credits that are required for the future."
      },
      "Revenue": {
        "type": "currency",
        "description": "The revenue of the company by year."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the combination of forecast year, measure, account, and emissions activity record."
      },
      "TargetCompensatedEmissions": {
        "type": "double",
        "description": "The target emissions value for the specified emissions activity in the forecasting year. This value is from the annual emissions reduction target record when the target type is Net Zero Emissions."
      },
      "TargetEmissions": {
        "type": "double",
        "description": "The target emissions for the specified emissions activity in the forecasting year. This value is from the annual emissions reduction target record when the target type is Emissions Reduction."
      },
      "TargetRenewableEnergyPct": {
        "type": "double",
        "description": "The percentage of target renewable energy consumption for electricity. This value is from the annual emissions reduction target record when the target type is Renewable Energy Consumption."
      },
      "TotalFloorArea": {
        "type": "double",
        "description": "The total floor area occupied by the company."
      }
    },
    "module": "Net Zero Cloud"
  }
}