{
  "EmssnReductionTarget": {
    "name": "EmssnReductionTarget",
    "description": "Represents information about the science-based or non-science-based target set by a company to fulfill its emissions reduction commitment. This target indicates the company’s emissions reduction goal. A company’s emissions reduction goal could be to reduce carbon emissions or increase renewable energy for reaching a target metric tonnes of CO2e (tCO2e) within a specific timeframe.",
    "properties": {
      "AbsoluteContractionPercentage": {
        "type": "picklist",
        "description": "The percentage of annual contraction when using the SBTI's absolute contraction method of target-setting. 2.5% annual linear reduction is recommended for SBTi WB2C targets and 4.2% annual linear reduction is recommended for SBTi 1.5C targets."
      },
      "ActivityUnit": {
        "type": "picklist",
        "description": "The unit used for measuring the base year activity and target year activity."
      },
      "AnnualEmissionsInventoryId": {
        "type": "reference",
        "description": "The base year’s annual emissions inventory record that’s related to the emission reduction target record."
      },
      "BaseYear": {
        "type": "double",
        "description": "The year of the related annual emissions inventory record."
      },
      "BaseYearActivity": {
        "type": "double",
        "description": "The amount of activity in the base year that’s used to calculate emission reduction using the economic intensity or sectoral decarbonization methods."
      },
      "BaseYearEmissionIntensity": {
        "type": "double",
        "description": "The level of emissions per unit of economic activity in the base year. This value is usually the dollar value added or the unit of production in the base year that’s derived from the related annual emissions inventory record."
      },
      "BaseYearEmissions": {
        "type": "double",
        "description": "The base year’s emissions value in the related annual emissions inventory record."
      },
      "BusinessLine": {
        "type": "string",
        "description": "The line of business for which the emissions reduction target is being set when the selected target level is Business Line."
      },
      "BusinessRegion": {
        "type": "picklist",
        "description": "The business region for which the emissions reduction target is being set when the selected target level is Business Region."
      },
      "Category": {
        "type": "picklist",
        "description": "The category of the emissions reduction target."
      },
      "Country": {
        "type": "picklist",
        "description": "The country for which the emissions reduction target is being set when the selected target level is Country."
      },
      "CustomAbsoluteContractionPct": {
        "type": "percent",
        "description": "The custom percentage of annual emission contraction when using the SBTI's absolute contraction method of target-setting."
      },
      "CustomTargetSettingMethod": {
        "type": "string",
        "description": "The method used for setting the target when target setting method is Custom."
      },
      "CustomTargetType": {
        "type": "string",
        "description": "The type of emissions reduction target when the target type is Custom."
      },
      "Description": {
        "type": "string",
        "description": "The description of the emissions reduction target record."
      },
      "EmissionsActivityId": {
        "type": "reference",
        "description": "The emissions activity record that’s related to the emissions reduction target record."
      },
      "EmssnRdctnCommitmentId": {
        "type": "reference",
        "description": "The emissions-reduction commitment record for which target is being set."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates if the record is locked or not."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Level": {
        "type": "picklist",
        "description": "The level at which the emissions reduction target is being set."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates if the record can be edited or not."
      },
      "Name": {
        "type": "string",
        "description": "The name of the emissions reduction target record."
      },
      "OtherTargetKpi": {
        "type": "picklist",
        "description": "The key performance indicator (KPI) of targets when the target setting method is Other."
      },
      "OtherTargetKpiChangePercentage": {
        "type": "percent",
        "description": "The targeted percentage of change in the key performance indicators (KPI) from the base year to the target year."
      },
      "OtherTargetKpiInBaseYear": {
        "type": "double",
        "description": "The key performance indicator (KPI) of targets in the base year when the target setting method is Other."
      },
      "OtherTargetKpiInTargetYear": {
        "type": "double",
        "description": "The key performance indicator (KPI) of targets in the target year when the target setting method is Other."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "TargetEmissionsCalculator": {
        "type": "picklist",
        "description": "The application that’s used to calculate the emissions target."
      },
      "TargetEmssnChangePercentage": {
        "type": "percent",
        "description": "The targeted percentage of change in emissions from the base year to the target year."
      },
      "TargetEmssnIntensityChangePct": {
        "type": "percent",
        "description": "The targeted percentage of change in emissions intensity from the base year to the target year."
      },
      "TargetSettingMethod": {
        "type": "picklist",
        "description": "The method used for setting the target."
      },
      "TargetType": {
        "type": "picklist",
        "description": "The type of emissions reduction target."
      },
      "TargetYear": {
        "type": "picklist",
        "description": "The year for which the emissions reduction target is set. The target year is determined by adding the number of years for which the target is set to the base year."
      },
      "TargetYearActivity": {
        "type": "double",
        "description": "The amount of activity in the target year that’s used to calculate emission reduction using economic intensity or sectoral decarbonization methods."
      },
      "TargetYearEmissions": {
        "type": "double",
        "description": "The emissions targeted for in the target year."
      },
      "TargetYearEmissionsIntensity": {
        "type": "double",
        "description": "The level of emissions per unit of economic activity in the target year. This value is usually the dollar value added or the unit of production in the target year."
      },
      "TargetYearOutputCalcType": {
        "type": "picklist",
        "description": "The measure that’s used to calculate the company’s output in the target year when the selected target setting method is Economic Intensity or Sectoral Decarbonization. The output can be calculated by aligning the company’s growth with its market sector or based on the company's projected activity growth in the target year."
      }
    },
    "module": "Net Zero Cloud"
  }
}