{
  "EmssnRdctnCommitment": {
    "name": "EmssnRdctnCommitment",
    "description": "Represents information about a company's commitment to reducing its carbon emissions. This commitment is in line with the Paris Agreement’s goal to achieve a low-carbon future. For example, companies sign the Business Ambition for 1.5°C commitment letter and commit to set emission reduction targets to limit temperature rise to 1.5°C above pre-industrial levels.",
    "properties": {
      "ApprovalDate": {
        "type": "date",
        "description": "The date when the climate body approves the commitment."
      },
      "CommitmentLetterId": {
        "type": "reference",
        "description": "The commitment letter that was pledged by the company."
      },
      "CommitmentProgram": {
        "type": "picklist",
        "description": "The climate commitment program that the company associates itself with."
      },
      "CommitmentType": {
        "type": "picklist",
        "description": "The type of climate commitment made by the company. A company committing to 1.5° Celsius emissions reduction target must set targets across all the greenhouse gas scopes in line with 1.5° Celsius emission scenarios. A company committing to a net-zero emissions reduction target must set a long-term science-based target to reach net-zero value chain greenhouse gas emissions by no later than 2050. It must also set interim targets across all the relevant greenhouse gas scopes. The targets must be set in line with the criteria and recommendations of the Science Based Targets initiative."
      },
      "CompanyBusinessRegion": {
        "type": "picklist",
        "description": "The business region in which the company operates."
      },
      "CompanyEmployeeCount": {
        "type": "int",
        "description": "The total number of employees in the company. The employee count determines whether the company is a small and medium enterprise (SME) or not."
      },
      "CompanySector": {
        "type": "multipicklist",
        "description": "The sector in which the company operates based on the SBTi sector classification."
      },
      "CompanyType": {
        "type": "picklist",
        "description": "The type of the company."
      },
      "CustomCommitmentProgram": {
        "type": "string",
        "description": "The climate commitment program that the company associates itself with when the commitment program is Custom."
      },
      "CustomCommitmentType": {
        "type": "string",
        "description": "The type of climate commitment made by the company when the commitment type is Custom."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates if the record is locked or not."
      },
      "IsSmallandMediumEnterprise": {
        "type": "boolean",
        "description": "Indicates whether the company is a small and medium enterprise (SME) or not based on the company’s employee count. A company with fewer than 500 employees is considered a small and medium enterprise (SME)."
      },
      "IsTargetUsedForForecasting": {
        "type": "boolean",
        "description": "Indicates whether to use the emissions reduction target record related to this commitment record for emissions forecasting."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates if the record can be edited or not."
      },
      "Name": {
        "type": "string",
        "description": "The name of the emissions reduction commitment record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PrimaryContactId": {
        "type": "reference",
        "description": "The primary contact to communicate about the company's climate commitment."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the climate commitment made by the company."
      },
      "TargetSettingDueDate": {
        "type": "date",
        "description": "The date by when the company must set their emissions targets after the commitment was approved."
      }
    },
    "module": "Net Zero Cloud"
  }
}