{
  "EnergyAttrCreditDstr": {
    "name": "EnergyAttrCreditDstr",
    "description": "Represents a junction between energy attribute credits and stationary asset energy use indicating the quantity of credits distributed for a specific energy use.",
    "properties": {
      "AllocationDate": {
        "type": "dateTime",
        "description": "The date when the energy attribute certificate credit was allocated."
      },
      "CleanEnergyType": {
        "type": "picklist",
        "description": "The clean energy type associated with this energy attribute certificate distribution."
      },
      "EnergyAttrCertCreditId": {
        "type": "reference",
        "description": "The energy attribute certificate credit record that's associated with the energy attribute certificate distribution."
      },
      "EnrgyAttrCrAllocCost": {
        "type": "currency",
        "description": "The cost of the energy attribute certificate credits that were allocated for the stationary asset energy use records."
      },
      "EnrgyAttrCreditsAlloc": {
        "type": "double",
        "description": "The energy attribute certificate credits that were allocated for the stationary asset energy use records in kWh."
      },
      "EnrgyAttrCreditsUnit": {
        "type": "picklist",
        "description": "The unit of measure for the energy attribute certificate credits."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the energy attribute certificate distribution."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "StnryAssetEnergyUseId": {
        "type": "reference",
        "description": "The stationary asset energy use record that's associated with the energy attribute certificate distribution."
      }
    },
    "module": "Net Zero Cloud"
  }
}