{
  "EnergyAttrCertCredit": {
    "name": "EnergyAttrCertCredit",
    "description": "Represents information about the energy attribute certificate credits related to energy attribute certificate purchase.",
    "properties": {
      "CleanEnergyProjectId": {
        "type": "reference",
        "description": "The clean energy project related to the energy attribute certificate purchase that's associated with the purchase of energy attribute certificate credits."
      },
      "CleanEnergyType": {
        "type": "picklist",
        "description": "The clean energy type from clean energy project related to the energy attribute certificate purchase that's associated with the purchase of energy attribute certificate credits."
      },
      "CostPerUnit": {
        "type": "currency",
        "description": "The cost of the credits for each unit of emissions."
      },
      "CreditsAllocatedInMwh": {
        "type": "double",
        "description": "The credits that are allocated to the emissions inventory of the organization measured in megawatt hour (MWh)."
      },
      "CreditsAvailableInMwh": {
        "type": "double",
        "description": "The credits that are available after allocation measured in megawatt hour (MWh)."
      },
      "CreditsIssueDate": {
        "type": "date",
        "description": "The date when the credits were issued."
      },
      "CreditsPurchasedInMwh": {
        "type": "double",
        "description": "The credits that are purchased by the organization measured in megawatt hour (MWh)."
      },
      "CreditsRetiredDate": {
        "type": "date",
        "description": "The date when the credits are retired from the registry."
      },
      "Description": {
        "type": "string",
        "description": "The description of the energy attribute certificate credit record."
      },
      "EnergyAttrCertPurchaseId": {
        "type": "reference",
        "description": "The energy attribute certificate purchase record that's associated with the purchase of energy attribute certificate credits."
      },
      "IsRetired": {
        "type": "boolean",
        "description": "Indicates whether the energy attribute certificate credit is retired (true) or not (false) so it can be allocated to the stationary asset energy use records."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the energy attribute certificate credit record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PurchaseDate": {
        "type": "date",
        "description": "The date when the energy attribute certificate credits were purchased."
      },
      "SupplierId": {
        "type": "reference",
        "description": "The name of the organization responsible for supplying the energy attribute certificate credits."
      },
      "TotalCost": {
        "type": "currency",
        "description": "The total amount spent on the credits."
      },
      "VintagePeriod": {
        "type": "string",
        "description": "The period when the energy attribute certificate credits were issued."
      }
    },
    "module": "Net Zero Cloud"
  }
}