{
  "EntityMilestone": {
    "name": "EntityMilestone",
    "description": "Represents a required step in a customer support process on a work order. The Salesforce user interface uses the term “object milestone.",
    "properties": {
      "ActualElapsedTimeInDays": {
        "type": "double",
        "description": "The number of days that it took to complete a milestone. (Elapsed Time) – (Stopped Time) = (Actual Elapsed Time) Note To display this field, select Enable stopped time and actual elapsed time on the Entitlement Settings page and add the field to the object milestone page layout."
      },
      "ActualElapsedTimeInHrs": {
        "type": "double",
        "description": "The number of hours that it took to complete a milestone. (Elapsed Time) – (Stopped Time) = (Actual Elapsed Time) Note To display this field, select Enable stopped time and actual elapsed time on the Entitlement Settings page and add the field to the object milestone page layout."
      },
      "ActualElapsedTimeInMins": {
        "type": "int",
        "description": "The number of minutes that it took to complete a milestone. (Elapsed Time) – (Stopped Time) = (Actual Elapsed Time) Note To display this field, select Enable stopped time and actual elapsed time on the Entitlement Settings page and add the field to the object milestone page layout."
      },
      "BusinessHoursId": {
        "type": "reference",
        "description": "The business hours on the milestone. If business hours aren’t specified, the entitlement process business hours are used. If business hours are also not specified on the entitlement process, the business hours on the record are used."
      },
      "CompletionDate": {
        "type": "dateTime",
        "description": "The date and time the milestone was completed."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for orgs with the multicurrency feature enabled. Contains the ISO code for any currency allowed by the organization."
      },
      "ElapsedTimeInDays": {
        "type": "double",
        "description": "The number of days it took to complete a milestone, including time during which the milestone was stopped. Automatically calculated to include the business hours on the record. Elapsed time is calculated only after the Completion Date field is populated. (Elapsed Time) – (Stopped Time) = (Actual Elapsed Time)."
      },
      "ElapsedTimeInHrs": {
        "type": "double",
        "description": "The number of hours it took to complete a milestone, including time during which the milestone was stopped. Automatically calculated to include the business hours on the record. Elapsed time is calculated only after the Completion Date field is populated. (Elapsed Time) – (Stopped Time) = (Actual Elapsed Time)."
      },
      "ElapsedTimeInMins": {
        "type": "int",
        "description": "The number of minutes it took to complete a milestone, including time during which the milestone was stopped. Automatically calculated to include the business hours on the record. Elapsed time is calculated only after the Completion Date field is populated. (Elapsed Time) – (Stopped Time) = (Actual Elapsed Time)."
      },
      "IsCompleted": {
        "type": "boolean",
        "description": "Green checkmark icon that indicates a milestone completion."
      },
      "IsViolated": {
        "type": "boolean",
        "description": "Red exclamation point icon that indicates a milestone violation."
      },
      "MilestoneTypeId": {
        "type": "reference",
        "description": "The ID of the milestone (for instance, First Response)."
      },
      "Name": {
        "type": "string",
        "description": "The name of the milestone."
      },
      "ParentEntityId": {
        "type": "reference",
        "description": "The ID of the record—for example, a work order—that contains the milestone."
      },
      "SlaProcessId": {
        "type": "reference",
        "description": "The entitlement process associated with the milestone."
      },
      "StartDate": {
        "type": "dateTime",
        "description": "The date and time that milestone tracking started."
      },
      "StoppedTimeInDays": {
        "type": "double",
        "description": "The number of days that an agent has been blocked from completing a milestone. For example, an agent may be waiting for a customer to reply with more information. Note To display this field, select Enable stopped time and actual elapsed time on the Entitlement Settings page and add the field to the object milestone page layout."
      },
      "StoppedTimeInHrs": {
        "type": "double",
        "description": "The number of hours that an agent has been blocked from completing a milestone. For example, an agent may be waiting for a customer to reply with more information. Note To display this field, select Enable stopped time and actual elapsed time on the Entitlement Settings page and add the field to the object milestone page layout."
      },
      "StoppedTimeInMins": {
        "type": "int",
        "description": "The number of minutes that an agent has been blocked from completing a milestone. For example, an agent may be waiting for a customer to reply with more information. Note To display this field, select Enable stopped time and actual elapsed time on the Entitlement Settings page and add the field to the object milestone page layout."
      },
      "TargetDate": {
        "type": "dateTime",
        "description": "The date and time to complete the milestone."
      },
      "TargetResponseInDays": {
        "type": "double",
        "description": "The number of days to complete the milestone. Automatically calculated to include the business hours on the record."
      },
      "TargetResponseInHrs": {
        "type": "double",
        "description": "The number of hours to complete the milestone. Automatically calculated to include the business hours on the record."
      },
      "TargetResponseInMins": {
        "type": "int",
        "description": "The number of minutes to complete the milestone. Automatically calculated to include the business hours on the record."
      },
      "TimeRemainingInDays": {
        "type": "string",
        "description": "The days that remain before a milestone violation. Automatically calculated to include the business hours on the record."
      },
      "TimeRemainingInHrs": {
        "type": "string",
        "description": "The hours that remain before a milestone violation. Automatically calculated to include the business hours on the record."
      },
      "TimeRemainingInMins": {
        "type": "string",
        "description": "The minutes that remain before a milestone violation. Automatically calculated to include the business hours on the record."
      },
      "TimeSinceTargetInDays": {
        "type": "string",
        "description": "The days that have elapsed since a milestone violation. Automatically calculated to include the business hours on the record."
      },
      "TimeSinceTargetInHrs": {
        "type": "string",
        "description": "The hours that have elapsed since a milestone violation. Automatically calculated to include the business hours on the record."
      },
      "TimeSinceTargetInMins": {
        "type": "string",
        "description": "The minutes that have elapsed since a milestone violation. Automatically calculated to include the business hours on the record."
      }
    },
    "module": "Field Service Lightning"
  }
}