{
  "Entitlement": {
    "name": "Entitlement",
    "description": "Represents the customer support an account or contact is eligible to receive.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "ID of the Account associated with the entitlement."
      },
      "AssetId": {
        "type": "reference",
        "description": "Required. ID of the Asset associated with the entitlement. Must be a valid asset ID."
      },
      "AssetWarrantyID": {
        "type": "reference",
        "description": "The identifier of the asset warranty record. Must be a valid asset warranty ID. AssetWarranty is available only with Field Service."
      },
      "BusinessHoursId": {
        "type": "reference",
        "description": "Required. ID of the BusinessHours associated with the entitlement. Must be a valid business hours ID."
      },
      "CasesPerEntitlement": {
        "type": "int",
        "description": "The total number of cases the entitlement supports."
      },
      "ContractLineItemId": {
        "type": "reference",
        "description": "Required. ID of the ContractLineItem associated with the entitlement. Must be a valid ID."
      },
      "EndDate": {
        "type": "date",
        "description": "The last day the entitlement is in effect."
      },
      "IsPerIncident": {
        "type": "boolean",
        "description": "Indicates whether the entitlement is limited to supporting a specific number of cases (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "date",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "date",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "LocationID": {
        "type": "reference",
        "description": "ID of the Location associated with the entitlement. Must be a valid location ID."
      },
      "Name": {
        "type": "string",
        "description": "Required. Name of the entitlement."
      },
      "SvcApptBookingWindowsId": {
        "type": "reference",
        "description": "The operating hours that the entitlement’s work orders should respect. The label in the user interface is Operating Hours. Available only if Field Service is enabled."
      },
      "RemainingCases": {
        "type": "int",
        "description": "The number of cases the entitlement can support. This field decreases in value by one each time a case is created with the entitlement."
      },
      "RemainingWorkOrders": {
        "type": "int",
        "description": "The number of agreed work orders remaining to be created."
      },
      "ServiceContractId": {
        "type": "reference",
        "description": "Required. ID of the ServiceContract associated with the entitlement. Must be a valid ID."
      },
      "SlaProcessId": {
        "type": "reference",
        "description": "ID of the SlaProcess associated with the entitlement. This field is available in version 19.0 and later."
      },
      "StartDate": {
        "type": "date",
        "description": "The first date the entitlement is in effect."
      },
      "Status": {
        "type": "picklist",
        "description": "Status of the entitlement, such as Expired."
      },
      "SvcApptBookingWindows": {
        "type": "reference",
        "description": "The operating hours of the entitlement. This field is visible only if Field Service is enabled."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of entitlement, such as Web or phone support."
      },
      "": {
        "type": "",
        "description": ""
      },
      "WorkOrdersPerEntitlement": {
        "type": "int",
        "description": "Total number of work orders available for this entitlement."
      }
    },
    "module": "Field Service Lightning",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.field_service_dev.meta/field_service_dev/sforce_api_objects_entitlement.htm"
  }
}