{
  "EnvironmentalRisk": {
    "name": "EnvironmentalRisk",
    "description": "Represents information about the risk that the environmental resources create for an organization.",
    "properties": {
      "Aquifer": {
        "type": "string",
        "description": "The name of the groundwater aquifer system."
      },
      "BaselineStress": {
        "type": "picklist",
        "description": "Specifies the baseline stress that is a ratio of total water withdrawals to available renewable surface and groundwater supplies. Water withdrawals include domestic, industrial, irrigation, and livestock consumptive and non-consumptive uses. Available renewable water supplies include the impact of upstream consumptive water users and large dams on downstream water availability. Higher values indicate more competition among users."
      },
      "BusinessQuantifiedRisk": {
        "type": "currency",
        "description": "The risk that's identified by an organization using the internal tools and processes."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the environmental risk."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "MajorBasin": {
        "type": "string",
        "description": "The name of the major river basin."
      },
      "MinorBasin": {
        "type": "string",
        "description": "The name of the minor river basin."
      },
      "Name": {
        "type": "string",
        "description": "The name of this environmental risk."
      },
      "OverallRisk": {
        "type": "picklist",
        "description": "Specifies the total risk that’s calculated by aggregating the selected indicators from the categories, such as physical quantity, quality, and regulatory, and reputation risk. Higher values indicate high environmental risk."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": ""
      },
      "RiskType": {
        "type": "picklist",
        "description": "Specifies the type of risk related to the environment."
      },
      "UpdateYear": {
        "type": "picklist",
        "description": "Specifies the year when the customer has updated the environment risk."
      }
    },
    "module": "Net Zero Cloud"
  }
}