{
  "EventBusSubscriber": {
    "name": "EventBusSubscriber",
    "description": "Represents a trigger, process, or flow that’s subscribed to a platform event or a change data capture event. Doesn’t include CometD or Pub/Sub API subscribers.",
    "properties": {
      "ExternalId": {
        "type": "string",
        "description": "The ID of the subscriber. For example, the trigger ID."
      },
      "IsPartitioned": {
        "type": "boolean",
        "description": "Indicates whether the platform event Apex trigger is configured with parallel subscriptions (true) or not (false). The default value is false. See Platform Event Processing at Scale with Parallel Subscriptions for Apex Triggers in the Platform Events Developer Guide."
      },
      "LastError": {
        "type": "string",
        "description": "The error message that the last thrown EventBus.RetryableException contains. This field applies to Apex triggers only. Available in API version 43.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "The name of the subscribed item, such as the trigger or process name. If the subscribed item’s name is “Process”, at least one flow Pause element is subscribed to the event."
      },
      "Position": {
        "type": "int",
        "description": "The replay ID of the last event that the subscriber processed."
      },
      "Retries": {
        "type": "int",
        "description": "The number of times the trigger was retried due to throwing the EventBus.RetryableException. This field applies to Apex triggers only. Available in API version 43.0 and later."
      },
      "Status": {
        "type": "picklist",
        "description": "Indicates the status of the subscriber. Can be one of these values: Error— The subscriber was disconnected and stopped receiving published events. A trigger reaches this state when it exceeds the number of maximum retries with the EventBus.RetryableException. Trigger assertion failures and unhandled exceptions don’t cause the error state. We recommend limiting the retries to fewer than nine times to avoid reaching this state. When you fix and save the trigger, or for a managed package trigger, if you redeploy the package, the trigger resumes automatically from the tip, starting from new events. Also, you can resume a trigger subscription in the subscription detail page that you access from the platform event page. Repartitioning—The system is in the process of modifying the trigger's parallel subscription configuration. Running—The subscriber is actively listening to events. If you modify the subscriber, the subscription continues to process events. Suspended—The subscriber is disconnected and can’t receive events because a Salesforce admin suspended it or due to an internal error. You can resume a trigger subscription in the subscription detail page that you access from the platform event page. To resume a process, deactivate it and then reactivate it. If you modify the subscriber, the subscription resumes automatically from the tip, starting from new events."
      },
      "Tip": {
        "type": "int",
        "description": "The replay ID of the last published event. Note For high-volume platform events and change events, the value for Tip isn’t available and is always -1."
      },
      "Topic": {
        "type": "string",
        "description": "The name of the subscription channel that corresponds to a platform event or change event. For a platform event, the topic name is the event name appended with __e, such as MyEvent__e. For a change event, the topic is the name of the change event, such as AccountChangeEvent."
      },
      "Type": {
        "type": "string",
        "description": "The subscriber type (ApexTrigger). If the subscriber is a process or flow Pause element, the type is blank."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_eventbussubscriber.htm"
  }
}