{
  "Expense": {
    "name": "Expense",
    "description": "Represents an expense linked to a work order. Service resource technicians can log expenses, such as tools or travel costs.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The ID of the account associated with the linked work order."
      },
      "Amount": {
        "type": "currency",
        "description": "The amount of the expense."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only if the multicurrency feature is enabled. Contains the ISO code for any currency allowed by the organization."
      },
      "Description": {
        "type": "textarea",
        "description": "A description for the expense."
      },
      "Discount": {
        "type": "percent",
        "description": "The percentage deducted from the Subtotal price. Available in version 51.0 and later."
      },
      "ExpenseEndDate": {
        "type": "date",
        "description": "If the expense was incurred over multiple days, the Expense End Date is the last day that the expense covers."
      },
      "ExpenseNumber": {
        "type": "string",
        "description": "The number that uniquely identifies the expense."
      },
      "ExpenseStartDate": {
        "type": "date",
        "description": "If the expense was incurred over multiple days, the Expense Start Date is the first day that the expense covers."
      },
      "ExpenseType": {
        "type": "picklist",
        "description": "The type of expense. Possible values are: Billable Non-Billable The default value is Billable."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns the expense record."
      },
      "Quantity": {
        "type": "double",
        "description": "The number of items purchased in this record. Available in version 51.0 and later."
      },
      "Subtotal": {
        "type": "currency",
        "description": "The subtotal price calculated as the product of Quantity and UnitPrice. Available in version 51.0 and later."
      },
      "Title": {
        "type": "string",
        "description": "A title that identifies the expense."
      },
      "TotalPrice": {
        "type": "currency",
        "description": "The total price of the transaction which is equal to the discounted subtotal: Subtotal - (Discount * Subtotal). Available in version 51.0 and later."
      },
      "TransactionDate": {
        "type": "date",
        "description": "The day that the expense was incurred, or the payment date for the expense."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "The price of one item on the record. Available in version 51.0 and later."
      },
      "WorkOrderId": {
        "type": "reference",
        "description": "The ID of the work order associated with the expense."
      }
    },
    "module": "Field Service Lightning",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.field_service_dev.meta/field_service_dev/sforce_api_objects_expense.htm"
  }
}