{
  "ExplainabilityActionVersion": {
    "name": "ExplainabilityActionVersion",
    "description": "Represents the explainability action version of the explainability action log that's generated by the associated application's action.",
    "properties": {
      "ActionLogMessageTemplate": {
        "type": "string",
        "description": "The custom message template that is registered by the application."
      },
      "ActionSpecification": {
        "type": "string",
        "description": "The explainability specification of the application's action log that's generated at runtime and stored as a JSON file."
      },
      "DefinitionVersion": {
        "type": "int",
        "description": "The version of the explainability action definition."
      },
      "Description": {
        "type": "string",
        "description": "The description of the explainability action version record."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the explainability action version record."
      },
      "ExplainabilityActionDefId": {
        "type": "reference",
        "description": "The explainability action definition of which this record is one of the versions."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the explainability action version is active and can be used as a specification in the application's action logs (true) or not (false)."
      },
      "Language": {
        "type": "string",
        "description": "The language of the explainability action version."
      },
      "ManageableState": {
        "type": "string",
        "description": "Indicates the manageable state of the specified component that is contained in a package."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The UI label of the explainability action version."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/tooling_api_objects_explainabilityactionversion.htm"
  }
}