{
  "ExpressionSetObjectAlias": {
    "name": "ExpressionSetObjectAlias",
    "description": "Represents the alias of the source object that's used in an expression set.",
    "properties": {
      "DataType": {
        "type": "picklist",
        "description": "Specifies the data type of the object alias. This is a required field."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The developer name of the expression set object alias."
      },
      "FullName": {
        "type": "string",
        "description": "The name of the expression set object alias."
      },
      "Language": {
        "type": "picklist",
        "description": "The language in which the expression set object alias is created."
      },
      "ManageableState": {
        "type": "picklist",
        "description": "Indicates the manageable state of the specified component that is contained in a package."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label of the expression set object alias."
      },
      "Metadata": {
        "type": "complexvalue",
        "description": "Expression set object alias metadata."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix."
      },
      "ObjectAlias": {
        "type": "string",
        "description": "The alias that corresponds to the source object that's used in an expression set. In the context of an expression set, this alias in a group that contains the aliases of fields from the source object. The length of the object alias can’t exceed 40 characters. This is a required field."
      },
      "ObjectApiName": {
        "type": "string",
        "description": "The API name of the source object associated with the alias that's being used in an expression set."
      },
      "UsageType": {
        "type": "picklist",
        "description": "The type of application associated with the industry that's using an expression set."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/tooling_api_objects_expressionsetobjectalias.htm"
  }
}