{
  "ExpressionSet": {
    "name": "ExpressionSet",
    "description": "Represents information about an expression set. An expression set performs a series of calculations using lookups and user-defined variables and constants.",
    "properties": {
      "ApiName": {
        "type": "string",
        "description": "The API name of the expression set. This field is unique within your organization. This is a required field."
      },
      "Description": {
        "type": "string",
        "description": "The description of the expression set."
      },
      "ExecutionScale": {
        "type": "picklist",
        "description": "Specifies the scale of the input that an expression set processes. The scale determines where the expression set is executed."
      },
      "ExpressionSetDefinitionId": {
        "type": "reference",
        "description": "The expression set definition record associated with this expression set. This is a required field."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it's possible the user only accessed this record or list view (LastReferencedDate) but didn't view it."
      },
      "Name": {
        "type": "string",
        "description": "The name of the expression set. This is a required field."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who currently owns this expression set. Default value is the user logged in to the API to perform the create action"
      },
      "UsageType": {
        "type": "picklist",
        "description": "The type of industry that’s using the expression set."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/sforce_api_objects_expressionset.htm"
  }
}