{
  "ExpressionSetVersion": {
    "name": "ExpressionSetVersion",
    "description": "Represents information about a specific version of an expression set. This object is also accessible through the UI API, which enables its use in components like Lightning Web Components (LWC).",
    "properties": {
      "ApiName": {
        "type": "string",
        "description": "The API name of the expression set version. This is a required field and it requires a unique value."
      },
      "Description": {
        "type": "string",
        "description": "The description of the expression set version,"
      },
      "DecimalScale": {
        "type": "int",
        "description": "The number of decimal places to apply to non-local resources such as context tags."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "The date and time when the expression set version becomes inactive."
      },
      "ExpressionSetDefinitionVerId": {
        "type": "reference",
        "description": "The expression set definition version associated with this expression set version. This is a required field."
      },
      "ExpressionSetId": {
        "type": "reference",
        "description": "The ID of the parent expression set record that’s associated with this expression set version. This is a required field."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the expression set version is active (true) or not (false). This is a required field."
      },
      "IsLoopingEnabled": {
        "type": "boolean",
        "description": "Indicates whether looping is active for this expression set version (true) or not (false)."
      },
      "LatestSimulationResult": {
        "type": "textarea",
        "description": "The result of the simulation service that processes the input variables defined for the expression set version, in JSON format."
      },
      "LoopEndVariableName": {
        "type": "textarea",
        "description": "The name of the resource that’s used to determine which resource can be processed last in the loop."
      },
      "LoopIncrementVariableName": {
        "type": "textarea",
        "description": "The name of the variable that’s used to determine which resource can be processed next in the loop."
      },
      "LoopStartVariableName": {
        "type": "textarea",
        "description": "The name of the variable that’s processed when the loop starts."
      },
      "Name": {
        "type": "string",
        "description": "The name of the expression set version. This is a required field."
      },
      "Rank": {
        "type": "int",
        "description": "The rank of the expression set version. An expression set version's rank is used to determine when the version is chosen for processing. When more than one enabled version matches an expression set call, and the start and end date time periods overlap, the version with the highest rank is chosen."
      },
      "ShouldShowExplExternally": {
        "type": "boolean",
        "description": "Indicates whether the decision explanation is exposed to external users (true) or not (false)."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "The date and time when the expression set version becomes active."
      },
      "VersionNumber": {
        "type": "int",
        "description": "The version number of this expression set. This is a required field."
      }
    },
    "module": "Public Sector Cloud"
  }
}