{
  "ExpsSetObjectAliasFieldVw": {
    "name": "ExpsSetObjectAliasFieldVw",
    "description": "Represents the virtual object that provides a consolidated view of source object and its alias, and the source object fields and their aliases that are used in an expression set. This object is used to check the permission level required to access the underlying object fields associated with their field aliases.",
    "properties": {
      "DurableId": {
        "type": "string",
        "description": "The unique identifier for the field. Always retrieve this value before using it, as the value isn’t guaranteed to stay the same from one release to the next. Simplify queries by using this field instead of making multiple queries."
      },
      "ExpsSetDefVerVarField": {
        "type": "string",
        "description": "Identifies the variable to which this field belongs. This is a required field."
      },
      "FieldAlias": {
        "type": "string",
        "description": "The alias associated with the object field that's used in the expression set. The field alias can be up to 30 characters in length. This is a required field."
      },
      "InstalledPackageName": {
        "type": "string",
        "description": "The name of the package used to add the record to the org. This is a required field."
      },
      "LastModifiedBy": {
        "type": "string",
        "description": "The unique identifier of the user who modified the alias last. This is a required field."
      },
      "ManageableState": {
        "type": "picklist",
        "description": "Indicates the manageable state of the specified component that is contained in a package. This is a required field."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. This is a required field.The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "ObjectAlias": {
        "type": "string",
        "description": "The alias that corresponds to the source object whose fields are used in an expression set. In the context of an expression set, this alias is a group that contains the aliases for fields from the source object. This is a required field."
      },
      "ObjectApiName": {
        "type": "string",
        "description": "The API name of the source object associated with the object field aliases that are used in an expression set."
      },
      "SourceFieldDataType": {
        "type": "picklist",
        "description": "The data type of the source object for which the object alias is defined. This is a required field."
      },
      "SourceFieldDecimalScale": {
        "type": "int",
        "description": "The number of decimal places applied to the value in the source field that's of the type Currency, Percent, or Number."
      },
      "SourceFieldName": {
        "type": "string",
        "description": "The name of the source object field associated with a field alias that's used in an expression set. This is a required field."
      },
      "UsageType": {
        "type": "picklist",
        "description": "The type of application associated with the industry that's using an expression set."
      }
    },
    "module": "Public Sector Cloud"
  }
}