{
  "ExternalSocialAccount": {
    "name": "ExternalSocialAccount",
    "description": "Represents a managed social media account on a social network such as Facebook or Twitter.",
    "properties": {
      "AuthorizedBy": {
        "type": "string",
        "description": "Name of the Radian6 user who added the social account to Radian6."
      },
      "DataSourceId": {
        "type": "string",
        "description": "ID of the Radian6 data source for the social account."
      },
      "DefaultResponseAccountId": {
        "type": "reference",
        "description": "ID of the managed social account to use by default when responding."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the record in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. This field is automatically generated but you can supply your own value if you create the record using the API. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow while Salesforce generates one for each record. Note Only users with View DeveloperName OR View Setup and Configuration permission can view, group, sort, and filter this field."
      },
      "ExternalAccountId": {
        "type": "string",
        "description": "ID of the social account on the social network."
      },
      "ExternalPictureURL": {
        "type": "url",
        "description": "URL to the picture of the social account on the social network."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Specifies whether the social account is active or not."
      },
      "IsAuthenticated": {
        "type": "boolean",
        "description": "Specifies whether the social account is authenticated or not."
      },
      "IsCaseCreationEnabled": {
        "type": "boolean",
        "description": "Specifies whether case creation for the social account is enabled or not."
      },
      "IsDataSourceActive": {
        "type": "boolean",
        "description": "Specifies whether the data source is active or not."
      },
      "Language": {
        "type": "picklist",
        "description": "Specifies the language of the social account."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Master label for the social account. This display value is the internal label and does not get translated."
      },
      "ProfileUrl": {
        "type": "url",
        "description": "URL for the profile."
      },
      "Provider": {
        "type": "picklist",
        "description": "Social network, such as Facebook or Twitter, of the social account."
      },
      "ProviderUserId": {
        "type": "string",
        "description": "User ID for the social network of the social account."
      },
      "RuleId": {
        "type": "string",
        "description": "ID of the Radian6 rule for the account."
      },
      "SocialPropertyId": {
        "type": "string",
        "description": "ID of the Radian6 social property for the account."
      },
      "TopicId": {
        "type": "string",
        "description": "ID of the topic for the social account."
      },
      "UniqueName": {
        "type": "string",
        "description": "Unique name for the social account."
      },
      "Username": {
        "type": "string",
        "description": "Username for the social account."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_externalsocialaccount.htm"
  }
}