{
  "ExternalCredential": {
    "name": "ExternalCredential",
    "description": "Represents the details of how Salesforce authenticates to the external system.",
    "properties": {
      "AuthenticationProtocol": {
        "type": "picklist",
        "description": "Required. The authentication protocol that’s required to access the external system. Valid values are: AwsSv4 — AWS Signature Version 4 Basic — Authentication using a static username and password Custom — User-created authentication. Specify the permission set, sequence number, and authentication parameters. Each authentication parameter requires a name and value. Jwt — Reserved for future use JwtExchange— Reserved for future use NoAuthentication — Reserved for future use Oauth — Oauth 2.0 Password — Reserved for future use For connections to Amazon Web Services using Signature Version 4, use AwsSv4. For connections using a direct token system, use Jwt. If using an intermediary authorization provider to process JWTs and return access tokens, use JwtExchange. For Simple URL data sources, select NoAuthentication. For connections using a static username and password, use Basic. For cloud-based Files Connect external systems, select Oauth. For on-premises systems, select Password."
      },
      "Description": {
        "type": "",
        "description": ""
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name for the external credential object."
      },
      "ExternalCredentialParameters": {
        "type": "ExternalCredentialParameter[]",
        "description": "One or more sets of parameters that further configure the external credential."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of ExternalCredential in Metadata API. The full name can include a namespace prefix."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the external credential."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "The main label for the external credential. In the UI, this field is Label."
      },
      "Metadata": {
        "type": "ExternalCredential",
        "description": "The external credential’s metadata."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation."
      },
      "AuthProvider": {
        "type": "",
        "description": ""
      },
      "Certificate": {
        "type": "",
        "description": ""
      },
      "ExtlAuthIdentityProvider": {
        "type": "",
        "description": ""
      },
      "ParameterGroup": {
        "type": "",
        "description": ""
      },
      "ParameterName": {
        "type": "",
        "description": ""
      },
      "ParameterType": {
        "type": "",
        "description": ""
      },
      "ParameterValue": {
        "type": "",
        "description": ""
      },
      "Principal": {
        "type": "",
        "description": ""
      },
      "SequenceNumber": {
        "type": "",
        "description": ""
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_externalcredential.htm"
  }
}