{
  "GeneralLdgrAcctPrdSummary": {
    "name": "GeneralLdgrAcctPrdSummary",
    "description": "Represents a junction between a general ledger account and a legal entity accounting period. Stores information about the total credit amount, total debit amount, opening balance, and closing balance of a general ledger account for a specific legal entity accounting period.",
    "properties": {
      "ClosingBalanceAmount": {
        "type": "currency",
        "description": "The closing balance amount for a general ledger accounting period summary is calculated based on the general ledger account's type. For asset and expense type general ledger accounts, it’s the opening balance amount plus total debit amount minus total credit amount. For liability, equity, and revenue type general ledger accounts, it’s the opening balance amount plus total credit amount minus total debit amount."
      },
      "GeneralLedgerAccountId": {
        "type": "reference",
        "description": "The general ledger account that’s related to the general ledger accounting period summary."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed general ledger accounting period summary record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed general ledger accounting period summary record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "LegalEntityAccountingPeriodId": {
        "type": "reference",
        "description": "The legal entity accounting period that’s related to the general ledger account."
      },
      "OpeningBalanceAmount": {
        "type": "currency",
        "description": "The opening balance is the same as the closing balance of the previous general ledger account period summary."
      },
      "TotalCreditAmount": {
        "type": "currency",
        "description": "The sum of the credit fields from all transaction journals of the general ledger account for a specific legal entity accounting period."
      },
      "TotalDebitAmount": {
        "type": "currency",
        "description": "The sum of the debit fields from all transaction journals of the general ledger account for a specific legal entity accounting period."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_generalldgracctprdsummary.htm"
  }
}