{
  "GeneralLedgerAcctAsgntRule": {
    "name": "GeneralLedgerAcctAsgntRule",
    "description": "",
    "properties": {
      "CreditGeneralLedgerAccountId": {
        "type": "reference",
        "description": "The general ledger account for a credit transaction that's related to the general ledger account assignment rule."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "The currency code of the general ledger account assignment rule for Salesforce orgs with multicurrency enabled."
      },
      "DebitGeneralLedgerAccountId": {
        "type": "reference",
        "description": "The general ledger account for a debit transaction that's related to the general ledger account assignment rule."
      },
      "FilterCriteria": {
        "type": "picklist",
        "description": "The filter criteria for the general ledger account assignment rule."
      },
      "FilterLogic": {
        "type": "string",
        "description": "The filter logic for the general ledger account assignment rule when the filter criteria is Custom. Transaction journals are created for the transactions of the selected type that meet the defined filter logic."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "The legal entity that's related to the general ledger account assignment rule."
      },
      "Name": {
        "type": "string",
        "description": "A user-defined name for the general ledger account assignment rule."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the owner of the general ledger account assignment rule record."
      },
      "Priority": {
        "type": "int",
        "description": "The priority of the general ledger account assignment rule when there are multiple general ledger account assignment rules defined for a transaction type."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the general ledger account assignment rule."
      },
      "TransactionAmountField": {
        "type": "string",
        "description": "The amount field on the transaction type that's used to record the credit or debit amount in the transaction journals that are generated for that specific transaction type. This field is available in API version 64.0 and later."
      },
      "TransactionType": {
        "type": "picklist",
        "description": "The transaction type that's related to the general ledger account assignment rule."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_generalledgeracctasgntrule.htm"
  }
}