{
  "DandBCompany": {
    "name": "DandBCompany",
    "description": "Represents a Dun & Bradstreet® company record, which is associated with an account added from Data.com.",
    "properties": {
      "Address": {
        "type": "address",
        "description": "The compound form of the address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "City": {
        "type": "string",
        "description": "The city where a company is physically located. Maximum size is 40 characters."
      },
      "CompanyCurrencyIsoCode": {
        "type": "picklist",
        "description": "The code used to represent a company’s local currency. This data is provided by the International Organization for Standardization (ISO) and is based on their three-letter currency codes. For example, USD is the ISO code for United States Dollar. Maximum size is 3 characters."
      },
      "Country": {
        "type": "string",
        "description": "The country where a company is physically located. Maximum size is 40 characters."
      },
      "CountryAccessCode": {
        "type": "string",
        "description": "The required code for international calls. Maximum size is 4 characters."
      },
      "CurrencyCode": {
        "type": "picklist",
        "description": "The currency in which the company’s sales volume is expressed. The full list of values can be found at the Optimizer Resources page maintained by Dun & Bradstreet. Maximum size is 4 characters."
      },
      "Description": {
        "type": "textarea",
        "description": "A brief description of the company, which may include information about its history, its products and services, and its influence on a particular industry. Maximum size is 32000 characters."
      },
      "DomesticUltimateBusinessName": {
        "type": "string",
        "description": "The primary name of the Domestic Ultimate, which is the highest ranking subsidiary, specified by country, within an organization’s corporate structure. Maximum size is 255 characters."
      },
      "DomesticUltimateDunsNumber": {
        "type": "string",
        "description": "The D-U-N-S Number for the Domestic Ultimate, which is the highest ranking subsidiary, specified by country, within an organization’s corporate structure. Maximum size is 9 characters."
      },
      "DunsNumber": {
        "type": "string",
        "description": "The Data Universal Numbering System (D-U-N-S) number is a unique, nine-digit number assigned to every business location in the Dun & Bradstreet database that has a unique, separate, and distinct operation. D-U-N-S numbers are used by industries and organizations around the world as a global standard for business identification and tracking. Maximum size is 9 characters."
      },
      "EmployeeQuantityGrowthRate": {
        "type": "double",
        "description": "The yearly growth rate of the number of employees in a company expressed as a decimal percentage. The data includes the total employee growth rate for the past two years."
      },
      "EmployeesHere": {
        "type": "double",
        "description": "The number of employees at a specified location, such as a branch location. Maximum size is 15 characters."
      },
      "EmployeesHereReliability": {
        "type": "picklist",
        "description": "The reliability of the EmployeesHere figure. Available values include: 0—Actual number 1—Low 2—Estimated (for all records) 3—Modeled (for non-US records)"
      },
      "EmployeesTotal": {
        "type": "double",
        "description": "The total number of employees in the company, including all subsidiary and branch locations. This data is only available on records that have a value of Headquarters/Parent in the LocationStatus field. Maximum size is 15 characters."
      },
      "EmployeesTotalReliability": {
        "type": "picklist",
        "description": "The reliability of the EmployeesTotal figure. Available values include: 0—Actual number 1—Low 2—Estimated (for all records) 3—Modeled (for non-US records) A blank value indicates this data is unavailable."
      },
      "FamilyMembers": {
        "type": "int",
        "description": "The total number of family members, worldwide, within an organization, including the Global Ultimate, its subsidiaries (if any), and its branches (if any). Maximum size is 5 characters."
      },
      "Fax": {
        "type": "phone",
        "description": "The company’s facsimile number."
      },
      "FifthNaics": {
        "type": "string",
        "description": "An additional NAICS code used to further classify an organization by industry. Maximum size is 6 characters."
      },
      "FifthNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding NAICS code. Maximum size is 120 characters."
      },
      "FifthSic": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "FifthSic8": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "FifthSic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "FifthSicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "FipsMsaCode": {
        "type": "string",
        "description": "The Federal Information Processing Standards (FIPS) and the Metropolitan Statistical Area (MSA) codes identify the organization’s location. The MSA codes are defined by the US Office of Management and Budget. Maximum size is 5 characters."
      },
      "FipsMsaDesc": {
        "type": "string",
        "description": "A brief description of an organization’s FIPS MSA code. Maximum size is 255 characters."
      },
      "FortuneRank": {
        "type": "int",
        "description": "The numeric value of the company’s Fortune 1000 ranking. A null or blank value means that the company isn’t ranked as a Fortune 1000 company."
      },
      "FourthNaics": {
        "type": "string",
        "description": "An additional NAICS code used to further classify an organization by industry. Maximum size is 6 characters."
      },
      "FourthNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding NAICS code. Maximum size is 120 characters."
      },
      "FourthSic": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "FourthSic8": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "FourthSic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "FourthSicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "GeoCodeAccuracy": {
        "type": "picklist",
        "description": "The level of accuracy of a location’s geographical coordinates compared with its physical address. Available values include: A – Non-US rooftop accuracy B – Block level C – Places the address in the correct city D – Rooftop level I – Street intersection M – Mailing address level N – Not matched P – PO BOX location S – Street level T – Census tract level Z – ZIP code level 0 (zero)– Geocode could not be assigned"
      },
      "GlobalUltimateBusinessName": {
        "type": "string",
        "description": "The primary name of the Global Ultimate, which is the highest entity within an organization’s corporate structure and may oversee branches and subsidiaries. Maximum size is 255 characters."
      },
      "GlobalUltimateDunsNumber": {
        "type": "string",
        "description": "The D-U-N-S Number of the Global Ultimate, which is the highest entity within an organization’s corporate structure and may oversee branches and subsidiaries. Maximum size is 9 characters."
      },
      "GlobalUltimateTotalEmployees": {
        "type": "double",
        "description": "The total number of employees at the Global Ultimate, which is the highest entity within an organization’s corporate structure and may oversee branches and subsidiaries. Maximum size is 15 characters."
      },
      "ImportExportAgent": {
        "type": "picklist",
        "description": "Identifies whether a business imports goods or services, exports goods or services, and/or is an agent for goods. Available values include: A—Importer/exporter/agent B—Importer/exporter C—Importer D—Importer/agent E—Exporter/agent F—Agent (keeps no inventory and does not take title goods) G—None or data not available H—Exporter"
      },
      "IncludedInSnP500": {
        "type": "string",
        "description": "A true or false value. If true, the company is listed in the S&P 500 Index. If false, the company isn’t listed in the S&P 500 Index."
      },
      "Latitude": {
        "type": "string",
        "description": "Used with longitude to specify a precise location, which is then used to assess the Geocode Accuracy. Maximum size is 11 characters."
      },
      "LegalStatus": {
        "type": "picklist",
        "description": "Identifies the legal structure of an organization."
      },
      "LocationStatus": {
        "type": "picklist",
        "description": "Identifies the organizational status of a company. Available values are Single location, Headquarters/Parent, and Branch. Available values include: 0—Single location (no other entities report to the business) 1—Headquarters/parent (branches and/or subsidiaries report to the business) 2—Branch (secondary location to a headquarters location)"
      },
      "Longitude": {
        "type": "string",
        "description": "Used with latitude to specify a precise location, which is then used to assess the Geocode Accuracy. Maximum size is 11 characters."
      },
      "MailingAddress": {
        "type": "address",
        "description": "The compound form of the mailing address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "MailingCity": {
        "type": "string",
        "description": "The city where a company has its mail delivered. Maximum size is 40 characters."
      },
      "MailingCountry": {
        "type": "string",
        "description": "The country where a company has its mail delivered. Maximum size is 40 characters."
      },
      "MailingPostalCode": {
        "type": "string",
        "description": "The postal code that a company uses on its mailing address. Maximum size is 20 characters."
      },
      "MailingState": {
        "type": "string",
        "description": "The state where a company has its mail delivered. Maximum size is 20 characters."
      },
      "MailingStreet": {
        "type": "textarea",
        "description": "The street address where a company has its mail delivered. Maximum size is 255 characters."
      },
      "MarketingPreScreen": {
        "type": "picklist",
        "description": "The probability that a company will pay with a significant delay compared to the agreed terms. The risk level is based on the standard Commercial Credit Score, and ranges from low risk to high risk. Available values include: L—Low risk of delinquency M—Moderate risk of delinquency H—High risk of delinquency Important Use this information for marketing pre-screening purposes only."
      },
      "MarketingSegmentationCluster": {
        "type": "picklist",
        "description": "Twenty-two distinct, mutually exclusive profiles, created as a result of cluster analysis of Dun & Bradstreet data for US organizations."
      },
      "MinorityOwned": {
        "type": "picklist",
        "description": "Indicates whether an organization is owned or controlled by a member of a minority group. Available values include: Y—Minority owned N—Not minority owned"
      },
      "Name": {
        "type": "string",
        "description": "The primary or registered name of a company. Maximum size is 255 characters."
      },
      "NationalId": {
        "type": "string",
        "description": "The identification number used in some countries for business registration and tax collection. Maximum size is 255 characters."
      },
      "NationalIdType": {
        "type": "picklist",
        "description": "A code value that identifies the type of national identification number used. The full list of resources can be found at the Optimizer Resources page maintained by Dun & Bradstreet. Maximum size is 5 characters."
      },
      "OutOfBusiness": {
        "type": "picklist",
        "description": "Indicates whether the company at the specified address has discontinued operations. Available values include: Y—Out of business N—Not out of business"
      },
      "OwnOrRent": {
        "type": "picklist",
        "description": "Indicates whether a company owns or rents the building it occupies. Available values include: 0—Unknown or not applicable 1—Owns 2—Rents"
      },
      "ParentOrHqBusinessName": {
        "type": "string",
        "description": "The primary name of the parent or headquarters company. Maximum size is 255 characters."
      },
      "ParentOrHqDunsNumber": {
        "type": "string",
        "description": "The D-U-N-S Number for the parent or headquarters. Maximum size is 9 characters."
      },
      "Phone": {
        "type": "phone",
        "description": "A company’s primary telephone number."
      },
      "PostalCode": {
        "type": "string",
        "description": "The postal code that corresponds to a company’s physical location. Maximum size is 20 characters."
      },
      "PremisesMeasure": {
        "type": "int",
        "description": "A numeric value for the measurement of the premises."
      },
      "PremisesMeasureReliability": {
        "type": "string",
        "description": "A descriptive accuracy of the measurement such as actual, estimated, or modeled."
      },
      "PremisesMeasureUnit": {
        "type": "string",
        "description": "A descriptive measurement unit such as acres, square meters, or square feet."
      },
      "PrimaryNaics": {
        "type": "string",
        "description": "The six-digit North American Industry Classification System (NAICS) code is the standard used by business and government to classify business establishments according to their economic activity for the purpose of collecting, analyzing, and publishing statistical data related to the US business economy. The full list of values can be found at the Optimizer Resources page maintained by Dun & Bradstreet. Maximum size is 6 characters."
      },
      "PrimaryNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on its NAICS code. Maximum size is 120 characters."
      },
      "PrimarySic": {
        "type": "string",
        "description": "The four-digit Standard Industrial Classification (SIC) code is used to categorize business establishments by industry. The full list of values can be found at the Optimizer Resources page maintained by Dun & Bradstreet. Maximum size is 4 characters."
      },
      "PrimarySic8": {
        "type": "string",
        "description": "The eight-digit Standard Industrial Classification (SIC) code is used to categorize business establishments by industry. The full list of values can be found at the Optimizer Resources page maintained by Dun & Bradstreet. Maximum size is 8 characters."
      },
      "PrimarySic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on its SIC code. The full list of values can be found at the Optimizer Resources page maintained by Dun & Bradstreet. Maximum size is 80 characters."
      },
      "PrimarySicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on its SIC code. Maximum size is 80 characters."
      },
      "PriorYearEmployees": {
        "type": "int",
        "description": "The total number of employees for the prior year."
      },
      "PriorYearRevenue": {
        "type": "double",
        "description": "The annual revenue for the prior year."
      },
      "PublicIndicator": {
        "type": "picklist",
        "description": "Indicates whether ownership of the company is public or private. Available values include: Y—Public N—Private"
      },
      "SalesTurnoverGrowthRate": {
        "type": "double",
        "description": "The increase in annual revenue from the previous value for an equivalent period expressed as a decimal percentage."
      },
      "SalesVolume": {
        "type": "double",
        "description": "The total annual sales revenue in the headquarters’ local currency. Dun & Bradstreet tracks revenue data for publicly traded companies, Global Ultimates, Domestic Ultimates, and some headquarters."
      },
      "SalesVolumeReliability": {
        "type": "picklist",
        "description": "The reliability of the SalesVolume figure. Available values include: 0—Actual number 1—Low 2—Estimated (for all records) 3—Modeled (for non-US records)"
      },
      "SecondNaics": {
        "type": "string",
        "description": "An additional NAICS code used to further classify an organization by industry. Maximum size is 6 characters."
      },
      "SecondNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding NAICS code. Maximum size is 120 characters."
      },
      "SecondSic": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "SecondSic8": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "SecondSic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "SecondSicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "SixthNaics": {
        "type": "string",
        "description": "An additional NAICS code used to further classify an organization by industry. Maximum size is 6 characters."
      },
      "SixthNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding NAICS code. Maximum size is 120 characters."
      },
      "SixthSic": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "SixthSic8": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "SixthSic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "SixthSicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "SmallBusiness": {
        "type": "picklist",
        "description": "Indicates whether the company is designated a small business as defined by the Small Business Administration of the US government. Available values include: Y—Small business site N—Not small business site"
      },
      "State": {
        "type": "string",
        "description": "The state where a company is physically located. Maximum size is 20 characters."
      },
      "StockExchange": {
        "type": "string",
        "description": "The corresponding exchange for a company’s stock symbol. For example: NASDAQ or NYSE. Maximum size is 16 characters."
      },
      "StockSymbol": {
        "type": "string",
        "description": "The abbreviation used to identify publicly traded shares of a particular stock. Maximum size is 6 characters."
      },
      "Street": {
        "type": "textarea",
        "description": "The street address where a company is physically located. Maximum size is 255 characters."
      },
      "Subsidiary": {
        "type": "picklist",
        "description": "Indicates whether a company is more than 50 percent owned by another organization. Available values include: 0—Not subsidiary of another organization 3—Subsidiary of another organization"
      },
      "ThirdNaics": {
        "type": "string",
        "description": "An additional NAICS code used to further classify an organization by industry. Maximum size is 6 characters."
      },
      "ThirdNaicsDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding NAICS code. Maximum size is 120 characters."
      },
      "ThirdSic": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "ThirdSic8": {
        "type": "string",
        "description": "An additional SIC code used to further classify an organization by industry. Maximum size is 8 characters."
      },
      "ThirdSic8Desc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "ThirdSicDesc": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on the corresponding SIC code. Maximum size is 80 characters."
      },
      "TradeStyle1": {
        "type": "string",
        "description": "A name, different from its legal name, that an organization may use for conducting business. Similar to “Doing business as” or “DBA”. Maximum size is 255 characters."
      },
      "TradeStyle2": {
        "type": "string",
        "description": "An additional tradestyle used by the organization. Maximum size is 255 characters."
      },
      "TradeStyle3": {
        "type": "string",
        "description": "An additional tradestyle used by the organization. Maximum size is 255 characters."
      },
      "TradeStyle4": {
        "type": "string",
        "description": "An additional tradestyle used by the organization. Maximum size is 255 characters."
      },
      "TradeStyle5": {
        "type": "string",
        "description": "An additional tradestyle used by the organization. Maximum size is 255 characters."
      },
      "URL": {
        "type": "url",
        "description": "An organization’s primary website address. Maximum size is 104 characters."
      },
      "UsTaxId": {
        "type": "string",
        "description": "The identification number for the company used by the Internal Revenue Service (IRS) in the administration of tax laws. Also referred to as Federal Taxpayer Identification Number. Maximum size is 9 characters."
      },
      "WomenOwned": {
        "type": "picklist",
        "description": "Indicates whether a company is more than 50 percent owned or controlled by a woman. Available values include: Y—Owned by a woman N—Not owned by a woman, or unknown"
      },
      "YearStarted": {
        "type": "string",
        "description": "The year the company was established or the year when current ownership or management assumed control of the company. Maximum size is 4 characters."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_dandbcompany.htm"
  }
}