{
  "DataEncryptionKey": {
    "name": "DataEncryptionKey",
    "description": "The DataEncryptionKey object is part of the Bring Your Own Key (BYOK) feature, which allows users to upload a data encryption key (DEK) using a public key generated by the Salesforce Shield Key Management Service (KMS). Customers create their own DEKs and upload them to Salesforce. Users access this entity via the API to list DEK keys for auditing purposes. They can also programmatically use this object to create the certificate and to upload key material.",
    "properties": {
      "CreatedBy": {
        "type": "string",
        "description": "The email address of the user who created the DEK. For example, user@example.com."
      },
      "DataEncryptionKeyCertName": {
        "type": "string",
        "description": "The name of the certificate whose public key is used to encrypt the DEK during a remote key callout. When you want to create a BYOK-compatible certificate, use this property in a call to create() to name the certificate. You need to know the name to retrieve the certificate later. Specify only the file name. Salesforce will add the .crt extension when it creates the file."
      },
      "Description": {
        "type": "string",
        "description": "The user-defined description of the root key."
      },
      "DoesUseKeyDerivation": {
        "type": "boolean",
        "description": "Indicates whether the DEK is intended to be used as part of a derived key (true) or not (false). See Components Involved in Deriving Keys for information on derived keys."
      },
      "LastModifiedBy": {
        "type": "string",
        "description": "The email address of the user who most recently modified the key. For example, user@example.com."
      },
      "RootKeyIdentifier": {
        "type": "string",
        "description": "The unique key identifier assigned by Salesforce to the root key used to create the DEK."
      },
      "RootKeyKmsIdentifier": {
        "type": "string",
        "description": "The unique key identifier from the external KMS, such as an AWS Amazon Resource Name (ARN). For example, arn:aws:kms:us-west-2:123456789000:key/123ab456-7cd8-9012-3e4f-5gh678i901j2"
      },
      "SecretValue": {
        "type": "textarea",
        "description": "The encrypted 256-bit secret value encoded in base64."
      },
      "SessionToken": {
        "type": "textarea",
        "description": "Contains the token for the session that was active when the DEK was last wrapped. If the session is inactive, a new certificate is required in order to transmit the DEK."
      },
      "Source": {
        "type": "string",
        "description": "The source of the encryption key material. Values are: AWS—A tenant secret or DEK fetched from the Amazon Key Management Service DEKs with a Source value of AWS are listed as Fetched on the Key Management page in Setup. Salesforce—A Salesforce-generated DEK."
      },
      "Status": {
        "type": "string",
        "description": "The status of the key."
      },
      "Type": {
        "type": "string",
        "description": "The type of DEK. This value appears in the Type picklist: Search Index—search index files. For Hyperforce orgs on API version 63.0 and later, create secrets of type SearchIndex using the DataEncryptionKey object. For Hyperforce orgs on API versions 62.0 and earlier, and for all non-Hyperforce orgs, create secrets of type SearchIndex using the TenantSecret object. You also specify a type of SearchIndex when you are creating a BYOK-compatible certificate using the DataEncryptionKey object."
      },
      "Version": {
        "type": "int",
        "description": "The version number of this secret. The version number is unique within your org."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_dataencryptionkey.htm",
    "accessRules": "Shield, Salesforce Platform Encryption",
    "clouds": [
      "Core Salesforce",
      "Shield"
    ]
  }
}