{
  "DebitMemo": {
    "name": "DebitMemo",
    "description": "Represents the document used to charge an additional amount to a buyer by a seller. An invoice is generated for the debit memo in the next invoice run.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The account that's related to the debit memo record."
      },
      "CorpCrcyCnvTotChargeAmt": {
        "type": "double",
        "description": "The total charge amount of the debit memo in corporate currency."
      },
      "CorporateCurrencyCvsnDate": {
        "type": "date",
        "description": "The exchange date that's used to convert the debit memo amounts into corporate currency."
      },
      "CorporateCurrencyCvsnRate": {
        "type": "double",
        "description": "The exchange rate that's used to convert the debit memo amounts into corporate currency."
      },
      "CorporateCurrencyIsoCode": {
        "type": "string",
        "description": "The currency ISO code of the corporate currency."
      },
      "Description": {
        "type": "string",
        "description": "The description of the debit memo."
      },
      "DocumentNumber": {
        "type": "string",
        "description": "An auto-generated number assigned to the debit memo record."
      },
      "InvoiceGenerationStatus": {
        "type": "picklist",
        "description": "The status of invoice generation for the debit memo."
      },
      "InvoiceMatchingRefKeyId": {
        "type": "reference",
        "description": "Indicates the product or Asset ID. This key, combined with the account, currency, and legal entity, is used to find a matching invoice. The invoice lines converted from debit memo lines are then added to this matched invoice."
      },
      "InvoiceMatchingRefName": {
        "type": "string",
        "description": "Indicates the product's name. This text, combined with the account, currency, and legal entity, is used to find a matching invoice. The invoice lines converted from debit memo lines are then added to this matched invoice."
      },
      "IsManuallyProcessed": {
        "type": "boolean",
        "description": "Indicates whether the debit memo lines of the debit memo are converted to invoice lines manually (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a debit memo address group record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a debit memo address record. If this value is null, it’s possible that the user only accessed the debit memo address record or a related list view (LastReferencedDate), but not viewed the debit memo address record itself."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "The legal entity record that's related to the debit memo."
      },
      "NextBillingDate": {
        "type": "date",
        "description": "The date indicates when the next billing period begins for the debit memo. This date is used to determine when invoices are created for the debit memos. When the invoice scheduler or API evaluates debit memos to generate invoices, those with a next billing date on or before the user-specified target date are included in the invoice batch run."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the owner of this object."
      },
      "PostedDate": {
        "type": "date",
        "description": "The date when the debit memo is posted."
      },
      "ReasonCode": {
        "type": "picklist",
        "description": "Specifies a dynamic picklist of reasons for generating debit memos."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the debit memo."
      },
      "TotalChargeAmount": {
        "type": "currency",
        "description": "The sum of the charge amount field values of the debit memo lines."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_debitmemo.htm"
  }
}