{
  "DeliveryEstimationSetup": {
    "name": "DeliveryEstimationSetup",
    "description": "Shows the configuration options for the commerce delivery service offered through a web store or sales channel. Includes settings such as delivery location group, channel, fulfillment types, and default fulfillment time.",
    "properties": {
      "ChannelId": {
        "type": "reference",
        "description": "ID for the web store or sales channel associated with the delivery estimation configuration."
      },
      "DefaultBusinessHoursId": {
        "type": "reference",
        "description": "ID for the default business hours."
      },
      "DefaultPickupTime": {
        "type": "time",
        "description": "Default pickup time."
      },
      "DefaultProcessingTime": {
        "type": "int",
        "description": "Default processing time."
      },
      "DefaultProcessingTimeUnit": {
        "type": "picklist",
        "description": "Default processing time unit. Possible values are: Hours Days Weeks"
      },
      "ExternalReference": {
        "type": "string",
        "description": "Unique code, reference, or identifier for the delivery estimation configuration record used by external systems. Can be the name of the web store or sales channel associated with the configuration to ensure a unique ID within the organization."
      },
      "isEnabled": {
        "type": "boolean",
        "description": "Indicates whether the given delivery estimation configuration is active."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the record was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastSyncedById": {
        "type": "reference",
        "description": "User ID of who performed the last sync for this delivery estimation configuration. This field is available in API version 62.0 and later."
      },
      "LastSyncedDate": {
        "type": "dateTime",
        "description": "Date the delivery estimation configuration was last synced. This field is available in API version 62.0 and later."
      },
      "LastSyncedMessage": {
        "type": "textarea",
        "description": "Message that occurred during the last sync. This field is available in API version 62.0 and later."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Last time the delivery estimation configuration was viewed."
      },
      "LocationGroupId": {
        "type": "reference",
        "description": "Represents a group of Omnichannel Inventory locations."
      },
      "Name": {
        "type": "string",
        "description": "Name of the delivery estimation setup configuration."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who currently owns this DeliveryEstimationSetup object. Default value is the user logged in to the API to perform the create."
      },
      "ServiceRegion": {
        "type": "string",
        "description": "An org's commerce delivery service provisioning region (North America, Europe, or Asia) that's set when Delivery Estimation is enabled in the Order Management app. It can't be changed. If the field is empty, provisioning hasn't occurred yet. Available in API version 63.0 and later."
      },
      "SyncStatus": {
        "type": "picklist",
        "description": "Sync status of the delivery estimation setup configuration."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_deliveryestimationsetup.htm",
    "accessRules": "The DeliveryEstimationSetup object is available only if the B2B Commerce or D2C Commerce license is enabled.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}