{
  "DeployRequest": {
    "name": "DeployRequest",
    "description": "Uses file representations of metadata components to create, update, or delete those components in a Salesforce org. This object is available in API version 49.0 and later.",
    "properties": {
      "AllowMissingFiles": {
        "type": "boolean",
        "description": "If files that are specified in package.xml are not in the .zip file, specifies whether a deployment can still succeed (true) or not (false).Do not set this argument to true for deployment to production orgs."
      },
      "AutoUpdatePackage": {
        "type": "boolean",
        "description": "If a file is in the .zip file but not specified in package.xml, specifies whether the file is automatically added to the package (true) or not (false). A retrieve() is issued with the updated package.xml that includes the .zip file. Do not set this argument to true for deployment to production orgs."
      },
      "CanceledById": {
        "type": "string",
        "description": "The ID of the user who canceled the deployment. This is a relationship field."
      },
      "ChangeSetName": {
        "type": "string",
        "description": "Specifies the name of the change set for the deployment."
      },
      "CheckOnly": {
        "type": "boolean",
        "description": "Indicates whether this deployment is being used to check the validity of the deployed files without making any changes in the organization (true) or not (false). A check-only deployment does not deploy any components or change the organization in any way."
      },
      "CompletedDate": {
        "type": "dateTime",
        "description": "Timestamp for when the deployment process ended."
      },
      "DeployTestResults": {
        "type": "string",
        "description": "Specifies the deployment test result."
      },
      "ErrorMessage": {
        "type": "string",
        "description": "Message corresponding to the values in the ErrorStatusCode field, if any."
      },
      "ErrorStatusCode": {
        "type": "string",
        "description": "If an error occurred during the deploy() call, a status code is returned, and the message corresponding to the status code is returned in the ErrorMessagefield.For a description of each StatusCode value, see “StatusCode” in the SOAP API Developer Guide."
      },
      "IgnoreWarnings": {
        "type": "boolean",
        "description": "Specifies whether a deployment should continue even if the deployment generates warnings (true) or not (false).Do not set this argument to true for deployments to production organizations."
      },
      "NumberComponentErrors": {
        "type": "number",
        "description": "The number of components that generated errors during this deployment."
      },
      "NumberComponentsDeployed": {
        "type": "number",
        "description": "The number of components deployed in the deployment process. Use this value with the NumberComponentsTotal value to get an estimate of the deployment’s progress."
      },
      "NumberComponentsTotal": {
        "type": "number",
        "description": "The total number of components in the deployment. Use this value with the NumberComponentsDeployed value to get an estimate of the deployment’s progress."
      },
      "NumberTestErrors": {
        "type": "number",
        "description": "The number of Apex tests that have generated errors during this deployment."
      },
      "NumberTestsCompleted": {
        "type": "number",
        "description": "The number of completed Apex tests for this deployment. Use this value with the NumberTestsTotal value to get an estimate of the deployment’s test progress."
      },
      "NumberTestsTotal": {
        "type": "number",
        "description": "The total number of Apex tests for this deployment. Use this value with the NumberTestsCompleted value to get an estimate of the deployment’s test progress. The value in this field is not accurate until the deployment has started running tests for the components being deployed."
      },
      "PurgeOnDelete": {
        "type": "boolean",
        "description": "Indicates whether to purge on delete (true) or not (false)."
      },
      "RollbackOnError": {
        "type": "boolean",
        "description": "Indicates whether any failure causes a complete rollback (true) or not (false). If false, whatever set of actions can be performed without errors are performed, and errors are returned for the remaining actions."
      },
      "RunTestsEnabled": {
        "type": "boolean",
        "description": "Indicates whether Apex tests were run as part of this deployment (true) or not (false). Tests are either automatically run as part of a deployment or can be set to run in DeployOptions for the deploy() call. For information on when tests are automatically run, see Running Tests in a Deployment."
      },
      "SinglePackage": {
        "type": "boolean",
        "description": "Indicates whether to deploy as a single package (true) or not (false)"
      },
      "StartDate": {
        "type": "dateTime",
        "description": "Timestamp for when the deployment process began."
      },
      "StateDetail": {
        "type": "string",
        "description": "Indicates which component is being deployed or which Apex test class is running."
      },
      "Status": {
        "type": "string",
        "description": "The current state of the deployment. Possible values are: Canceled Canceling Failed InProgress Pending Succeeded SucceededPartial"
      },
      "TestLevel": {
        "type": "string",
        "description": "Indicates which tests to run. Possible values are: NoTestRun RunAllTestsInOrg RunLocalTests RunSpecifiedTests"
      },
      "Type": {
        "type": "string",
        "description": "The type of deployment to perform. Possible values are: Api (default) Changeset"
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_deployrequest.htm",
    "accessRules": "Your client application must be logged in with the Modify Metadata Through Metadata API Functions OR Modify All Data permission.",
    "clouds": [
      "Tooling API"
    ]
  }
}