{
  "DisputeItem": {
    "name": "DisputeItem",
    "description": "Represents a transaction that’s being disputed.",
    "properties": {
      "AcquirerReferenceNumber": {
        "type": "string",
        "description": "A unique identifier assigned to a transaction by the payment network if the transaction was done through a payment gateway. Available in version 61.0 and later."
      },
      "ApprovedProvisionalCredit": {
        "type": "currency",
        "description": "The provisional credit amount that's approved for the dispute. Available in version 60.0 and later."
      },
      "CardBrand": {
        "type": "picklist",
        "description": "Specifies the brand or network associated with the card that was used in the disputed transaction."
      },
      "CardLastFourDigit": {
        "type": "string",
        "description": "The last four digits of the credit or debit card number that's associated with this transaction. These digits are commonly used to verify the transaction and identify the cardholder. Available in version 60.0 and later."
      },
      "CardSixDigitBin": {
        "type": "string",
        "description": "The first six digits of the credit or debit card number that's associated with this transaction. These digits are used to identify the card issuer. Available in version 60.0 and later."
      },
      "CardType": {
        "type": "picklist",
        "description": "Specifies the type of card used in the transaction. Available in version 61.0 and later."
      },
      "CaseClaimIdentifier": {
        "type": "string",
        "description": "A unique identifier of the claim associated with an arbitration or compliance case . Available in version 62.0 and later."
      },
      "ClaimIdentifier": {
        "type": "string",
        "description": "A unique identifier of the claim associated with the chargeback. Available in version 61.0 and later."
      },
      "ClearingMerchantName": {
        "type": "string",
        "description": "The name of the merchant or business that accepted the payment through a card transaction. Available in version 61.0 and later."
      },
      "ClearingTrxnAmountLocal": {
        "type": "double",
        "description": "The cleared amount of the disputed transaction in the local currency.. Available in version 62.0 and later."
      },
      "ClearingTrxnAmountLocalCrcy": {
        "type": "string",
        "description": "The cleared amount of the disputed transaction in the local currency. Available in version 62.0 and later."
      },
      "DisputeId": {
        "type": "reference",
        "description": "The unique identifier of the transaction."
      },
      "DisputeReasonId": {
        "type": "reference",
        "description": "The Dispute Reason associated with the dispute item. Available in version 61.0 and later."
      },
      "DisputedAmount": {
        "type": "currency",
        "description": "The amount in the transaction that's under question or dispute."
      },
      "EnrichmentProvider": {
        "type": "picklist",
        "description": "Specifies the name of the enrichment provider that provides additional information associated with the transaction, such as merchant name, address, description, and URL. Available in version 60.0 and later."
      },
      "FundFlowDirection": {
        "type": "picklist",
        "description": "Specifies the direction of funds in the transaction that's being disputed. Available in version 60.0 and later."
      },
      "IsCardPresent": {
        "type": "boolean",
        "description": "Indicates whether the payment card was present with the cardholder (true) or not (false) during the transaction. Available in version 61.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "MerchantAddress": {
        "type": "address",
        "description": "The address of the merchant associated with the transaction. Available in version 60.0 and later."
      },
      "MerchantCategory": {
        "type": "string",
        "description": "The category associated with the merchant based on the type of products or services the merchant provides. Available in version 60.0 and later."
      },
      "MerchantDescription": {
        "type": "string",
        "description": "The description of the merchant associated with the transaction. Available in version 60.0 and later."
      },
      "MerchantName": {
        "type": "string",
        "description": "The name of the merchant associated with the transaction. Available in version 60.0 and later."
      },
      "MerchantUrl": {
        "type": "url",
        "description": "The website URL of the merchant associated with the transaction. Available in version 60.0 and later."
      },
      "MerchantLogoUrl": {
        "type": "url",
        "description": "The logo URL of the merchant associated with the transaction. Available in version 60.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "Name of the DisputeItem record."
      },
      "PaymentNetwork": {
        "type": "picklist",
        "description": "Specifies the payment network that faciliates the exchange of funds between parties involved. Available in version 61.0 and later."
      },
      "ProvisionalCreditApproverId": {
        "type": "reference",
        "description": "The User associated with the Dispute. The user is the approver of provisional credit amount. Available in version 60.0 and later."
      },
      "ProvisionalCreditDate": {
        "type": "date",
        "description": "The date when the provisional credit amount was credited. Available in version 60.0 and later."
      },
      "ProvisionalCreditStatus": {
        "type": "picklist",
        "description": "Specifies the status of the provisional credit amount. Available in version 60.0 and later."
      },
      "ReceiverBin": {
        "type": "string",
        "description": "The unique identifier of the entity who filed an arbitration or compliance case. Available in version 62.0 and later."
      },
      "SenderBin": {
        "type": "string",
        "description": "The unique identifier of the entity against which an arbitration or compliance case is filed. Available in version 62.0 and later."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the disputed transaction."
      },
      "TransactionAmount": {
        "type": "currency",
        "description": "The total amount involved in the transaction."
      },
      "TransactionCode": {
        "type": "string",
        "description": "The unique code that identifies the type of transaction."
      },
      "TransactionCurrencyCode": {
        "type": "string",
        "description": "The unique code associated with the currency used in this transaction."
      },
      "TransactionDate": {
        "type": "date",
        "description": "The date of the transaction."
      },
      "TransactionDescription": {
        "type": "textarea",
        "description": "The description of the transaction."
      },
      "TransactionIdentifier": {
        "type": "string",
        "description": "The unique identifier of the transaction."
      },
      "TransactionsApiSearchResult": {
        "type": "string",
        "description": "The search result of the transactions API. Available in version 61.0 and later."
      },
      "TrxnApiAuthorizationResult": {
        "type": "textarea",
        "description": "The authorization information obtained from the transactions API. Available in version 61.0 and later."
      },
      "TrxnApiClrAndStlResult": {
        "type": "textarea",
        "description": "The clearing and settlement information obtained from the transactions API. Available in version 61.0 and later."
      },
      "TrxnAuthorizationIdentifier": {
        "type": "string",
        "description": "The unique identifier generated during the authorization phase of a transaction to verify the availability of sufficient funds in the cardholder's account to proceed with the transaction. Available in version 61.0 and later."
      },
      "TrxnClearingIdentifier": {
        "type": "string",
        "description": "The unique identifier assigned to a transaction during clearing and settlement process to track the transaction's progress and facilitate funds transfer between parties. Available in version 61.0 and later."
      },
      "ValidationOutcome": {
        "type": "picklist",
        "description": "Specifies the outcome of the validation rules run on the disputed transaction."
      },
      "ValidationOutcomeReason": {
        "type": "string",
        "description": "The reason for the transaction's validation outcome. Available in version 60.0 and later."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_disputeitem.htm",
    "clouds": [
      "Financial Services Cloud"
    ]
  }
}