{
  "AcadTermEnrlPolicyRuleLog": {
    "name": "AcadTermEnrlPolicyRuleLog",
    "description": "Represents the log of the policy rule calculation runs for an academic term enrollment.",
    "properties": {
      "AcademicTermEnrollmentId": {
        "type": "reference",
        "description": "The Academic Term Enrollment associated with the Academic Term Enrollment Policy Rule Log."
      },
      "AcademicTermId": {
        "type": "reference",
        "description": "The Academic Term associated with the Academic Term Enrollment Policy Rule Log."
      },
      "CalculatedDate": {
        "type": "dateTime",
        "description": "The date on which the result is calculated."
      },
      "CalculatedNumericResult": {
        "type": "double",
        "description": "The numeric result that's calculated using the Policy Rule."
      },
      "CalculatedTextResult": {
        "type": "string",
        "description": "The text result that's calculated using the Policy Rule."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "The ISO code for the currency associated with the Academic Term Enrollment Policy Rule Log."
      },
      "JobIdentifier": {
        "type": "string",
        "description": "The identifier for the job that calculates the result."
      },
      "JobType": {
        "type": "picklist",
        "description": "Specifies the type of job that's run using the policy rule."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "Name": {
        "type": "string",
        "description": "The name of the Academic Term Enrollment Policy Rule Log."
      },
      "PolicyRuleId": {
        "type": "reference",
        "description": "The Policy Rule expression set associated with the Academic Term Enrollment Policy Rule Log."
      },
      "PublishedDate": {
        "type": "dateTime",
        "description": "The date on which the result is published."
      },
      "Scope": {
        "type": "picklist",
        "description": "Specifies the scope of the Academic Term Enrollment Policy Rule Log."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies whether the result is calculated or published."
      }
    },
    "module": "Education Cloud"
  }
}