{
  "AcademicTermRegstrnTimeline": {
    "name": "AcademicTermRegstrnTimeline",
    "description": "Represents the registration time window for an academic term.",
    "properties": {
      "AcademicTermId": {
        "type": "reference",
        "description": "The academic term associated with the academic term registration timeline."
      },
      "Category": {
        "type": "picklist",
        "description": "Specifies the category of the academic term related to the academic term registration timeline."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "The ISO code for the currency associated with the academic term registration timeline."
      },
      "Description": {
        "type": "string",
        "description": "The description of the academic term registration timeline."
      },
      "EligibilityCriteriaId": {
        "type": "reference",
        "description": "TThe Eligibility Criteria expression set associated with the Academic Term Registration Timeline."
      },
      "IsDefault": {
        "type": "boolean",
        "description": "Indicates whether the academic term registration timeline is the default for the related academic term (true) or not (false)."
      },
      "IsPublished": {
        "type": "boolean",
        "description": "Indicates whether the academic term registration timeline is published (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "Name": {
        "type": "string",
        "description": "The name of the academic term registration timeline."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The user who owns this record."
      },
      "RegistrationCloseDate": {
        "type": "dateTime",
        "description": "The date and time when registration closes."
      },
      "RegistrationOpenDate": {
        "type": "dateTime",
        "description": "The date and time when registration opens."
      }
    },
    "module": "Education Cloud"
  }
}