{
  "AccountProductPeriodForecast": {
    "name": "AccountProductPeriodForecast",
    "description": "Represents the quantity and revenue information of opportunities, sales agreements, orders, and resultant forecasted quantities for a product in a particular time period of the forecast rolling period. Other than the fields AdjustedForecastQuantity and AdjustedForecastRevenue, no other fields of this object can be updated.",
    "properties": {
      "AccForecastPeriodMetricId": {
        "type": "reference",
        "description": "ID of each account forecast period metric used in forecast formula calculations."
      },
      "AccountProductForecastId": {
        "type": "reference",
        "description": "ID of a specific product for which forecast is calculated for this period."
      },
      "AdjustedForecastedQuantity": {
        "type": "double",
        "description": "Forecasted quantity which is either auto-calculated or overwritten by a user with edit access. The user-defined value is retained along with the auto-calculated value."
      },
      "AdjustedForecastedRevenue": {
        "type": "double",
        "description": "Forecasted revenue which is either auto-calculated or overwritten by a user with edit access. The user-defined value is retained along with the auto-calculated value."
      },
      "AdjustmentComments": {
        "type": "textarea",
        "description": "User-defined notes stating the reason for a manual adjustment."
      },
      "CurrentOrdersQuantity": {
        "type": "double",
        "description": "Calculated quantity of all active orders for this account in the current period."
      },
      "CurrentOrdersRevenue": {
        "type": "double",
        "description": "Calculated revenue of all active orders for this account in the current period."
      },
      "ForecastedQuantity": {
        "type": "double",
        "description": "Auto-calculated quantity based on forecast formula and configurations."
      },
      "ForecastedRevenue": {
        "type": "double",
        "description": "Auto-calculated revenue based on forecast formula and configurations."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicator of whether the record is part of the forecast display period or not."
      },
      "LastCalculatedDate": {
        "type": "dateTime",
        "description": "Date when the value was last calculated, either due to rolling over or through recalculation of forecast."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which this record was referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which this record was viewed."
      },
      "Name": {
        "type": "string",
        "description": "Name of the record."
      },
      "OpportunityQuantity": {
        "type": "double",
        "description": "Calculated quantity of all active opportunities for this account in the current period."
      },
      "OpportunityRevenue": {
        "type": "double",
        "description": "Calculated revenue of all active opportunities for this account in the current period."
      },
      "PastOrdersQuantity": {
        "type": "double",
        "description": "Calculated quantity of all active orders for this account in the last forecast period."
      },
      "PastOrdersRevenue": {
        "type": "double",
        "description": "Calculated revenue of all active orders for this account in the last forecast period."
      },
      "PeriodId": {
        "type": "reference",
        "description": "ID of the period as derived from the Period entity based on the fiscal year."
      },
      "SalesAgreementPlannedQuantity": {
        "type": "double",
        "description": "Calculated quantity for all active sales agreements for this account in the current period. This is calculated on a pro-rata basis if the sales agreement period does not coincide with the forecast display period."
      },
      "SalesAgreementPlannedRevenue": {
        "type": "double",
        "description": "Calculated revenue for all active sales agreements for this account in the current period. This is calculated on a pro-rata basis if the sales agreement period does not coincide with the forecast display period."
      },
      "StartDate": {
        "type": "date",
        "description": "Date on which the period starts."
      }
    },
    "module": "Manufacturing Cloud"
  }
}