{
  "AccountingModelConfig": {
    "name": "AccountingModelConfig",
    "description": "Represents settings for the accounting models used with Accounting Subledger. Accounting models are based on accounting sets, which include details about what accounting data is used and how.",
    "properties": {
      "AccountingType": {
        "type": "picklist",
        "description": "Specifies the type of accounting."
      },
      "DefaultAccrualAccountCode": {
        "type": "string",
        "description": "The name of the default accrual account."
      },
      "DefaultWriteOffAccountCode": {
        "type": "string",
        "description": "The name of the account for payments that are written off."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The name of the person who created the accounting set."
      },
      "EarliestCreatedDate": {
        "type": "dateTime",
        "description": "Source records with a primary record Created Date that is older than this date are not considered part of this mapping set."
      },
      "ExpectedCashFlowGrouping": {
        "type": "picklist",
        "description": "Determines how transaction journal records are generated for expected revenue scenarios."
      },
      "FullName": {
        "type": "string",
        "description": "The unique name for the accounting set record."
      },
      "InternalMappingDetails": {
        "type": "textarea",
        "description": "JSON that is used to transmit financial data to Accounting Subledger for processing."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Determines whether Accounting Subledger processes this accounting set (true) or not (false)."
      },
      "IsUsed": {
        "type": "boolean",
        "description": "Determines whether the accounting set was used or activated at least once. If it was, you can't select another object for the object model, or change its number of objects."
      },
      "Language": {
        "type": "picklist",
        "description": "Specifies the language used."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The standard name of the accounting set on the UI."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix of the accounting set."
      },
      "PaidCashFlowGrouping": {
        "type": "picklist",
        "description": "Specifies how journal entries are generated for expense scenarios."
      },
      "RecordTypeFilter": {
        "type": "textarea",
        "description": "Information is generated only for records whose primary record’s record type is listed. If no record types are defined, all source records are considered eligible. The value is case-sensitive, and a semicolon-delimited API name."
      },
      "RunOrder": {
        "type": "int",
        "description": "Specifies the sequence in which the accounting set is processed if there is more than one. The Accounting Subledger job processes the accounting set with the lower number first. For example, run order 1 is processed before run order 2."
      }
    },
    "module": "Public Sector Cloud"
  }
}