{
  "AccountPlanObjMeasCalcDef": {
    "name": "AccountPlanObjMeasCalcDef",
    "description": "Represents the definition of a target object, rollup field, and logic for calculating the current value of a sales account plan objective measure.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "A summary of the calculation definition that’s visible to users when they select the definition for an account plan objective measure."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. The name: must be 40 characters or fewer must begin with a letter can contain only underscores and alphanumeric characters can’t include spaces can’t end with an underscore can’t contain 2 consecutive underscores"
      },
      "Language": {
        "type": "picklist",
        "description": "The combined language and locale ISO code, which controls the language of the calculation definition."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label for this calculation definition. This display value is the internal label that doesn't get translated."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of these values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that aren’t Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "RollupType": {
        "type": "picklist",
        "description": "The method for calculating the account plan objective measure’s current value from records that match the calculation definition and any optional conditions."
      },
      "Status": {
        "type": "picklist",
        "description": "Possible values are: Active Draft Inactive"
      },
      "TargetField": {
        "type": "picklist",
        "description": "The field on TargetObject to use for calculating the account plan objective measure’s current value. Rollup fields on the Campaign, Case, Contact, or Opportunity object are supported."
      },
      "TargetObject": {
        "type": "picklist",
        "description": "The object to use for calculating the account plan objective measure’s current value."
      },
      "ValueType": {
        "type": "picklist",
        "description": "The data type for calculating the account plan objective measure’s current value."
      }
    },
    "module": "Core Salesforce"
  }
}