{
  "AccountPlanObjectiveMeasure": {
    "name": "AccountPlanObjectiveMeasure",
    "description": "Represents the performance of target metrics for an objective associated with the account plan.",
    "properties": {
      "AccountPlanObjMeasCalcDefId": {
        "type": "reference",
        "description": "The account plan objective calculation definition associated with the measure."
      },
      "AccountPlanObjectiveId": {
        "type": "reference",
        "description": "The account plan objective associated with the measure."
      },
      "CurrentCurrencyValue": {
        "type": "currency",
        "description": "The current value in currency for a measure associated with the account plan objective."
      },
      "CurrentNumberValue": {
        "type": "double",
        "description": "The current numerical value for a measure associated with the account plan objective."
      },
      "CurrentPercentValue": {
        "type": "percent",
        "description": "The current value in percentage for a measure associated with the account plan objective."
      },
      "CurrentValue": {
        "type": "string",
        "description": "The current value for a measure associated with the account plan objective."
      },
      "CurrentValueTimestamp": {
        "type": "dateTime",
        "description": "The date and time that the current value was last updated. This field is available in API version 63.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the account plan objective measure."
      },
      "TargetCurrencyValue": {
        "type": "currency",
        "description": "The target value in currency for a measure associated with the account plan objective."
      },
      "TargetNumberValue": {
        "type": "double",
        "description": "The target numerical value for a measure associated with the account plan objective."
      },
      "TargetPercentValue": {
        "type": "percent",
        "description": "The target value in percentage for a measure associated with the account plan objective."
      },
      "TargetValue": {
        "type": "string",
        "description": "The target value for a measure associated with the account plan objective."
      },
      "ValueType": {
        "type": "picklist",
        "description": "Specifies the type of value that's measured."
      }
    },
    "module": "Core Salesforce"
  }
}