{
  "AccountPlan": {
    "name": "AccountPlan",
    "description": "Represents customer information with measurable objectives and executable steps to proactively manage and grow customer relationships.",
    "properties": {
      "AccountChallenges": {
        "type": "textarea",
        "description": "The key obstacles to the growth of the account."
      },
      "AccountCmptvWeaknesses": {
        "type": "textarea",
        "description": "The shortcomings that hinder the account’s ability to outperform competitors in the market."
      },
      "AccountCompetitiveStrengths": {
        "type": "textarea",
        "description": "The abilities of the account to outperform their competitors in the market."
      },
      "AccountCompetitors": {
        "type": "textarea",
        "description": "The businesses or companies that offer similar products or services and compete for the same target market as the account."
      },
      "AccountId": {
        "type": "reference",
        "description": "The Account record."
      },
      "AccountIndustryTrends": {
        "type": "textarea",
        "description": "The shifts in the pattern of the industry that are specific to the account."
      },
      "AccountInternalRiskRating": {
        "type": "picklist",
        "description": "The rating that’s assigned to assess the risk level of the account. To access this field, you must have an FSC Sales or a Financial Services Cloud Extension license."
      },
      "AccountPrfmIndicators": {
        "type": "textarea",
        "description": "The key performance indicators used by the account to measure the success and effectiveness of a product or service."
      },
      "AccountStrategicPriorities": {
        "type": "textarea",
        "description": "The key priorities of the account."
      },
      "AccountVision": {
        "type": "textarea",
        "description": "The long-term value statement of the account."
      },
      "CallingStrategy": {
        "type": "textarea",
        "description": "How frequently the relationship team meets with the account. To access this field, you must have an FSC Sales or a Financial Services Cloud Extension license."
      },
      "CallingStrategyNotes": {
        "type": "textarea",
        "description": "The outline of the format and organization of account meetings. To access this field, you must have an FSC Sales or a Financial Services Cloud Extension license."
      },
      "EndDate": {
        "type": "date",
        "description": "The end date of the account plan."
      },
      "FlexCard": {
        "type": "string",
        "description": "The Omnistudio FlexCard. To access this field, you must have an FSC Sales or a Financial Services Cloud Extension license."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly. For example, accessed through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate isn’t null, the user accessed this record or list view indirectly."
      },
      "Name": {
        "type": "string",
        "description": "The name of the account plan."
      },
      "Notes": {
        "type": "textarea",
        "description": "The notes or observations for the account plan."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the account plan."
      },
      "RelationshipOpportunities": {
        "type": "textarea",
        "description": "The list of sales or potential deal opportunities in the relationship with the account."
      },
      "RelationshipStrengths": {
        "type": "textarea",
        "description": "The strengths in the relationship with the account."
      },
      "RelationshipSummary": {
        "type": "textarea",
        "description": "A concise overview of the relationship dynamics with the account. To access this field, you must have an FSC Sales or a Financial Services Cloud Extension license."
      },
      "RelationshipThreats": {
        "type": "textarea",
        "description": "The possible concerns in the relationship with the account."
      },
      "RelationshipWeaknesses": {
        "type": "textarea",
        "description": "The shortcomings in the relationship with the account."
      },
      "StartDate": {
        "type": "date",
        "description": "The start date of the account plan."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the account plan."
      }
    },
    "module": "Core Salesforce"
  }
}