{
  "Account": {
    "name": "Account",
    "description": "Standard and custom fields extend the standard Account object for use in Consumer Goods Cloud to represent an individual account, which is an company or person involved with your business, such as customers, competitors, and partners.",
    "properties": {
      "AccountNumber": {
        "type": "string",
        "description": "Account number assigned to the account (not the unique, auto-generated ID assigned during creation). Can have up to 40 characters."
      },
      "AccountSource": {
        "type": "picklist",
        "description": "Source of the account record:"
      },
      "AnnualRevenue": {
        "type": "currency",
        "description": "Estimated annual revenue of the account."
      },
      "BillingAddress": {
        "type": "address",
        "description": "Compound form of the billing address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "BillingCity": {
        "type": "string",
        "description": "Details for the billing address of the account. Can have up to 40 characters."
      },
      "BillingCountry": {
        "type": "string",
        "description": "Details for the billing address of the account. Can have up to 80 characters."
      },
      "BillingGeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the billing address:"
      },
      "BillingLatitude": {
        "type": "double",
        "description": "Used with BillingLongitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –90 and 90, up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "BillingLongitude": {
        "type": "double",
        "description": "Used with BillingLatitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –180 and 180, up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "BillingPostalCode": {
        "type": "string",
        "description": "Details for the billing address of the account. Can have up to 20 characters."
      },
      "BillingState": {
        "type": "string",
        "description": "Details for the billing address of this account. Can have up to 80 characters."
      },
      "BillingStreet": {
        "type": "textarea",
        "description": "Street name in the billing address of the account."
      },
      "CleanStatus": {
        "type": "picklist",
        "description": "Indicates the record’s clean status compared with Data.com:"
      },
      "DandbCompanyId": {
        "type": "reference",
        "description": "ID of the Dun & Bradstreet® company record associated with the account."
      },
      "Description": {
        "type": "textarea",
        "description": "Text description of the account. Limited to 32,000 KB."
      },
      "DunsNumber": {
        "type": "string",
        "description": "The Data Universal Numbering System (D-U-N-S) number is a unique, nine-digit number assigned to every business location in the Dun & Bradstreet database that has a unique, separate, and distinct operation. D-U-N-S numbers are used by industries and organizations around the world as a global standard for business identification and tracking. Maximum size is nine characters. This field is available only on business accounts. Note This field is available only to companies that use Data.com Prospector or Data.com Clean."
      },
      "Fax": {
        "type": "phone",
        "description": "Fax number of the account."
      },
      "Industry": {
        "type": "picklist",
        "description": "Industry associated with the account. Can have up to 40 characters."
      },
      "Jigsaw": {
        "type": "string",
        "description": "References the ID of a company in Data.com. Accounts imported from Data.com always have a value in this field, while accounts not imported from Data.com have a null value. Can have up to 20 characters. Available in API version 22.0 and later. Label is Data.com Key. This field is available only on business accounts."
      },
      "JigsawCompanyId": {
        "type": "string",
        "description": "ID of a company in Data.com."
      },
      "LastActivityDate": {
        "type": "date",
        "description": "Date when a user last modified the record."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Most recent date on which a user referenced the record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Most recent date on which a user viewed the record."
      },
      "MasterRecordId": {
        "type": "reference",
        "description": "If this object was deleted as the result of a merge, then this field contains the ID of the record that was kept. If this object was deleted for any other reason, or hasn’t been deleted, the value is null."
      },
      "NaicsCode": {
        "type": "string",
        "description": "The six-digit North American Industry Classification System (NAICS) code is the standard used by businesses and the government to classify business establishments into industries, according to their economic activity for the purpose of collecting, analyzing, and publishing statistical data related to the U.S. business economy. Can have up to eight characters. This field is available only on business accounts. Note This field is available only to companies that use Data.com Prospector or Data.com Clean."
      },
      "NaicsDesc": {
        "type": "string",
        "description": "Brief description of an company line of business based on the org’s NAICS code. Can have up to 120 characters. The field is available only on business accounts. Note The field is available only to companies that use Data.com Prospector or Data.com Clean."
      },
      "Name": {
        "type": "string",
        "description": "Unique identification of the account."
      },
      "NumberOfEmployees": {
        "type": "int",
        "description": "Number of employees working at the company that’s represented by the account. Can have up to eight digits."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "Operating hours associated with the account. Available only if Field Service is enabled."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who currently owns the account. Default value is the user logged in to the API to perform the create. If you have set up account teams in your company, the result of updating this field depends on your version of the API:"
      },
      "Ownership": {
        "type": "picklist",
        "description": "Ownership type of the account:"
      },
      "ParentId": {
        "type": "reference",
        "description": "ID of the parent object, if any."
      },
      "Phone": {
        "type": "phone",
        "description": "Phone number of the account. Can have up to 40 characters."
      },
      "PhotoUrl": {
        "type": "url",
        "description": "Path to be combined with the URL of a Salesforce instance (for example, https://yourInstance.salesforce.com/) to generate a URL to request the social network profile image associated with the account. Generated URL returns an HTTP redirect (code 302) to the social network profile image for the account. Returns a blank if Social Accounts and Contacts aren’t enabled for the company or are disabled for the requesting user."
      },
      "Rating": {
        "type": "picklist",
        "description": "Account’s prospect rating:"
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "ID of the record type assigned to the object."
      },
      "ShippingAddress": {
        "type": "address",
        "description": "Read-only. Compound form of the shipping address. See Address Compound Fields for details on compound address fields."
      },
      "ShippingCity": {
        "type": "string",
        "description": "City in the shipping address of the account. Can have up to 40 characters."
      },
      "ShippingCountry": {
        "type": "string",
        "description": "Country in the shipping address of the account. Can have up to 80 characters."
      },
      "ShippingGeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the shipping address:"
      },
      "ShippingLatitude": {
        "type": "double",
        "description": "Used with ShippingLongitude to specify the precise geolocation of a shipping address. Acceptable values are numbers between –90 and 90, up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "ShippingLongitude": {
        "type": "double",
        "description": "Used with ShippingLatitude to specify the precise geolocation of an address. Acceptable values are numbers between –180 and 180, up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "ShippingPostalCode": {
        "type": "string",
        "description": "Postal code in the shipping address of the account. Can have up to 20 characters."
      },
      "ShippingState": {
        "type": "string",
        "description": "State in the shipping address of the account. Can have up to 80 characters."
      },
      "ShippingStreet": {
        "type": "textarea",
        "description": "Street name in the shipping address of the account. Can have up to 255 characters."
      },
      "Sic": {
        "type": "string",
        "description": "Standard Industrial Classification code of the company’s main business categorization. For example, 57340 for Electronics. Can have up to 20 characters. This field is available only on business accounts."
      },
      "SicDesc": {
        "type": "string",
        "description": "Brief description of an company line of business, based on the SIC code. Can have up to 80 characters. This field is available only on business accounts."
      },
      "Site": {
        "type": "string",
        "description": "Name of the account’s location. For example, Headquarters or London. Can have up to 80 characters."
      },
      "TickerSymbol": {
        "type": "string",
        "description": "Stock market symbol for the account. Can have up to 20 characters. This field is available only on business accounts."
      },
      "Tradestyle": {
        "type": "string",
        "description": "Non-legal name that an company uses for conducting business. Similar to Doing business as or DBA. Can have up to 255 characters. This field is available only on business accounts. Note This field is available only to companies that use Data.com Prospector or Data.com Clean."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of account"
      },
      "Website": {
        "type": "url",
        "description": "Website of the account. Can have up to 255 characters."
      },
      "YearStarted": {
        "type": "string",
        "description": "Date when an org was legally established. Can have up to four characters. Note This field is only available to organizations that use Data.com Prospector or Data.com Clean."
      },
      "cgcloud_Account_Email__c": {
        "type": "email",
        "description": "Email address of the account. Label is Email."
      },
      "cgcloud_Account_Number__c": {
        "type": "string",
        "description": "Account number assigned to the account (not the unique, auto-generated ID assigned during creation). Can have up to 40 characters."
      },
      "cgcloud_Account_Template_Description__c": {
        "type": "string",
        "description": "The account template description."
      },
      "cgcloud_Account_Template__c": {
        "type": "reference",
        "description": "References the account template object used for accounts."
      },
      "cgcloud__ExternalId__c": {
        "type": "string",
        "description": "Unique identifier of the external object record to account."
      },
      "cgcloud__Name_2__c": {
        "type": "string",
        "description": "Unique identification of the account."
      },
      "cgcloud__Number_Of_Extensions__c": {
        "type": "double",
        "description": "Number of extensions for the account."
      },
      "cgcloud__Sales_Org__c": {
        "type": "string",
        "description": "Sales org of the template."
      }
    },
    "module": "Consumer Goods Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.retail_api.meta/retail_api/sforce_api_objects_account.htm"
  }
}