{
  "AccountPlanObjective": {
    "name": "AccountPlanObjective",
    "description": "Represents strategic objectives or initiatives pursued by a relationship team with a customer to enhance customer engagement and satisfaction.",
    "properties": {
      "AccountPlanId": {
        "type": "reference",
        "description": "The account plan associated with the objective."
      },
      "AccountPlanObjCategoryId": {
        "type": "reference",
        "description": "The category associated with the account plan objective. To access this field, you must have an FSC Sales or a Financial Services Cloud Extension license."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the account plan objective."
      },
      "EndDate": {
        "type": "date",
        "description": "The end date of the account plan objective."
      },
      "ExternalStakeholderId": {
        "type": "reference",
        "description": "The customer stakeholder contact associated with the account plan objective. The relationship team collaborates with the customer stakeholder to achieve a specific objective. To access this field, you must have an FSC Sales or a Financial Services Cloud Extension license."
      },
      "LastInteractionSumGenDate": {
        "type": "dateTime",
        "description": "The date when the most recent interaction summary was generated using Einstein Generative AI. To access this field, you must have an FSC Sales or a Financial Services Cloud Extension license."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the account plan objective."
      },
      "ObjectiveInteractionSummary": {
        "type": "textarea",
        "description": "The summary of interactions that occur with the account in relation to the account plan objective. To access this field, you must have an FSC Sales or a Financial Services Cloud Extension license."
      },
      "ObjectiveOwnerId": {
        "type": "reference",
        "description": "The owner user associated with the objective."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who created the record."
      },
      "Priority": {
        "type": "picklist",
        "description": "Specifies the level of importance placed on achieving the objective associated with the account plan. To access this field, you must have an FSC Sales or a Financial Services Cloud Extension license."
      },
      "StartDate": {
        "type": "date",
        "description": "The start date of the account plan objective."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the account plan objective."
      }
    },
    "module": "Core Salesforce"
  }
}