{
  "AccountingFieldMapping": {
    "name": "AccountingFieldMapping",
    "description": "Represents the custom field mappings used to populate transaction journal records with other Salesforce data.",
    "properties": {
      "AccountingModelConfigId": {
        "type": "reference",
        "description": "The accounting set associated with the accounting field mapping record."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The name of the person who created the accounting field mapping."
      },
      "IsForAllocationType": {
        "type": "boolean",
        "description": "Determines whether this supplemental mapping applies to transaction journal records of allocation type (true) or not (false)."
      },
      "IsForPaymentType": {
        "type": "boolean",
        "description": "Determines whether this supplemental mapping applies to transaction journal records of payment type (true) or not (false)."
      },
      "IsForTransactionType": {
        "type": "boolean",
        "description": "Determines whether this supplemental mapping applies to transaction journal records of transaction type (true) or not (false)."
      },
      "Language": {
        "type": "picklist",
        "description": "Specifies the language used."
      },
      "MappingBehavior": {
        "type": "picklist",
        "description": "If set to PointInTime, the target field's data is mapped from the source field only when the transaction journal record is created. If set to CurrentValue, Accounting Subledger reverses and replaces the generated transaction journal records when the value on the transaction journal record is different from the source field value (for example, when you update the source field or the generated record)."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The standard name of the accounting set on the UI."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix of the accounting set."
      },
      "SourceField": {
        "type": "picklist",
        "description": "The API name of the field on the source object that is mapped to the target field."
      },
      "TargetField": {
        "type": "picklist",
        "description": "The API name of the field on the transaction journal record for this mapping."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/sforce_api_objects_accountingfieldmapping.htm"
  }
}