{
  "ActivityMetric": {
    "name": "ActivityMetric",
    "description": "Represents activities that were added to Salesforce automatically by Einstein Activity Capture and manually by users.",
    "properties": {
      "BaseId": {
        "type": "reference",
        "description": "The ID of the record that the activities apply to."
      },
      "BaseType": {
        "type": "string",
        "description": "The entity that corresponds to the BaseId"
      },
      "FirstCallDateTime": {
        "type": "dateTime",
        "description": "Indicates the date when the first call was made. This field is available only to Sales Engagement users. Einstein Activity Capture and Activity Metrics aren’t required."
      },
      "FirstEmailDateTime": {
        "type": "dateTime",
        "description": "Indicates the date when the first email was sent. This field is available only to Sales Engagement users. Einstein Activity Capture and Activity Metrics aren’t required."
      },
      "InactiveDays": {
        "type": "int",
        "description": "Indicates the number of days since the most recent activity was completed. This field is derived from the Last Activity Date field."
      },
      "LastActivityDateLastModDate": {
        "type": "dateTime",
        "description": "Indicates when the LastActivityDateTime field was last modified."
      },
      "LastActivityDateTime": {
        "type": "dateTime",
        "description": "Indicates the date when the most recent activity was completed."
      },
      "LastCallDateLastModDate": {
        "type": "dateTime",
        "description": "Indicates when the LastCallDateTime field was last modified."
      },
      "LastCallDateTime": {
        "type": "dateTime",
        "description": "Indicates the date when the most recent call was made through Sales Dialer or Inbox."
      },
      "LastEmailDateLastModDate": {
        "type": "dateTime",
        "description": "Indicates when the LastEmailDateTime field was last modified."
      },
      "LastEmailDateTime": {
        "type": "dateTime",
        "description": "Indicates the date when the most recent email was sent or received."
      },
      "LastEmailReceivedDateTime": {
        "type": "dateTime",
        "description": "Indicates the date when the most recent email was received.Available in API version 54.0 and later."
      },
      "LastEmailSentDateTime": {
        "type": "dateTime",
        "description": "Indicates the date when the most recent email was sent.Available in API version 54.0 and later."
      },
      "LastEventDateLastModDate": {
        "type": "dateTime",
        "description": "Indicates when the LastEventDateTime field was last modified."
      },
      "LastEventDateTime": {
        "type": "dateTime",
        "description": "Indicates the date when the most recent event was completed."
      },
      "LastTaskDateLastModDate": {
        "type": "dateTime",
        "description": "Indicates when the LastTaskDateTime field was last modified."
      },
      "LastTaskDateTime": {
        "type": "dateTime",
        "description": "Indicates the date when the last task was completed."
      },
      "NextActivityDateLastModDate": {
        "type": "dateTime",
        "description": "Indicates when the NextActivityDateTime field was last modified."
      },
      "NextActivityDateTime": {
        "type": "dateTime",
        "description": "Indicates the date of the next scheduled task or event. Only open tasks in the future are included."
      }
    },
    "module": "Core Salesforce"
  }
}