{
  "ActionLinkGroupTemplate": {
    "name": "ActionLinkGroupTemplate",
    "description": "Action link templates let you reuse action link definitions and package and distribute action links. An action link is a button on a feed element. Clicking on an action link can take a user to another Web page, initiate a file download, or invoke an API call to an external server or Salesforce. Use action links to integrate Salesforce and third-party services into the feed. Every action link belongs to an action link group and action links within the group are mutually exclusive.",
    "properties": {
      "Category": {
        "type": "picklist",
        "description": "The location of the action link group within the feed element. Values are: Primary—The action link group is displayed in the body of the feed element. Overflow—The action link group is displayed in the overflow menu of the feed element."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The name of the action link group template to use in code."
      },
      "ExecutionsAllowed": {
        "type": "picklist",
        "description": "The number of times an action link can be executed. Values are: Once—An action link can be executed only once across all users. OncePerUser—An action link can be executed only once for each user. Unlimited—An action link can be executed an unlimited number of times by each user. If the action link’s actionType is Api or ApiAsync, you can’t use this value."
      },
      "HoursUntilExpiration": {
        "type": "int",
        "description": "The number of hours from when the action link group is created until it's removed from associated feed elements and can no longer be executed. The maximum value is 8,760."
      },
      "IsPublished": {
        "type": "boolean",
        "description": "If true, the action link group template is published. Action link group templates shouldn’t be published until at least one ActionLinkTemplate is associated with it. Once set to true, this can’t be set back to false."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the MasterLabel."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The name of the action link group template."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      }
    },
    "module": "Core Salesforce"
  }
}