{
  "ActiveScratchOrg": {
    "name": "ActiveScratchOrg",
    "description": "Represents an active scratch org.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "A description of this scratch org."
      },
      "Edition": {
        "type": "picklist",
        "description": "The org edition of this scratch org. Possible values are Group, Developer, Enterprise, and Professional. This field is read only."
      },
      "ExpirationDate": {
        "type": "date",
        "description": "Date when the scratch org expires. This field is read only."
      },
      "Features": {
        "type": "textarea",
        "description": "The features enabled in this scratch org, such as MultiCurrency. See the Salesforce DX Developer Guide for the full list of valid features. This field is read only."
      },
      "HasSampleData": {
        "type": "boolean",
        "description": "Specifies whether the scratch org contains sample data. If set to true, the sample data is similar to the data in a Salesforce free trial org."
      },
      "LastLoginDate": {
        "type": "date",
        "description": "The date of the last user login to the scratch org. This field is read only."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record. This field is read only."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate isn’t null, the user accessed this record or list view indirectly. This field is read only."
      },
      "Name": {
        "type": "string",
        "description": "The auto-generated ID of this scratch org. This field is read only."
      },
      "Namespace": {
        "type": "string",
        "description": "The namespace associated with this scratch org. This field is read only."
      },
      "OrgName": {
        "type": "string",
        "description": "The name of the scratch org. This field is read only."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this scratch org. This field is read only."
      },
      "ScratchOrg": {
        "type": "string",
        "description": "The org ID of the scratch org. This field is read only."
      },
      "ScratchOrgInfoId": {
        "type": "reference",
        "description": "The id of the associated ScratchOrgInfo object. This field is read only."
      },
      "SignupEmail": {
        "type": "email",
        "description": "The email address of the Administration user. This field is read only."
      },
      "SignupInstance": {
        "type": "string",
        "description": "The Salesforce instance on which this scratch org resides. This field is read only."
      },
      "SignupTrialDays": {
        "type": "int",
        "description": "The number of days between the scratch org's creation and expiration. This field is read only."
      },
      "SignupUsername": {
        "type": "string",
        "description": "The username of the Administration user of the scratch org. This field is read only."
      },
      "Snapshot": {
        "type": "string",
        "description": "If this scratch org was created from a scratch org snapshot, then this field contains either the name or ID of the snapshot. Specifically, the name corresponds to the Name field of the snapshot’s record in the OrgSnapshot standard object; the ID corresponds to the record ID."
      }
    },
    "module": "Core Salesforce"
  }
}