{
  "ActionCadence": {
    "name": "ActionCadence",
    "description": "Represents the definition of a cadence.",
    "properties": {
      "ActivatedDate": {
        "type": "date",
        "description": "The date that the user activated the action cadence. ActionCadence objects are created in a draft state and must be manually activated before they’re used."
      },
      "ActiveTargets": {
        "type": "int",
        "description": "The total number of active targets that are currently assigned with this cadence. Available in API version 58.0 and later."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of this action cadence."
      },
      "ErrorMessage": {
        "type": "string",
        "description": "If there was an error when activating the action cadence, this field contains the error message."
      },
      "FolderId": {
        "type": "reference",
        "description": "The ID of the folder that contains the action cadence. Available in API version 49.0 and later."
      },
      "FolderName": {
        "type": "string",
        "description": "The name of the folder that contains the action cadence. Available in API version 49.0 and later."
      },
      "IsWaitAllowedBeforeDaisyChain": {
        "type": "boolean",
        "description": "Whether the cadence is allowed to have a wait step before a daisy chain step (true) or not (false)."
      },
      "LastEditedDateTime": {
        "type": "dateTime",
        "description": "The date and time this object was last edited."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date this object was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date this action cadence was last viewed in the Sales Engagement app."
      },
      "Name": {
        "type": "string",
        "description": "The name of this action cadence. Every action cadence in an org must have a unique name."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the owner of the action cadence (typically the user who created it). Note To change the owner of an action cadence, the new owner must have read access to action cadences enabled in their user profile."
      },
      "State": {
        "type": "picklist",
        "description": "This entity's state."
      },
      "SuccessfulCompletions": {
        "type": "int",
        "description": "The total number of successful dispositions this cadence has upon completion. For example, customer engaged or customer connected. Available in API version 58.0 and later."
      },
      "TotalSteps": {
        "type": "int",
        "description": "The number of total steps associated with this cadence. This value doesn’t include special step types such as root, branch, and daisy chain. Available in API version 58.0 and later."
      },
      "TotalTargets": {
        "type": "int",
        "description": "The total number of targets that have been assigned with this cadence. Available in API version 58.0 and later."
      },
      "Type": {
        "type": "picklist",
        "description": "Indicates the type of ActionCadence. Available in API version 56.0 and later."
      }
    },
    "module": "Core Salesforce"
  }
}