{
  "ActionPlan": {
    "name": "ActionPlan",
    "description": "Represents the instance of an action plan, a set of tasks created from an action plan template.",
    "properties": {
      "ActionPlanState": {
        "type": "picklist",
        "description": "The status of work being done for the action plan."
      },
      "ActionPlanTemplateVersionId": {
        "type": "reference",
        "description": "The ID of the version of the action plan template used to create this action plan. At creation, the referenced action plan template must be in the published state."
      },
      "ActionPlanType": {
        "type": "picklist",
        "description": "The action plan’s type."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates whether the action plan is locked or not."
      },
      "IsUsingHolidayHours": {
        "type": "boolean",
        "description": "Indicates whether task completion dates have been calculated by incrementing the task offset for each non-work day, excluding recurring holidays."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates whether the action plan can be edited or not."
      },
      "Name": {
        "type": "string",
        "description": "The name of the action plan."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "StartDate": {
        "type": "date",
        "description": "The start date of the action plan."
      },
      "TargetId": {
        "type": "reference",
        "description": "The ID of the parent object record that relates to this action plan. For API version 63.0 and later, supported parent objects are Account, AccountPlanObjective, Applicant, ApplicationForm, ApplicationFormProduct, Asset, BusinessLicense, BusinessMilestone, Campaign, Case, ChangeRequest, Claim, Contact, Contract, FinancialGoal, Incident, InsurancePolicy, InsurancePolicyCoverage, Lead, Opportunity, PersonLifeEvent, Problem, ResidentialLoanApplication, WorkOrder, and WorkOrderLineItem. For API version 62.0 and later, supported parent objects are ApplicationFormEvaluation and VettingEvaluation. For API version 48.0 and later, supported parent objects are Account, AssetsAndLiabilities, BusinessMilestone, Campaign, Card, Case, Claim, Contact, Contract, Financial Account, Financial Goal, Financial Holding, InsurancePolicy, InsurancePolicyCoverage, Lead, Opportunity, PersonLifeEvent, ResidentialLoanApplication, and Visit as well as custom objects with activities enabled. For API version 47.0 and later, supported parent objects are Account, BusinessMilestone, Campaign, Case, Claim, Contact, Contract, InsurancePolicy, InsurancePolicyCoverage, Lead, Opportunity, PersonLifeEvent, and Visit as well as custom objects with activities enabled. For API version 46.0 and later, supported parent objects are Account, Campaign, Case, Contact, Contract, Lead, and Opportunity as well as custom objects with activities enabled. For API version 45.0 and earlier, the only supported parent object is Account."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/sforce_api_objects_actionplan.htm"
  }
}