{
  "AdvAccountForecastSet": {
    "name": "AdvAccountForecastSet",
    "description": "Represents a collection of fields to set up an advanced account forecast set.",
    "properties": {
      "AccountFieldName": {
        "type": "picklist",
        "description": "The field name for the account in the advanced account forecast fact record."
      },
      "CalculationFrequency": {
        "type": "picklist",
        "description": "The frequency at which the forecast set is recalculated automatically."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the advanced account forecast set record."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The name of the advanced account forecast set record."
      },
      "ForecastFactObjectName": {
        "type": "picklist",
        "description": "The API Name of the object used to store the forecast facts."
      },
      "ForecastPeriodGroupId": {
        "type": "reference",
        "description": "The forecast period group associated with the advanced account forecast set."
      },
      "ForecastQuantityFieldName": {
        "type": "picklist",
        "description": "The field name for the forecast quantity in the advanced account forecast fact record."
      },
      "ForecastRevenueFieldName": {
        "type": "picklist",
        "description": "The field name for the forecast revenue in the advanced account forecast record."
      },
      "ForecastSetFieldName": {
        "type": "picklist",
        "description": "The name of the field used to store the forecast set and fact object relation."
      },
      "ForecastSetName": {
        "type": "string",
        "description": "The name of the forecast set."
      },
      "ForecastStatusFieldName": {
        "type": "picklist",
        "description": "The field name for the Status in the advanced account forecast fact record."
      },
      "GenerationDpeDefNameId": {
        "type": "reference",
        "description": "The name of the Data Processing Engine definition used to generate advanced account forecast fact records."
      },
      "Language": {
        "type": "picklist",
        "description": "The combined language and locale ISO code, which controls the language of the advanced account forecast fact set record."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label for this advanced account forecast set value. This display value is the internal label that doesn't get translated."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "PeriodFieldName": {
        "type": "picklist",
        "description": "The field name for the period in the advanced account forecast fact record."
      },
      "RecalculateDpeDefNameId": {
        "type": "reference",
        "description": "The Data Processing Engine definition used to recalculate advanced account forecast fact records."
      },
      "RegenerationDpeDefNameId": {
        "type": "reference",
        "description": "The Data Processing Engine definition used to regenerate advanced account forecast fact records."
      },
      "RolloverDpeDefNameId": {
        "type": "reference",
        "description": "The Data Processing Engine definition used to generate rollover advanced account forecast fact records."
      },
      "RolloverFrequency": {
        "type": "picklist",
        "description": "The frequency of rollover of the advanced account forecast records."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the advanced account forecast set."
      }
    },
    "module": "Manufacturing Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.mfg_api_devguide.meta/mfg_api_devguide/sforce_api_objects_advaccountforecastset.htm"
  }
}