{
  "AgentWork": {
    "name": "AgentWork",
    "description": "Represents a work assignment that’s been routed to an agent. If the work is transferred to another agent, a new AgentWork record is created. This object is available in API version 32.0 and later.",
    "properties": {
      "AcceptDateTime": {
        "type": "Filter, Nillable, Sort",
        "description": ""
      },
      "ActiveTime": {
        "type": "int",
        "description": "The amount of time an agent is actively working on a work item in their console. Active time is tracked only for tasks routed using the tab-based capacity model. It's tracked only when the work tab is open and in focus in the console. If the agent switches console tabs, the time spent on the other tabs isn't counted. Active time continues to count if you switch to a new browser tab or window. Active time stops when the agent closes the work item or the after conversation work time ends, whichever happens first."
      },
      "AcwExtensionCount": {
        "type": "int",
        "description": "The number of times that an agent extended the After Conversation Work (ACW) timer. This field is available in API version 55.0 and later."
      },
      "AcwExtensionDuration": {
        "type": "int",
        "description": "The length of time (in seconds) that the After Conversation Work (ACW) timer was extended each time that the agent extended the timer. This field is available in API version 55.0 and later.To find the total extension duration, multiply this field by AcwExtensionCount or use AfterConversationActualTime."
      },
      "AfterConversationActualTime": {
        "type": "int",
        "description": "The number of seconds an agent spent on After Conversation Work (ACW) after customer contact ended. This field is available in API version 52.0 and later."
      },
      "AgentCapacityWhenDeclined": {
        "type": "double",
        "description": "The agent’s capacity when declining work, either explicitly or through push timeout."
      },
      "AssignedDateTime": {
        "type": "dateTime",
        "description": "Indicates when the work item was assigned to an agent. This field is a calculated field."
      },
      "BotId": {
        "type": "reference",
        "description": "The ID of the Enhanced Einstein Bot or AI agent that performed the work. This is a relationship field. This field is available in API version 52.0 and later."
      },
      "BotType": {
        "type": "picklist",
        "description": "Indicates the type of bot. Valid values are: Bot. Refers to an Einstein bot. ExternalCopilot. Refers to an AI agent with whom your customers can interact."
      },
      "CancelDateTime": {
        "type": "dateTime",
        "description": "Indicates when the work item was canceled."
      },
      "CapacityModel": {
        "type": "picklist",
        "description": "Indicates the capacity model used to determine agent capacity. Valid values are StatusBased and TabBased. This field is available in API version 50.0 and later."
      },
      "CapacityPercentage": {
        "type": "percent",
        "description": "The percentage of an agent’s capacity that’s consumed when this work item is in progress. Valid values are from 0 to 100."
      },
      "CapacityWeight": {
        "type": "double",
        "description": "The amount of an agent’s capacity that’s consumed when this work item is in progress."
      },
      "CloseDateTime": {
        "type": "dateTime",
        "description": "Indicates when the work item was closed."
      },
      "DeclineDateTime": {
        "type": "dateTime",
        "description": "Date and time when the agent declined this record."
      },
      "DeclineReason": {
        "type": "string",
        "description": "The provided reason for why an agent declined the work request."
      },
      "ExternalBotId": {
        "type": "reference",
        "description": "The ID of the third-party bot that handles the work item. This is a relationship field. This field is available in API version 64.0 and later."
      },
      "HandleTime": {
        "type": "int",
        "description": "The amount of time an agent had the work item open, calculated by CloseDateTime – AcceptedDateTime. Handle time stops when the agent closes the work item or the after conversation work time ends, whichever happens first."
      },
      "IsInterruptible": {
        "type": "boolean",
        "description": "Indicates whether a work item consumes interruptible or primary capacity. The default value is false. Available in API version 57.0 and later when the Interruptible Capacity feature is enabled."
      },
      "IsOwnerChangeInitiated": {
        "type": "boolean",
        "description": "Indicates whether a work item owner change triggered the direct assignment of the work item to the agent. The default value is false. Status-Based Capacity Model has to be turned on to use this field. This field is available in API version 50.0 and later."
      },
      "IsPreferredUserRequired": {
        "type": "boolean",
        "description": "Indicates whether a work item stays with the preferred user even when the user isn’t available. The default value is false. This field is available in API version 50.0 and later."
      },
      "IsStatusChangeInitiated": {
        "type": "boolean",
        "description": "Indicates whether a work item status change triggered the direct assignment of the work item to the agent. The default value is false. Status-Based Capacity Model has to be turned on to use this field. This field is available in API version 50.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "An automatically generated ID number that identifies the record."
      },
      "OriginalGroupId": {
        "type": "reference",
        "description": "The ID of the queue that the work assignment was originally routed to. This field is a relationship field."
      },
      "OriginalQueueId": {
        "type": "reference",
        "description": "The ID of the queue that the work assignment was originally routed to. Due to API changes, OriginalQueueId is no longer recommended. Use OriginalGroupId instead."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the owner of the AgentWork. This field is a polymorphic relationship field. This field is available in API version 50.0 and later."
      },
      "PausedCapacityPercentage": {
        "type": "percent",
        "description": "The percentage of an agent’s capacity that’s consumed when this work item is paused. The paused capacity feature is available with status-based capacity and Enhanced Omni-Channel only. This field is available in API version 62.0 and later."
      },
      "PausedCapacityWeight": {
        "type": "double",
        "description": "The amount of an agent’s capacity that’s consumed when this work item is paused. The paused capacity feature is available with status-based capacity and Enhanced Omni-Channel only. This field is available in API version 62.0 and later."
      },
      "PendingServiceRoutingId": {
        "type": "reference",
        "description": "The ID of the PendingServiceRouting from which the AgentWork was created. This field is a relationship field. This field is available in API version 50.0 and later."
      },
      "PreferredUserId": {
        "type": "reference",
        "description": "The ID of the preferred user to handle the work. This field is a relationship field. This field is available in API v46.0 and later."
      },
      "PushTimeout": {
        "type": "int",
        "description": "The time limit set for an agent to respond to an item before it’s pushed to another agent. The time limit is measured in seconds. This field is available in API version 36.0 and later."
      },
      "PushTimeoutDateTime": {
        "type": "dateTime",
        "description": "The date and time (in UTC) when the push timeout event occurred. This field is available in API version 36.0 and later."
      },
      "RequestDateTime": {
        "type": "dateTime",
        "description": "Indicates when the work was requested."
      },
      "RoutingModel": {
        "type": "picklist",
        "description": "Determines how incoming work items are routed to agents assigned to a service channel. Possible values are: ExternalRouting LeastActive MostAvailable"
      },
      "RoutingPriority": {
        "type": "int",
        "description": "The order in which work items from the queue that are associated with the routing configuration are routed to agents."
      },
      "RoutingType": {
        "type": "picklist",
        "description": "The type of Omni-Channel routing. Possible values are: QueueBased SkillsBased"
      },
      "SecondaryRoutingPriority": {
        "type": "int",
        "description": "Indicates the secondary routing priority."
      },
      "ServiceChannelId": {
        "type": "reference",
        "description": "The ID of the service channel that’s associated with the work assignment. This field is a relationship field."
      },
      "ShouldSkipCapacityCheck": {
        "type": "boolean",
        "description": "Indicates whether to skip checking an agent’s available capacity (true) or not (false) when an externally routed work item is created. This field is used when agents can simultaneously handle work from both Omni-Channel queues and queues using external routing."
      },
      "SpeedToAnswer": {
        "type": "int",
        "description": "The amount of time between when the work was requested and when an agent accepted it."
      },
      "Status": {
        "type": "picklist",
        "description": "The working status of the work item. Valid values are: Assigned – The item is assigned to the agent but hasn’t been opened. Canceled – The item no longer needs to be routed. For example: a chat visitor cancels their Omni-Channel routed chat request before it reaches an agent. Closed – The item is closed. Declined – The item was assigned to the agent but the agent explicitly declined it. DeclinedOnPushTimeout – The item was declined because push time-out is enabled and the item request timed out with the agent. Opened – The agent opened the item. Transferred–The item was transferred from an agent to another agent, queue, or skill. Unavailable – The item was assigned to the agent but the agent became unavailable (went offline or lost connection)."
      },
      "TransferRequesterId": {
        "type": "reference",
        "description": "The user ID of the rep who reassigned the work using the Reassign action. This field is populated in reassigned AgentWork records only, not the original AgentWork record. This is a relationship field. This field is available in API version 63.0 and later."
      },
      "UserId": {
        "type": "reference",
        "description": "The ID of the user that the work item was assigned to. This field is a relationship field."
      },
      "WorkItemId": {
        "type": "reference",
        "description": "The ID of the object that’s routed to the agent through Omni-Channel."
      }
    },
    "module": "Core Salesforce"
  }
}