{
  "AgentWorkSkill": {
    "name": "AgentWorkSkill",
    "description": "Represents a skill used to route a work assignment to an agent. AgentWorkSkill is used for reporting and represents the result of a routing decision.",
    "properties": {
      "AgentWorkId": {
        "type": "reference",
        "description": "The AgentWork object associated with this skill."
      },
      "IsAdditionalSkill": {
        "type": "boolean",
        "description": "After a designated timeout period, a skill marked as additional is dropped from Omni-Channel routing. The case is then routed to the best-matched agent, even if the agent doesn’t have all the skills. The default value is false. Available in API version 48.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "An automatically generated ID number that identifies the record."
      },
      "SkillId": {
        "type": "reference",
        "description": "The skill that is required or additional."
      },
      "SkillLevel": {
        "type": "double",
        "description": "The level of the required or additional skill. Skill levels can range from 1 to 10. Depending on your business needs, you might want the skill level to reflect years of experience, certification levels, or license classes."
      },
      "SkillPriority": {
        "type": "int",
        "description": "For additional skills, specifies the order in which skills are dropped if after the specified timeout no agent with that skill is available. Higher priority-value skills are dropped first. Lower priority-value skills, for example 0, are dropped last. Skills with the same priority value are dropped as a group. You can set skill priority using attribute setup for skills-based routing or Apex code."
      },
      "WasDropped": {
        "type": "boolean",
        "description": "For skills marked as additional, indicates if the skill was dropped from Omni-Channel routing because an agent with this skill was not available. The default value is false. Available in API version 48.0 and later."
      }
    },
    "module": "Core Salesforce"
  }
}