{
  "AnalyticsDownloadEventLog": {
    "name": "AnalyticsDownloadEventLog",
    "description": "AnalyticsDownloadEventLog represent downloads made from lens and dashboard in the CRM Analytics.",
    "properties": {
      "AnalyticsSessionIdentifier": {
        "type": "string",
        "description": "The ID of a particular session of CRM Analytics. Use this field to determine which log lines originated from a particular session."
      },
      "AnalyticsTimestamp": {
        "type": "dateTime",
        "description": "The time when this log line was generated."
      },
      "AssetIdentifier": {
        "type": "string",
        "description": "The asset ID from the user download."
      },
      "AssetType": {
        "type": "string",
        "description": "The asset type from the user download."
      },
      "ClientIp": {
        "type": "string",
        "description": "The IP address of the client that’s using Salesforce services. A Salesforce internal IP (such as a login from AppExchange) is shown as “Salesforce.com IP”. For example: 96.43.144.26."
      },
      "CpuTime": {
        "type": "double",
        "description": "The CPU time in milliseconds used to complete the request. This field indicates the amount of activity taking place in the app server layer."
      },
      "DatasetIdentifiers": {
        "type": "string",
        "description": "A comma-separated list of used dataset IDs."
      },
      "DownloadFormat": {
        "type": "string",
        "description": "The format of the data for export."
      },
      "LoginKey": {
        "type": "string",
        "description": "The string that ties together all events in a given user’s login session. It starts with a login event and ends with either a logout event or the user session expiring. For example: GeJCsym5eyvtEK2I."
      },
      "RecordCount": {
        "type": "int",
        "description": "The number of records exported."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "Globally unique identifier for a given request."
      },
      "RunTime": {
        "type": "double",
        "description": "The amount of time that the request took in milliseconds."
      },
      "SessionKey": {
        "type": "string",
        "description": "The user’s unique session ID. You can use this value to identify all user events within a session. When a user logs out and logs in again, a new session is started. For example: d7DEq/ANa7nNZZVD."
      },
      "Timestamp": {
        "type": "dateTime",
        "description": "The access time of Salesforce services in GMT. For example, 2020-01-20T19:12:26.965Z. Milliseconds are the most granular setting."
      },
      "Uri": {
        "type": "string",
        "description": "The URI of the page that’s receiving the request. For example: /home/home.jsp."
      },
      "UserIdentifier": {
        "type": "string",
        "description": "The ID of the user who’s using Salesforce services through the UI or the API. For example: 00530000009M943."
      },
      "UserType": {
        "type": "string",
        "description": "The category of user license."
      }
    },
    "module": "Core Salesforce"
  }
}