{
  "AnimationRule": {
    "name": "AnimationRule",
    "description": "",
    "properties": {
      "AnimationFrequency": {
        "type": "picklist",
        "description": "Required. The frequency with which an animation is displayed when a user selects the designated picklist values in a path. Valid values are: always often sometimes rarely A value of always triggers an animation every time. The values often, sometimes, and rarely trigger an animation progressively less frequently."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The developer name for the animation rule."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated metadata object in Metadata API."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the animation rule is active (true) or not (false)."
      },
      "Language": {
        "type": "picklist",
        "description": "The language in the user’s personal settings."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label for the animation rule."
      },
      "Metadata": {
        "type": "complexvalue",
        "description": "AnimationRule metadata from the mns namespace.Query this field only if the query result contains no more than one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance."
      },
      "RecordTypeContext": {
        "type": "picklist",
        "description": "An enum to track whether this AnimationRule applies to all record types for the associated sObject, or only to a single or main record type. Valid values are All, Custom, and Master."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "The record type selected for the sObject in which the animation is displayed."
      },
      "SobjectType": {
        "type": "string",
        "description": "The object on which the animation rule is run."
      },
      "TargetField": {
        "type": "string",
        "description": "Name of the field used to determine when to display an animation."
      },
      "TargetFieldChangeToValues": {
        "type": "string",
        "description": "Values used to determine when to display an animation. When a user selects a value in TargetField that matches a value stored in TargetFieldChangeToValues, the animation is displayed."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_animationrule.htm"
  }
}