{
  "AnnualEmssnInventory": {
    "name": "AnnualEmssnInventory",
    "description": "Represents information about a company's total carbon emissions for a particular year in metric tonnes of CO2e (tCO2e). These emissions are the sum of all the emissions in scope 1, scope 2, and scope 3 greenhouse gas categories.",
    "properties": {
      "AccountNameId": {
        "type": "reference",
        "description": "Name of the company, it's subsidiary, or it's business unit for which you are doing carbon accounting."
      },
      "AllocScope1And2Emssn": {
        "type": "double",
        "description": "The scope 1 and scope 2 emissions allocated to the inventory of an account."
      },
      "AllocScope1EmissionsInTco2e": {
        "type": "double",
        "description": "The scope 1 emissions allocated to the inventory of an account."
      },
      "AllocScope1EmssnOverride": {
        "type": "double",
        "description": "The emissions value entered to override the scope 1 emissions that are allocated to the inventory of an account."
      },
      "AllocScope2EmssnInTco2e": {
        "type": "double",
        "description": "The scope 2 emissions allocated to the inventory of an account."
      },
      "AllocScope2EmssnOverride": {
        "type": "double",
        "description": "The emissions value entered to override the scope 2 emissions that are allocated to the inventory of an account."
      },
      "AllocScope2LocBasedEmssn": {
        "type": "double",
        "description": "The scope 2 location-based emissions allocated to the inventory of an account."
      },
      "AllocScope2MktBasedEmssn": {
        "type": "double",
        "description": "The scope 2 market-based emissions allocated to the inventory of an account."
      },
      "AllocScope3EmssnInTco2e": {
        "type": "double",
        "description": "The scope 3 emissions allocated to the inventory of an account."
      },
      "AllocScope3EmssnOverride": {
        "type": "double",
        "description": "The emissions value entered to override the scope 3 emissions that are allocated to the inventory of an account."
      },
      "EmissionsAllocToFranchCatg": {
        "type": "double",
        "description": "The emissions from child or partner companies that are allocated to GHG category 14 - Franchises category of the parent company account."
      },
      "EmissionsAllocToInvestCatg": {
        "type": "double",
        "description": "The emissions from child or partner companies that are allocated to GHG Category 15 - Investments category of the parent company account."
      },
      "EnergyUsageCmclBldOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the energy used in commercial buildings."
      },
      "EnergyUsageCommercialBld": {
        "type": "double",
        "description": "The energy used in all the commercial buildings that are related to the carbon footprint record or the override value."
      },
      "EnergyUsageDataCenters": {
        "type": "double",
        "description": "The energy used in all the data centers that are related to the carbon footprint record or the override value."
      },
      "EnergyUsageDataCtrOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the energy used in data centers."
      },
      "FinalEmssnInTco2e": {
        "type": "double",
        "description": "The consolidated emissions of an account that includes allocated emissions of the related account, which could be a child or partner account."
      },
      "FinalScope1EmssnInTco2e": {
        "type": "double",
        "description": "The consolidated scope 1 emissions of an account that includes allocated scope 1 emissions of the related account, which could be a child or partner account."
      },
      "FinalScope2EmssnInTco2e": {
        "type": "double",
        "description": "The consolidated scope 2 emissions of an account that includes allocated scope 2 emissions of the related account, which could be a child or partner account."
      },
      "FinalScope3EmssnInTco2e": {
        "type": "double",
        "description": "The consolidated scope 3 emissions of an account that includes allocated scope 3 emissions of the related account, which could be a child or partner account."
      },
      "FnlScp1And2EmssnInTco2e": {
        "type": "double",
        "description": "The consolidated scope 1 and scope 2 emissions of an account that includes allocated scope 1 and scope 2 emissions of the related account, which could be a child or a partner account."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates if the record is locked or not."
      },
      "IsRecordLocked": {
        "type": "boolean",
        "description": "Indicates that the annual emissions inventory record and the associated carbon footprint records are locked for editing."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates if the record can be edited (true) or not (false)."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "RenewableEnergyUsagePctCmclBld": {
        "type": "percent",
        "description": "The percentage of renewable energy used for the total electricity consumption of all the commercial buildings that are related to the carbon footprint record or the override value."
      },
      "RenewableEnergyUsagePctDataCtr": {
        "type": "percent",
        "description": "The percentage of total renewable energy used for the total electricity consumption of all the data centers that are related to the carbon footprint record or the override value."
      },
      "RenewableEnrgyPctCmclBldOvride": {
        "type": "percent",
        "description": "The emissions value entered to override the value of the commercial buildings renewable energy percentage."
      },
      "RenewableEnrgyPctDataCtrOvride": {
        "type": "percent",
        "description": "The emissions value entered to override the value of the data centers renewable energy percentage."
      },
      "Scope1EmissionsDataCenters": {
        "type": "double",
        "description": "The scope 1 emissions from data centers that’s calculated based on the data center emissions in the related carbon footprint record or the override value."
      },
      "Scope1EmissionsFleetVehicles": {
        "type": "double",
        "description": "The scope 1 emissions from fleet vehicles that’s calculated based on the fleet vehicle emissions in the related carbon footprint record or the override value."
      },
      "Scope1EmissionsPrivateJets": {
        "type": "double",
        "description": "The scope 1 emissions from private jets that’s calculated based on the private jet emissions in the related carbon footprint record or the override value."
      },
      "Scope1EmssnCmclBldOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the scope 1 emissions from commercial buildings."
      },
      "Scope1EmssnCommercialBuildings": {
        "type": "double",
        "description": "The scope 1 emissions from commercial buildings that’s calculated based on the commercial building emissions in the related carbon footprint record or the override value."
      },
      "Scope1EmssnDataCentersOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the scope 1 emissions from data centers."
      },
      "Scope1EmssnPrivateJetsOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the scope 1 emissions from private jets."
      },
      "Scp1EmssnWstGenInTco2e": {
        "type": "double",
        "description": "The scope 1 emissions from company's generated waste that’s calculated based on the waste related emissions in the related waste footprint record or the override value."
      },
      "Scp1EmssnWstGenOvrideInTco2e": {
        "type": "double",
        "description": "The value to override the scope 1 emissions from company's generated waste."
      },
      "Scope2EmissionsFleetVehicles": {
        "type": "double",
        "description": "The scope 2 emissions from fleet vehicles that’s calculated based on the fleet vehicle emissions in the related carbon footprint record or the override value."
      },
      "Scope2EmissionsPrivateJets": {
        "type": "double",
        "description": "The scope 2 emissions from private jets that’s calculated based on the private jets emissions in the related carbon footprint record or the override value."
      },
      "Scope2EmissionsType": {
        "type": "picklist",
        "description": "Specifies the type of scope 2 emissions."
      },
      "Scope2LocBasedEmssnCmclBld": {
        "type": "double",
        "description": "The scope 2 emissions from commercial buildings that’s calculated based on the location-based commercial buildings emissions in the related carbon footprint record or the override value."
      },
      "Scope2LocBasedEmssnDataCtr": {
        "type": "double",
        "description": "The scope 2 emissions from data centers that’s calculated based on the location-based data center emissions in the related carbon footprint record or the override value."
      },
      "Scope2MarketBasedEmssnCmclBld": {
        "type": "double",
        "description": "The scope 2 emissions from commercial buildings that’s calculated based on the market-based commercial building emissions in the related carbon footprint record or the override value."
      },
      "Scope2MarketBasedEmssnDataCtr": {
        "type": "double",
        "description": "The scope 2 emissions from data centers that’s calculated based on the market-based data center emissions in the related carbon footprint record or the override value."
      },
      "Scope3EmissionsBusinessTravel": {
        "type": "double",
        "description": "The total scope 3 emissions from business travel that is included in category 6 of the related carbon footprint record or the override values."
      },
      "Scope3EmissionsCapitalGoods": {
        "type": "double",
        "description": "The total scope 3 emissions from the production of capital goods that is included in category 2 of the related carbon footprint record or the override value."
      },
      "Scope3EmissionsDataCenters": {
        "type": "double",
        "description": "The total scope 3 emissions from all the data centers in the related carbon footprint record or the override value."
      },
      "Scope3EmissionsFleetVehicles": {
        "type": "double",
        "description": "The total scope 3 emissions from all the fleet vehicles in the related carbon footprint record or the override value."
      },
      "Scope3EmissionsFranchises": {
        "type": "double",
        "description": "The total scope 3 emissions from the operation of franchises that is included in category 14 of the related carbon footprint record or the override value."
      },
      "Scope3EmissionsInvestments": {
        "type": "double",
        "description": "The total scope 3 emissions from investment that is included in category 15 of the related carbon footprint record or the override value."
      },
      "Scope3EmissionsPctCapitalGoods": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the production of capital goods out of the total scope 3 emissions."
      },
      "Scope3EmissionsPctFranchises": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the operation of franchises out of the total scope 3 emissions."
      },
      "Scope3EmissionsPctInvestments": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from investments out of the total scope 3 emissions."
      },
      "Scope3EmissionsPercentage": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions out of the total emissions."
      },
      "Scope3EmissionsPrivateJets": {
        "type": "double",
        "description": "The total scope 3 emissions from all the private jets in the related carbon footprint record or the override value."
      },
      "Scope3EmissionsWasteGenInOper": {
        "type": "double",
        "description": "The total scope 3 emissions from the treatment and disposal of generated waste that is included in category 5 of the related carbon footprint record or the override value."
      },
      "Scope3EmssnCapitalGoodsOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the production of capital goods."
      },
      "Scope3EmssnCmclBldOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from commercial buildings."
      },
      "Scope3EmssnCommercialBuildings": {
        "type": "double",
        "description": "The total scope 3 emissions from all the commercial buildings in the related carbon footprint record or the override value."
      },
      "Scope3EmssnDataCentersOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from data centers."
      },
      "Scope3EmssnEmpCommutingOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the transportation of employees."
      },
      "Scope3EmssnEmployeeCommuting": {
        "type": "double",
        "description": "The total scope 3 emissions from the transportation of employees that is included in category 7 of the related carbon footprint record or the override value."
      },
      "Scope3EmssnFranchisesOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the operation of franchises."
      },
      "Scope3EmssnInvestmentsOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from investments."
      },
      "Scope3EmssnPctBusinessTravel": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from business travel out of the total scope 3 emissions."
      },
      "Scope3EmssnPctDnstrmTrnspDstr": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the transportation and distribution of downstream leased assets out of the total scope 3 emissions."
      },
      "Scope3EmssnPctEmpCommuting": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the transportation of employees out of the total scope 3 emissions."
      },
      "Scope3EmssnPctUpstrmLeasedAsst": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the operation of upstream leased assets out of the total scope 3 emissions."
      },
      "Scope3EmssnPctUseOfSoldPrdct": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from uncategorized sources out of the total scope 3 emissions."
      },
      "Scope3EmssnUseOfSoldProducts": {
        "type": "double",
        "description": "The total scope 3 emissions from the use of sold products and services that is included in category 11 of the related carbon footprint record or the override value."
      },
      "Scope3UncategorizedEmissions": {
        "type": "double",
        "description": "The total scope 3 emissions from uncategorized sources in the related carbon footprint record or the override value."
      },
      "Scp1EmssnFleetVehiclesOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the scope 1 emissions from fleet vehicles."
      },
      "Scp2EmssnFleetVehiclesOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the scope 2 emissions from fleet vehicles."
      },
      "Scp2EmssnPrivateJetsOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the scope 2 emissions from private jets."
      },
      "Scp2LocBsdEmssnCmclBldOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the scope 2 location-based emissions from commercial buildings."
      },
      "Scp2LocBsdEmssnDataCtrOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the scope 2 location-based emissions from data centers."
      },
      "Scp2MktBsdEmssnCmclBldOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the scope 2 market-based emissions from commercial buildings."
      },
      "Scp2MktBsdEmssnDataCtrOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the scope 2 market-based emissions from data centers."
      },
      "Scp3EmssnBusinessTravelOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from business travel."
      },
      "Scp3EmssnDnstrmLeasedAssets": {
        "type": "double",
        "description": "The total scope 3 emissions from downstream leased assets that is included in category 13 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnDnstrmLeasedAstOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from downstream leased assets."
      },
      "Scp3EmssnDnstrmTrnspDstrOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the transportation and distribution of downstream assets."
      },
      "Scp3EmssnDownstreamTrnspDstr": {
        "type": "double",
        "description": "The total scope 3 emissions from the transportation and distribution of downstream assets that is included in category 9 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnEolSoldPrdctOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the end-of-life treatment of sold products."
      },
      "Scp3EmssnEolTreatOfSoldPrdct": {
        "type": "double",
        "description": "The total scope 3 emissions from the end-of-life treatment of sold products that is included in category 12 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnFleetVehiclesOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from fleet vehicles."
      },
      "Scp3EmssnFuelEnergyActivity": {
        "type": "double",
        "description": "The total scope 3 emissions from the production of fuel and energy that is included in category 3 of the related carbon footprint record or the override values."
      },
      "Scp3EmssnFuelEnrgyActvtyOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the production of fuel and energy."
      },
      "Scp3EmssnPctDnstrmLeasedAssets": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the downstream leased assets out of the total scope 3 emissions."
      },
      "Scp3EmssnPctEolTreatSoldPrdct": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the end-of-life treatment of sold products out of the total scope 3 emissions."
      },
      "Scp3EmssnPctFuelEnrgyActivity": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the production of fuel and energy out of the total scope 3 emissions."
      },
      "Scp3EmssnPctProcSoldProducts": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the processing of sold products out of the total scope 3 emissions."
      },
      "Scp3EmssnPctPurchGoodsAndSrvcs": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the production of purchased goods and services out of the total scope 3 emissions."
      },
      "Scp3EmssnPctUpstrmTrnspDstr": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the transportation and distribution of upstream leased assets out of the total scope 3 emissions."
      },
      "Scp3EmssnPctWasteGenInOper": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from the treatment and disposal of generated waste out of the total scope 3 emissions."
      },
      "Scp3EmssnPrivateJetsOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from private jets."
      },
      "Scp3EmssnProcSoldPrdctOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the processing of sold products."
      },
      "Scp3EmssnProcSoldProducts": {
        "type": "double",
        "description": "The total scope 3 emissions from the processing of sold products that is included in category 10 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnPurchGoodsAndServices": {
        "type": "double",
        "description": "The scope 3 emissions from the production of purchased goods and services, included in category 1 associated with the carbon footprint record or the relevant override value."
      },
      "Scp3EmssnPurchGoodsSrvcsOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the production of purchased goods and services."
      },
      "Scp3EmssnUpstreamLeasedAssets": {
        "type": "double",
        "description": "The total scope 3 emissions from the operation of upstream leased assets that is included in category 8 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnUpstreamTrnspDstr": {
        "type": "double",
        "description": "The total scope 3 emissions from the transportation and distribution of upstream leased assets that is included in category 4 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnUpstrmLeasedAstOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the operation of upstream leased assets."
      },
      "Scp3EmssnUpstrmTrnspDstrOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the transportation and distribution of upstream leased assets."
      },
      "Scp3EmssnUseOfSoldPrdctOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the use of sold products and services."
      },
      "Scp3EmssnWasteGenInOperOvride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from the treatment and disposal of generated waste."
      },
      "Scp3UncategorizedEmssnOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions from uncategorized sources."
      },
      "Scp3UncatgEmssnPct": {
        "type": "percent",
        "description": "The percentage of scope 3 emissions from uncategorized sources out of the total scope 3 emissions."
      },
      "SupplementalScope3EmissionsPct": {
        "type": "percent",
        "description": "The percentage of supplemental scope 3 emissions out of the total scope 3 emissions."
      },
      "TotScope2LocBasedEmssn": {
        "type": "double",
        "description": "The total scope 2 location-based emissions from all the related records or the override value."
      },
      "TotScope2MarketBsdEmssn": {
        "type": "double",
        "description": "The total scope 2 market-based emissions from all the related records or the override value."
      },
      "TotalAllocEmissionsInTco2e": {
        "type": "double",
        "description": "The total emissions allocated to the inventory of an account."
      },
      "TotalEmissions": {
        "type": "double",
        "description": "The total scope 1, 2, and 3 emissions."
      },
      "TotalScope1And2Emissions": {
        "type": "double",
        "description": "The total scope 1 and 2 emissions of the related carbon footprint record."
      },
      "TotalScope1Emissions": {
        "type": "double",
        "description": "The total scope 1 emissions from all the related energy use records and the supplemental emissions from the related carbon footprint record or the override value."
      },
      "TotalScope1EmissionsOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 1 emissions."
      },
      "TotalScope2Emissions": {
        "type": "double",
        "description": "The total scope 2 emissions from all the related energy use records and the supplemental emissions from the related carbon footprint record or the override value."
      },
      "TotalScope2EmissionsOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 2 emissions."
      },
      "TotalScope3Emissions": {
        "type": "double",
        "description": "The total scope 3 emissions of the related carbon footprint record that’s calculated based on categorized, uncategorized, and supplemental scope 3 emissions or the override value."
      },
      "TotalScope3EmissionsOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total scope 3 emissions."
      },
      "TotalSuplScope3EmssnOverride": {
        "type": "double",
        "description": "The emissions value entered to override the value of the total supplemental scope 3 emissions."
      },
      "TotalSuplScp3Emissions": {
        "type": "double",
        "description": "The total supplemental scope 3 emissions from the related carbon footprint record or the override value."
      },
      "UniqueIdx": {
        "type": "string",
        "description": "The unique index for this record. This field is available in API version 57.0 and later."
      },
      "Year": {
        "type": "picklist",
        "description": "The year to which the carbon emissions inventory data corresponds."
      }
    },
    "module": "Net Zero Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.netzero_cloud_dev_guide.meta/netzero_cloud_dev_guide/sforce_api_objects_annualemssninventory.htm"
  }
}