{
  "AnnualEmssnRdctnTarget": {
    "name": "AnnualEmssnRdctnTarget",
    "description": "Represents information about the emissions reduction target set by a company for a particular year.",
    "properties": {
      "EmissionsReductionPercentage": {
        "type": "percent",
        "description": "The percentage of emissions reduced from the previous year."
      },
      "EmssnIntensityReductionPct": {
        "type": "percent",
        "description": "The percentage of emission intensity reduced from the previous year."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates if the record is locked or not."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates if the record can be edited or not."
      },
      "Name": {
        "type": "string",
        "description": "The name of the annual emissions reduction target record."
      },
      "OtherTargetKpiChangePercentage": {
        "type": "percent",
        "description": "The targeted percentage of change in the key performance indicators (KPI) from the base year to the target year."
      },
      "OtherTargetKpiInTargetYear": {
        "type": "double",
        "description": "The key performance indicator (KPI) target to achieve in the target year for the KPI of the parent emissions reduction target record."
      },
      "ParentTargetId": {
        "type": "reference",
        "description": "The parent target record that’s related to the annual emissions reduction target record."
      },
      "Scope3GhgCatgTgtEmssnRdctn": {
        "type": "double",
        "description": "The emissions targeted to be reduced in the scope 3 greenhouse gas category in the target year."
      },
      "Scope3GhgCatgTgtEmssnRdctnPct": {
        "type": "percent",
        "description": "The percentage of scope 3 greenhouse gas emissions targeted to be reduced from the base year to the target year."
      },
      "TargetEmissions": {
        "type": "double",
        "description": "The emissions targeted to be reached in the target year."
      },
      "TargetEmissionsIntensity": {
        "type": "double",
        "description": "The emissions intensity targeted to be reached in the target year."
      },
      "TargetYear": {
        "type": "picklist",
        "description": "The year of the annual emissions reduction target record."
      }
    },
    "module": "Net Zero Cloud"
  }
}