{
  "AnnualEmssnInventoryExtension": {
    "name": "AnnualEmssnInventoryExtension",
    "description": "Represents additional information about a company's total carbon emissions for a particular year in metric tonnes of CO2e (tCO2e).",
    "properties": {
      "AllocScope1EmssnCmclBuildings": {
        "type": "double",
        "description": "The scope 1 emissions allocated to stationary assets of type commercial building."
      },
      "AllocScope1EmssnDataCenters": {
        "type": "double",
        "description": "The scope 1 emissions allocated to stationary assets of type data center."
      },
      "AllocScope1EmssnFleetVehicles": {
        "type": "double",
        "description": "The scope 1 emissions allocated to vehicle assets of type fleet vehicle."
      },
      "AllocScope1EmssnPrivateJets": {
        "type": "double",
        "description": "The scope 1 emissions allocated to vehicle assets of type private jet."
      },
      "AllocScope2EmssnFleetVehicles": {
        "type": "double",
        "description": "The scope 2 emissions allocated to vehicle assets of type fleet vehicle."
      },
      "AllocScope2EmssnPrivateJets": {
        "type": "double",
        "description": "The scope 2 emissions allocated to vehicle assets of type private jet."
      },
      "AllocScope2LocBsdEmssnCmclBld": {
        "type": "double",
        "description": "The location-based scope 2 emissions allocated to stationary assets of type commercial building."
      },
      "AllocScope2LocBsdEmssnDataCtr": {
        "type": "double",
        "description": "The location-based scope 2 emissions allocated to stationary assets of type data center."
      },
      "AllocScope2MktBsdEmssnCmclBld": {
        "type": "double",
        "description": "The market-based scope 2 emissions allocated to stationary assets of type commercial building."
      },
      "AllocScope2MktBsdEmssnDataCtr": {
        "type": "double",
        "description": "The market-based scope 2 emissions allocated to stationary assets of type data center."
      },
      "AllocScope3EmssnDnstrmLsdAst": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to downstream leased assets across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp1EmssnWstGenInTco2e": {
        "type": "double",
        "description": "The scope 1 emissions allocated to waste generated in operations."
      },
      "AllocScp3EmssnBusTrvl": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to business travel across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnCptlGoods": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to capital goods across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnDnstrmTrnspDistr": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to downstream transportation and distribution across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnEmpCommute": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to employee commute across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnFranchises": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to franchises across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnFuelEnrgyActvty": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to fuel energy and activity across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnInvestments": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to investments across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnProcSoldPrdct": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to the processing of sold products across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnPurchGoodsSrvcs": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to purchased goods and services across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnUpstrmLsdAst": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to upstream leased assets across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnUpstrmTrnspDistr": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to upstream transportation and distribution across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnUseOfSoldPrdct": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to the use of sold products across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EmssnWstGenInOper": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to waste generated in operations across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3EndLifeTreatSoldPrdct": {
        "type": "double",
        "description": "The sum of scope 3 emissions allocated to end of life treatment of sold products across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocScp3UncategorizedEmssn": {
        "type": "double",
        "description": "The sum of uncategorized scope 3 emissions across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocSuplScope3DnstrmEmissions": {
        "type": "double",
        "description": "The sum of supplemental scope 3 downstream emissions across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocSuplScope3Emission": {
        "type": "double",
        "description": "The sum of supplemental scope 3 emissions across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AllocSuplScope3UpstrmEmissions": {
        "type": "double",
        "description": "The sum of supplemental scope 3 upstream emissions across the stationary asset carbon footprint, vehicle asset carbon footprint, and scope 3 carbon footprint."
      },
      "AnnualEmissionInventoryId": {
        "type": "reference",
        "description": "The annual emissions inventory related to the annual emissions inventory extension record."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      }
    },
    "module": "Net Zero Cloud"
  }
}