{
  "ApexClass": {
    "name": "ApexClass",
    "description": "Represents an Apex class.",
    "properties": {
      "ApiVersion": {
        "type": "double",
        "description": "The API version for this class. Every class has an API version specified at creation."
      },
      "Body": {
        "type": "textarea",
        "description": "The Apex class definition. Limit: 1 million characters."
      },
      "BodyCrc": {
        "type": "double",
        "description": "The CRC (cyclic redundancy check) of the class or trigger file."
      },
      "IsValid": {
        "type": "boolean",
        "description": "Indicates whether any dependent metadata has changed since the class was last compiled (true) or not (false). The default value is false."
      },
      "LengthWithoutComments": {
        "type": "int",
        "description": "Length of the class without comments."
      },
      "Name": {
        "type": "string",
        "description": "Name of the class. Limit: 255 characters"
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "Status": {
        "type": "picklist",
        "description": "The current status of the Apex class. The following string values are valid: Active—The class is active. Deleted—The class is marked for deletion. This is useful for managed packages, because it allows a class to be deleted when a managed package is updated. Inactive—This option is unused and is only supported for ApexTrigger. For more information, see the Metadata API Developer Guide."
      }
    },
    "module": "Core Salesforce"
  }
}