{
  "ApexTrigger": {
    "name": "ApexTrigger",
    "description": "Represents the saved copy of an Apex trigger. ApexTrigger uses the cached version of the class unless one is unavailable.",
    "properties": {
      "ApiVersion": {
        "type": "double",
        "description": "The API version for this trigger. Every trigger has an API version specified at creation."
      },
      "Body": {
        "type": "string",
        "description": "The Apex trigger definition. Limit: 1 million characters."
      },
      "BodyCrc": {
        "type": "double",
        "description": "The CRC (cyclic redundancy check) of the class or trigger file."
      },
      "EntityDefinitionId": {
        "type": "string",
        "description": "The Id of the EntityDefinition object associated with this object."
      },
      "IsValid": {
        "type": "boolean",
        "description": "Indicates whether any dependent metadata has changed since the trigger was last compiled (true) or not (false)."
      },
      "LengthWithoutComments": {
        "type": "int",
        "description": "Length of the trigger without comments."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "Metadata": {
        "type": "ApexTriggerMetadata",
        "description": "An object that describes the version, status, and packaged versions of the corresponding Apex trigger."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the Apex trigger. The following string values are valid: Active—The trigger is active. Inactive—The trigger is inactive, but not deleted. Deleted—The trigger is marked for deletion. This status is useful for managed packages, because it allows a class to be deleted when a managed package is updated. Note Apex triggers cannot be deactivated using Tooling API. You can deactivate Apex triggers using Metadata API. Consider using custom metadata records and include logic in your trigger to bypass trigger configuration logic. For more information, see the Metadata API Developer Guide."
      },
      "UsageAfterDelete": {
        "type": "boolean",
        "description": "Specifies whether the trigger is an after delete trigger (true) or not (false)."
      },
      "UsageAfterInsert": {
        "type": "boolean",
        "description": "Specifies whether the trigger is an after insert trigger (true) or not (false)."
      },
      "UsageAfterUndelete": {
        "type": "boolean",
        "description": "Specifies whether the trigger is an after undelete trigger (true) or not (false)."
      },
      "UsageAfterUpdate": {
        "type": "boolean",
        "description": "Specifies whether the trigger is an after update trigger (true) or not (false)."
      },
      "UsageBeforeDelete": {
        "type": "boolean",
        "description": "Specifies whether the trigger is a before delete trigger (true) or not (false)."
      },
      "UsageBeforeInsert": {
        "type": "boolean",
        "description": "Specifies whether the trigger is an before insert trigger (true) or not (false)."
      },
      "UsageBeforeUpdate": {
        "type": "boolean",
        "description": "Specifies whether the trigger is an before update trigger (true) or not (false)."
      },
      "UsageIsBulk": {
        "type": "boolean",
        "description": "Specifies whether the trigger is defined as a bulk trigger (true) or not (false)."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_apextrigger.htm"
  }
}