{
  "ApexLog": {
    "name": "ApexLog",
    "description": "Represents a debug log containing information about a transaction, including information about Apex, Visualforce, and workflow and validation rules.",
    "properties": {
      "Application": {
        "type": "string",
        "description": "This value depends on the client type that triggered the log. For API clients, this value is the client ID. For browser clients, this value is Browser."
      },
      "DurationMilliseconds": {
        "type": "int",
        "description": "Duration of the transaction in milliseconds."
      },
      "Location": {
        "type": "picklist",
        "description": "Specifies the location of the origin of the log. Values are: Monitoring—Log is generated as part of debug log monitoring. These types of logs are maintained for seven days or until a user deletes them. SystemLog—Log is generated from the Developer Console. These types of logs are maintained for 24 hours or until the user clears them."
      },
      "LogLength": {
        "type": "int",
        "description": "Length of the log in bytes."
      },
      "LogUserId": {
        "type": "reference",
        "description": "ID of the user whose actions triggered the debug log."
      },
      "Operation": {
        "type": "string",
        "description": "Name of the operation that triggered the debug log, such as APEXSOAP, Apex Sharing Recalculation, and so on."
      },
      "Request": {
        "type": "string",
        "description": "Request type. Values are: API—Request came from the API Application—Request came from the Salesforce user interface"
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "The unique identifier of the request that triggered the debug log. Use this request identifier to correlate multiple debug logs triggered by the same request."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "Start time of the transaction."
      },
      "Status": {
        "type": "string",
        "description": "Status of the transaction. This value is either Success, or the text of an unhandled Apex exception."
      }
    },
    "module": "Core Salesforce"
  }
}