{
  "AppExtension": {
    "name": "AppExtension",
    "description": "Represents a connection between the Field Service mobile app and another app, typically for passing record data to the Salesforce mobile app or other apps.",
    "properties": {
      "AppExtensionLabel": {
        "type": "string",
        "description": "The label in the UI for the app extension."
      },
      "AppExtensionName": {
        "type": "string",
        "description": "The API name of the app extension."
      },
      "FieldServiceMobileSettingsId": {
        "type": "reference",
        "description": "The ID of a set of field service mobile settings."
      },
      "InstallationUrl": {
        "type": "string",
        "description": "The URL that takes the user to the app install location, such as the App Store or Google Play."
      },
      "LaunchValue": {
        "type": "string",
        "description": "A value directing the Field Service app to the appropriate app extension. The Launch Value can be a static URL or a dynamic value that you can represent with certain tokens. These tokens pass field information from the record that the user is currently viewing. The basic format for these tokens is based on the field names; for example: {!$Name}."
      },
      "ScopedToObjectTypes": {
        "type": "string",
        "description": "Indicates the types of records from which the app extension can be activated. Scoping an app extension to an object lets users activate the app extension from records of the specified type. For example, to scope to both work orders and service appointments you would use the value WorkOrder,ServiceAppointment."
      },
      "Type": {
        "type": "picklist",
        "description": "A picklist of types of app extensions: iOS, Android, Flow, and Lightning Apps"
      }
    },
    "module": "Field Service Lightning",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.field_service_dev.meta/field_service_dev/sforce_api_objects_appextension.htm"
  }
}