{
  "ApplicationRecommender": {
    "name": "ApplicationRecommender",
    "description": "Represents a junction between an individual application and the recommender of the application.",
    "properties": {
      "ApplicationId": {
        "type": "reference",
        "description": "The individual application that's associated with the recommender."
      },
      "DoesSendSurvey": {
        "type": "boolean",
        "description": "Indicates whether automation sends a recommendation survey to the recommender (true) or not (false). This field is available in API version 62.0 and later."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates whether the record is locked (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible the user accessed this record or list view (LastReferencedDate) but didn’t view it."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates whether the record can be edited (true) or not (false)."
      },
      "Name": {
        "type": "string",
        "description": "The name for this record."
      },
      "RecommendationStatus": {
        "type": "picklist",
        "description": "Specifies the status of the recommendation."
      },
      "RecommenderId": {
        "type": "reference",
        "description": "The contact associated with the application as a recommender."
      },
      "SubmittedDate": {
        "type": "date",
        "description": "Specifies the date on which the recommendation was submitted."
      },
      "SurveyDeveloperName": {
        "type": "string",
        "description": "The developer name of the survey sent to the recommender. This field is available in API version 62.0 and later."
      },
      "SurveySubject": {
        "type": "string",
        "description": "The ID of the survey subject record. Used for tracking recommender types. This field is available in API version 62.0 and later."
      },
      "VerificationDate": {
        "type": "date",
        "description": "The date and time of the recommendation verification. This field is available in API version 62.0 and later."
      },
      "VerificationStatus": {
        "type": "picklist",
        "description": "The verification status of the application. This field is available in API version 62.0 and later."
      }
    },
    "module": "Education Cloud"
  }
}