{
  "AppMenuItem": {
    "name": "AppMenuItem",
    "description": "Represents the organization’s default settings for items in the app menu or App Launcher.",
    "properties": {
      "ApplicationId": {
        "type": "reference",
        "description": "The 15-character ID for the menu item."
      },
      "CanvasAccessMethod": {
        "type": "picklist",
        "description": "The access method for the canvas app. Values can be: Get—OAuth Webflow Post—Signed Request"
      },
      "CanvasEnabled": {
        "type": "boolean",
        "description": "Indicates if the app menu item is a canvas app (true) or not (false). The default setting is false."
      },
      "CanvasOptions": {
        "type": "string",
        "description": "Represents the options enabled for a canvas connected app. The options are: PersonalEnabled—The app is enabled as a canvas personal app. HideHeader—The publisher header, which contains the “What are you working on?” text, is hidden. HideShare—The publisher Share button is hidden. This field is available in API version 34.0 and later."
      },
      "CanvasReferenceId": {
        "type": "string",
        "description": "The canvas app unique identifier."
      },
      "CanvasSelectedLocations": {
        "type": "string",
        "description": "The selected locations for the canvas app which define where the canvas app can appear in the user interface. For example:Chatter,ChatterFeed,Publisher,ServiceDesk"
      },
      "CanvasUrl": {
        "type": "url",
        "description": "The URL of the canvas app."
      },
      "Description": {
        "type": "string",
        "description": "A description of this menu item."
      },
      "IconUrl": {
        "type": "url",
        "description": "The icon for the menu item’s application."
      },
      "InfoUrl": {
        "type": "url",
        "description": "The URL for more information about the application."
      },
      "IsAccessible": {
        "type": "boolean",
        "description": "If true, the current user is authorized to use the app. The default setting is false."
      },
      "IsRegisteredDeviceOnly": {
        "type": "boolean",
        "description": "If true, indicates that the app is available to registered devices only. The default setting is false. Available in API version 49.0 and later."
      },
      "IsUsingAdminAuthorization": {
        "type": "boolean",
        "description": "If true, the app is pre-authorized for certain users by the administrator. The default setting is false."
      },
      "IsVisible": {
        "type": "boolean",
        "description": "If true, the app is visible to users of the organization. The default setting is false."
      },
      "Label": {
        "type": "string",
        "description": "The app’s name."
      },
      "LogoUrl": {
        "type": "url",
        "description": "The logo for the menu item’s application. The default is the initials of the Label value."
      },
      "MobileAppBinaryId": {
        "type": "string",
        "description": "The URL for the Mobile App Binary file."
      },
      "MobileAppInstallUrl": {
        "type": "url",
        "description": "The location mobile users are directed to install the app. Available in API version 49.0 and later."
      },
      "MobileAppInstalledDate": {
        "type": "dateTime",
        "description": "The date and time that a user installed a mobile app. Available in API version 49.0 and later."
      },
      "MobileAppInstalledVersion": {
        "type": "string",
        "description": "The version of the user’s installed mobile app. Available in API version 49.0 and later."
      },
      "MobileAppVer": {
        "type": "string",
        "description": "The version number of the mobile app. Available in API version 49.0 and later."
      },
      "MobileDeviceType": {
        "type": "string",
        "description": "The supported device form factors for the mobile app. Available in API version 49.0 and later."
      },
      "MobileMinOsVer": {
        "type": "string",
        "description": "The minimum version required for the app. Available in API version 49.0 and later."
      },
      "MobilePlatform": {
        "type": "picklist",
        "description": "The mobile platform for the app. Possible values include: android – Android ios – iOS Available in API version 49.0 and later."
      },
      "MobileStartUrl": {
        "type": "url",
        "description": "The location mobile users are directed to after they’ve authenticated. This field is used with connected apps and Experience Builder sites. For sites only, this location is a fully qualified domain name. For other apps, it’s a relative URL."
      },
      "Name": {
        "type": "string",
        "description": "The API name of the item."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values: In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "SortOrder": {
        "type": "int",
        "description": "The index value that controls where this item appears in the menu. For example, a menu item with a sort order of 5 appears between items with sort order values of 3 and 9."
      },
      "StartUrl": {
        "type": "url",
        "description": "For a connected app, the location users are directed to after they’ve authenticated. Otherwise, the application’s default start page."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of application represented by this item. The types are: ConnectedApplication Network ServiceProvider TabSet"
      },
      "UserSortOrder": {
        "type": "int",
        "description": "The index value that represents where the user set this item in the menu (or App Launcher). For example, an item with a sort order value of 5 appears between items with sort order values of 3 and 9. This value is separate from SortOrder so you can create logic incorporating both values. For example, if you want the user-sorted items to appear first, followed by the organization order for the rest, use: SELECT ApplicationId,SortOrder,UserSortOrder FROM AppMenuItem order by userSortOrder NULLS LAST, sortOrder NULLS LAST"
      }
    },
    "module": "Core Salesforce"
  }
}