{
  "AppointmentSchedulingPolicy": {
    "name": "AppointmentSchedulingPolicy",
    "description": "Represents a set of rules for scheduling appointments using Salesforce Scheduler.",
    "properties": {
      "AppointmentAssignmentPolicyId": {
        "type": "reference",
        "description": "The name or ID of the appointment assignment policy. This is a relationship field, available in version 52.0 and later."
      },
      "AppointmentStartTimeInterval": {
        "type": "picklist",
        "description": "The proposed time interval in minutes between appointment start times. For example, set the interval to 15. Appointments can then begin at the top of the hour and at 15-minute intervals thereafter (10:00 AM, 10:15 AM, 10:30 AM, and so on). Possible values are: 5 10 15 20 30 45 60 90 120 150 180 240 300 360 420 480"
      },
      "DeveloperName": {
        "type": "string",
        "description": "The API name of the AppointmentSchedulingPolicy object."
      },
      "ExtCalEventHandlerId": {
        "type": "reference",
        "description": "The API name of the custom Apex class that checks service resources’ external calendar events and returns the time slots where service resources are already booked. Available in API version 50.0 and later."
      },
      "IsOrgDefault": {
        "type": "boolean",
        "description": "Indicates whether this scheduling policy is the default appointment scheduling policy for Lightning Scheduler appointments in this org."
      },
      "IsSvcTerrOpHoursWithShiftsUsed": {
        "type": "boolean",
        "description": "Indicates whether this scheduling policy considers the intersection of shifts and service territory operating hours when determining the availability of service resources for appointments (true). The default value is false. Available in API version 56.0 and later."
      },
      "IsSvcTerritoryMemberShiftUsed": {
        "type": "boolean",
        "description": "Indicates whether this scheduling policy considers shifts of service territory members when determining the availability of service resources for appointments (true). The default value is false. Available in API version 56.0 and later."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the appointment scheduling policy."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label for the appointment scheduling policy."
      },
      "ShouldConsiderCalendarEvents": {
        "type": "boolean",
        "description": "Indicates whether this policy checks the Salesforce calendar for resource availability."
      },
      "ShouldEnforceExcludedResource": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy prevents excluded service resources from being assigned to appointments."
      },
      "ShouldEnforceRequiredResource": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy allows only required service resources to be assigned to appointments."
      },
      "ShouldMatchSkill": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy allows only required service resources who have certain skills to be assigned to appointments."
      },
      "ShouldMatchSkillLevel": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy allows only required service resources who have certain skills and skill levels to be assigned to appointments."
      },
      "ShouldRespectVisitingHours": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy prevents users from scheduling appointments outside of an account’s visiting hours."
      },
      "ShouldUsePrimaryMembers": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy allows only service resources who are primary members of a service territory to be assigned to appointments."
      },
      "ShouldUseSecondaryMembers": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy allows service resources who are secondary members of a service territory to be assigned to appointments."
      }
    },
    "module": "Scheduler"
  }
}