{
  "AppointmentInvitation": {
    "name": "AppointmentInvitation",
    "description": "Represents information about an appointment invitation that’s created for customers who can use it for booking appointments.",
    "properties": {
      "AppointmentTopicId": {
        "type": "reference",
        "description": "Appointment topic that's associated with this invitation."
      },
      "AppointmentTopicType": {
        "type": "string",
        "description": "Type of appointment topic that's related to this invitation. For example, work type or work type group."
      },
      "AppointmentType": {
        "type": "picklist",
        "description": "Appointment type for the appointment invitation. This field is available in API version 57.0 and later."
      },
      "BookingEndDate": {
        "type": "date",
        "description": "Date until which an appointment can be booked by using the appointment invitation URL."
      },
      "BookingStartDate": {
        "type": "date",
        "description": "Date from which an appointment can be booked by using the appointment invitation URL.Default value: current date."
      },
      "EngagementChannelTypeId": {
        "type": "reference",
        "description": "Engagement channel type for the appointment invitation. For example, users can choose video call as the engagement channel type when they create an appointment invitation. This field is available in API version 57.0 and later."
      },
      "InvitationIdentifier": {
        "type": "string",
        "description": "Invitation URL identifier that’s used to book an appointment in a flow."
      },
      "InvitationNumber": {
        "type": "string",
        "description": "Auto-assigned number that identifies the appointment invitation."
      },
      "InvitationUrl": {
        "type": "url",
        "description": "Appointment invitation URL that’s shared with users to book appointments."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the invitation URL is available for a customer to book an appointment."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Date on which the appointment invitation was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Date on which the appointment invitation was last viewed."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Owner of the appointment invitation."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "Service territory that's associated with the appointment invitation."
      },
      "UrlExpiryDate": {
        "type": "date",
        "description": "Expiration date of the appointment invitation URL."
      }
    },
    "module": "Scheduler"
  }
}