{
  "ApptBundlePropagatePolicy": {
    "name": "ApptBundlePropagatePolicy",
    "description": "Policy that defines which property values are inherited from the bundle to the bundle members or are assigned as constant values in the bundle members.",
    "properties": {
      "AdditionalConstantValue": {
        "type": "string",
        "description": "The additional constant value that is connected to the initial constant value to be added to the bundle members."
      },
      "BundleFieldName": {
        "type": "picklist",
        "description": "Name of the source field in the bundle from which the value is taken."
      },
      "BundleMemberFieldName": {
        "type": "picklist",
        "description": "Name of the target field in the bundle member where the value is inherited from the bundle."
      },
      "BundlePolicyId": {
        "type": "reference",
        "description": "ID of the parent bundle policy."
      },
      "ConstantValue": {
        "type": "string",
        "description": "The constant value to be added to the bundle members."
      },
      "DateValue": {
        "type": "picklist",
        "description": "Represents how the date value is determined."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "Name": {
        "type": "string",
        "description": "The name of the appointment bundle propagation policy."
      },
      "ShouldAddConstantValue": {
        "type": "boolean",
        "description": "Indicates if you want to enable adding a constant value to the bundle members."
      },
      "ShouldUpdateOnAdd": {
        "type": "boolean",
        "description": "Indicates if you want to enable updating the fields of the bundle members when they are added to the bundle."
      },
      "ShouldUpdateOnRemove": {
        "type": "boolean",
        "description": "Indicates if you want to enable updating the fields of the bundle members when they are removed from the bundle."
      },
      "ShouldUpdateOnUnbundle": {
        "type": "boolean",
        "description": "Indicates if you want to enable updating the fields of the bundle members when performing the Unbundle action."
      }
    },
    "module": "Field Service Lightning"
  }
}