{
  "ArchiveActivity": {
    "name": "ArchiveActivity",
    "description": "Represents metadata retrieved for a single Archive process initiated by an action. Retrieved metadata can include status tracking, start and end times, record counts, and monitoring and auditing outcomes.",
    "properties": {
      "ArchivePolicyId": {
        "type": "reference",
        "description": "ID of the associated policy that triggered the process. Links each execution back to its configuration."
      },
      "AttemptedRootRecordsCount": {
        "type": "int",
        "description": "The number of root records that the action tried to process. Excludes records that were filtered out before processing began."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The date and time that the process executed successfully, or was terminated due to error."
      },
      "FailedCount": {
        "type": "int",
        "description": "The number of records that failed to process due to errors such as validation failures, missing references, or system exceptions."
      },
      "FailureReason": {
        "type": "string",
        "description": "Description of why process failed or only partially completed. Can include system error messages or policy-level failures."
      },
      "Name": {
        "type": "string",
        "description": "The autogenerated name of the action instance."
      },
      "ProgressPercentage": {
        "type": "double",
        "description": "The percentage of records that were successfully processed."
      },
      "RecordsSizeInMb": {
        "type": "double",
        "description": "Estimated total size, in megabytes (MB), of the records processed during an action, including metadata and payload."
      },
      "SkippedRootRecordsCount": {
        "type": "int",
        "description": "The number of root records skipped due to validation errors, exclusion filters, or data protection thresholds."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The date and time that the action started."
      },
      "Status": {
        "type": "picklist",
        "description": ""
      },
      "SucceededCount": {
        "type": "int",
        "description": "The number of records processed successfully."
      },
      "TotalRecordCount": {
        "type": "int",
        "description": "The total number of records initially selected for processing, including successful, failed, and skipped records."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the type of archive process to be executed. This static enum categorizes the purpose or mode of the run.Valid values are: Analyzer Archive Archive-fail-to-delete Estimate Export Export-and-download Export-to-external-bucket Import-data-archive Import-data-load Index-request None Purge Purge-by-retention Purge-estimation RTBF-SDK Unarchive Unarchive-retry Unarchive-sdk"
      }
    },
    "module": "Core Salesforce"
  }
}