{
  "AssessmentQuestionVersion": {
    "name": "AssessmentQuestionVersion",
    "description": "Stores the question versions for the assessment questions.",
    "properties": {
      "ActivationDateTime": {
        "type": "dateTime",
        "description": "The date when the assessment question version was set to active."
      },
      "AdditionalInformation": {
        "type": "textarea",
        "description": "The additional details for an UI element, such as the disclosure text."
      },
      "AssessmentQuestionId": {
        "type": "reference",
        "description": "Required. The ID of the assessment question associated with this record."
      },
      "AssessmentQuestionSourceDocId": {
        "type": "reference",
        "description": "The ID of the assessment question source document that's associated with the assessment question version."
      },
      "DataType": {
        "type": "picklist",
        "description": "The data type of the assessment question associated with this record."
      },
      "DeactivationDateTime": {
        "type": "dateTime",
        "description": "The date when the assessment question version was set to inactive."
      },
      "Description": {
        "type": "textarea",
        "description": "The description for the assessment question. This text is not rendered on the assessment."
      },
      "DisplayTextCategory": {
        "type": "picklist",
        "description": "Specifies the category of the display text when the data type is Text Block."
      },
      "HelpText": {
        "type": "string",
        "description": "The text that's added as an infobubble in the UI element related to the assessment question."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the current version of the assessment question is set to active (true) or not (false)."
      },
      "IsOptionSourceResponseValue": {
        "type": "boolean",
        "description": "Indicates whether the response value source for an assessment question is configured as custom or SObject in the OmniStudio designer (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the assessment question version record."
      },
      "QuestionCreationType": {
        "type": "picklist",
        "description": "Specifies how the assessment question is created from the assessment question source document."
      },
      "QuestionText": {
        "type": "textarea",
        "description": "Required. The assessment question text. Holds the label for the assessment question that appears on the assessment."
      },
      "ResponseValues": {
        "type": "textarea",
        "description": "Specifies the values to be defined in the picklist, multiselect picklist, or radio buttons."
      },
      "Status": {
        "type": "string",
        "description": "The status of the assessment question version."
      },
      "VersionNumber": {
        "type": "int",
        "description": "The assessment question version number."
      }
    },
    "module": "Public Sector Cloud"
  }
}