{
  "Assessment": {
    "name": "Assessment",
    "description": "Stores the header data for an assessment.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The ID of the account for which the assessment was taken."
      },
      "ApplicantId": {
        "type": "reference",
        "description": "The applicant for whom the assessment was carried out. This field is available only if you have enabled Integrated Onboarding for Financial Services Cloud."
      },
      "AssessmentRating": {
        "type": "picklist",
        "description": "The overall rating for the assessment."
      },
      "AssessmentStagedDataId": {
        "type": "reference",
        "description": "The Assessment Staged Data that's associated with this assessment."
      },
      "AssessmentStatus": {
        "type": "picklist",
        "description": "Required. The status of the assessment."
      },
      "AssessorId": {
        "type": "reference",
        "description": "The person who carried out the assessment and recorded the responses."
      },
      "CareProgramSiteId": {
        "type": "reference",
        "description": "Stores the derived Care Program Site Identifier when the site assessment is done in the context of care program sites. This field is available in API version 63.0 when Site Management is enabled."
      },
      "CaseId": {
        "type": "reference",
        "description": "The ID of the case associated with the assessment."
      },
      "CompletedDateTime": {
        "type": "dateTime",
        "description": "The date and time when the assessment was completed."
      },
      "ContactId": {
        "type": "reference",
        "description": "The ID of the contact associated with the assessment."
      },
      "EffectiveDateTime": {
        "type": "dateTime",
        "description": "The timestamp from when the assessment is effective."
      },
      "ExpirationDateTime": {
        "type": "dateTime",
        "description": "The timestamp from when the assessment lapses."
      },
      "ExternalAssessmentDefId": {
        "type": "reference",
        "description": "The associated external assessment definition."
      },
      "Identifier": {
        "type": "string",
        "description": "The unique identifier of a completed or partially completed assessment in the source system."
      },
      "IsSavedForLater": {
        "type": "boolean",
        "description": "Indicates whether the assessment is saved as a draft (true) or not (false). The default value is false. This field is available in API version 60.0 and later."
      },
      "IsSuggestedAssessment": {
        "type": "boolean",
        "description": "Indicates whether the assessment is a suggested assessment (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the assessment."
      },
      "OmniProcessId": {
        "type": "reference",
        "description": "The OmniScript associated with the assessment record. This field is available in API version 56.0 and later."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who created the relationship record."
      },
      "ParentId": {
        "type": "reference",
        "description": "The ID of the related assessment, if any."
      },
      "PartyProfileId": {
        "type": "reference",
        "description": "Represents information about the profile of a party, such as a contact, account, or lead. This field is available only if you’ve enabled the Know Your Customer setting in your Salesforce org."
      },
      "ResponseContextId": {
        "type": "reference",
        "description": "The record in which context the response was taken. This field is available in API version 56.0 and later where Public Sector Solutions is enabled."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the type of assessment. This field is available only if you have enabled Integrated Onboarding for Financial Services Cloud."
      }
    },
    "module": "Public Sector Cloud"
  }
}