{
  "AssessmentTask": {
    "name": "AssessmentTask",
    "description": "Perform activities such as planogram check, inventory check, promotion check, in-store survey, or custom task in stores to capture information.",
    "properties": {
      "AssessmentTaskDefinitionId": {
        "type": "reference",
        "description": "The assessment task definition that is referenced for the task. This field is available in API version 48.0 and later."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of task that has to be performed at the store."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "Time when the task is completed by a field rep. This field is available in API version 49.0 and later."
      },
      "IsRequired": {
        "type": "boolean",
        "description": "Indicate whether a task must be completed to complete a visit. The default value is False. This field is available in API version 48.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "Unique identification of the task."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the assessment task record owner."
      },
      "ParentId": {
        "type": "reference",
        "description": "The visit associated with an assessment task.This field is available in API version 48.0 and later."
      },
      "SequenceNumber": {
        "type": "int",
        "description": "The sequence in which the tasks must be performed. This field is available in API version 48.0 and later."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "Time when the task is started by a field rep. This field is available in API version 49.0 and later."
      },
      "Status": {
        "type": "picklist",
        "description": "View the status of a task. This field is available in API version 48.0 and later."
      },
      "TaskDefinitionId": {
        "type": "reference",
        "description": "Reference to related records such as signature task, delivery task, other Component task, flow, and SFDC task. This field is a polymorphic relationship field. This field is available in API version 48.0 and later."
      },
      "TaskType": {
        "type": "picklist",
        "description": "Type of a task that the sales rep can perform during the visit. The task type must match the task type of the assessment task definition."
      }
    },
    "module": "Consumer Goods Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.retail_api.meta/retail_api/sforce_api_objects_assessmenttask.htm"
  }
}