{
  "Asset": {
    "name": "Asset",
    "description": "Represents an item of commercial value, such as a product sold by your company or a competitor, that a customer has purchased.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "(Required) ID of the Account associated with this asset. Must be a valid account ID. Required if ContactId isn’t specified.",
        "format": "salesforce-id",
        "x-object": "Account",
        "maxLength": 18,
        "nullable": true
      },
      "Address": {
        "type": "address",
        "description": "Represents the physical address or geolocation of the asset."
      },
      "AssetLevel": {
        "type": "int",
        "description": "The asset’s position in an asset hierarchy. If the asset has no parent or child assets, its level is 1. Assets that belong to a hierarchy have a level of 1 for the root asset, 2 for the child assets of the root asset, 3 for their children, and so forth. On assets created before the introduction of this field, the asset level defaults to –1. After the asset record is updated, the asset level is calculated and automatically updated.",
        "nullable": true,
        "readOnly": true
      },
      "AssetProvidedById": {
        "type": "reference",
        "description": "The account that provided the asset, typically a manufacturer.",
        "format": "salesforce-id",
        "x-object": "Account",
        "maxLength": 18,
        "nullable": true
      },
      "AssetServicedById": {
        "type": "reference",
        "description": "The account in charge of servicing the asset.",
        "format": "salesforce-id",
        "x-object": "Account",
        "maxLength": 18,
        "nullable": true
      },
      "AssetTypeId": {
        "type": "reference",
        "description": "The asset type associated with the asset."
      },
      "Availability": {
        "type": "percent",
        "description": "The percentage of expected uptime where the asset was available for use.",
        "format": "percent",
        "nullable": true,
        "readOnly": true,
        "multipleOf": 0.01
      },
      "AveragetimetoRepair": {
        "type": "double",
        "description": "Represents the number of hours it typically takes to repair an asset after a failure."
      },
      "AveragetimeBetweenFailure": {
        "type": "double",
        "description": "Represents the number of hours that typically elapses before the asset is likely to fail again."
      },
      "AverageUptimePerDay": {
        "type": "double",
        "description": "The average number of hours per day the asset is expected to be available for use.",
        "nullable": true,
        "multipleOf": 0.01
      },
      "City": {
        "type": "string",
        "description": "The city detail for the address."
      },
      "ConsequenceOfFailure": {
        "type": "picklist",
        "description": "The business impact associated with the asset’s failure. Using this field, you can address the asset’s health and take action using Flows. To enable this field, use Object Manager to update the field availability. Make sure that the field is visible for field-level security and for page layout. To learn more, see What Determines Field Access. The picklist values aren’t predefined in orgs created before Winter ’22 that aren’t Field Service enabled. This field is available in API version 53.0 and later."
      },
      "ContactId": {
        "type": "reference",
        "description": "Required if AccountId isn’t specified. ID of the Contact associated with this asset. Must be a valid contact ID that has an account parent (but doesn’t need to match the asset’s AccountId).",
        "format": "salesforce-id",
        "x-object": "Contact",
        "maxLength": 18,
        "nullable": true
      },
      "Country": {
        "type": "String",
        "description": "The country detail for the address."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Three-letter ISO 4217 currency code associated with the invoice. The default value is USD."
      },
      "CurrentAmount": {
        "type": "currency",
        "description": "Reserved for future use. This field is available in API version 50.0 and later. This field is available when CPQ Plus, Salesforce Billing, or Subscription Management is enabled.",
        "format": "currency",
        "nullable": true,
        "readOnly": true,
        "multipleOf": 0.01
      },
      "CurrentLifecycleEndDate": {
        "type": "dateTime",
        "description": "Represents the end of the period shown as current. System-populated field inherited from the end date of the current asset state period. If that field is empty, as with an evergreen subscription, the Current Lifecycle End Date field is also empty. This field is available in API version 50.0 and later. This field is available when CPQ Plus, Salesforce Billing, or Subscription Management is enabled.",
        "format": "date-time",
        "nullable": true,
        "readOnly": true
      },
      "CurrentMrr": {
        "type": "currency",
        "description": "The asset’s monthly recurring revenue during the current asset state period. System-populated field inherited from the monthly recurring revenue on the current asset state period. If no asset state period is current, the value is 0. Label is Current Monthly Recurring Revenue. This field is available in API version 50.0 and later. This field is available when CPQ Plus, Salesforce Billing, or Subscription Management is enabled.",
        "format": "currency",
        "nullable": true,
        "readOnly": true,
        "multipleOf": 0.01
      },
      "CurrentQuantity": {
        "type": "double",
        "description": "The asset’s quantity during the current asset state period. System-populated field inherited from the quantity on the current asset state period. If no asset state period is current, the value is 0. This field is available in API version 50.0 and later. This field is available when CPQ Plus, Salesforce Billing, or Subscription Management is enabled.",
        "nullable": true,
        "readOnly": true,
        "multipleOf": 0.01
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the asset.",
        "maxLength": 32000,
        "nullable": true
      },
      "DigitalAssetStatus": {
        "type": "picklist",
        "description": "Status of digital tracking of the asset. The default picklist includes the following values: On Off Warning Error",
        "format": "enum",
        "enum": [
          "On",
          "Off",
          "Warning",
          "Error"
        ],
        "maxLength": 255,
        "nullable": true
      },
      "ExternalIdentifier": {
        "type": "string",
        "description": "The ID of the matching record in an external system. This field is available in API version 49.0 and later.",
        "maxLength": 255,
        "nullable": true
      },
      "GeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the address."
      },
      "HasLifecycleManagement": {
        "type": "boolean",
        "description": "True if this asset is a lifecycle-managed asset, otherwise false. You can’t switch an asset to a lifecycle-managed asset or the reverse. This field is system populated.",
        "nullable": false,
        "readOnly": true
      },
      "InstallDate": {
        "type": "date",
        "description": "Date when the asset was installed.",
        "format": "date",
        "nullable": true
      },
      "IsCompetitorProduct": {
        "type": "boolean",
        "description": "Indicates whether this Asset represents a product sold by a competitor (true) or not (false). The default value is false. Its UI label is Competitor Asset.",
        "nullable": false
      },
      "IsInternal": {
        "type": "boolean",
        "description": "Indicates that the asset is produced or used internally (true) or not (false). The default value is false. Its UI label is Internal Asset.",
        "nullable": false
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that the asset was last modified. Its UI label is Last Modified Date.",
        "format": "date-time",
        "nullable": true,
        "readOnly": true
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time that the asset was last viewed.",
        "format": "date-time",
        "nullable": true,
        "readOnly": true
      },
      "Latitude": {
        "type": "double",
        "description": "Used with Longitude to specify the precise geolocation of the address."
      },
      "LifecycleEndDate": {
        "type": "dateTime",
        "description": "Represents the end of the asset’s lifecycle. System-populated field inherited from the end date of the final asset state period. If that field is empty, as with an evergreen subscription, the lifecycle has no end date. This field is available in API version 50.0 and later. This field is available when CPQ Plus, Salesforce Billing, or Subscription Management is enabled.",
        "format": "date-time",
        "nullable": true,
        "readOnly": true
      },
      "LifecycleStartDate": {
        "type": "dateTime",
        "description": "Represents the beginning of the asset’s lifecycle. System-populated field inherited from the start date of the earliest asset state period. This field can’t be edited. When a new asset action affects the start date of an asset state period, the period is deleted and a new one is generated. This field is available in API version 50.0 and later. This field is available when CPQ Plus, Salesforce Billing, or Subscription Management is enabled.",
        "format": "date-time",
        "nullable": true,
        "readOnly": true
      },
      "LocationId": {
        "type": "reference",
        "description": "The asset’s location. Typically, this location is the place where the asset is stored, such as a warehouse or van.",
        "format": "salesforce-id",
        "x-object": "Location",
        "maxLength": 18,
        "nullable": true
      },
      "Longitude": {
        "type": "double",
        "description": "Used with Latitude to specify the precise geolocation of the address."
      },
      "ManufactureDate": {
        "type": "date",
        "description": "The date when the asset was manufactured. This field is available from API version 49.0 and later.",
        "format": "date",
        "nullable": true
      },
      "Name": {
        "type": "string",
        "description": "(Required) Name of the asset. Label is Asset Name.",
        "maxLength": 255,
        "nullable": false
      },
      "OwnerId": {
        "type": "reference",
        "description": "The asset’s owner. By default, the asset owner is the user who created the asset record. Its UI label is Asset Owner.",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false
      },
      "ParentId": {
        "type": "reference",
        "description": "The asset’s parent asset. Its UI label is Parent Asset.",
        "format": "salesforce-id",
        "x-object": "Asset",
        "maxLength": 18,
        "nullable": true
      },
      "PostalCode": {
        "type": "string",
        "description": "The postal code for the address."
      },
      "Price": {
        "type": "currency",
        "description": "Price paid for this asset.",
        "format": "currency",
        "nullable": true,
        "multipleOf": 0.01
      },
      "PricingSource": {
        "type": "picklist",
        "description": "Pricing source to use when amending or renewing an asset."
      },
      "Product2Id": {
        "type": "reference",
        "description": "(Optional) ID of the Product2 associated with this asset. Must be a valid Product2 ID. Its UI label is Product.",
        "format": "salesforce-id",
        "x-object": "Product2",
        "maxLength": 18,
        "nullable": true
      },
      "ProductCode": {
        "type": "string",
        "description": "The product code of the related product.",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "ProductDescription": {
        "type": "string",
        "description": "The product description of the related product.",
        "maxLength": 4000,
        "nullable": true,
        "readOnly": true
      },
      "ProductFamily": {
        "type": "picklist",
        "description": "The product family of the related product.",
        "format": "enum",
        "enum": [
          "None"
        ],
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "PurchaseDate": {
        "type": "date",
        "description": "Date on which this asset was purchased.",
        "format": "date",
        "nullable": true
      },
      "Quantity": {
        "type": "double",
        "description": "Quantity purchased or installed. The Quantity field value isn’t set by Customer Asset Lifecycle Management. Instead, you can populate the field as you need.",
        "nullable": true,
        "multipleOf": 0.01
      },
      "QuantityIncreasePricingType": {
        "type": "picklist",
        "description": "Specify which pricing type to use when the quantity of this asset is increased. Its UI label is Pricing Type for Quantity Increase. This field is available in API version 56.0 and later. This field is available when Subscription Management is enabled."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "The unique identifier for the asset.",
        "format": "salesforce-id",
        "x-object": "RecordType",
        "maxLength": 18,
        "nullable": true
      },
      "Reliability": {
        "type": "percent",
        "description": "The percentage of expected uptime where the asset wasn’t subject to unplanned downtime.",
        "format": "percent",
        "nullable": true,
        "readOnly": true,
        "multipleOf": 0.01
      },
      "RenewalPricingType": {
        "type": "picklist",
        "description": "The price used when renewing a subscription. Its UI label is Pricing Type for Renewal. This field is available in API version 55.0 and later. This field is available when Subscription Management is enabled."
      },
      "RenewalTerm": {
        "type": "double",
        "description": "With Renewal Term Unit, defines the default subscription term for renewal quotes. This field is available in API version 55.0 and later. This field is available when Subscription Management is enabled."
      },
      "RenewalTermUnit": {
        "type": "picklist",
        "description": "The unit of time for a subscription term. This field is available in API version 55.0 and later. This field is available when Subscription Management is enabled."
      },
      "RootAssetId": {
        "type": "reference",
        "description": "(Read only) The top-level asset in an asset hierarchy. Depending on where an asset lies in the hierarchy, its root could be the same as its parent. Its UI label is Root Asset.",
        "format": "salesforce-id",
        "x-object": "Asset",
        "maxLength": 18,
        "nullable": true,
        "readOnly": true
      },
      "SalesStoreId": {
        "type": "reference",
        "description": "ID of the RetailStore or WebStore associated with this Asset."
      },
      "SerialNumber": {
        "type": "string",
        "description": "Serial number for this asset.",
        "maxLength": 80,
        "nullable": true
      },
      "State": {
        "type": "string",
        "description": "The state detail for the address."
      },
      "Status": {
        "type": "picklist",
        "description": "Customizable picklist of values. The default picklist includes the following values: Purchased Shipped Installed Registered Obsolete",
        "format": "enum",
        "enum": [
          "Purchased",
          "Shipped",
          "Installed",
          "Registered",
          "Obsolete"
        ],
        "maxLength": 255,
        "nullable": true
      },
      "StatusReason": {
        "type": "picklist",
        "description": "The explanation of the device status. This field is available from API version 49.0 and later.",
        "format": "enum",
        "enum": [
          "Online",
          "Paused",
          "Standby",
          "Offline",
          "Not Ready",
          "Off"
        ],
        "maxLength": 255,
        "nullable": true
      },
      "StockKeepingUnit": {
        "type": "string",
        "description": "The SKU assigned to the related product.",
        "maxLength": 180,
        "nullable": true,
        "readOnly": true
      },
      "Street": {
        "type": "textarea",
        "description": "The street detail for the address."
      },
      "SumDowntime": {
        "type": "double",
        "description": "Accumulated downtime (planned and unplanned), determined as follows: When only UptimeRecordStart is set, the sum of all downtime from UptimeRecordStart When UptimeRecordStart and UptimeRecordEnd are set, the sum of all downtime from UptimeRecordStart to UptimeRecordEnd Otherwise, downtime isn’t accumulated.",
        "nullable": true,
        "readOnly": true,
        "multipleOf": 0.01
      },
      "SumUnplannedDowntime": {
        "type": "double",
        "description": "Accumulated unplanned downtime, determined as follows: When only UptimeRecordStart is set, the sum of all unplanned downtime from UptimeRecordStart When UptimeRecordStart and UptimeRecordEnd are set, the sum of all unplanned downtime from UptimeRecordStart to UptimeRecordEnd Otherwise, unplanned downtime isn’t accumulated.",
        "nullable": true,
        "readOnly": true,
        "multipleOf": 0.01
      },
      "TotalLifecycleAmount": {
        "type": "currency",
        "description": "The total amount of revenue for the asset, including revenue from each stage in the asset lifecycle. This field is available when CPQ Plus, Salesforce Billing, or Subscription Management is enabled."
      },
      "UptimeRecordEnd": {
        "type": "dateTime",
        "description": "The date until which SumDowntime and SumUnplannedDowntime are accumulated.",
        "format": "date-time",
        "nullable": true
      },
      "UptimeRecordStart": {
        "type": "dateTime",
        "description": "The date from which SumDowntime and SumUnplannedDowntime are accumulated.",
        "format": "date-time",
        "nullable": true
      },
      "UsageEndDate": {
        "type": "date",
        "description": "Date when usage for this asset ends or expires.",
        "format": "date",
        "nullable": true
      },
      "Uuid": {
        "type": "string",
        "description": "The unique ID for the asset. This field is available in API version 49.0 and later.",
        "maxLength": 255,
        "nullable": true
      },
      "Id": {
        "type": "string",
        "description": "Asset ID",
        "format": "salesforce-id",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "CreatedDate": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "CreatedById": {
        "type": "string",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "LastModifiedDate": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "LastModifiedById": {
        "type": "string",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "SystemModstamp": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Deleted",
        "nullable": false,
        "readOnly": true
      },
      "MayEdit": {
        "type": "boolean",
        "nullable": false,
        "readOnly": true
      },
      "IsLocked": {
        "type": "boolean",
        "nullable": false,
        "readOnly": true
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_asset.htm",
    "keyPrefix": "02i",
    "iconUrl": "icon/t4v35/standard/asset_object_120.png",
    "iconColor": "107CAD",
    "createable": true,
    "updateable": true,
    "deletable": true,
    "queryable": true,
    "searchable": true,
    "childRelationships": [
      {
        "childObject": "AIInsightValue",
        "field": "SobjectLookupValueId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "AIRecordInsight",
        "field": "TargetId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ActionPlan",
        "field": "TargetId",
        "relationshipName": "ActionPlans",
        "cascadeDelete": false
      },
      {
        "childObject": "ActivityHistory",
        "field": "WhatId",
        "relationshipName": "ActivityHistories",
        "cascadeDelete": true
      },
      {
        "childObject": "AssessmentTaskContentDocument",
        "field": "ContentContextId",
        "relationshipName": "ContentDocumentContext",
        "cascadeDelete": false
      },
      {
        "childObject": "Asset",
        "field": "ParentId",
        "relationshipName": "ChildAssets",
        "cascadeDelete": false
      },
      {
        "childObject": "Asset",
        "field": "RootAssetId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "AssetChangeEvent",
        "field": "ParentId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "AssetChangeEvent",
        "field": "RootAssetId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "AssetContactRole__c",
        "field": "Asset__c",
        "relationshipName": "Asset__r",
        "cascadeDelete": false
      },
      {
        "childObject": "AssetFeed",
        "field": "ParentId",
        "relationshipName": "Feeds",
        "cascadeDelete": true
      },
      {
        "childObject": "AssetHistory",
        "field": "AssetId",
        "relationshipName": "Histories",
        "cascadeDelete": true
      },
      {
        "childObject": "AssetRelationship",
        "field": "AssetId",
        "relationshipName": "PrimaryAssets",
        "cascadeDelete": true
      },
      {
        "childObject": "AssetRelationship",
        "field": "RelatedAssetId",
        "relationshipName": "RelatedAssets",
        "cascadeDelete": false
      },
      {
        "childObject": "AssetShare",
        "field": "AssetId",
        "relationshipName": "Shares",
        "cascadeDelete": true
      },
      {
        "childObject": "AssetTokenEvent",
        "field": "AssetId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "AttachedContentDocument",
        "field": "LinkedEntityId",
        "relationshipName": "AttachedContentDocuments",
        "cascadeDelete": true
      },
      {
        "childObject": "AttachedContentNote",
        "field": "LinkedEntityId",
        "relationshipName": "AttachedContentNotes",
        "cascadeDelete": true
      },
      {
        "childObject": "Attachment",
        "field": "ParentId",
        "relationshipName": "Attachments",
        "cascadeDelete": true
      },
      {
        "childObject": "Case",
        "field": "AssetId",
        "relationshipName": "Cases",
        "cascadeDelete": false
      },
      {
        "childObject": "CaseChangeEvent",
        "field": "AssetId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "CombinedAttachment",
        "field": "ParentId",
        "relationshipName": "CombinedAttachments",
        "cascadeDelete": true
      },
      {
        "childObject": "ContentDocumentLink",
        "field": "LinkedEntityId",
        "relationshipName": "ContentDocumentLinks",
        "cascadeDelete": true
      },
      {
        "childObject": "ContentVersion",
        "field": "FirstPublishLocationId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ContractLineItem",
        "field": "AssetId",
        "relationshipName": "ContractLineItems",
        "cascadeDelete": false
      },
      {
        "childObject": "ContractLineItemChangeEvent",
        "field": "AssetId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "DocumentChecklistItem",
        "field": "ParentRecordId",
        "relationshipName": "DocumentChecklistItemPR",
        "cascadeDelete": false
      },
      {
        "childObject": "EmailMessage",
        "field": "RelatedToId",
        "relationshipName": "Emails",
        "cascadeDelete": false
      },
      {
        "childObject": "EmailMessageChangeEvent",
        "field": "RelatedToId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "Entitlement",
        "field": "AssetId",
        "relationshipName": "Entitlements",
        "cascadeDelete": false
      },
      {
        "childObject": "EntitlementChangeEvent",
        "field": "AssetId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "EntitySubscription",
        "field": "ParentId",
        "relationshipName": "FeedSubscriptionsForEntity",
        "cascadeDelete": true
      },
      {
        "childObject": "Event",
        "field": "WhatId",
        "relationshipName": "Events",
        "cascadeDelete": true
      },
      {
        "childObject": "EventChangeEvent",
        "field": "WhatId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "EventRelation",
        "field": "RelationId",
        "relationshipName": "EventRelations",
        "cascadeDelete": true
      },
      {
        "childObject": "EventRelationChangeEvent",
        "field": "RelationId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "FeedComment",
        "field": "ParentId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "FeedItem",
        "field": "ParentId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "FlowExecutionErrorEvent",
        "field": "ContextRecordId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "FlowRecordRelation",
        "field": "RelatedRecordId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "Note",
        "field": "ParentId",
        "relationshipName": "Notes",
        "cascadeDelete": true
      },
      {
        "childObject": "NoteAndAttachment",
        "field": "ParentId",
        "relationshipName": "NotesAndAttachments",
        "cascadeDelete": true
      },
      {
        "childObject": "OpenActivity",
        "field": "WhatId",
        "relationshipName": "OpenActivities",
        "cascadeDelete": true
      },
      {
        "childObject": "OutgoingEmail",
        "field": "RelatedToId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ProcessInstance",
        "field": "TargetObjectId",
        "relationshipName": "ProcessInstances",
        "cascadeDelete": true
      },
      {
        "childObject": "ProcessInstanceHistory",
        "field": "TargetObjectId",
        "relationshipName": "ProcessSteps",
        "cascadeDelete": false
      },
      {
        "childObject": "RecordAction",
        "field": "RecordId",
        "relationshipName": "RecordActions",
        "cascadeDelete": true
      },
      {
        "childObject": "RecordActionHistory",
        "field": "ParentRecordId",
        "relationshipName": "RecordActionHistories",
        "cascadeDelete": false
      },
      {
        "childObject": "Task",
        "field": "WhatId",
        "relationshipName": "Tasks",
        "cascadeDelete": true
      },
      {
        "childObject": "TaskChangeEvent",
        "field": "WhatId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "TaskRelation",
        "field": "RelationId",
        "relationshipName": "TaskRelations",
        "cascadeDelete": true
      },
      {
        "childObject": "TaskRelationChangeEvent",
        "field": "RelationId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "TopicAssignment",
        "field": "EntityId",
        "relationshipName": "TopicAssignments",
        "cascadeDelete": true
      },
      {
        "childObject": "Visit",
        "field": "ContextId",
        "relationshipName": "Contexts",
        "cascadeDelete": false
      },
      {
        "childObject": "WorkOrder",
        "field": "AssetId",
        "relationshipName": "WorkOrders",
        "cascadeDelete": false
      },
      {
        "childObject": "WorkOrderChangeEvent",
        "field": "AssetId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "WorkOrderLineItem",
        "field": "AssetId",
        "relationshipName": "WorkOrderLineItems",
        "cascadeDelete": false
      },
      {
        "childObject": "WorkOrderLineItemChangeEvent",
        "field": "AssetId",
        "relationshipName": null,
        "cascadeDelete": false
      }
    ]
  }
}