{
  "AssetStatePeriod": {
    "name": "AssetStatePeriod",
    "description": "Represents a time span when an asset has the same quantity, amount, and monthly recurring revenue (MRR). An asset has as many asset state periods as there are changes to it (asset actions) during its lifecycle. The dashboard and related pages show the current asset state period. The fields can’t be edited.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "An asset’s total amount during an asset state period. Revenue Cloud doesn't set or use this field's value currently."
      },
      "AssetId": {
        "type": "reference",
        "description": "The asset related to an asset state period. Label is Asset."
      },
      "AssetStatePeriodNumber": {
        "type": "string",
        "description": "The ID of the asset state period. Label is Name."
      },
      "BillingFrequency": {
        "type": "picklist",
        "description": "The time period that indicates how often the line item is billed."
      },
      "BindingInstanceTargetId": {
        "type": "reference",
        "description": "The ID of a custom product target for a usage-based quote line item, order Item, or asset allocation."
      },
      "Discount": {
        "type": "percent",
        "description": "Editable number from 0 to 100. Available in API version 65.0 and later."
      },
      "DiscountAmount": {
        "type": "currency",
        "description": "The fixed amount discount to apply to the line item. Available in API version 65.0 and later."
      },
      "EndDate": {
        "type": "dateTime",
        "description": "The end date and time of an asset state period. On an asset that is an evergreen subscription, the last asset state period has no end date."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "The ID of the related legal entity."
      },
      "Mrr": {
        "type": "currency",
        "description": "An asset’s monthly recurring revenue during an asset state period."
      },
      "PriceRevisionPolicy": {
        "type": "reference",
        "description": "Specifies the price uplift policy associated with this asset state period."
      },
      "Quantity": {
        "type": "double",
        "description": "The total quantity of an asset during an asset state period."
      },
      "RampIdentifier": {
        "type": "string",
        "description": "The ramp record used to group order item segments for this asset state period."
      },
      "SegmentIdentifier": {
        "type": "string",
        "description": "The order item segment for this asset state period."
      },
      "SegmentName": {
        "type": "string",
        "description": "The name of the order item segment for this asset state period."
      },
      "SegmentType": {
        "type": "picklist",
        "description": "The period for the order item segment for this asset state period. Valid values are: Custom Free Trial Yearly"
      },
      "StartDate": {
        "type": "dateTime",
        "description": "The start date and time of an asset state period."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "The price per unit for the line item. Available in API version 65.0 and later."
      },
      "UnitPriceUplift": {
        "type": "percent",
        "description": "Indicates the percentage increase of a line item's unit price. Available in API version 65.0 and later."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_assetstateperiod.htm"
  }
}