{
  "AssessmentQuestion": {
    "name": "AssessmentQuestion",
    "description": "Stores the questions required for an assessment.",
    "properties": {
      "ActiveVersionId": {
        "type": "reference",
        "description": "The ID of the active version of the assessment question."
      },
      "DataType": {
        "type": "picklist",
        "description": "Required. The data type of the assessment question."
      },
      "Description": {
        "type": "textarea",
        "description": "The description for the assessment question. This text is not rendered on the assessment."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Required. The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations."
      },
      "DisplayTextCategory": {
        "type": "picklist",
        "description": "Specifies the category of the display text when the data type is Text Block."
      },
      "FormulaResponseDataType": {
        "type": "picklist",
        "description": "Specifies the data type of the question response calculated by a formula."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who created the relationship record."
      },
      "QuestionCategory": {
        "type": "picklist",
        "description": "Required. Stores the question category."
      },
      "QuestionText": {
        "type": "textarea",
        "description": "Required. The label for the assessment question that appears on the assessment."
      },
      "RelatedQuestionId": {
        "type": "reference",
        "description": "Identifies the ID of the related question. Used to define a question hierarchy."
      },
      "ShouldExcludeFromMetadata": {
        "type": "boolean",
        "description": "Indicates whether the assessment question record should be excluded from metadata (true) or not (false)."
      },
      "ShouldHideInDesigner": {
        "type": "boolean",
        "description": "Indicates whether the assesment question record should be hidden in OmniScript designer (true) or not (false)."
      },
      "SourceSystemName": {
        "type": "picklist",
        "description": "Specifies the source system name from where the content of the assessment question was retrieved."
      }
    },
    "module": "Public Sector Cloud"
  }
}