{
  "AsyncOperationTracker": {
    "name": "AsyncOperationTracker",
    "description": "Represents the status of an asynchronous request initiated from the Quote, Order, and CreditMemo entities.",
    "properties": {
      "AsyncOperationNumber": {
        "type": "string",
        "description": "A string that identifies the operation being tracked in AsyncOperationTracker."
      },
      "CorrelationIdentifier": {
        "type": "string",
        "description": "A string that identifies an operation across services."
      },
      "ExpiresAt": {
        "type": "dateTime",
        "description": "The timestamp indicating when this record will be deleted."
      },
      "FailedJobItems": {
        "type": "int",
        "description": "The number of items within the job that have failed."
      },
      "FinishedAt": {
        "type": "dateTime",
        "description": "The timestamp indicating when the asynchronous process completed."
      },
      "JobType": {
        "type": "picklist",
        "description": "The type of job."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user or group that owns the job.,"
      },
      "ParentOperationId": {
        "type": "reference",
        "description": "This field is a relationship field."
      },
      "ReferenceEntityId": {
        "type": "reference",
        "description": "Contains the ID of a record associated with the asynchronous request. For example, if the asynchronous request is associated with a credit memo, this field contains the ID of the credit memo."
      },
      "StartedAt": {
        "type": "dateTime",
        "description": "The timestamp indicating when Salesforce started the asynchronous process."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the asynchronous request."
      },
      "StepName": {
        "type": "picklist",
        "description": "Possible values are: AssetizationAsyncJob AutomatedNegativeInvoiceLineConversion—Automated Negative Invoice Line Conversion AutomaticRefunds—Automatic Refunds CommerceVariationsUpsert ContextPersistence CreateCPQContractsJob DeltaCatalogSyndicationAsyncJob FullCatalogSyndicationAsyncJob InvoiceDocgenJob InvoiceDocgenPostProcessJob InvoiceDocgenRetryJob InvoiceDraftToPosted PSTCommonSyncStep PSTConfigAndPersist PSTOrderTaxAsync PSTPriceAndPersist PSTQuoteTaxAsync PearAmendQtyAssets—Initiate Amend Quantity PearCancelAssets—Initiate Cancellation PearRenewAssets—Initiate Renewal PlaceOrder PlaceOrderPersistSync PlaceOrderPriceAsync PlaceOrderTaxAsync PlaceQuote—Place Quote PlaceQuotePersistAndPriceSync PlaceQuotePersistSync PlaceQuotePriceAsync PlaceQuoteTaxAsync PriceRuleDeployment—Price Rule Deployment PriceSheetDeployJob QuoteToOrderJob RuleLibraryDeployment TransactionLineBom—Create Material Lines"
      },
      "SubmittedAt": {
        "type": "dateTime",
        "description": "The timestamp indicating when the asynchronous process was submitted by the REST request."
      },
      "SuccessfulJobItems": {
        "type": "int",
        "description": "The number of successful items in this job."
      },
      "TotalJobItems": {
        "type": "int",
        "description": "Total number of items in this job."
      }
    },
    "module": "Core Salesforce"
  }
}