{
  "AttachedContentDocument": {
    "name": "AttachedContentDocument",
    "description": "This read-only object contains all ContentDocument objects associated with an object.",
    "properties": {
      "ContentDocumentId": {
        "type": "reference",
        "description": "ID of the attached ContentDocument."
      },
      "ContentSize": {
        "type": "int",
        "description": "Size of the document in bytes."
      },
      "ContentUrl": {
        "type": "url",
        "description": "URL for links and Google Docs. This field is set only for links and Google Docs, and is one of the fields that determine the FileType. This field is available in API version 31.0 and later."
      },
      "ExternalDataSourceName": {
        "type": "string",
        "description": "Name of the external data source in which the document is stored. This field is set only for external documents that are connected to Salesforce.This field is available in API version 32.0 and later."
      },
      "ExternalDataSourceType": {
        "type": "picklist",
        "description": "Type of external data source in which the document is stored. This field is set only for external documents that are connected to Salesforce.This field is available in APIAPI version 35.0 and later."
      },
      "FileExtension": {
        "type": "string",
        "description": "File extension of the attached ContentDocument. This field is available in API version 31.0 and later."
      },
      "FileType": {
        "type": "string",
        "description": "Type of document, determined by the file extension."
      },
      "LinkedEntityId": {
        "type": "reference",
        "description": "ID of the record the ContentDocument is attached to."
      },
      "SharingOption": {
        "type": "picklist",
        "description": "Controls whether or not sharing is frozen for a file. Only administrators and file owners with Collaborator access to the file can modify this field. Default is Allowed, which means that new shares are allowed. When set to Restricted, new shares are prevented without affecting existing shares.This field is available in API versions 35.0 and later."
      },
      "Title": {
        "type": "string",
        "description": "Title of the attached ContentDocument."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_attachedcontentdocument.htm"
  }
}