{
  "AttribModel": {
    "name": "AttribModel",
    "description": "Represents an attribution model used with Personalization, Attribution, and Campaign Influence, including model weights and touch type.",
    "properties": {
      "AttribModelStatus": {
        "type": "picklist",
        "description": "Indicates a model’s current status. The default value is Draft, and accepted values are Active Draft Inactive"
      },
      "AttributionModelType": {
        "type": "picklist",
        "description": "Indicates the type of attribution model, which determines which touchpoints to evaluate. The default value is LastTouch, and accepted values are"
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Three letter ISO currency codes for supported currencies. The default value is USD. This is an optional field."
      },
      "DataSpaceId": {
        "type": "reference",
        "description": "Unique identifier that refers to the data space where a model's resources originate. This is a required field."
      },
      "Description": {
        "type": "String",
        "description": "Text description of the attribution model. Optional."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Auto-generated or user-generated API name for the attribution model. This is a required field."
      },
      "Error Code": {
        "type": "picklist",
        "description": "Indicates the issue that’s causing an error. The default value is None, and accepted values are ConfigurationMissingError indicates that a required configuration setting is missing. DpcJobError indicates a problem during processing. InternalError indicates an internal error during processing. ModelValidationError indicates that the model is invalid. None"
      },
      "GlobalAttributionWindowDays": {
        "type": "int",
        "description": "Defines a timeframe for tracking attribution-related engagement. This is a required field."
      },
      "IdentityResolutionMode": {
        "type": "picklist",
        "description": "Defines which identity resolution method to use when tracking engagement activities. Default value is Individual, and acceptable values are Individual Unified"
      },
      "IsZeroDayLoadRequired": {
        "type": "boolean",
        "description": "Defines whether to sync data before the attribution window begins. The default value is false."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Timestamp that indicates the last time the model was referenced by another resource."
      },
      "LastRefresh": {
        "type": "dateTime",
        "description": "The timestamp that indicates the last time engagement data was refreshed and evaluated by the model."
      },
      "LastSuccessfulRefresh": {
        "type": "dateTime",
        "description": "The timestamp that indicates the last time the model was successfully refreshed."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Timestamp that indicates the last time a user viewed the model."
      },
      "LatestRefreshedStatus": {
        "type": "picklist",
        "description": "Picklist value that indicates the status of last refresh process. The default value is None, and accepted values are Canceled Complete Failure None Processing"
      },
      "ModelContext": {
        "type": "picklist",
        "description": "Indicates the app or feature in which the attribution model is used. The default value is Personalization, and accepted values are Attribution: indicates the use with Attribution in Salesforce Personalization. CampaignInfluence: indicates the use with Campaign Influence in Unified Marketing Analytics. Personalization: indicates the use with Personalization in Salesforce Personalization."
      },
      "ModelRevision": {
        "type": "int",
        "description": "A version number that indicates the latest save of the model."
      },
      "Name": {
        "type": "string",
        "description": "Text label that identifies the attribution model. This is a required field."
      },
      "Partner": {
        "type": "string",
        "description": "Indicates who's using the model. This field is required if the value of ModelContext is Attribution."
      },
      "ProfileDataGraphId": {
        "type": "reference",
        "description": "Unique identifier that refers to the profile data graph that’s used with the model."
      },
      "ScheduledFrequencyMins": {
        "type": "int",
        "description": "The scheduled frequency (in minutes) at which the attribution model is processed."
      },
      "SyncStatus": {
        "type": "picklist",
        "description": "Indicates the current status of the attribution model while an action is being performed. The default value is Processing, and acceptable values are: Active CreateError DeleteError Deleting EditError Processing"
      },
      "Tags": {
        "type": "string",
        "description": "User-generated strings that can be used to organize attribution models."
      }
    },
    "module": "Core Salesforce"
  }
}