{
  "AuthorizedEmailDomain": {
    "name": "AuthorizedEmailDomain",
    "description": "Represents an authorized domain for email verification.",
    "properties": {
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the record in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. This field is automatically generated but you can supply your own value if you create the record using the API. Note these important considerations. When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record. Only users with View DeveloperName OR View Setup and Configuration permission can view, group, sort, and filter this field."
      },
      "DomainName": {
        "type": "string",
        "description": "The unique domain name."
      },
      "Id": {
        "type": "ID",
        "description": "The ID of this authorized email domain. The ID starts with the string 1TB."
      },
      "IsDomainOwnershipVerified": {
        "type": "boolean",
        "description": "Indicates whether Salesforce successfully verified ownership of this domain (true) or not (false)."
      },
      "IsEmailRequired": {
        "type": "boolean",
        "description": "Indicates whether email verification is required for new users with an email address on this domain (true) or not (false)."
      },
      "Language": {
        "type": "picklist",
        "description": "Specifies the language of the authorized email domain. The value for this field is the language value of the org."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Master label for this object. This display value is the internal label that is not translated."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_authorizedemaildomain.htm"
  }
}