{
  "AuthSession": {
    "name": "AuthSession",
    "description": "The AuthSession object represents an individual user session in your organization.",
    "properties": {
      "CreatedDate": {
        "type": "dateTime",
        "description": "The date and time this session was created. This field is a standard system field."
      },
      "Id": {
        "type": "id",
        "description": "The current session’s ID."
      },
      "IsAssociatedWithJwtAccessToken": {
        "type": "boolean",
        "description": "If true, the session is associated with a JSON Web Token (JWT)-based access token. This field is available in API version 64.0 and later."
      },
      "IsCurrent": {
        "type": "boolean",
        "description": "If true, the session is a member of the user’s current session family. This field is available in API version 37.0 and later."
      },
      "LastModifiedDate": {
        "type": "dateTime",
        "description": "The date and time this session was last updated. A session expires when the current date and time equals LastModifiedDate + NumSecondsValid. This field is a standard system field."
      },
      "LoginGeoId": {
        "type": "reference",
        "description": "The 18-character ID for the record of the geographic location of the user for a login event. Due to the nature of geolocation technology, the accuracy of geolocation fields (for example, country, city, postal code) can vary. This field is available in API version 34.0 and later."
      },
      "LoginHistoryId": {
        "type": "reference",
        "description": "The 18-character ID for a successful login event. When a session is reused, Salesforce updates the LoginHistoryId with the value from the most recent login. This field is available in API version 33.0 and later."
      },
      "LoginType": {
        "type": "picklist",
        "description": "The type of login used to access the session. Possible values are: AJAX Toolkit Apex Office Toolkit AppExchange Application AppStore Certificate-based login Chatter Communities External User Chatter Communities External User Third Party SSO Community Customer Service Portal Third-Party SSO Customer Service Portal DataJunction DB Replication Employee Login to Community Excel Integration Help and Training HOTP YubiKey Lightning Login Networks Portal API Only Offline Client Order Center Other Apex API Outlook Integration Partner Portal Third-Party SSO Partner Portal Partner Product Passwordless Login Remote Access 2.0 Remote Access Client Sales Anywhere Salesforce Outlook Integration Salesforce.com Website SAML Chatter Communities External User SSO SAML Customer Service Portal SSO SAML Idp Initiated SSO SAML Partner Portal SSO SAML Sfdc Initiated SSO SAML Site SSO Self-Service Signup Sync SysAdmin Switch Third Party SSO Unknown Validate"
      },
      "LogoutUrl": {
        "type": "string",
        "description": "The page or view to display after users log out of an Experience Cloud site, or an org if they authenticated using SAML. This field is available in API version 32.0 and later."
      },
      "NumSecondsValid": {
        "type": "int",
        "description": "The number of seconds before the session expires, starting from the last update time."
      },
      "ParentId": {
        "type": "reference",
        "description": "The 18-character ID for the parent session, if one exists (for example, if the current session is for a canvas app). If the current session doesn’t have a parent, this value is the current session’s own ID."
      },
      "SessionSecurityLevel": {
        "type": "picklist",
        "description": "Standard or High, depending upon the authentication method used."
      },
      "SessionType": {
        "type": "picklist",
        "description": "The type of session. Common ones are UI, Content, API, and Visualforce."
      },
      "SourceIp": {
        "type": "string",
        "description": "IP address of the end user’s device from which the session started. This address can be an IPv4 or IPv6 address."
      },
      "UserType": {
        "type": "picklist",
        "description": "The kind of user for this session. Types include Standard, Partner, Customer Portal Manager, High Volume Portal, and CSN Only."
      },
      "UsersId": {
        "type": "reference",
        "description": "The user’s Salesforce user ID."
      }
    },
    "module": "Core Salesforce"
  }
}