{
  "Automotive Cloud Fields on Product2": {
    "name": "Automotive Cloud Fields on Product2",
    "description": "Standard fields extend the Product2 object for use in Automotive Cloud to represent information about vehicle models, parts, and accessories.",
    "properties": {
      "AvailabilityDate": {
        "type": "dateTime",
        "description": "The date when the part is used in the vehicle or is made available for sale. This field is available in API version 56.0 and later."
      },
      "BusinessBrandId": {
        "type": "reference",
        "description": "The brand associated with this vehicle. This field is available in API version 56.0 and later."
      },
      "DiscontinuedDate": {
        "type": "dateTime",
        "description": "The date from when the part can’t be used in the vehicle or sold. This field is available in API version 56.0 and later."
      },
      "HarmonizedSystemCode": {
        "type": "string",
        "description": "The harmonized system code that’s assigned to the vehicle or a part used in the vehicle. This field is available in API version 56.0 and later."
      },
      "HarmonizedTariffSchedCode": {
        "type": "string",
        "description": "The harmonized tariff schedule code that’s assigned to the vehicle or a part used in the vehicle. This field is available in API version 56.0 and later."
      },
      "IsCertified": {
        "type": "boolean",
        "description": "Indicates whether the part that’s installed as an accessory in the vehicle is certified (true) or not (false). This field is available in API version 56.0 and later."
      },
      "IsEnvrPrtcRegCompliant": {
        "type": "boolean",
        "description": "Indicates whether the product is compliant with the environment protection regulations or not. This field is available in API version 56.0 and later."
      },
      "MakeName": {
        "type": "string",
        "description": "Specifies the make name of the product. This field is available in API version 56.0 and later."
      },
      "ManufacturerName": {
        "type": "string",
        "description": "The manufacturer name for the part used in the vehicle. This field is available in API version 56.0 and later."
      },
      "ManufacturerPartNumber": {
        "type": "string",
        "description": "The unique number assigned by the manufacturer to identify the part. This field is available in API version 56.0 and later."
      },
      "ModelName": {
        "type": "string",
        "description": "Specifies the model name of the vehicle. This field is available in API version 56.0 and later."
      },
      "ModelYear": {
        "type": "int",
        "description": "The year when the model of the vehicle was first launched. This field is available in API version 56.0 and later."
      },
      "ProductCategoryCode": {
        "type": "string",
        "description": "The part category associated with the vehicle. This field is available in API version 56.0 and later."
      },
      "ProductLineCode": {
        "type": "string",
        "description": "The vehicle category associated with the part. This field is available in API version 56.0 and later."
      },
      "UniversalProductCode": {
        "type": "string",
        "description": "The universal product code used to track the part used in the vehicle. This field is available in API version 56.0 and later."
      },
      "VehicleTrimLevel": {
        "type": "string",
        "description": "The trim levels supported by the vehicle model. This field is available in API version 56.0 and later."
      },
      "VersionName": {
        "type": "string",
        "description": "The version name associated with the vehicle model. This field is available in API version 56.0 and later."
      }
    },
    "module": "Automotive Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.automotive_cloud.meta/automotive_cloud/sforce_api_objects_product2.htm"
  }
}