{
  "ObjectPermissions": {
    "name": "ObjectPermissions",
    "description": "Represents the enabled object permissions for the parent PermissionSet.",
    "properties": {
      "ParentId": {
        "type": "reference",
        "description": "The Id of this object’s parent PermissionSet."
      },
      "PermissionsCreate": {
        "type": "boolean",
        "description": "If true, users assigned to the parent PermissionSet can create records for this object. Requires PermissionsRead for the same object to be true."
      },
      "PermissionsDelete": {
        "type": "boolean",
        "description": "If true, users assigned to the parent PermissionSet can delete records for this object. Requires PermissionsRead and PermissionsEdit for the same object to be true."
      },
      "PermissionsEdit": {
        "type": "boolean",
        "description": "If true, users assigned to the parent PermissionSet can edit records for this object. Requires PermissionsRead for the same object to be true."
      },
      "PermissionsModifyAllRecords": {
        "type": "boolean",
        "description": "If true, users assigned to the parent PermissionSet can edit all records for this object, regardless of sharing settings. Requires PermissionsRead, PermissionsDelete, PermissionsEdit, and PermissionsViewAllRecords for the same object to be true."
      },
      "PermissionsRead": {
        "type": "boolean",
        "description": "If true, users assigned to the parent PermissionSet can view records for this object."
      },
      "PermissionsViewAllFields": {
        "type": "boolean",
        "description": "If true, users assigned to the parent PermissionSet can view all fields and field data for this object. Available in API version 63.0 and later."
      },
      "PermissionsViewAllRecords": {
        "type": "boolean",
        "description": "If true, users assigned to the parent PermissionSet can view all records for this object, regardless of sharing settings. Requires PermissionsRead for the same object to be true."
      },
      "SobjectType": {
        "type": "picklist",
        "description": "The object’s API name. For example, Merchandise__c."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_objectpermissions.htm"
  }
}