{
  "ObjectTerritory2AssignmentRule": {
    "name": "ObjectTerritory2AssignmentRule",
    "description": "Represents a territory assignment rule that’s associated with an object, such as Account. ObjectTerritory2AssignmentRuleItem can be created or deleted if the BooleanFilter field on its corresponding ObjectTerritory2AssignmentRule is null.",
    "properties": {
      "BooleanFilter": {
        "type": "string",
        "description": "Represents advanced filter conditions that were specified for the rule in the online application. For example, “(1 AND 2) OR 3.”"
      },
      "DeveloperName": {
        "type": "string",
        "description": "Required. The unique name of the object in the API. This name can contain only underscores and alphanumeric characters and must be unique in your organization. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. The field label in the user interface is Unique Name. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the rule is active (true) or inactive (false). Via the API, active rules run automatically when object records are created and edited. The exception is when the value of the IsExcludedFromRealign field on an object record is true, which prevents record assignment rules from evaluating that record."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the label in the user interface."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Required. The user interface label for the territory type."
      },
      "ObjectType": {
        "type": "picklist",
        "description": "The object that the rule is defined for. For API version 31, Account only."
      },
      "Territory2ModelId": {
        "type": "reference",
        "description": "The ID of the territory model."
      }
    },
    "module": "Core Salesforce"
  }
}