{
  "OmniExtTrackingEventDef": {
    "name": "OmniExtTrackingEventDef",
    "description": "Represents a format for FlexCard or OmniScript user interaction data that a third-party Analytics system such as Google Analytics can accept.",
    "properties": {
      "ComponentType": {
        "type": "picklist",
        "description": "The type of component for which user interactions are tracked."
      },
      "Description": {
        "type": "string",
        "description": "A description of the OmniExtTrackingEventDef."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the OmniExtTrackingEventDef in the API. This name can contain only underscores and alphanumeric characters and must be unique in your organization. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. Limit: 80 characters. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow while Salesforce generates one for each record. Note Only users with View DeveloperName OR View Setup and Configuration permission can view, group, sort, and filter this field."
      },
      "InclusionRule": {
        "type": "textarea",
        "description": "A true-or-false condition that determines whether an event is sent to the third-party Analytics system."
      },
      "Language": {
        "type": "picklist",
        "description": "The language for the OmniExtTrackingEventDef."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The unique master label of the OmniExtTrackingEventDef. This internal label doesn’t get translated."
      },
      "OmniExtTrackingDef": {
        "type": "reference",
        "description": "The ID of the related OmniExtTrackingDef object."
      },
      "OmniExtTrackingEventDefKey": {
        "type": "string",
        "description": "A UUID generated internally by Salesforce to uniquely identify an OmniExtTrackingEventDef record across all orgs."
      },
      "PayloadTemplate": {
        "type": "textarea",
        "description": "The payload template structure with placeholders for runtime data. This is used at runtime to generate the actual payload to be sent to the external Analytics service."
      }
    },
    "module": "Core Salesforce"
  }
}