{
  "OpenActivity": {
    "name": "OpenActivity",
    "description": "This read-only object is displayed in a related list of open activities—future events and open tasks—related to an object. It includes activities for all contacts related to the object. OpenActivity fields for phone calls are only available if your organization uses Salesforce CRM Call Center.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "Indicates the ID of the related account, which is determined as follows: The account associated with the WhatId, if it exists; or The account associated with the WhoId, if it exists; otherwise null"
      },
      "ActivityDate": {
        "type": "date",
        "description": "Indicates one of the following: The due date of a task The date of an event if IsAllDayEvent is set to true This field has a time stamp that is always set to midnight in the Universal Time Coordinated (UTC) time zone. The time stamp doesn’t represent the time of the activity; don’t attempt to alter it to accommodate time zone differences. Label is Date."
      },
      "ActivityDateTime": {
        "type": "dateTime",
        "description": "Contains the event’s due date if the IsAllDayEvent flag is set to false. The time portion of this field is always transferred in the Coordinated Universal Time (UTC) time zone. Translate the time portion to or from a local time zone for the user or the application, as appropriate. Label is Due Date Time.The value for this field and StartDateTime must match, or one of them must be null."
      },
      "ActivitySubtype": {
        "type": "picklist",
        "description": "Provides standard subtypes to facilitate creating and searching for specific activity subtypes. This field isn’t updateable.Possible values are: Task Email Call Event LinkedIn —Available in API version 56.0 and later. List Email"
      },
      "ActivityType": {
        "type": "picklist",
        "description": "Represents one of the following values: Call, Email, Meeting, or Other. Label is Type. These are default values, and can be changed."
      },
      "AlternateDetailId": {
        "type": "reference",
        "description": "The ID of a record the activity is related to which contains more details about the activity. For example, an activity can be related to an EmailMessage record."
      },
      "CallDisposition": {
        "type": "string",
        "description": "Represents the result of a given call, for example, “we'll call back,” or “call unsuccessful.” Limit is 255 characters."
      },
      "CallDurationInSeconds": {
        "type": "int",
        "description": "Duration of the call in seconds."
      },
      "CallObject": {
        "type": "string",
        "description": "Name of a call center. Limit is 255 characters."
      },
      "CallType": {
        "type": "picklist",
        "description": "The type of call being answered: Inbound, Internal, or Outbound."
      },
      "CompletedDateTime": {
        "type": "dateTime",
        "description": "The date and time the task was saved with a Closed status. This value is always null."
      },
      "ConnectionReceivedId": {
        "type": "reference",
        "description": "Indicates the ID of the PartnerNetworkConnection that shared this record with your organization. This field is available only if your organization has enabled Salesforce to Salesforce and only in API versions 28.0 and later."
      },
      "ConnectionSentId": {
        "type": "reference",
        "description": "Indicates the ID of the PartnerNetworkConnection that your organization shared this record with. This field is available only if your organization has enabled Salesforce to Salesforce, and only in API versions 28.0 and later. The value is always null. You can use the PartnerNetworkRecordConnection object to forward records to connections."
      },
      "Description": {
        "type": "textarea",
        "description": "Contains a description of the event or task. Limit is 32 KB."
      },
      "DurationInMinutes": {
        "type": "int",
        "description": "Indicates the duration of the event or task."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "Indicates the end date and time of the event or task. Available in versions 27.0 and later. This field is optional, depending on the following: If IsAllDayEvent is true, you can supply a value for either DurationInMinutes or EndDateTime. Supplying values in both fields is allowed if the values add up to the same amount of time. If both fields are null, the duration defaults to one day. If IsAllDayEvent is false, a value must be supplied for either DurationInMinutes or EndDateTime. Supplying values in both fields is allowed if the values add up to the same amount of time."
      },
      "IsAllDayEvent": {
        "type": "boolean",
        "description": "If the value of this field is set to true, then the activity is an event spanning a full day, and the ActivityDate defines the date of the event. If the value of this field is set to false, then the activity may be an event spanning less than a full day, or it may be a task. The default value of this field is false. Label is All-Day Event."
      },
      "IsClosed": {
        "type": "boolean",
        "description": "Indicates whether a task is closed (true) or not closed (false). The default value of this field is false. This field is set indirectly by setting Status on the task—each picklist value has a corresponding IsClosed value. Label is Closed."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the activity has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "IsHighPriority": {
        "type": "boolean",
        "description": "Indicates a high-priority task. The default value of this field is false. This field is derived from the Priority field."
      },
      "IsReminderSet": {
        "type": "boolean",
        "description": "Indicates whether a reminder is set for an activity (true) or not (false). The default value of this field is false."
      },
      "IsTask": {
        "type": "boolean",
        "description": "If the value of this field is set to true, then the activity is a task; if the value is set to false, then the activity is an event. The default value of this field is false. Label is Task."
      },
      "IsVisibleInSelfService": {
        "type": "boolean",
        "description": "If the value of this field is set to true, then the activity can be viewed in the self-service portal. The default value of this field is false. Label is Visible in Self-Service."
      },
      "Location": {
        "type": "string",
        "description": "If the activity is an event, then this field represents the location of the event. If the activity is a task, then the value is null."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Indicates the ID of the user or group who owns the activity."
      },
      "PrimaryAccountId": {
        "type": "reference",
        "description": "Contains the AccountId value from the activity record. Available in API versions 30.0 and later to organizations that use Shared Activities."
      },
      "PrimaryWhoId": {
        "type": "reference",
        "description": "Contains the WhoId value from the activity record. Available in API versions 30.0 and later to organizations that have enabled Shared Activities."
      },
      "Priority": {
        "type": "picklist",
        "description": "Indicates the priority of a task, such as high, normal, or low. The default value of this field is Normal."
      },
      "ReminderDateTime": {
        "type": "dateTime",
        "description": "Represents the time at which a reminder is scheduled to fire if IsReminderSet is set to true. If IsReminderSet is set to false, then either the user has deselected the reminder checkbox in the user interface or the reminder has already fired at the time indicated by the value."
      },
      "Status": {
        "type": "picklist",
        "description": "Indicates the current status of a task. The default value of this field is Not Started. Each predefined status field sets a value for IsClosed. To obtain picklist values, query the TaskStatus object.Possible values are: Completed Deferred In Progress Not Started Waiting on someone else"
      },
      "Subject": {
        "type": "combobox",
        "description": "Contains the subject of the task or event."
      },
      "WhatId": {
        "type": "reference",
        "description": "The WhatId represents nonhuman objects such as accounts, opportunities, campaigns, cases, or custom objects. WhatIds are polymorphic. Polymorphic means a WhatId is equivalent to the ID of a related object. The label is Related To ID."
      },
      "WhoId": {
        "type": "reference",
        "description": "The WhoId represents a human such as a lead or a contact. WhoIds are polymorphic. Polymorphic means a WhoId is equivalent to a contact’s ID or a lead’s ID. The label is Name ID. If Shared Activities is enabled, the value of this field is the ID of the related lead or primary contact. If you add, update, or remove the WhoId field, you might encounter problems with triggers, workflows, and data validation rules that are associated with the record. The label is Name ID."
      }
    },
    "module": "Core Salesforce"
  }
}