{
  "OpportunitySplit": {
    "name": "OpportunitySplit",
    "description": "OpportunitySplit credits one or more opportunity team members with a portion of the opportunity amount.",
    "properties": {
      "ArchivedTerritoryName": {
        "type": "String",
        "description": "The name of the associated territory that’s on an archived territory model. If the OpportunityLineItemSplit isn’t associated with a territory on an archived territory model, the field value is null. This field is available in API version 62.0 and later."
      },
      "HasOpportunityLineItemSplit": {
        "type": "boolean",
        "description": "Read-only. Indicates whether the opportunity split has a split on the opportunity line item level (true) or not (false)."
      },
      "OpportunityId": {
        "type": "reference",
        "description": "ID of the opportunity for which the split is being created."
      },
      "Split": {
        "type": "string",
        "description": "Read-only. Automatically generated number identifying the split within the opportunity."
      },
      "SplitAmount": {
        "type": "currency",
        "description": "Monetary amount of the split."
      },
      "SplitNote": {
        "type": "string",
        "description": "Enter any notes or comments about the split. The character limit is 255."
      },
      "SplitOwnerId": {
        "type": "reference",
        "description": "The opportunity owner."
      },
      "SplitPercentage": {
        "type": "percent",
        "description": "Split percentage that this team member receives. If the split type is validated to a 100% total, this number can range from 0 to 100. If the total isn’t validated, this number can range from 0 to 1,000."
      },
      "SplitTypeId": {
        "type": "reference",
        "description": "Auto-generated, numeric ID for the split type defined by the OpportunitySplitType object. This field is available in API version 28 and later."
      },
      "Territory2Id": {
        "type": "reference",
        "description": "ID of the associated territory. This field is a relationship field, and is available in API version 62.0 and later."
      }
    },
    "module": "Core Salesforce"
  }
}