{
  "OpptyLineItemSplitType": {
    "name": "OpptyLineItemSplitType",
    "description": "Represents an opportunity product split type.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "Text description of the opportunity line item split type. Limit: 80 characters."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The developer (API) name of the opportunity line item split type."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the opportunity line item split type is active (true) or not (false). The value of this field is inherited from the IsActive field of the parent OpportunitySplitType record."
      },
      "IsTotalValidated": {
        "type": "boolean",
        "description": "Indicates whether the OpportunityLineItemSplit records associated with the OpportunityLineItem must have SplitPercent values that aggregate to 100% (true) or not (false). The value of this field is inherited from the IsTotalValidated field of the parent OpportunitySplitType record."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the opportunity line item split type."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The opportunity line item split type label."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object."
      },
      "OpportunitySplitTypeId": {
        "type": "reference",
        "description": "The ID of the parent OpportunitySplitType. Every OpptyLineItemSplitType must have a parent OpportunitySplitType. This field is a relationship field."
      },
      "SplitDataStatus": {
        "type": "picklist",
        "description": "The state of the asynchronous job to delete OpportunityLineItemSplit records when the associated OpptyLineItemSplitType record is deleted. Possible values are: DeletionFailed–The job failed the last time it ran. Ready–The job hasn't run or isn't running. OpportunityLineItemSplit records associated with the OpptyLineItemSplitType can be interacted with. ToBeDeleted–The job is running."
      },
      "SplitEntity": {
        "type": "picklist",
        "description": "Name or ID of the entity that contains the field being split. In API version 58.0, this value is always OpportunityLineItem."
      },
      "SplitField": {
        "type": "picklist",
        "description": "Name or ID of the field on OpportunityLineItem that is being split. If it's a standard field, then the value is the API name of the field. If it’s a custom field, the value is the custom field definition ID."
      }
    },
    "module": "Core Salesforce"
  }
}