{
  "OrderItem": {
    "name": "OrderItem",
    "description": "Represents an order product that your organization sells.",
    "properties": {
      "AdjustedLineAmount": {
        "type": "currency",
        "description": "Line amount following line adjustments, excluding tax."
      },
      "AdjustedLineAmtWithTax": {
        "type": "currency",
        "description": "Line amount following line adjustments, including tax."
      },
      "AvailableQuantity": {
        "type": "double",
        "description": "Amount of an order product that is available to be reduced. Value must be greater than or equal to 0. An order product is reducible only if AvailableQuantity is greater than 0. Value is always 0 if the order product’s parent order is a reduction order."
      },
      "BillingFrequency2": {
        "type": "picklist",
        "description": "The time period that indicates how often the order item is billed. This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for orgs with the multicurrency feature enabled. Contains the ISO code for the currency of the original Order associated with the OrderItem."
      },
      "DeliveryEstimationReference": {
        "type": "string",
        "description": "Unique reference ID for the delivery estimation."
      },
      "DeliveryEstimationTimeZone": {
        "type": "picklist",
        "description": "Timezone in which the estimated delivery times are based."
      },
      "Description": {
        "type": "string",
        "description": "Text description of this object. For Commerce stores, during checkout, this field is populated with the value of a product name. The product name is copied from the CartItem.Name field of a cart item that corresponds to the OrderItem."
      },
      "EarliestEstimatedDeliveryDate": {
        "type": "date",
        "description": "Earliest date when the item is estimated to be delivered."
      },
      "EarliestEstimatedDeliveryTime": {
        "type": "timeOnly",
        "description": "Earliest time of the day when the item is estimated to be delivered."
      },
      "EndDate": {
        "type": "date",
        "description": "Optional. Last day the order product is available."
      },
      "EndDateTime": {
        "type": "datetime",
        "description": "The end date and time of the order item, which is derived from the End Date and End Time fields in the time zone specified in the Start and End Time Zone field. If the time zone isn't specified, the default is Coordinated Universal Time (UTC)."
      },
      "EndTime": {
        "type": "timeOnly",
        "description": "The end time of the order item."
      },
      "GrossUnitPrice": {
        "type": "currency",
        "description": "Unit price including tax."
      },
      "LastEstimatedDeliveryDate": {
        "type": "date",
        "description": "Latest date when the item is estimated to be delivered."
      },
      "LastEstimatedDeliveryTime": {
        "type": "timeOnly",
        "description": "Latest time of the day when the item is estimated to be delivered."
      },
      "LineNumber": {
        "type": "int",
        "description": "Used to organize lines on the order."
      },
      "ListPrice": {
        "type": "currency",
        "description": "List price for the order product. Value is inherited from the associated PriceBookEntry upon order product creation."
      },
      "ListPriceTotal": {
        "type": "currency",
        "description": "The ListPrice times the Quantity. This field is a calculated field.This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "NetUnitPrice": {
        "type": "currency",
        "description": "The unit price after all price adjustments are applied. This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "OrderActionId": {
        "type": "reference",
        "description": "The ID of the related order action. The order action indicates the type of order; for example, a new sale or a cancellation.This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "OrderDeliveryGroupId": {
        "type": "reference",
        "description": "The delivery group for the order product."
      },
      "OrderId": {
        "type": "reference",
        "description": "Required. ID of the order that this order product is a child of."
      },
      "OrderItemNumber": {
        "type": "string",
        "description": "Automatically generated number that identifies the order product."
      },
      "OriginalOrderItemId": {
        "type": "reference",
        "description": "Required if isReductionOrder on the parent order is true."
      },
      "PeriodBoundary": {
        "type": "picklist",
        "description": "The period boundary helps determine the start and end date of the billing periods.This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "PeriodBoundaryDay": {
        "type": "int",
        "description": "Required when PeriodBoundary is DayOfPeriod. Indicates day of the week or month that marks the period boundary. Must be an integer from 1 through 31.This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "PeriodBoundaryStartMonth": {
        "type": "picklist",
        "description": "Field is populated based on input in the StartDate, PeriodBoundary, and PeriodBoundaryDay when BillingFrequency2 is Annual or by manual user entry. Possible values are: 1-January 2-February 3-March 4-April 5-May 6-June 7-July 8-August 9-September 10-October 11-November 12-December"
      },
      "PricebookEntryId": {
        "type": "reference",
        "description": "Required. ID of the associated PricebookEntry. This field must be specified when creating OrderItem records. It can’t be changed in an update."
      },
      "PriceRevisionPolicyId": {
        "type": "reference",
        "description": "The price uplift policy associated with this order item."
      },
      "PricingTermCount": {
        "type": "double",
        "description": "A calculated field indicating the number of pricing terms in the subscription. This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "PricingTransactionType": {
        "type": "picklist",
        "description": "Indicates the type of pricing transaction. For example, a new sale, a cancellation, an amendment, or a renewal."
      },
      "ProFormaBillingPeriodAmount": {
        "type": "currency",
        "description": "The initial amount for the billing period. The final amount for the billing period can include subsequent amendments, discounts, or charges. This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "Product2Id": {
        "type": "reference",
        "description": "ID of the Product2 associated with this OrderItem."
      },
      "ProductSellingModelId": {
        "type": "reference",
        "description": "The ID of the related product selling model. The product selling model defines one method by which a product can be sold; for example, as a one-time sale, an evergreen subscription, or a termed subscription.This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "ProrationPolicyId": {
        "type": "reference",
        "description": "The ID of the related proration policy. The proration policy defines how the price is calculated for each subscription period; for example, whether partial periods are allowed, and how remainder amounts are handled.This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "Quantity": {
        "type": "double",
        "description": "Required. Number of units of this order product."
      },
      "QuoteLineItemId": {
        "type": "reference",
        "description": "Required. ID of the associated quote line item.If this field is specified, the quote line item’s QuoteId must match the QuoteId for the order product’s parent order."
      },
      "ReferencePrice": {
        "type": "currency",
        "description": "The original or reference price of the order product."
      },
      "RelatedOrderItemID": {
        "type": "reference",
        "description": "Required for change orders, shows the original order product."
      },
      "RoundedLineAmount": {
        "type": "currency",
        "description": "The rounded line amount, before tax and adjustments. Currency with decimal values of 0.5 and higher are rounded to the next-highest whole unit of currency."
      },
      "RoundedLineAmtWithTax": {
        "type": "currency",
        "description": "The rounded line amount, including tax. Currency with decimal values of 0.5 and higher are rounded to the next-highest whole unit of currency."
      },
      "ServiceDate": {
        "type": "date",
        "description": "Start date for the order product."
      },
      "ServiceDateTime": {
        "type": "datetime",
        "description": "The service date and time of the order item, which is derived from the Service Date and Service Time fields in the time zone specified in the Service and End Time Zone field. If the time zone isn't specified, the default is Coordinated Universal Time (UTC)."
      },
      "ServiceEndTimeZone": {
        "type": "timeOnly",
        "description": "Specifies the time zone for the order item's service and end dates, times, and datetimes."
      },
      "ServiceTime": {
        "type": "timeOnly",
        "description": "The service time of the order item."
      },
      "StartingPriceTotal": {
        "type": "currency",
        "description": "The starting unit price times the quantity.This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "StartingUnitPriceSource": {
        "type": "picklist",
        "description": "Indicates whether the starting unit price was entered manually or calculated. This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "TaxTreatmentId": {
        "type": "reference",
        "description": "The ID of the related tax treatment. This field is available in API version 55.0 and later. This field is available with Subscription Management."
      },
      "TotalAdjustedLineTaxAmount": {
        "type": "currency",
        "description": "Sum of line tax amount and line adjustment tax amounts."
      },
      "TotalAdjustmentAmount": {
        "type": "currency",
        "description": "Roll-up of all the order product’s price adjustments."
      },
      "TotalAdjustmentAmtWithTax": {
        "type": "currency",
        "description": "Roll-up of all the order product’s price adjustments, including tax."
      },
      "TotalAdjustmentDistAmount": {
        "type": "currency",
        "description": "Roll-up of all adjustments on the order. Used only if the OrderAdjustmentGroup has a Type value of Header."
      },
      "TotalAdjustmentDistTaxAmount": {
        "type": "currency",
        "description": "Roll-up of all adjustment tax amounts on the order. Used only if the OrderAdjustmentGroup has a Type value of Header."
      },
      "TotalAdjustmentDistAmtWithTax": {
        "type": "currency",
        "description": "Roll-up of all adjustment tax amounts on the order, including tax. Used only if the OrderAdjustmentGroup has a Type value of Header."
      },
      "TotalAdjustmentTaxAmount": {
        "type": "currency",
        "description": "Sum of all the order product’s tax adjustments."
      },
      "TotalAmtWithTax": {
        "type": "currency",
        "description": "Equals TotalPrice + TotalTaxAmount for the order item."
      },
      "TotalLineAdjustmentAmount": {
        "type": "currency",
        "description": "The sum of line-level adjustments for the order product."
      },
      "TotalLineAdjustmentAmtWithTax": {
        "type": "currency",
        "description": "The sum of line-level adjustments for the order product, including tax."
      },
      "TotalLineAdjustmentTaxAmount": {
        "type": "currency",
        "description": "Total tax amount for adjustments made to the order product."
      },
      "TotalLineAmount": {
        "type": "currency",
        "description": "The net total price of the order product, before price adjustments, inclusive of quantity."
      },
      "TotalLineTaxAmount": {
        "type": "currency",
        "description": "Total tax amount for this order product, excluding tax on adjustments."
      },
      "TotalPrice": {
        "type": "currency",
        "description": "Total price for this order product. The calculations for this field’s value are different if Commerce Orders are enabled."
      },
      "TotalTaxAmount": {
        "type": "currency",
        "description": "Sum of the order product’s tax and any adjustments."
      },
      "Type": {
        "type": "picklist",
        "description": "Describes what the order item represents. Each value is associated with one type code, shown here in parentheses."
      },
      "TypeCode": {
        "type": "picklist",
        "description": "The category associated with the type. A type code can be associated with one or more types."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "Unit price for the order product."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_orderitem.htm"
  }
}