{
  "OrderItemSummary": {
    "name": "OrderItemSummary",
    "description": "Represents the current properties and state of a product or charge on an OrderSummary. Corresponds to one or more order item objects, consisting of an original object and any change objects applicable to it.",
    "properties": {
      "AdjustedLineAmount": {
        "type": "currency",
        "description": "Total, including line adjustments but not order-lever adjustments or tax, of the OrderItemSummary. This is a calculated field."
      },
      "AdjustedLineAmt​WithTax": {
        "type": "currency",
        "description": "Total price of the OrderItemSummary, inclusive of adjustments and tax. This amount is equal to AdjustedLineAmount + TotalAdjustedLineTaxAmount."
      },
      "AssetId": {
        "type": "reference",
        "description": "ID of the associated asset. This field is available in API version 60.0 and later."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for orgs with the multicurrency feature enabled. ISO code for the currency of the OrderSummary associated with the OrderItemSummary."
      },
      "DeliveryEstimationReference": {
        "type": "string",
        "description": "Unique reference ID for the delivery estimation."
      },
      "DeliveryEstimationTimeZone": {
        "type": "picklist",
        "description": "Timezone in which the estimated delivery times are based."
      },
      "Description": {
        "type": "string",
        "description": "Description of the OrderItemSummary."
      },
      "EarliestEstimatedDeliveryDate": {
        "type": "date",
        "description": "Earliest date when the item is estimated to be delivered."
      },
      "EarliestEstimatedDeliveryTime": {
        "type": "timeOnly",
        "description": "Earliest time of the day when the item is estimated to be delivered."
      },
      "EndDate": {
        "type": "date",
        "description": "End date of the OrderItemSummary."
      },
      "GrossUnitPrice": {
        "type": "currency",
        "description": "Unit price, including tax, of the OrderItemSummary. This value is equal to UnitPrice + the amount of tax on the UnitPrice."
      },
      "LastEstimatedDeliveryDate": {
        "type": "date",
        "description": "Latest date when the item is estimated to be delivered."
      },
      "LastEstimatedDeliveryTime": {
        "type": "timeOnly",
        "description": "Latest time of the day when the item is estimated to be delivered."
      },
      "LineNumber": {
        "type": "int",
        "description": "The order line number assigned to this OrderItemSummary. For example, if this object is the third in the displayed list of OrderItemSummaries belonging to the OrderSummary, this value is 3."
      },
      "ListPrice": {
        "type": "currency",
        "description": "List price of the product represented by this OrderItemSummary."
      },
      "MainOrderItemSummaryId": {
        "type": "reference",
        "description": "The primary order item summary ID of this order item summary."
      },
      "Name": {
        "type": "string",
        "description": "Name of the OrderItemSummary."
      },
      "OrderDeliveryGroup​SummaryId": {
        "type": "reference",
        "description": "ID of the OrderDeliveryGroupSummary to which this object belongs."
      },
      "OrderManagementBillingType": {
        "type": "enum",
        "description": "The type of entitlement, either PPO or GMV, that is used to track Order Summary usage."
      },
      "OrderSummaryId": {
        "type": "reference",
        "description": "ID of the OrderSummary to which this object belongs."
      },
      "OriginalOrderItemId": {
        "type": "reference",
        "description": "ID of the original order item associated with this summary object. Nillable=true only if the associated order summary is unmanaged. For managed order summaries, nillable=false."
      },
      "PricebookEntryId": {
        "type": "reference",
        "description": "ID of the pricebook entry associated with this OrderItemSummary."
      },
      "Product2Id": {
        "type": "reference",
        "description": "ID of the product represented by this OrderItemSummary."
      },
      "ProductCode": {
        "type": "string",
        "description": "Product code of the product represented by this OrderItemSummary."
      },
      "Quantity": {
        "type": "double",
        "description": "Current total quantity of products represented by this order item summary. Equal to QuantityOrdered minus (QuantityCanceled and QuantityReturned)."
      },
      "QuantityAllocated": {
        "type": "double",
        "description": "Allocated quantity on this order item summary. This quantity is associated with one or more FulfillmentOrderLineItems."
      },
      "QuantityAvailable​ToCancel": {
        "type": "double",
        "description": "Quantity that can still be canceled on this OrderItemSummary. Equal to QuantityOrdered minus (QuantityCanceled and QuantityAllocated). This value duplicates QuantityAvailableToFulfill. This is a calculated field."
      },
      "QuantityAvailable​ToFulfill": {
        "type": "double",
        "description": "Quantity available to be fulfilled on this OrderItemSummary. Equal to QuantityOrdered minus (QuantityCanceled and QuantityAllocated). This value duplicates QuantityAvailableToCancel. This is a calculated field."
      },
      "QuantityAvailable​ToReship": {
        "type": "double",
        "description": "Quantity available to be reshipped on this OrderItemSummary. Equal to QuantityFulfilled minus (QuantityReshipped and QuantityReturnInitiated)."
      },
      "QuantityAvailable​ToReturn": {
        "type": "double",
        "description": "Quantity available to be returned on this OrderItemSummary. Equal to QuantityFulfilled minus QuantityReturnInitiated. This is a calculated field."
      },
      "QuantityCanceled": {
        "type": "double",
        "description": "Canceled quantity on this OrderItemSummary."
      },
      "QuantityFulfilled": {
        "type": "double",
        "description": "Fulfilled quantity on this OrderItemSummary. This quantity can no longer be canceled."
      },
      "QuantityNetOrdered": {
        "type": "double",
        "description": "Quantity available to be allocated on this OrderItemSummary. Equal to QuantityOrdered minus QuantityCanceled."
      },
      "QuantityOrdered": {
        "type": "double",
        "description": "Ordered quantity on this OrderItemSummary. It includes the originally ordered quantity plus any quantity added to the order later."
      },
      "QuantityReshipped": {
        "type": "double",
        "description": "Reshipped quantity on this OrderItemSummary."
      },
      "QuantityReturned": {
        "type": "double",
        "description": "Returned quantity on this OrderItemSummary."
      },
      "QuantityReturnInitiated": {
        "type": "double",
        "description": "Quantity returned or pending return on this OrderItemSummary."
      },
      "QuantityShipped": {
        "type": "double",
        "description": "Quantity shipped on this OrderItemSummary."
      },
      "ReferencePrice": {
        "type": "currency",
        "description": "The original or reference price of the order product."
      },
      "ReservedAtLocationId": {
        "type": "reference",
        "description": "Reserved for future use."
      },
      "ServiceDate": {
        "type": "date",
        "description": "Service or start date of the OrderItemSummary."
      },
      "Status": {
        "type": "picklist",
        "description": "Status of the OrderItemSummary. The default value is ORDERED. When a quantity value changes, each status formula is evaluated in order. If a formula is true, no more evaluations are performed for that change."
      },
      "StockKeepingUnit": {
        "type": "string",
        "description": "The stock keeping unit (SKU) of the Product2 associated with the OrderItemSummary."
      },
      "TaxTreatmentId": {
        "type": "reference",
        "description": "The ID of the related tax treatment. This field is available in API version 63.0 and later. This field is available with Subscription Management."
      },
      "TotalAdjusted​LineTaxAmount": {
        "type": "currency",
        "description": "Tax on the AdjustedLineAmount. This is a calculated field."
      },
      "TotalAdjustmentAmount": {
        "type": "currency",
        "description": "Total of all price adjustments applied to this OrderItemSummary. This is a calculated field."
      },
      "TotalAdjustment​AmtWithTax": {
        "type": "currency",
        "description": "Total amount of all price adjustments applied to this OrderItemSummary, inclusive of tax. This amount is equal to TotalAdjustmentAmount + TotalAdjustmentTaxAmount."
      },
      "TotalAdjustmentDistAmount": {
        "type": "currency",
        "description": "Total of all order-level price adjustments applied to this OrderItemSummary. This value includes OrderItemAdjustmentLineSummaries that belong to OrderAdjustmentGroupSummaries of type Header. This is a calculated field."
      },
      "TotalAdjustmentDist​AmtWithTax": {
        "type": "currency",
        "description": "Total amount of the order-level price adjustments applied to this OrderItemSummary, inclusive of tax. This amount is equal to TotalAdjustmentDistAmount + TotalAdjustmentDistTaxAmount."
      },
      "TotalAdjustmentDist​TaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalAdjustmentDistAmount. This is a calculated field."
      },
      "TotalAdjustmentTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalAdjustmentAmount. This is a calculated field."
      },
      "TotalAmtWithTax": {
        "type": "currency",
        "description": "Total price of the OrderItemSummary, inclusive of tax. This amount is equal to TotalPrice + TotalTaxAmount."
      },
      "TotalLineAdjustmentAmount": {
        "type": "currency",
        "description": "Total of all non-order-level price adjustments applied to this OrderItemSummary. This value includes OrderItemAdjustmentLineSummaries that don’t belong to an OrderAdjustmentGroupSummary, or that belong to an OrderAdjustmentGroupSummary of type SplitLine. This is a calculated field."
      },
      "TotalLineAdjustment​AmtWithTax": {
        "type": "currency",
        "description": "Total of all non-order-level price adjustments applied to this OrderItemSummary, inclusive of tax. This amount is equal to TotalLineAdjustmentAmount + TotalLineAdjustmentTaxAmount."
      },
      "TotalLineAdjustment​TaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalLineAdjustmentAmount. This is a calculated field."
      },
      "TotalLineAmount": {
        "type": "currency",
        "description": "Total, not including adjustments or tax, of the OrderItemSummary."
      },
      "TotalLineAmount​WithTax": {
        "type": "currency",
        "description": "Total unadjusted amount of the OrderItemSummary, inclusive of tax. This amount is equal to TotalLineAmount + TotalLineTaxAmount."
      },
      "TotalLineTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalLineAmount. This is a calculated field."
      },
      "TotalPrice": {
        "type": "currency",
        "description": "Total, including line and order-level adjustments but not tax, of the OrderItemSummary. This is a calculated field."
      },
      "TotalTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalPrice. This is a calculated field."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of the OrderItemSummary. Delivery Charge indicates that the OrderItemSummary represents a delivery charge. Fee indicates that it represents another type of fee, such as a return fee. Order Product indicates that it represents any other type of product, service, or charge. Each type corresponds to one type code, shown here in parentheses."
      },
      "TypeCode": {
        "type": "picklist",
        "description": "Type code of the OrderItemSummary. Charge indicates that the OrderItemSummary represents a charge or fee. Product indicates that it represents any other type of product, service, or charge. A type code can be associated with one or more types."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "Unit price of the product represented by the OrderItemSummary."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_orderitemsummary.htm"
  }
}