{
  "OrderDeliveryGroupSummary": {
    "name": "OrderDeliveryGroupSummary",
    "description": "Represents the current properties and state of a group of OrderItemSummaries, belonging to one OrderSummary, to be fulfilled using the same delivery method and delivered to the same address. A single shipment can include them all, but that isn’t guaranteed. Corresponds to one or more order delivery group objects, consisting of an original object and any change objects applicable to it.",
    "properties": {
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "ISO code for the currency of the OrderSummary associated with the OrderDeliveryGroupSummary. The default value is USD."
      },
      "DeliverToAddress": {
        "type": "address",
        "description": "Address of the recipient. Users with the Edit Delivery Information user permission can modify this field."
      },
      "DeliverToCity": {
        "type": "string",
        "description": "Recipient address city."
      },
      "DeliverToCompanyName": {
        "type": "string",
        "description": ""
      },
      "DeliverToCountry": {
        "type": "string",
        "description": "Recipient address country."
      },
      "DeliverToFullFirstName": {
        "type": "string",
        "description": ""
      },
      "DeliverToFullLastName": {
        "type": "string",
        "description": ""
      },
      "DeliverToFullName": {
        "type": "string",
        "description": ""
      },
      "DeliverToFullSalutation": {
        "type": "picklist",
        "description": ""
      },
      "DeliverTo​GeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy of the geocode for the recipient address."
      },
      "DeliverToLatitude": {
        "type": "double",
        "description": "Used with FulfilledToLongitude to specify the precise geolocation of the recipient address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "DeliverToLongitude": {
        "type": "double",
        "description": "Used with FulfilledToLatitude to specify the precise geolocation of the recipient address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "DeliverToName": {
        "type": "string",
        "description": "Name on the recipient address. Users with the Edit Delivery Information user permission can modify this field."
      },
      "DeliverToPostalCode": {
        "type": "string",
        "description": "Recipient address postal code."
      },
      "DeliverToState": {
        "type": "string",
        "description": "Recipient address state."
      },
      "DeliverToStreet": {
        "type": "textarea",
        "description": "Recipient address street."
      },
      "DeliveryInstructions": {
        "type": "textarea",
        "description": "Special instructions for the delivery. Users with the Edit Delivery Information user permission can modify this field."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the OrderDeliveryGroupSummary."
      },
      "DesiredDeliveryDate": {
        "type": "dateTime",
        "description": "Desired date for delivery. This field is informational, available for customizations. Users with the Edit Delivery Information user permission can modify this field."
      },
      "EmailAddress": {
        "type": "email",
        "description": "Email address of the recipient. Users with the Edit Delivery Information user permission can modify this field."
      },
      "GiftMessage": {
        "type": "textarea",
        "description": "Gift message to include. Users with the Edit Delivery Information user permission can modify this field."
      },
      "GrandTotalAmount": {
        "type": "currency",
        "description": "Total, including adjustments and tax, of the delivery charges associated with the OrderDeliveryGroupSummary. This value only includes OrderItemSummaries of type code Charge."
      },
      "IsGift": {
        "type": "boolean",
        "description": "Indicates whether the OrderDeliveryGroupSummary represents a gift. Users with the Edit Delivery Information user permission can modify this field."
      },
      "OrderDeliveryGroup​SummaryNumber": {
        "type": "string",
        "description": "ID of the OrderDeliveryGroupSummary."
      },
      "OrderDeliveryMethodId": {
        "type": "reference",
        "description": "ID of the order delivery method specified for the OrderDeliveryGroupSummary. Users with the Edit Delivery Information user permission can modify this field."
      },
      "OrderSummaryId": {
        "type": "reference",
        "description": "ID of the OrderSummary associated with the OrderDeliveryGroupSummary."
      },
      "OriginalOrderDelivery​GroupId": {
        "type": "reference",
        "description": "ID of the original order delivery group associated with this summary object. Nillable=true only if the associated order summary is unmanaged. For managed order summaries, nillable=false."
      },
      "PhoneNumber": {
        "type": "phone",
        "description": "Phone number of the recipient. Users with the Edit Delivery Information user permission can modify this field."
      },
      "PromisedDeliveryDate": {
        "type": "dateTime",
        "description": "Promised date for delivery. This field is informational, available for customizations. Users with the Edit Delivery Information user permission can modify this field."
      },
      "TotalAdjustmentAmount": {
        "type": "currency",
        "description": "Total price adjustments applied to delivery charges associated with the OrderDeliveryGroupSummary. This value only includes adjustments to OrderItemSummaries of type code Charge."
      },
      "TotalAdjustment​AmtWithTax": {
        "type": "currency",
        "description": "Total amount of the price adjustments applied to the delivery charges associated with the OrderDeliveryGroupSummary, inclusive of tax. This amount is equal to TotalAdjustmentAmount + TotalAdjustmentTaxAmount."
      },
      "TotalAdjustment​TaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalAdjustmentAmount."
      },
      "TotalAmount": {
        "type": "currency",
        "description": "Total, including adjustments but not tax, of the delivery charges associated with the OrderDeliveryGroupSummary. This value only includes adjustments to OrderItemSummaries of type code Charge."
      },
      "TotalLineAmount": {
        "type": "currency",
        "description": "Total, not including adjustments or tax, of the delivery charges associated with the OrderDeliveryGroupSummary."
      },
      "TotalLineAmt​WithTax": {
        "type": "currency",
        "description": "Total of the delivery charges associated with the OrderDeliveryGroupSummary, inclusive of tax. This amount is equal to TotalLineAmount + TotalLineTaxAmount."
      },
      "TotalLineTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalLineAmount."
      },
      "TotalTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalAmount."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_orderdeliverygroupsummary.htm"
  }
}