{
  "Order": {
    "name": "Order",
    "description": "Represents an order associated with a contract or an account.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "Required. ID of the Account associated with this order. Can only be updated when the order’s StatusCode value is Draft."
      },
      "ActivatedById": {
        "type": "reference",
        "description": "ID of the User who activated this order."
      },
      "ActivatedDate": {
        "type": "dateTime",
        "description": "Date and time when the order was activated."
      },
      "BillingAddress": {
        "type": "address",
        "description": ""
      },
      "BillingCity": {
        "type": "string",
        "description": "City for the billing address for this order. Maximum size is 40 characters."
      },
      "BillingCountry": {
        "type": "string",
        "description": "Country for the billing address for this order. Maximum size is 80 characters."
      },
      "BillingCountryCode": {
        "type": "picklist",
        "description": "ISO country code for the billing address for this order."
      },
      "BillingEmailAddress": {
        "type": "email",
        "description": "Email address for this order’s billing address."
      },
      "BillingGeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode of the address."
      },
      "BillingLatitude": {
        "type": "double",
        "description": "Used with BillingLongitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "BillingLongitude": {
        "type": "double",
        "description": "Used with BillingLatitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "BillingPhoneNumber": {
        "type": "phone",
        "description": "Phone number for this order’s billing address."
      },
      "BillingPostalCode": {
        "type": "string",
        "description": "Postal code for the billing address for this order. Maximum size is 20 characters."
      },
      "BillingState": {
        "type": "string",
        "description": "State for the billing address for this order. Maximum size is 80 characters."
      },
      "BillingStateCode": {
        "type": "picklist",
        "description": "ISO state code for the order’s billing address."
      },
      "BillingStreet": {
        "type": "textarea",
        "description": "Street address for the billing address."
      },
      "BillToContactId": {
        "type": "reference",
        "description": "ID of the contact that the order is billed to."
      },
      "CompanyAuthorizedById": {
        "type": "reference",
        "description": "ID of the user who authorized the account associated with the order."
      },
      "CompanyAuthorizedDate": {
        "type": "date",
        "description": "The date on which your organization authorized the order."
      },
      "ContractId": {
        "type": "reference",
        "description": "ID of the contract associated with this order. Can only be updated when the order’s StatusCode value is Draft."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Three-letter ISO 4217 currency code."
      },
      "CustomerAuthorizedById": {
        "type": "reference",
        "description": "ID of the contact who authorized the order."
      },
      "CustomerAuthorizedDate": {
        "type": "date",
        "description": "Date on which the contact authorized the order."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the order."
      },
      "EffectiveDate": {
        "type": "date",
        "description": "Date at which the order becomes effective. Label is Order Start Date."
      },
      "EndDate": {
        "type": "date",
        "description": "Date at which the order ends. Label is Order End Date."
      },
      "GrandTotalAmount": {
        "type": "currency",
        "description": "Sum of TotalAmount and TotalTaxAmount."
      },
      "IsReductionOrder": {
        "type": "boolean",
        "description": "Read-only. Determines whether an order is a reduction order. Label is Reduction Order."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last interacted with this record, directly or indirectly. Some sample scenarios are:"
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "Name": {
        "type": "string",
        "description": "Name for this order."
      },
      "OpportunityId": {
        "type": "reference",
        "description": "ID for the opportunity that’s associated with this order."
      },
      "OrderedDate": {
        "type": "dateTime",
        "description": "The date and time that the order was placed."
      },
      "OrderManagementReferenceIdentifier": {
        "type": "string",
        "description": "This field is used by Order Management to store the external reference Identifier for B2C Commerce orders. On creation, the B2C Integration sets this value to B2C realm ID + \"_\" + B2C instance ID + \"@\" + B2C Commerce catalog/domain ID + \"@\" + B2C Commerce order number. Otherwise, it isn’t set."
      },
      "OrderNumber": {
        "type": "string",
        "description": "Order number assigned to this order (not the unique, system-generated ID assigned during creation). Maximum size is 30 characters."
      },
      "OrderReferenceNumber": {
        "type": "string",
        "description": "Order reference number assigned to this order. Maximum size is 80 characters."
      },
      "OriginalOrderId": {
        "type": "reference",
        "description": "Optional. ID of the original order that a reduction order is reducing, if the reduction order is reducing a single order. Label is Original Order.Editable only if isReductionOrder is true. If the reduction order is reducing more than one order, leave blank."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Required. ID of the User or queue that owns this order."
      },
      "PaymentTermId": {
        "type": "reference",
        "description": "The ID of the related payment term. This field is available in API version 55.0 and later. This field is available if Subscription Management is enabled in your org."
      },
      "PoDate": {
        "type": "date",
        "description": "Date of the purchase order."
      },
      "PoNumber": {
        "type": "string",
        "description": "Number identifying the purchase order. Maximum is 80."
      },
      "Pricebook2Id": {
        "type": "reference",
        "description": "Required. ID of the price book associated with this order."
      },
      "QuoteId": {
        "type": "reference",
        "description": "ID of the quote that’s associated with this order.If you set QuoteId to null, QuoteLineItemId on all of the order’s child order products is set to null."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "ID of the record type assigned to this order."
      },
      "RelatedOrderId": {
        "type": "reference",
        "description": "The original order that a change order was created from."
      },
      "RelatedOrderType": {
        "type": "picklist",
        "description": "Specifies the related order type."
      },
      "SalesChannelId": {
        "type": "reference",
        "description": "Reference to a sales channel entity."
      },
      "SalesStoreId": {
        "type": "reference",
        "description": "ID of the RetailStore or WebStore associated with this Order."
      },
      "ShippingAddress": {
        "type": "address",
        "description": "Shipping address for the order."
      },
      "ShippingCity": {
        "type": "string",
        "description": "City of the shipping address. Maximum size is 40 characters."
      },
      "ShippingCountry": {
        "type": "string",
        "description": "Country of the shipping address. Maximum size is 80 characters."
      },
      "ShippingCountryCode": {
        "type": "picklist",
        "description": "ISO country code for the order’s shipping address."
      },
      "ShippingGeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode of the shipping address."
      },
      "ShippingLatitude": {
        "type": "double",
        "description": "Used with ShippingLongitude to specify the precise geolocation of a shipping address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "ShippingLongitude": {
        "type": "double",
        "description": "Used with ShippingLatitude to specify the precise geolocation of an address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "ShippingPostalCode": {
        "type": "string",
        "description": "Postal code of the shipping address. Maximum size is 20 characters."
      },
      "ShippingState": {
        "type": "string",
        "description": "State of the shipping address. Maximum size is 80 characters."
      },
      "ShippingStateCode": {
        "type": "picklist",
        "description": "ISO state code for the order’s shipping address."
      },
      "ShippingStreet": {
        "type": "textarea",
        "description": "Street address of the shipping address. Maximum of 255 characters."
      },
      "ShipToContactId": {
        "type": "reference",
        "description": "ID of the contact that the order is shipped to."
      },
      "Status": {
        "type": "picklist",
        "description": "Picklist of values that indicate order status. Each value is associated with one of the status categories defined in StatusCode. For example, the status picklist might contain Draft, Ready for Review, and Ready for Activation values with a StatusCode of Draft."
      },
      "StatusCode": {
        "type": "picklist",
        "description": "The status category for the order. Label is Status Category.Valid values are: Draft Activated Superseded-This value is applicable only to Revenue Cloud Advanced users and is available in API version 64.0 and later. To use supplemental orders, also known as in-flight amendments, create a status that’s associated with the Superseded status code. ."
      },
      "TaxLocaleType": {
        "type": "picklist",
        "description": "The type of tax calculation that Salesforce uses for the order’s order items. VAT regions use gross tax, which includes tax in all sale amounts. US regions use net tax, which calculates tax separately from the initial sale amount and then adds the sale and tax amounts together in a total."
      },
      "TotalAdjDeliveryAmtWithTax": {
        "type": "currency",
        "description": "Sum of delivery line amounts, delivery line adjustments, and tax. Order products with null Type fields aren’t included."
      },
      "TotalAdjProductAmtWithTax": {
        "type": "currency",
        "description": "Sum of product line amounts, line adjustments, and tax. Order products with null Type fields aren’t included."
      },
      "TotalAdjustedDeliveryAmount": {
        "type": "currency",
        "description": "Sum of delivery line amounts and delivery line adjustments. Order products with null Type fields aren’t included."
      },
      "TotalAdjustedDeliveryTaxAmount": {
        "type": "currency",
        "description": "Sum of delivery line tax amounts and delivery line tax adjustments."
      },
      "TotalAdjustedProductAmount": {
        "type": "currency",
        "description": "Sum of product line amounts and line adjustments. Order products with null Type fields aren’t included."
      },
      "TotalAdjustedProductTaxAmount": {
        "type": "currency",
        "description": "Sum of line tax amounts and line tax adjustments. Order products with null Type fields aren’t included."
      },
      "TotalAmount": {
        "type": "currency",
        "description": "The net total amount for the order products associated with this order."
      },
      "TotalDeliveryAdjDistAmount": {
        "type": "currency",
        "description": "Roll-up of the order’s delivery adjustment distributed amounts. Used only when the Order Adjustment Group has a Type value of Header."
      },
      "TotalDeliveryAdjDistAmtWithTax": {
        "type": "currency",
        "description": "Roll-up of the order’s delivery adjustment distributed amounts and tax. Used only when the Order Adjustment Group has a Type value of Header."
      },
      "TotalDeliveryAdjDistTaxAmount": {
        "type": "currency",
        "description": "Roll-up of the order’s delivery adjustment distributed tax amounts. Used only when the Order Adjustment Group has a Type value of Header."
      },
      "TotalProductAdjDistAmount": {
        "type": "currency",
        "description": "Roll-up of the order’s product adjustment distributed amounts. Order products with null Type fields aren’t included. Used only when the Order Adjustment Group has a Type value of Header."
      },
      "TotalProductAdjDistAmtWithTax": {
        "type": "currency",
        "description": "Roll-up of the order’s product adjustment distributed amounts. Order products with null Type fields aren’t included. Used only when the Order Adjustment Group has a Type value of Header."
      },
      "TotalProductAdjDistTaxAmount": {
        "type": "currency",
        "description": "Roll-up of the order’s product adjustment distributed tax amounts. Order products with null Type fields aren’t included. Used only when the Order Adjustment Group has a Type value of Header."
      },
      "TotalTaxAmount": {
        "type": "currency",
        "description": "Roll up of all tax on the order. Includes delivery taxes, price adjustment taxes, and product taxes."
      },
      "Type": {
        "type": "picklist",
        "description": "If you want to show more information about your order, you can add custom values to the Type picklist. By default, the Type field doesn't perform any actions or show any values."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_order.htm"
  }
}