{
  "OrderItemTaxLineItemSummary": {
    "name": "OrderItemTaxLineItemSummary",
    "description": "Represents the current tax on an OrderItemSummary or OrderItemAdjustmentLineSummary. Corresponds to one or more order item tax line items, consisting of an original object and any change objects applicable to it.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "Amount of tax represented by the OrderItemTaxLineItemSummary."
      },
      "CalculationReferenceNumber": {
        "type": "string",
        "description": "Reference number provided by the tax provider, such as Stripe, in the tax calculation API response."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "ISO code for the currency of the OrderSummary associated with the OrderItemTaxLineItemSummary. The default value is USD."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the OrderItemTaxLineItemSummary."
      },
      "Name": {
        "type": "string",
        "description": "Name of the OrderItemTaxLineItemSummary."
      },
      "OrderItemAdjustmentLine​SummaryId": {
        "type": "reference",
        "description": "If this object represents tax on an adjustment, this value is the ID of the OrderItemAdjustmentLineSummary to which the tax applies. If this value is null, the adjustment applies to an OrderItemSummary."
      },
      "OrderItemSummaryId": {
        "type": "reference",
        "description": "If this object represents tax on an OrderItemSummary, this value is the ID of that OrderItemSummary. If this object represents tax on an adjustment, this value is the ID of the OrderItemSummary to which the adjustment applies."
      },
      "OrderSummaryId": {
        "type": "reference",
        "description": "ID of the OrderSummary that the associated OrderItemSummary or OrderItemAdjustmentLineSummary belongs to."
      },
      "OriginalOrderItemTax​LineItemId": {
        "type": "reference",
        "description": "ID of the original order item tax line item associated with this summary object. Nillable=true only if the associated order summary is unmanaged. For managed order summaries, nillable=false."
      },
      "Rate": {
        "type": "percent",
        "description": "Tax rate used to calculate the Amount."
      },
      "ReferenceNumber": {
        "type": "string",
        "description": ""
      },
      "TaxEffectiveDate": {
        "type": "date",
        "description": "Date on which the Amount was calculated. Important due to tax rate changes over time."
      },
      "TransactionReferenceNumber": {
        "type": "string",
        "description": ""
      },
      "Type": {
        "type": "picklist",
        "description": "Indicates whether the Amount is actual or estimated."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_orderitemtaxlineitemsummary.htm"
  }
}