{
  "OrderPaymentSummary": {
    "name": "OrderPaymentSummary",
    "description": "Represents the current properties and state of payments using a single payment method that are applied to one OrderSummary.",
    "properties": {
      "AuthorizationAmount": {
        "type": "currency",
        "description": "Amount of the OrderPaymentSummary that has been authorized."
      },
      "AuthorizationReversal​Amount": {
        "type": "currency",
        "description": "Amount of the AuthorizationAmount that has been reversed."
      },
      "AvailableToCaptureAmount": {
        "type": "currency",
        "description": "Amount of the OrderPaymentSummary that’s available to be captured. Equal to AuthorizationAmount minus (CapturedAmount and PendingCaptureAmount and AuthorizationReversalAmount and PendingReverseAuthAmount). However, if the calculated amount is a negative number, this value is 0."
      },
      "AvailableToRefundAmount": {
        "type": "currency",
        "description": "Amount of the OrderPaymentSummary that’s available to be refunded. Equal to CapturedAmount plus PendingCaptureAmount minus (RefundedAmount and PendingRefundAmount). However, if the calculated amount is a negative number, this value is 0."
      },
      "BalanceAmount": {
        "type": "currency",
        "description": "Total balance of all payments associated with this summary object."
      },
      "CapturedAmount": {
        "type": "currency",
        "description": "Amount of the OrderPaymentSummary that has been captured."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for orgs with the multicurrency feature enabled. Contains the ISO code for the currency of the OrderSummary associated with the OrderPaymentSummary. Order Management APIs and actions that create an OrderPaymentSummary for an OrderSummary set this value. The default value is USD."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the payment method user."
      },
      "LastPaymentGateway​LogId": {
        "type": "reference",
        "description": "ID of the most recent payment gateway log associated with the OrderPaymentSummary."
      },
      "LastPaymentGateway​Message": {
        "type": "string",
        "description": "The most recent message received from the payment gateway associated with the OrderPaymentSummary."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Timestamp when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Timestamp when the current user last viewed this record. A null value can mean that this record was only referenced (LastReferencedDate) and not viewed."
      },
      "Method": {
        "type": "string",
        "description": "Name of the OrderPaymentSummary."
      },
      "OrderSummaryId": {
        "type": "reference",
        "description": "ID of the OrderSummary associated with the OrderPaymentSummary."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who currently owns this OrderPaymentSummary. Default value is the user logged in to the API to perform the create."
      },
      "PaymentCreditedAmount": {
        "type": "currency",
        "description": "Total amount of credit associated with this OrderPaymentSummary."
      },
      "PaymentMethodId": {
        "type": "reference",
        "description": "ID of the payment method associated with this OrderPaymentSummary."
      },
      "PendingAuthorization​Amount": {
        "type": "currency",
        "description": "Amount of the OrderPaymentSummary that’s pending authorization."
      },
      "PendingCaptureAmount": {
        "type": "currency",
        "description": "Amount of the OrderPaymentSummary that’s pending capture."
      },
      "PendingRefundAmount": {
        "type": "currency",
        "description": "Amount of the OrderPaymentSummary that’s pending refund."
      },
      "PendingReverseAuth​Amount": {
        "type": "currency",
        "description": "Amount of the AuthorizationAmount that’s pending reversal."
      },
      "RefundedAmount": {
        "type": "currency",
        "description": "Amount of the OrderPaymentSummary that was refunded."
      },
      "ReservedBalanceTotalAmount": {
        "type": "currency",
        "description": "Calculated field that summarizes the ReservedBalanceAmount for all OrderPaymentSummaryReferences for the OrderPaymentSummary."
      },
      "Type": {
        "type": "string",
        "description": "The payment method type associated with the OrderPaymentSummary. For example, visa, mastercard, check, or giftcard."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_orderpaymentsummary.htm"
  }
}