{
  "OrgMetricScanResult": {
    "name": "OrgMetricScanResult",
    "description": "Represents data or an item associated with a feature’s results in a Salesforce Optimizer evaluation. For example, for the Custom Field Limit feature, an OrgMetricScanResult object represents an object flagged for approaching the custom field limit.",
    "properties": {
      "Date": {
        "type": "dateTime",
        "description": "The date associated with an item in a feature’s Optimizer evaluation."
      },
      "Flags": {
        "type": "int",
        "description": "The flags associated with an item in a feature’s Optimizer evaluation."
      },
      "ItemStatus": {
        "type": "picklist",
        "description": "The recommended action for an item in a feature’s Optimizer evaluation."
      },
      "Name": {
        "type": "string",
        "description": "The name of the item in a feature’s Optimizer evaluation, such as an object name."
      },
      "Object": {
        "type": "string",
        "description": "The object ID associated with the item in a feature’s Optimizer evaluation. For the Release Update feature only, Object indicates the release that the update is scheduled for."
      },
      "OrgMetricScanSummaryId": {
        "type": "reference",
        "description": "The feature’s OrgMetricScanSummary ID from the most recent Optimizer run."
      },
      "Profile": {
        "type": "int",
        "description": "The profile ID associated with the item in a feature’s Optimizer evaluation."
      },
      "Quantity": {
        "type": "int",
        "description": "A quantity associated with the item in a feature’s Optimizer evaluation."
      },
      "Type": {
        "type": "string",
        "description": "The type of item or data in a feature’s Optimizer evaluation."
      },
      "Url": {
        "type": "url",
        "description": "The URL associated with the item in a feature’s Optimizer evaluation."
      },
      "User": {
        "type": "string",
        "description": "The user ID or username associated with the item in a feature’s Optimizer evaluation. For the Release Update feature only, User indicates the name of the release update that requires review."
      }
    },
    "module": "Core Salesforce"
  }
}