{
  "OtherEmssnFctrSet": {
    "name": "OtherEmssnFctrSet",
    "description": "Represents a collection of emissions and conversion factors for various data types and sources that are neither the electricity grid nor scope 3 data types.",
    "properties": {
      "Ch4GlblWarmingPot": {
        "type": "double",
        "description": "The value that's used to convert the CH4 emissions into their equivalent CO2 emissions."
      },
      "EmissionFactorDataSource": {
        "type": "textarea",
        "description": "The source of the emissions factor reference data."
      },
      "EmissionFactorUpdateYear": {
        "type": "picklist",
        "description": "The year in which this reference data for the emissions factor was most recently updated."
      },
      "ExternalIdentifier": {
        "type": "string",
        "description": "The external identifier for the emissions factor."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "N2oGlblWarmingPot": {
        "type": "double",
        "description": "The value that's used to convert the N2O emissions into their equivalent CO2 emissions."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "ReferenceDataLoadLogId": {
        "type": "reference",
        "description": "The reference data load log record that's associated with the emissions factor."
      },
      "RefrigerantLeakageRtInKgItKwh": {
        "type": "double",
        "description": "The leakage rate of the refrigerant used for cooling the data center's computing equipment."
      },
      "RefrigerantLeakageRtInKgM2": {
        "type": "double",
        "description": "The annual average leakage rate of the refrigerant for the occupied building space in kilograms of refrigerant per square meter. This leakage rate is used to estimate the refrigerant consumption in the office space. This value is calculated if you enter the Refrigerant Leakage Rate (kg/sqft) value."
      },
      "RefrigerantLeakageRtInKgSqft": {
        "type": "double",
        "description": "The annual average leakage rate of the refrigerant for the occupied building space in kilograms of refrigerant per square foot. This leakage rate is used to estimate the refrigerant consumption in the office space. This value is calculated if you enter the Refrigerant Leakage Rate (kg/m2) value."
      },
      "ShouldLockDtastUpdtForRec": {
        "type": "boolean",
        "description": "Indicates whether the emissions factor record can be locked from dataset updates."
      }
    },
    "module": "Net Zero Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.netzero_cloud_dev_guide.meta/netzero_cloud_dev_guide/sforce_api_objects_otheremssnfctrset.htm"
  }
}