{
  "TaxEngine": {
    "name": "TaxEngine",
    "description": "Represents information about an instance of a tax engine provider as well as the merchant credentials for that specific instance.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of an instance of the tax engine provider and merchant credential."
      },
      "ExternalReference": {
        "type": "string",
        "description": "Information about the external platform used for the tax engine."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a tax engine record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a tax engine record. If this value is null, it’s possible that the user only accessed the tax engine record or a related list view (LastReferencedDate), but not viewed the tax engine record itself."
      },
      "MerchantCredentialId": {
        "type": "reference",
        "description": "Required. The merchant credential setup object in Salesforce. The Tax Calculation API sends the merchant credential's information to the external tax engine that's used for tax calculation."
      },
      "SellerCode": {
        "type": "string",
        "description": "Required. The seller code of the transaction for which the tax engine integration log was captured."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the tax engine record."
      },
      "TaxEngineAddress": {
        "type": "address",
        "description": "Required. The compound form of the tax engine address. This field is used when the request doesn’t contain a Ship To address. See Address Compound Fields for details on compound address fields."
      },
      "TaxEngineName": {
        "type": "string",
        "description": "Required. The name of the tax engine record."
      },
      "TaxEngineProviderId": {
        "type": "reference",
        "description": "Required. The tax engine provider that's related to the tax engine record."
      },
      "TaxPrvdAccountIdentifier": {
        "type": "string",
        "description": "The unique identifier of the external tax provider's account. Available in API version 63.0 and later."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of the tax engine that's used to calculate tax."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_taxengine.htm"
  }
}