{
  "TaxPolicy": {
    "name": "TaxPolicy",
    "description": "Represents information about a group of tax treatments, where each treatment represents parameters to determine how a particular product is taxed for a transaction line item. Tax policies are related to products, which pass the policy on to the resulting order items and in turn the billing schedules.",
    "properties": {
      "DefaultTaxTreatmentId": {
        "type": "reference",
        "description": "The ID of the default tax treatment record. When you order a product, the order product, and in turn the billing schedule receives this tax treatment."
      },
      "Description": {
        "type": "textarea",
        "description": "Additional details about the tax policy."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed an invoice batch draft to posted run record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a tax policy record. If this value is null, it’s possible that the user only accessed the tax policy record or a related list view (LastReferencedDate), but not viewed the tax policy record itself."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the tax policy."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the tax policy. To calculate tax for order products, products must have an active tax policy. Tax policies are created with a Draft status before being assigned to a product or order product. After activating a tax policy, you can't edit certain policy fields."
      },
      "TreatmentSelection": {
        "type": "picklist",
        "description": "Required. Specifies the selection of tax treatments to billing schedules that are related to the tax policy."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_taxpolicy.htm"
  }
}