{
  "TransactionProcessingType": {
    "name": "TransactionProcessingType",
    "description": "Represents the settings to configure the processing constraints for a request.",
    "properties": {
      "Description": {
        "type": "string",
        "description": "The description of the transaction processing configuration to help Salesforce admins with configuration in their orgs."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Required. The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Record Type Name."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the TransactionProcessingType object."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label for the TransactionProcessingType object."
      },
      "PricingPreference": {
        "type": "string",
        "description": "Specifies whether to execute the price calculation step for each sales transaction record. Valid values are: Force—Reprices all lines. System—Performs a delta pricing request on the unprocessed lines when Delta Pricing is enabled in the org. Skip—Skips the pricing request on all lines. Available in API version 65.0 and later."
      },
      "RuleEngine": {
        "type": "picklist",
        "description": "The rule engine to be used for processing rules."
      },
      "SaveType": {
        "type": "picklist",
        "description": "Specifies how the transaction results are processed when saved for Salesforce administrators to adjust the user experience as desired. Valid values are: Standard Large—Reserved for future use."
      },
      "TaxPreference": {
        "type": "picklist",
        "description": "Specifies whether to execute or skip the tax calculation step for each sales transaction record."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/tooling_api_objects_transactionprocessingtype.htm"
  }
}