{
  "ActionableListMbrInvitation": {
    "name": "ActionableListMbrInvitation",
    "description": "Represents a relationship between an Actionable List Member and an Appointment Invitation.",
    "properties": {
      "ActionableListMemberId": {
        "type": "reference",
        "description": "The ID of the actionable list member that’s associated with the actionable list member invitation record."
      },
      "AppointmentInvitationId": {
        "type": "reference",
        "description": "The ID of the appointment invitation that’s associated with the actionable list member invitation record."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time when the current user last viewed a related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time when the current user last viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "Auto-assigned number that identifies the actionable list member invitation record."
      },
      "ServiceAppointmentId": {
        "type": "reference",
        "description": "The ID of the service appointment that’s associated with the actionable list member invitation."
      }
    },
    "module": "Scheduler"
  },
  "AppointmentAssignmentPolicy": {
    "name": "AppointmentAssignmentPolicy",
    "description": "Stores information about resource assignment rules.",
    "properties": {
      "FullName": {
        "type": "string",
        "description": "The API name of the AppointmentAssignmentPolicy object."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the appointment assignment policy."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label for the appointment assignment policy."
      },
      "PolicyApplicableDuration": {
        "type": "picklist",
        "description": "The frequency at which the utilization of service resources is calculated. This field is available in API version 53.0 and later."
      },
      "PolicyType": {
        "type": "picklist",
        "description": "The type of appointment assignment policy."
      },
      "UtilizationFactor": {
        "type": "picklist",
        "description": "Specifies the count type for the resource utilization. This field is available in API version 53.0 and later."
      }
    },
    "module": "Scheduler"
  },
  "AppointmentCategory": {
    "name": "AppointmentCategory",
    "description": "Represents the category of work types and shifts.",
    "properties": {
      "IsDropIn": {
        "type": "boolean",
        "description": "Indicates whether the appointment mode is drop-in (true) or not (false)."
      },
      "IsGroup": {
        "type": "boolean",
        "description": "Indicates whether the appointment mode is group (true) or not (false). It also indicates whether work types and shifts support the group category."
      },
      "IsScheduled": {
        "type": "boolean",
        "description": "Indicates whether the appointment mode is regular (true) or not (false). It also indicates whether work types and shifts support the group category."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the appointment category record was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the appointment category record was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "Name of the appointment category."
      }
    },
    "module": "Scheduler"
  },
  "AppointmentInvitation": {
    "name": "AppointmentInvitation",
    "description": "Represents information about an appointment invitation that’s created for customers who can use it for booking appointments.",
    "properties": {
      "AppointmentTopicId": {
        "type": "reference",
        "description": "Appointment topic that's associated with this invitation."
      },
      "AppointmentTopicType": {
        "type": "string",
        "description": "Type of appointment topic that's related to this invitation. For example, work type or work type group."
      },
      "AppointmentType": {
        "type": "picklist",
        "description": "Appointment type for the appointment invitation. This field is available in API version 57.0 and later."
      },
      "BookingEndDate": {
        "type": "date",
        "description": "Date until which an appointment can be booked by using the appointment invitation URL."
      },
      "BookingStartDate": {
        "type": "date",
        "description": "Date from which an appointment can be booked by using the appointment invitation URL.Default value: current date."
      },
      "EngagementChannelTypeId": {
        "type": "reference",
        "description": "Engagement channel type for the appointment invitation. For example, users can choose video call as the engagement channel type when they create an appointment invitation. This field is available in API version 57.0 and later."
      },
      "InvitationIdentifier": {
        "type": "string",
        "description": "Invitation URL identifier that’s used to book an appointment in a flow."
      },
      "InvitationNumber": {
        "type": "string",
        "description": "Auto-assigned number that identifies the appointment invitation."
      },
      "InvitationUrl": {
        "type": "url",
        "description": "Appointment invitation URL that’s shared with users to book appointments."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the invitation URL is available for a customer to book an appointment."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Date on which the appointment invitation was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Date on which the appointment invitation was last viewed."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Owner of the appointment invitation."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "Service territory that's associated with the appointment invitation."
      },
      "UrlExpiryDate": {
        "type": "date",
        "description": "Expiration date of the appointment invitation URL."
      }
    },
    "module": "Scheduler"
  },
  "AppointmentInvitee": {
    "name": "AppointmentInvitee",
    "description": "Represents information about the participant and resources required for creating an appointment invitation URL.",
    "properties": {
      "AppointmentInvitationId": {
        "type": "reference",
        "description": "ID of the appointment invitation."
      },
      "IsPrimaryResource": {
        "type": "boolean",
        "description": "Indicates whether a service resource that's used to book an appointment is a primary resource. The default value is false."
      },
      "IsRequiredResource": {
        "type": "boolean",
        "description": "Indicates whether a service resource is required to book an appointment. The default value is false."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Date on which the appointment invitee record was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Date on which the appointment invitee record was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "Auto-assigned number that identifies the appointment invitee."
      },
      "ParticipantServiceResourceId": {
        "type": "reference",
        "description": "Service resource who's assigned to the appointment invitation."
      }
    },
    "module": "Scheduler"
  },
  "AppointmentScheduleAggr": {
    "name": "AppointmentScheduleAggr",
    "description": "Records the utilization of a service resource, by date, for the Load Balancing appointment assignment policy.",
    "properties": {
      "AppointmentDate": {
        "type": "date",
        "description": "The date of the appointment."
      },
      "Name": {
        "type": "string",
        "description": "The name or ID of the AppointmentScheduleAggr object."
      },
      "ResourceUtilizationCount": {
        "type": "integer",
        "description": "The number of appointments scheduled for a service resource. Available in API version 53.0 and later."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The service resource associated with the appointment scheduling aggregate."
      },
      "TotalResourceUtilization": {
        "type": "double",
        "description": "The number of minutes for which the service resource has scheduled appointments."
      },
      "UsageType": {
        "type": "picklist",
        "description": "Specify the usage type of the AppointmentScheduleAggr object."
      }
    },
    "module": "Scheduler"
  },
  "AppointmentScheduleLog": {
    "name": "AppointmentScheduleLog",
    "description": "Stores service appointments of each service Resource.",
    "properties": {
      "AppointmentDate": {
        "type": "date",
        "description": "The date of the appointment."
      },
      "AppointmentScheduleAggrId": {
        "type": "reference",
        "description": "The appointment scheduling aggregate associated with the appointment scheduling log."
      },
      "IsUsedForResourceUtilization": {
        "type": "boolean",
        "description": "Indicates whether the appointment scheduling log is used for deriving the appointment scheduling aggregate."
      },
      "Name": {
        "type": "string",
        "description": "The name or ID of the AppointmentScheduleLog object."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "The service appointment, resource absence, event, or any other related record associated with the appointment scheduling log."
      },
      "ResourceUtilization": {
        "type": "double",
        "description": "The number of minutes the service resource already has scheduled appointments for."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The service resource associated with the appointment scheduling log."
      },
      "UsageType": {
        "type": "picklist",
        "description": "Specify the product associated with the AppointmentScheduleLog object."
      }
    },
    "module": "Scheduler"
  },
  "AppointmentSchedulingPolicy": {
    "name": "AppointmentSchedulingPolicy",
    "description": "Represents a set of rules for scheduling appointments using Salesforce Scheduler.",
    "properties": {
      "AppointmentAssignmentPolicyId": {
        "type": "reference",
        "description": "The name or ID of the appointment assignment policy. This is a relationship field, available in version 52.0 and later."
      },
      "AppointmentStartTimeInterval": {
        "type": "picklist",
        "description": "The proposed time interval in minutes between appointment start times. For example, set the interval to 15. Appointments can then begin at the top of the hour and at 15-minute intervals thereafter (10:00 AM, 10:15 AM, 10:30 AM, and so on). Possible values are: 5 10 15 20 30 45 60 90 120 150 180 240 300 360 420 480"
      },
      "DeveloperName": {
        "type": "string",
        "description": "The API name of the AppointmentSchedulingPolicy object."
      },
      "ExtCalEventHandlerId": {
        "type": "reference",
        "description": "The API name of the custom Apex class that checks service resources’ external calendar events and returns the time slots where service resources are already booked. Available in API version 50.0 and later."
      },
      "IsOrgDefault": {
        "type": "boolean",
        "description": "Indicates whether this scheduling policy is the default appointment scheduling policy for Lightning Scheduler appointments in this org."
      },
      "IsSvcTerrOpHoursWithShiftsUsed": {
        "type": "boolean",
        "description": "Indicates whether this scheduling policy considers the intersection of shifts and service territory operating hours when determining the availability of service resources for appointments (true). The default value is false. Available in API version 56.0 and later."
      },
      "IsSvcTerritoryMemberShiftUsed": {
        "type": "boolean",
        "description": "Indicates whether this scheduling policy considers shifts of service territory members when determining the availability of service resources for appointments (true). The default value is false. Available in API version 56.0 and later."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the appointment scheduling policy."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label for the appointment scheduling policy."
      },
      "ShouldConsiderCalendarEvents": {
        "type": "boolean",
        "description": "Indicates whether this policy checks the Salesforce calendar for resource availability."
      },
      "ShouldEnforceExcludedResource": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy prevents excluded service resources from being assigned to appointments."
      },
      "ShouldEnforceRequiredResource": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy allows only required service resources to be assigned to appointments."
      },
      "ShouldMatchSkill": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy allows only required service resources who have certain skills to be assigned to appointments."
      },
      "ShouldMatchSkillLevel": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy allows only required service resources who have certain skills and skill levels to be assigned to appointments."
      },
      "ShouldRespectVisitingHours": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy prevents users from scheduling appointments outside of an account’s visiting hours."
      },
      "ShouldUsePrimaryMembers": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy allows only service resources who are primary members of a service territory to be assigned to appointments."
      },
      "ShouldUseSecondaryMembers": {
        "type": "boolean",
        "description": "Indicates whether this appointment scheduling policy allows service resources who are secondary members of a service territory to be assigned to appointments."
      }
    },
    "module": "Scheduler"
  },
  "AppointmentTopicTimeSlot": {
    "name": "AppointmentTopicTimeSlot",
    "description": "Represents a lookup to a work type or a work type group for a time slot",
    "properties": {
      "AppointmentTopicTimeSlotKey": {
        "type": "string",
        "description": "Non-editable validating field used to ensure no two rows have the same time slot and work type or work type group values in an instance."
      },
      "Name": {
        "type": "string",
        "description": "Name or ID of the AppointmentTopicTimeSlot object."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The operating hours that contain the time slot."
      },
      "TimeSlotId": {
        "type": "reference",
        "description": "The ID of the time slot."
      },
      "WorkTypeGroupId": {
        "type": "reference",
        "description": "The work type group associated with this time slot."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The work type associated with this time slot."
      }
    },
    "module": "Scheduler"
  },
  "AsgnRsrcApptSchdEvent": {
    "name": "AsgnRsrcApptSchdEvent",
    "description": "Represents the assigned resources that are part of various platform events. This object is included in a streamed notification received on the channels for the parent platform events. You can’t subscribe to the AsgnRsrcApptSchdEvent channel directly.",
    "properties": {
      "AssignedResourceId": {
        "type": "string",
        "description": "ID of the assigned resource."
      },
      "ChangedFields": {
        "type": "complexvalue",
        "description": "A list of fields that changed."
      },
      "EventUuid": {
        "type": "string",
        "description": "A universally unique identifier (UUID) that identifies a platform event message. This field is available in API version 52.0 and later."
      },
      "IsPrimaryResource": {
        "type": "boolean",
        "description": "Indicates whether the resource is primary."
      },
      "IsRequiredResource": {
        "type": "boolean",
        "description": "Indicates whether the resource is required."
      },
      "ServiceResourceId": {
        "type": "string",
        "description": "ID of the service resource assigned to the event."
      },
      "ServiceResourceUserEmail": {
        "type": "string",
        "description": "Email of the service resource user assigned to the event."
      },
      "ServiceResourceUserId": {
        "type": "string",
        "description": "ID of the user record associated with the service resource assigned to the event."
      },
      "ServiceResourceUserName": {
        "type": "string",
        "description": "Username as per the user record associated with the service resource assigned to the event."
      }
    },
    "module": "Scheduler"
  },
  "AssignedResource": {
    "name": "AssignedResource",
    "description": "Represents a service resource who is assigned to a service appointment in Salesforce Scheduler. Assigned resources appear in the Assigned Resources related list on service appointments.",
    "properties": {
      "AssignedResourceNumber": {
        "type": "string",
        "description": "An auto-generated number identifying the resource assignment."
      },
      "EventId": {
        "type": "reference",
        "description": "The ID of the event that is added to the assigned resources calendar when the service appointment is created."
      },
      "IsPrimaryResource": {
        "type": "boolean",
        "description": "Indicates whether the service resource is a primary resource or not. The default value is false. Available in API version 47.0 and later."
      },
      "IsRequiredResource": {
        "type": "boolean",
        "description": "Indicates whether the service resource is a required resource or not."
      },
      "ServiceAppointmentId": {
        "type": "reference",
        "description": "The service appointment that the resource is assigned to."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The resource who is assigned to the service appointment."
      }
    },
    "module": "Scheduler"
  },
  "EngagementChannelType": {
    "name": "EngagementChannelType",
    "description": "Represents a channel through which a customer can be reached for communication. The Engagement Channel Type object supports only the English language.",
    "properties": {
      "ContactPointType": {
        "type": "picklist",
        "description": "The contact point type of the channel."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the engagement channel type is active (true) or not (false). This field is available in API version 56.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Required. Name of the communication subscription consent record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the account owner associated with this customer."
      },
      "UsageType": {
        "type": "multipicklist",
        "description": "Specifies the usage of the engagement channel type. This field is available in API version 56.0 and later."
      }
    },
    "module": "Scheduler"
  },
  "EngagementChannelWorkType": {
    "name": "EngagementChannelWorkType",
    "description": "Represents the relationship between an Engagement Channel Type object and a Work Type object for Salesforce Scheduler.",
    "properties": {
      "AreAllEngmtChnlSupported": {
        "type": "boolean",
        "description": "Indicates whether the work type supports all engagement channels (true) or not (false)."
      },
      "EngagementChannelTypeId": {
        "type": "reference",
        "description": "The ID of the engagement channel type that’s related to the work type indicated in the WorkTypeId field."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that the current user last viewed a record related to this object."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this object."
      },
      "Name": {
        "type": "string",
        "description": "The name of this engagement channel-work type relationship."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The ID of the work type that’s related to the engagement channel type indicated in the EngagementChannelTypeId field."
      }
    },
    "module": "Scheduler"
  },
  "Holiday": {
    "name": "Holiday",
    "description": "Represents the fields in the Holiday object that are used by Salesforce Scheduler. A holiday is a period during which your service resource is unavailable for appointment scheduling.",
    "properties": {
      "ActivityDate": {
        "type": "date",
        "description": "If the Holiday IsAllDay flag is set to true (indicating that it is an all-day holiday), then the holiday due date information is contained in the ActivityDate field. This field is a date field with a timestamp that is always set to midnight in the Coordinated Universal Time (UTC) time zone. The timestamp is not relevant, and you must not attempt to alter it to account for any time zone differences."
      },
      "Description": {
        "type": "string",
        "description": "Text description of the holiday."
      },
      "EndTimeInMinutes": {
        "type": "int",
        "description": "The end time of the holiday in minutes."
      },
      "IsAllDay": {
        "type": "boolean",
        "description": "Indicates whether the duration of the holiday is all day (true) or not (false)."
      },
      "Name": {
        "type": "string",
        "description": "The name of the holiday."
      },
      "StartTimeInMinutes": {
        "type": "int",
        "description": "The start time of the holiday in minutes."
      }
    },
    "module": "Scheduler"
  },
  "OperatingHours": {
    "name": "OperatingHours",
    "description": "Represents the hours in which a service territory, service resource, or account is available for work in Salesforce Scheduler.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the operating hours. Add any details that aren’t included in the name."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the operating hours record was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the operating hours record was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the operating hours. For example, Summer Hours, Winter Hours, or Peak Season Hours."
      },
      "TimeZone": {
        "type": "picklist",
        "description": "The time zone that the operating hours fall within."
      }
    },
    "module": "Scheduler"
  },
  "OperatingHoursHoliday": {
    "name": "OperatingHoursHoliday",
    "description": "Represents the day or hours for which a service territory and service resources exclusive to the service territory are unavailable in Salesforce Scheduler.",
    "properties": {
      "DateAndTime": {
        "type": "string",
        "description": "(Read-Only) The date or time for the holiday."
      },
      "HolidayId": {
        "type": "reference",
        "description": "The ID of the holiday that’s related to the operating hours indicated in the OperatingHoursId field."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that the current user last viewed a record related to this object."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this object."
      },
      "OperatingHoursHolidayNumber": {
        "type": "string",
        "description": "(Read-Only) An auto-generated number identifying the operating hours holiday."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The ID of the operating hours that’s related to the holiday indicated in the HolidayId field."
      }
    },
    "module": "Scheduler"
  },
  "ResourceAbsence": {
    "name": "ResourceAbsence",
    "description": "Represents a time period in which a service resource is unavailable to work in Salesforce Scheduler.",
    "properties": {
      "AbsenceNumber": {
        "type": "string",
        "description": "(Read only) An auto-generated number identifying the absence."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the absence."
      },
      "End": {
        "type": "dateTime",
        "description": "The date and time when the absence ends."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the resource absence was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the resource absence was last viewed."
      },
      "ResourceId": {
        "type": "reference",
        "description": "The absent service resource."
      },
      "Start": {
        "type": "dateTime",
        "description": "The date and time when the absence begins."
      }
    },
    "module": "Scheduler"
  },
  "ResourcePreference": {
    "name": "ResourcePreference",
    "description": "Represents an account’s preference for a specified service resource.",
    "properties": {
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the resource preference was last modified."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the resource preference was last viewed."
      },
      "PreferenceType": {
        "type": "picklist",
        "description": "Resource preference type. Values include: Preferred— Indicates that the user would like their appointment assigned to the resource. Required— Indicates that the resource must be assigned to the appointment. Excluded— Indicates that the resource must not be assigned to the appointment. Resource preferences serve more as a suggestion than a requirement. You can still assign a service appointment to any resource regardless of the related account’s resource preferences."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "The account with the resource preference."
      },
      "ResourcePreferenceNumber": {
        "type": "string",
        "description": "An auto-generated number identifying the resource preference."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The service resource that is preferred, required, or excluded."
      }
    },
    "module": "Scheduler"
  },
  "ServiceAppointment": {
    "name": "ServiceAppointment",
    "description": "Represents an appointment booked through Salesforce Scheduler.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "(Read only) The account associated with the appointment."
      },
      "ActualDuration": {
        "type": "double",
        "description": "The number of minutes that it took the resource to complete the appointment. When values are first added to the Actual Start and Actual End fields, the Actual Duration is automatically populated to list the difference between the Actual Start and Actual End. If the Actual Start and Actual End fields are subsequently updated, the Actual Duration field doesn’t re-update, but you can manually update it."
      },
      "ActualEndTime": {
        "type": "dateTime",
        "description": "The actual date and time the appointment ended."
      },
      "ActualStartTime": {
        "type": "dateTime",
        "description": "The actual date and time the appointment started."
      },
      "AdditionalInformation": {
        "type": "string",
        "description": "Represents additional information about the service appointment,"
      },
      "Address": {
        "type": "address",
        "description": "The address where the appointment is taking place."
      },
      "AppointmentCategoryId": {
        "type": "reference",
        "description": "The ID of the appointment category related to the service appointment. For example, for customers who visit the branch without an appointment, the drop in category is applicable. For pre-booked appointments, the scheduled category is applicable. This field is available in API version 58.0 and later."
      },
      "AppointmentInvitationId": {
        "type": "reference",
        "description": "The ID of the appointment invitation related to the appointment. This field is available in API version 55.0 and later."
      },
      "AppointmentMode": {
        "type": "picklist",
        "description": "The mode of the service appointment.. This field is available in API version 60.0 and later."
      },
      "AppointmentNumber": {
        "type": "string",
        "description": "An auto-assigned number that identifies the appointment."
      },
      "AppointmentType": {
        "type": "picklist",
        "description": "The type of appointment."
      },
      "ApptBookingInfoUrl": {
        "type": "textarea",
        "description": "The appointment booking URL related to the appointment. This field is available in API version 57.0 and later."
      },
      "ArrivalWindowEndTime": {
        "type": "dateTime",
        "description": "The end of the window of time in which the technician is scheduled to arrive at the site. This window is typically larger than the Scheduled Start and End window to allow time for delays and scheduling changes. You can choose to share the Arrival Window Start and End with the customer, but keep the Scheduled Start and End internal-only."
      },
      "ArrivalWindowStartTime": {
        "type": "dateTime",
        "description": "The beginning of the window of time in which the technician is scheduled to arrive at the site. This window is typically larger than the Scheduled Start and End window to allow time for delays and scheduling changes. You can choose to share the Arrival Window Start and End with the customer, but keep the Scheduled Start and End internal-only."
      },
      "AttendeeCount": {
        "type": "int",
        "description": "The number of attendees associated with the service appointment. This field is available in API version 60.0 and later."
      },
      "AttendeeLimit": {
        "type": "int",
        "description": "The maximum number of customers allowed to attend the service appointment. This field is considered when the appointment mode is Group. This field is available in API version 60.0 and later."
      },
      "CancellationReason": {
        "type": "string",
        "description": "The reason for the service appointment cancellation."
      },
      "CheckedInTime": {
        "type": "dateTime",
        "description": "The date and time when the service appointment status changed to CheckedIn. This field is available in API version 60.0 and later."
      },
      "City": {
        "type": "string",
        "description": "The city where the appointment is completed. The maximum length is 40 characters."
      },
      "Comments": {
        "type": "string",
        "description": "The comments for the service appointment."
      },
      "ContactId": {
        "type": "reference",
        "description": "The contact associated with the parent record. If needed, you can manually update the service appointment contact."
      },
      "Country": {
        "type": "string",
        "description": "The country where the appointment is completed. The maximum length is 80 characters."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the appointment."
      },
      "DueDate": {
        "type": "dateTime",
        "description": "The date by which the appointment must be completed. Earliest Start Permitted and Due Date typically reflect terms in the customer’s service-level agreement."
      },
      "Duration": {
        "type": "double",
        "description": "The estimated length of the appointment. The duration is in minutes or hours based on the value selected in the Duration Type field."
      },
      "DurationType": {
        "type": "picklist",
        "description": "The unit of duration."
      },
      "EarliestStartTime": {
        "type": "dateTime",
        "description": "The date after which the appointment must be completed. Earliest Start Permitted and Due Date typically reflect terms in the customer’s service-level agreement."
      },
      "Email": {
        "type": "email",
        "description": "The email address."
      },
      "EngagementChannelTypeId": {
        "type": "reference",
        "description": "The engagement channel type that's associated with the service appointment. This field is available in API version 56.0 and later."
      },
      "GroupAppointmentAccessType": {
        "type": "picklist",
        "description": "The users who can access the group service appointment. Valid values are: AddedAndExperienceSiteAndInvitedUsers—Added, Experience Site, and Invited Users AddedAndExperienceSiteUsers—Added and Experience Site Users AddedUsers—Added Users"
      },
      "IsAnonymousBooking": {
        "type": "boolean",
        "description": "Indicates whether a service resource was automatically assigned to the appointment (true) or not (false). The default value is false."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the service appointment was last modified. Its label in the user interface is LastModifiedDate."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the service appointment was last viewed."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the service appointment."
      },
      "ParentRecordId": {
        "type": "reference",
        "description": "The parent record associated with the appointment. The parent record can’t be updated after the service appointment is created."
      },
      "ParentRecordType": {
        "type": "string",
        "description": "(Read only) The type of parent record: Account."
      },
      "Phone": {
        "type": "phone",
        "description": "The phone number."
      },
      "PostalCode": {
        "type": "string",
        "description": "The postal code where the appointment is completed. The maximum length is 20 characters."
      },
      "SchedEndTime": {
        "type": "dateTime",
        "description": "The time at which the appointment is scheduled to end. ScheduledEnd – ScheduledStart = EstimatedDuration."
      },
      "SchedStartTime": {
        "type": "dateTime",
        "description": "The time at which the appointment is scheduled to start."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The service territory associated with the appointment."
      },
      "State": {
        "type": "string",
        "description": "The state where the service appointment is completed. The maximum length is 80 characters."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the appointment. The picklist includes the following values, which can be customized: None—Default value. CheckedIn—Checked In Scheduled—Appointment has been assigned to a service resource. Dispatched—Assigned service resource has been notified about their assignment. In Progress—Work has begun. Completed—Work is complete. Cannot Complete—Work couldn’t be completed. Canceled—Work is canceled, typically before any work began"
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "The category that each Status value falls into. The StatusCategory field’s values are identical to the default Status values except CheckedIn. Use the CheckedIn value for drop-in customers.If you create custom Status values, you must indicate which category it belongs to. For example, if you create a Customer Absent value, you can decide that it belongs in the Cannot Complete category. To learn which processes reference StatusCategory, see How are Status Categories Used?"
      },
      "Street": {
        "type": "textarea",
        "description": "The street number and name where the service appointment is completed."
      },
      "Subject": {
        "type": "string",
        "description": "A short phrase describing the appointment."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The work type associated with the service appointment."
      }
    },
    "module": "Scheduler"
  },
  "ServiceAppointmentAttendee": {
    "name": "ServiceAppointmentAttendee",
    "description": "Represents a Lead, Contact, or Person Account who is associated with the Service Appointment of type Group.",
    "properties": {
      "AttendeeId": {
        "type": "reference",
        "description": "The customer who is attending the associated service appointment."
      },
      "AttendeeIdentifier": {
        "type": "string",
        "description": "The alphanumeric unique identifier of the appointment attendee. For example, D101, E63, A5015."
      },
      "Email": {
        "type": "email",
        "description": "The email of the attendee."
      },
      "HasAttended": {
        "type": "boolean",
        "description": "Indicates whether the attendee has attended the associated service appointment (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the service appointment attendee record was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the service appointment attendee record was last viewed."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the service appointment attendee record."
      },
      "ServiceAppointmentId": {
        "type": "reference",
        "description": "The service appointment associated with the appointment attendee."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the service appointment attendee."
      }
    },
    "module": "Scheduler"
  },
  "ServiceAppointmentEvent": {
    "name": "ServiceAppointmentEvent",
    "description": "Notifies subscribers of the service appointment details that are generated from the event platform.",
    "properties": {
      "AsgnRsrcApptSchdDtlEvent": {
        "type": "AsgnRsrcApptSchdEvent[]",
        "description": "One or multiple assigned resource records related to the scheduler appointment event."
      },
      "ChangeType": {
        "type": "string",
        "description": "The operation that caused the change. For example: CREATE, UPDATE, DELETE."
      },
      "EventUuid": {
        "type": "string",
        "description": "A universally unique identifier (UUID) that identifies a platform event message."
      },
      "ReplayId": {
        "type": "string",
        "description": "Represents an ID value that is populated by the system and refers to the position of the event in the event stream. Replay ID values aren’t guaranteed to be contiguous for consecutive events. A subscriber can store a replay ID value and use it on resubscription to retrieve missed events that are within the retention window."
      },
      "ServiceApptSchduleEvent": {
        "type": "SvcApptSchdEvent[]",
        "description": "The service appointment related to the scheduler appointment event."
      }
    },
    "module": "Scheduler"
  },
  "ServiceResource": {
    "name": "ServiceResource",
    "description": "Represents a technician or an asset.",
    "properties": {
      "AssetId": {
        "type": "reference",
        "description": "ID of the Asset."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the resource."
      },
      "IsActive": {
        "type": "boolean",
        "description": "When selected, this option means that the resource can be assigned to appointments. For service tracking purposes, resources can’t be deleted, so deactivating a resource is the best way to send them into retirement.Deactivating a user doesn’t deactivate the related service resource. You can’t create a service resource that is linked to an inactive user."
      },
      "IsPrimary": {
        "type": "boolean",
        "description": "Indicate whether Salesforce Scheduler must consider the service resource record for scheduling appointments (true) or not (false). Note This field is applicable only if the Main Service Resource setting is enabled in your Salesforce org."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the service resource was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the service resource was last viewed."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "The associated user. Its label in the UI is User. If the service resource represents a service crew rather than a user, leave the User field blank and select the related crew in the ServiceCrewId field."
      },
      "ResourceType": {
        "type": "picklist",
        "description": "Indicates whether the resource is a Technician (T) or Asset (S). The default value is Technician (T). You can’t add additional resource types."
      }
    },
    "module": "Scheduler"
  },
  "ServiceResourceSkill": {
    "name": "ServiceResourceSkill",
    "description": "Represents a skill that a service resource possesses in Salesforce Scheduler.",
    "properties": {
      "EffectiveEndDate": {
        "type": "datetime",
        "description": "The date when the skill expires. For example, if a service resource must be recertified after six months, the end date would be the date their certification expires."
      },
      "EffectiveStartDate": {
        "type": "datetime",
        "description": "The date when the service resource gains the skill. For example, if the skill represents a certification, the start date would be the date of certification."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the resource skill was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the resource skill was last viewed."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The service resource who possesses the skill."
      },
      "SkillId": {
        "type": "reference",
        "description": "The skill the service resource possesses."
      },
      "SkillLevel": {
        "type": "double",
        "description": "The service resource’s skill level. Skill level can range from zero to 99.99."
      },
      "SkillNumber": {
        "type": "string",
        "description": "An auto-generated number identifying the resource skill assignment."
      }
    },
    "module": "Scheduler"
  },
  "ServiceTerritory": {
    "name": "ServiceTerritory",
    "description": "Represents a geographic or functional region in which work can be performed in Salesforce Scheduler.",
    "properties": {
      "Address": {
        "type": "address",
        "description": "An address to associate with the territory. You can want to list the address of the territory’s headquarters."
      },
      "City": {
        "type": "string",
        "description": "The city of the associated address. Maximum length is 40 characters."
      },
      "Country": {
        "type": "string",
        "description": "The country to associate with the territory. Maximum length is 80 characters."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the territory."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the service territory is meant to be used. If a territory is inactive, you can’t add members to it or link it to service appointments."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the territory was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the territory was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the territory."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The territory’s operating hours, which indicate when service appointments within the territory can occur. Service resources who are members of a territory automatically inherit the territory’s operating hours unless different hours are specified on the resource record."
      },
      "PostalCode": {
        "type": "string",
        "description": "The postal code of the address associated with the territory. Maximum length is 20 characters."
      },
      "PricebookId": {
        "type": "reference",
        "description": "This field creates a foreign key relationship with the PriceBook record, storing data related to pricing."
      },
      "State": {
        "type": "string",
        "description": "The state of the address associated with the territory. Maximum length is 80 characters."
      },
      "Street": {
        "type": "textarea",
        "description": "The street number and name of the address associated with the territory."
      }
    },
    "module": "Scheduler"
  },
  "ServiceTerritoryMember": {
    "name": "ServiceTerritoryMember",
    "description": "Represents a service resource who can be assigned to service appointments in a service territory in Salesforce Scheduler.",
    "properties": {
      "Address": {
        "type": "address",
        "description": "The member’s address. You can want to list the related service resource’s address in this field."
      },
      "EffectiveEndDate": {
        "type": "datetime",
        "description": "The date when the service resource is no longer a member of the territory. If the resource will be working in the territory for the foreseeable future, leave this field blank. This field is useful for indicating when a temporary relocation ends."
      },
      "EffectiveStartDate": {
        "type": "datetime",
        "description": "The date when the service resource becomes a member of the service territory."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the territory member was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the territory member was last viewed."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The operating hours assigned to the service territory member. If no operating hours are specified, the member is assumed to use their parent service territory’s operating hours. If a member needs special operating hours, create them in Setup and select them in the Operating Hours lookup field on the member’s detail page."
      },
      "Role": {
        "type": "picklist",
        "description": "The role associated with the service resource."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The service resource assigned to the service territory."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The service territory that the service resource is assigned to."
      },
      "TerritoryType": {
        "type": "picklist",
        "description": "Primary, Secondary, or Relocation. The primary territory is typically the territory where the resource works most often—for example, near their home base. Service resources can only have one primary territory. Secondary territories are territories where the resource can be assigned to appointments, if needed. Service resources can have multiple secondary territories. Relocation territories represent temporary moves for service resources. For example, a service resource can have the following territories: Primary territory: West Chicago Secondary territories: East Chicago South Chicago Relocation territory: Manhattan, for a three-month period"
      }
    },
    "module": "Scheduler"
  },
  "ServiceTerritoryWorkType": {
    "name": "ServiceTerritoryWorkType",
    "description": "Represents the relationship between a ServiceTerritory object and a WorkType object for Salesforce Scheduler appointments.",
    "properties": {
      "IsSlotPublished": {
        "type": "boolean",
        "description": "Indicate whether records in the Shift object are created for the selected Service Territory and Work Type."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that the current user last viewed a record related to this object."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this object."
      },
      "Name": {
        "type": "string",
        "description": "The name of this service territory-work type relationship."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The ID of the service territory that’s related to the work type indicated in the WorkTypeId field."
      },
      "TeamId": {
        "type": "reference",
        "description": "Represents the team associated with the service territory for a specific work type."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The ID of the work type that’s related to the service territory indicated in the ServiceTerritoryId field."
      }
    },
    "module": "Scheduler"
  },
  "Shift": {
    "name": "Shift",
    "description": "Represents a shift for service resource scheduling.",
    "properties": {
      "AppointmentCategoryId": {
        "type": "reference",
        "description": "This field is a relationship field. Available in API version 61.0 and later."
      },
      "BackgroundColor": {
        "type": "string",
        "description": "Sets a background color for shifts shown in the UI. Use a 3- or 6-digit hexadecimal format. For example, #FF00FF. Available in API version 55.0 and later."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The date and time that the shift ends."
      },
      "Label": {
        "type": "string",
        "description": "The label that a shift is given."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time when the current user last viewed a related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time when the current user last viewed this record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the shift."
      },
      "RecurrenceEndDate": {
        "type": "date",
        "description": "The date when the recurrence period ends. The date must be after the Recurrence Start Date. The value for this field is retrieved from the pattern defined in the RecurrencePattern field. You can define the end date by using the COUNT or UNTIL parameter in the RecurrencePattern field. If you specify a value in this field and define a recurrence pattern, Salesforce Scheduler overrides the value with the end date in the recurrence pattern.The recurrence period is limited to 180 days. This field is available in API version 56.0 and later."
      },
      "RecurrencePattern": {
        "type": "string",
        "description": "The RRULE that describes the recurrence pattern for recurring shifts. Supports a subset of the RFC 5545 standard for internet calendaring and scheduling. See the Salesforce Scheduler Recurring Shifts section in this topic for usage examples. The period for the recurrence pattern is limited to 180 days. This field is available in API version 56.0 and later."
      },
      "RecurrenceStartDate": {
        "type": "date",
        "description": "The date when the recurrence period begins. The date must be before the Recurrence End Date. The value for this field is retrieved from the StartTime field. Don’t modify the value for this field.This field is available in API version 56.0 and later."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The ID of the service resource the shift belongs to. Available in API versions 47.0 and later."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The ID of the service territory the shift belongs to. Available in API versions 47.0 and later."
      },
      "ShiftNumber": {
        "type": "string",
        "description": "The number automatically given to the shift upon creation."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The date and time that the shift starts."
      },
      "Status": {
        "type": "picklist",
        "description": "Describes the status of the shift. Users can create custom values."
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "Describes the status of the shift using static values. This field is derived from Status using the mapping defined in setup."
      },
      "TimeSlotType": {
        "type": "picklist",
        "description": "Type of time slot for the shift. The same setup values as the TimeSlot field in the OperatingHours object."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of shift."
      },
      "WorkTypeGroupId": {
        "type": "reference",
        "description": "The ID of the work type group the shift belongs to. Available in API versions 54.0 and later."
      }
    },
    "module": "Scheduler"
  },
  "ShiftEngagementChannel": {
    "name": "ShiftEngagementChannel",
    "description": "Represents the relationship between a Shift object and an Engagement Channel Type object for Salesforce Scheduler.",
    "properties": {
      "AreAllEngmtChnlSupported": {
        "type": "boolean",
        "description": "Indicates whether the shift supports all engagement channels (true) or not (false)."
      },
      "EngagementChannelTypeId": {
        "type": "reference",
        "description": "The ID of the engagement channel type that’s related to the shift indicated in the ShiftId field."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that the current user last viewed a record related to this object."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this object."
      },
      "Name": {
        "type": "string",
        "description": "The name of this shift-engagement channel type relationship."
      },
      "ShiftId": {
        "type": "reference",
        "description": "The ID of the shift that’s related to the engagement channel type indicated in the EngagementChannelTypeId field."
      }
    },
    "module": "Scheduler"
  },
  "ShiftWorkTopic": {
    "name": "ShiftWorkTopic",
    "description": "Represents the relationship between a Shift object and a Work Type or Work Type Group object for Salesforce Scheduler.",
    "properties": {
      "AreAllTopicsSupported": {
        "type": "boolean",
        "description": "Indicates whether the shift supports all work type or work type groups (true) or not (false)."
      },
      "AttendeeLimit": {
        "type": "int",
        "description": "The maximum number of attendees for a group service appointment in a shift. This field is considered when the appointment mode is Group. Available in API version 61.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that the current user last viewed a record related to this object."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this object."
      },
      "MaxAppointments": {
        "type": "int",
        "description": "The maximum number of appointments allowed for each time slot for a shift. This field is considered when WorkTypeId or WorkTypeGroupId is provided. This field is available in API version 60.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "The name of this shift-work topic relationship."
      },
      "ShiftId": {
        "type": "reference",
        "description": "The ID of the shift that’s related to the work type indicated in the WorkTypeId field or the work type group indicated in the WorkTypeGroupId field."
      },
      "WorkTypeGroupId": {
        "type": "reference",
        "description": "The ID of the work type group that’s related to the shift indicated in the ShiftId field."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The ID of the work type that’s related to the shift indicated in the ShiftId field."
      }
    },
    "module": "Scheduler"
  },
  "Skill": {
    "name": "Skill",
    "description": "Represents a skill that service resources have.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the skill."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed the skill."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The name of the skill."
      }
    },
    "module": "Scheduler"
  },
  "SkillRequirement": {
    "name": "SkillRequirement",
    "description": "Represents a skill that is required to complete a particular task in Salesforce Scheduler. Skill requirements can be added to work types Salesforce Scheduler.",
    "properties": {
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record can only have been referenced (LastReferencedDate) and not viewed."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "The record that the skill is required for. The related record can be a work type."
      },
      "SkillId": {
        "type": "reference",
        "description": "The skill that is required."
      },
      "SkillLevel": {
        "type": "double",
        "description": "The level of the skill required. Skill levels can range from zero to 99.99. Depending on your business needs, you can want the skill level to reflect years of experience, certification levels, or license classes."
      },
      "SkillNumber": {
        "type": "string",
        "description": "An auto-generated number identifying the skill requirement."
      }
    },
    "module": "Scheduler"
  },
  "SvcApptSchdEvent": {
    "name": "SvcApptSchdEvent",
    "description": "Represents the service appointment event. This object is included in a streamed notification received on the channels for the parent platform events. You can’t subscribe to the SvcApptSchdEvent channel directly.",
    "properties": {
      "AdditionalInformation": {
        "type": "string",
        "description": "Additional information about the service appointment."
      },
      "Address": {
        "type": "string",
        "description": "The address of the service appointment."
      },
      "AppointmentType": {
        "type": "string",
        "description": "The service appointment type."
      },
      "ChangedFields": {
        "type": "complexvalue",
        "description": "List of fields that changed."
      },
      "Comments": {
        "type": "string",
        "description": "Comments about the service appointment."
      },
      "ContactId": {
        "type": "string",
        "description": "ID of the contact associated with the service appointment."
      },
      "DurationInMinutes": {
        "type": "double",
        "description": "The duration of the service appointment in minutes."
      },
      "Email": {
        "type": "string",
        "description": "The email associated with the service appointment."
      },
      "EventUuid": {
        "type": "string",
        "description": "A universally unique identifier (UUID) that identifies a platform event message. This field is available in API version 52.0 and later."
      },
      "ParentRecordId": {
        "type": "string",
        "description": "ID of the parent record associated with the service appointment."
      },
      "Phone": {
        "type": "string",
        "description": "The phone number associated with the service appointment."
      },
      "ScheduledEndTime": {
        "type": "dateTime",
        "description": "The scheduled end time of the service appointment."
      },
      "ScheduledStartTime": {
        "type": "dateTime",
        "description": "The scheduled start time of the service appointment."
      },
      "ServiceAppointmentId": {
        "type": "string",
        "description": "ID of the service appointment."
      },
      "ServiceTerritoryId": {
        "type": "string",
        "description": "ID of the service territories associated with the service appointment."
      },
      "Status": {
        "type": "string",
        "description": "The status of the service appointment."
      },
      "StatusCategory": {
        "type": "string",
        "description": "The status category of the service appointment."
      },
      "Subject": {
        "type": "string",
        "description": "The subject of the service appointment."
      },
      "WorkTypeBlockTimeAfterAppointment": {
        "type": "int",
        "description": "The period of time occurring after the appointment that is typically blocked for this work type."
      },
      "WorkTypeBlockTimeAfterUnit": {
        "type": "string",
        "description": "The unit of the period specified for WorkTypeBlockTimeAfterAppointment. Values include hour and minute."
      },
      "WorkTypeBlockTimeBeforeAppointment": {
        "type": "int",
        "description": "The period of time occurring before the appointment that is typically blocked for this work type."
      },
      "WorkTypeBlockTimeBeforeUnit": {
        "type": "string",
        "description": "The unit of the period specified for WorkTypeBlockTimeBeforeAppointment. Values include hour and minute."
      },
      "WorkTypeId": {
        "type": "string",
        "description": "ID of the work type associated with the service appointment."
      }
    },
    "module": "Scheduler"
  },
  "TimeSlot": {
    "name": "TimeSlot",
    "description": "Represents a period of time on a specified day of the week during which work can be performed in Salesforce Scheduler. Operating hours consist of one or more time slots.",
    "properties": {
      "DayOfWeek": {
        "type": "picklist",
        "description": "The day of the week when the time slot takes place."
      },
      "EndTime": {
        "type": "time",
        "description": "The time when the time slot ends."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record can only have been referenced (LastReferencedDate) and not viewed."
      },
      "MaxAppointments": {
        "type": "int",
        "description": "Maximum number of appointments for a single time slot. Available in API version 47.0 and later."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The operating hours that the time slot belongs to. An operating hours’ time slots appear in the Operating Hours related list."
      },
      "StartTime": {
        "type": "time",
        "description": "The time when the time slot starts."
      },
      "TimeSlotNumber": {
        "type": "string",
        "description": "The name of the time slot. The name is auto-populated to a day and time format—for example, Monday 9:00 AM - 10:00 PM—but you can manually update it."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of time slot. Possible values are Normal and Extended. Default value must be Normal. You can choose to use Extended to represent overtime shifts."
      },
      "WorkTypeGroupId": {
        "type": "reference",
        "description": "Work type group assigned to the time slot. Available in API version 47.0 and later."
      }
    },
    "module": "Scheduler"
  },
  "Waitlist": {
    "name": "Waitlist",
    "description": "Represents a queue to which drop in customers who visit the branch without an already scheduled appointment are added.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the waitlist."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the waitlist is available to add drop in customers (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the waitlist was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the waitlist was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the waitlist."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the waitlist."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The ID of the service territory to which the waitlist belongs."
      },
      "": {
        "type": "",
        "description": ""
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the appointment type."
      }
    },
    "module": "Scheduler"
  },
  "WaitlistParticipant": {
    "name": "WaitlistParticipant",
    "description": "Represents a customer who is added to a waitlist.",
    "properties": {
      "AcceptanceTime": {
        "type": "dateTime",
        "description": "The date and time the service resource accepts the appointment request of the waitlist participant. This field is available in API version 59.0 and later."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the waitlist participant."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the waitlist participant record was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the waitlist participant record was last viewed."
      },
      "ParticipantId": {
        "type": "reference",
        "description": "The ID of the participant that's associated as a parent for the service appointment."
      },
      "RelatedRequestId": {
        "type": "reference",
        "description": "This field is a relationship field."
      },
      "ParticipantIdentifier": {
        "type": "string",
        "description": "The alphanumeric unique identifier of the participant in a waitlist. For example, D101, E63, A5015"
      },
      "ServiceAppointmentId": {
        "type": "reference",
        "description": "The ID of the service appointment that’s related to the waitlist participant."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The ID of the service resource that’s related to the service appointment for the waitlist participant."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "This field is a relationship field."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of waitlist participant."
      },
      "WaitlistId": {
        "type": "reference",
        "description": "The ID of the Waitlist that’s related to the participant."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The ID of the work type that's associated with the service appointment."
      }
    },
    "module": "Scheduler"
  },
  "WaitlistServiceResource": {
    "name": "WaitlistServiceResource",
    "description": "Represents the relationship between the Waitlist object and the Service Resource object for Salesforce Scheduler.",
    "properties": {
      "AccessLevel": {
        "type": "picklist",
        "description": "The access level of the user. The level determines the information that's masked from the service resource for a drop-in participant."
      },
      "IsAvailable": {
        "type": "boolean",
        "description": "Indicates whether the service resource is available to accept a drop-in participant from the waitlist (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the waitlist service resource record was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the waitlist service resource record was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "Auto-generated number that identifies the waitlist-service resource type record. For example, WSR-0001 and WSR-0002."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The ID of the service resource that’s related to the waitlist."
      },
      "WaitlistId": {
        "type": "reference",
        "description": "The ID of the waitlist that’s related to the service resource."
      }
    },
    "module": "Scheduler"
  },
  "WaitlistWorkType": {
    "name": "WaitlistWorkType",
    "description": "Represents the relationship between the Waitlist object and the Work Type object for Salesforce Scheduler.",
    "properties": {
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the waitlist work type record was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the waitlist work type record was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "Auto-generated number that identifies the waitlist-work type record. For example, WWT-0001 and WWT-0002."
      },
      "WaitlistId": {
        "type": "reference",
        "description": "The ID of the waitlist that’s related to the wok type."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The ID of the work type that’s related to the waitlist."
      }
    },
    "module": "Scheduler"
  },
  "WorkType": {
    "name": "WorkType",
    "description": "Represents a type of work to be performed in Salesforce Scheduler.",
    "properties": {
      "AppointmentCategoryId": {
        "type": "reference",
        "description": "The ID of the appointment category that’s assigned to the work type. This field is available in API version 58.0 and later."
      },
      "ApptStartTimeIntvlInMin": {
        "type": "int",
        "description": "Specify the time interval in minutes between appointment start times. For example, if you set the interval as 15, appointments can then begin at the top of the hour and at 15-minute intervals thereafter (10:00 AM, 10:15 AM, 10:30 AM). Valid values can be between 5 through 720. Note If you don’t specify a value for this field, Salesforce Scheduler considers the value specified in the default scheduling policy. This field is available in API version 57.0 and later."
      },
      "AttendeeLimit": {
        "type": "int",
        "description": "The maximum number of attendees for a group service appointment in a shift. This field is considered when the appointment mode is Group. Available in API version 61.0 and later."
      },
      "BlockTimeAfterAppointment": {
        "type": "int",
        "description": "Specify the after buffer time for the service appointment. Note In Salesforce Scheduler, during appointment scheduling, the number of available time slots is automatically adjusted to accommodate the after buffer time."
      },
      "BlockTimeAfterUnit": {
        "type": "picklist",
        "description": "Specify the unit of time for BlockTimeAfterAppointment."
      },
      "BlockTimeBeforeAppointment": {
        "type": "int",
        "description": "Specify the before buffer time for the service appointment. Note In Salesforce Scheduler, during appointment scheduling, the number of available time slots is automatically adjusted to accommodate the before buffer time."
      },
      "BlockTimeBeforeUnit": {
        "type": "picklist",
        "description": "Specify the unit of time for BlockTimeBeforeAppointment."
      },
      "DefaultAppointmentType": {
        "type": "picklist",
        "description": "The default appointment type of the work type."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the work type. Try to add details about the task or tasks that this work type represents."
      },
      "DurationType": {
        "type": "picklist",
        "description": "The unit of the Estimated Duration: Minutes or Hours."
      },
      "EstimatedDuration": {
        "type": "double",
        "description": "The estimated length of the work. The estimated duration is in minutes or hours based on the value selected in the Duration Type field."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the work type was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the work type was last viewed by the current user."
      },
      "Name": {
        "type": "string",
        "description": "The name of the work type."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The ID of the operating hours that’s assigned to the work type. If a service resource needs special operating hours, create them in Setup and select them in the Operating Hours lookup field on the member’s detail page."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The work type’s owner."
      },
      "ProductId": {
        "type": "reference",
        "description": "References the product associated with the work type."
      },
      "TimeFrameEndUnit": {
        "type": "picklist",
        "description": "Specify the unit of time for TimeFrame End."
      },
      "TimeFrameStartUnit": {
        "type": "picklist",
        "description": "Specify the unit of time for TimeFrame Start."
      },
      "TimeframeEnd": {
        "type": "int",
        "description": "Specify the timeframe end to show only time slots that end before the duration that is set in Timeframe End."
      },
      "TimeframeStart": {
        "type": "int",
        "description": "Specify the timeframe start to show only time slots that start after the duration that is set in Timeframe Start."
      }
    },
    "module": "Scheduler"
  },
  "WorkTypeGroup": {
    "name": "WorkTypeGroup",
    "description": "Represents a grouping of work types used to categorize types of appointments available in Salesforce Scheduler.",
    "properties": {
      "AdditionalInformation": {
        "type": "multipicklist",
        "description": "Additional information about the types of appointments this work type group represents."
      },
      "Description": {
        "type": "textarea",
        "description": "A description of this work type group."
      },
      "GroupType": {
        "type": "picklist",
        "description": "The category of this work type group. Possible values are: Default—A non-capacity group of work types used in Salesforce Scheduler."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether this work type group can be used for appointment scheduling."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that the current user last viewed a record related to this object."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this object."
      },
      "Name": {
        "type": "string",
        "description": "The name of this work type group."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who created this record."
      }
    },
    "module": "Scheduler"
  },
  "WorkTypeGroupDataTranslation": {
    "name": "WorkTypeGroupDataTranslation",
    "description": "Represents the translated values of the data stored within a WorkTypeGroup record’s fields.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The translated value for the WorkTypeGroup description."
      },
      "IsOutOfDate": {
        "type": "boolean",
        "description": "Indicates whether the translation is out-of-date (true) or current (false). A translation is out-of-date if the parent WorkTypeGroup record is updated after the last translation was filed."
      },
      "Language": {
        "type": "picklist",
        "description": "The language for these translated values."
      },
      "Name": {
        "type": "string",
        "description": "The translated value for the WorkTypeGroup record name. This field is required to translate the text in other fields."
      },
      "ParentId": {
        "type": "reference",
        "description": "The record ID of the WorkTypeGroup associated with the data that is being translated."
      }
    },
    "module": "Scheduler"
  },
  "WorkTypeGroupMember": {
    "name": "WorkTypeGroupMember",
    "description": "Represents the relationship between a work type and the work type group it belongs to.",
    "properties": {
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that the current user last viewed a record related to this object."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this object."
      },
      "Name": {
        "type": "string",
        "description": "Autogenerated number identifying the work type group membership. It uses the format ########."
      },
      "WorkTypeGroupId": {
        "type": "reference",
        "description": "The ID of the work type group that this record belongs to."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The ID of the work type that this record corresponds to."
      }
    },
    "module": "Scheduler"
  }
}