{
  "EmailInsight": {
    "name": "EmailInsight",
    "description": "Represents an insight generated from an email interaction. EmailInsights acts as a central place to store various types of insights related to email messages. The insights stored include status, type, and time of generation. Only certain types of insights can be created based on a pre-configured list of insight types.",
    "properties": {
      "EmailMessageId": {
        "type": "reference",
        "description": "Required. The ID of the email message the insight is generated for."
      },
      "GeneratedDate": {
        "type": "dateTime",
        "description": "Required. The date and time when the insight was generated in the legacy system."
      },
      "InsightTypeDescription": {
        "type": "textarea",
        "description": "Required. Description of the insight type."
      },
      "InsightTypeIdentifier": {
        "type": "string",
        "description": "Required. The ID of the insight type based on which the insight is generated."
      },
      "InsightTypeLabel": {
        "type": "string",
        "description": "Required. The display name of the insight type."
      },
      "IsLocked": {
        "type": "boolean",
        "description": "Indicates whether the email insight record is locked or not."
      },
      "LegacyInsightIdentifier": {
        "type": "string",
        "description": "Required. The unique ID of the insight that was generated and stored in the legacy system."
      },
      "MayEdit": {
        "type": "boolean",
        "description": "Indicates whether the email insight record can be edited or not."
      },
      "RowVersion": {
        "type": "string",
        "description": "A system-generated, read-only field that tracks the version of a record. Each time a record is created or updated, the RowVersion value increments, providing a mechanism to detect changes and manage concurrency."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the insight record."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_emailinsight.htm",
    "accessRules": "EmailStream and SiqC2CProvisioned permissions must be enabled.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}