{
  "EmbeddedServiceFieldService": {
    "name": "EmbeddedServiceFieldService",
    "description": "Represents a setup node for creating an embedded Appointment Management (beta) deployment.",
    "properties": {
      "AppointmentBookingFlowName": {
        "type": "string",
        "description": "Name of the appointment booking flow for this Embedded Service deployment."
      },
      "CancelApptBookingFlowName": {
        "type": "string",
        "description": "Name of the appointment cancellation flow for this embedded Appointment Management (beta) deployment."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Unique name for the embedded Appointment Management configuration setup node."
      },
      "EmbeddedServiceConfigId": {
        "type": "EmbeddedServiceConfig",
        "description": "Unique ID for the embedded Appointment Management (beta) deployment."
      },
      "Enabled": {
        "type": "boolean",
        "description": "Specifies whether Field Service is enabled for this Embedded Service deployment (true) or not (false)."
      },
      "FieldServiceConfirmCardImg": {
        "type": "string",
        "description": "URL of the image used for the confirmation card in embedded Appointment Management (beta)."
      },
      "FieldServiceHomeImg": {
        "type": "string",
        "description": "URL of the image used for the home screen in embedded Appointment Management (beta)."
      },
      "FieldServiceLogoImg": {
        "type": "string",
        "description": "URL of the logo used for the home screen in embedded Appointment Management (beta)."
      },
      "FullName": {
        "type": "string",
        "description": "The unique name used for this Embedded Service deployment. The fullName can contain only underscores and alphanumeric characters. It must be unique, begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores."
      },
      "Language": {
        "type": "picklist",
        "description": "Languages supported in the Embedded Service deployment. Chinese (Simplified): zh_CN Chinese (Traditional): zh_TW Danish: da Dutch: nl_NL English: en_US Finnish: fi French: fr German: de Italian: it Japanese: ja Korean: ko Norwegian: no Portuguese (Brazil): pt_BR Russian: ru Spanish: es Spanish (Mexico): es_MX Spanish (Mexico) defaults to Spanish for customer-defined translations. Swedish: sv Thai: th The Salesforce user interface is fully translated to Thai, but Help is in English."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "Name of the Embedded Service deployment."
      },
      "Metadata": {
        "type": "mns:EmbeddedServiceFieldService",
        "description": "The embedded Appointment Management (beta) metadata."
      },
      "ModifyApptBookingFlowName": {
        "type": "string",
        "description": "Name of the appointment modification flow for this embedded Appointment Management (beta) deployment."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "ShouldShowExistingAppointment": {
        "type": "boolean",
        "description": "Specifies whether to display a button on the home screen for customers to access their existing appointments (true) or not (false) for embedded Appointment Management (beta)."
      },
      "ShouldShowNewAppointment": {
        "type": "boolean",
        "description": "Specifies whether to display a button on the home screen for customers to create a new appointment (true) or not (false) for embedded Appointment Management (beta)."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_embeddedservicefieldservice.htm"
  }
}