{
  "EnablementProgram": {
    "name": "EnablementProgram",
    "description": "Represents an Enablement program, which includes exercises and measurable milestones to help users such as sales reps achieve specific outcomes related to your company’s revenue goals.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "A summary of the program’s goals and content that’s visible to users."
      },
      "DoesAllowSelfEnrollment": {
        "type": "boolean",
        "description": "Indicates whether users can self-enroll in programs that are shared with them (true) or take only assigned programs (false). The default value is false."
      },
      "EnablementProgramDefinitionId": {
        "type": "reference",
        "description": "The representation for the program in Metadata API. This field is a relationship field. Available in API version 61.0 and later."
      },
      "IsOutcomeBased": {
        "type": "boolean",
        "description": "Indicates whether the program includes a final, measurable outcome (true) or not (false). The default value is false."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record. If this value is null, maybe the user accessed this record (LastReferencedDate) but not viewed it yet."
      },
      "Name": {
        "type": "string",
        "description": "The name of the program that’s visible to users. For example, AE Onboarding, Event Prep, or New Product Launch."
      },
      "NetworkId": {
        "type": "reference",
        "description": "The ID of the supported Experience Cloud site where a partner program is available. For site requirements, see Considerations for Partner Enablement Programs. Available in API version 60.0 and later."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of the program. This field is a polymorphic relationship field."
      },
      "PublishedDateTime": {
        "type": "dateTime",
        "description": "The date that the program is published."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the program. Only a published program is available for an Enablement admin to assign to users or share with users so they can self-enroll."
      },
      "TotalAssigned": {
        "type": "int",
        "description": "The number of assignments in this program. For example, if the program is assigned to 3 users, then TotalAssigned=3."
      },
      "TotalBehind": {
        "type": "int",
        "description": "The number of assignments that are behind in this program. For example, if the program is assigned to 3 users, and 2 users are behind on their assignments, then TotalBehind=2"
      },
      "TotalCompleted": {
        "type": "int",
        "description": "The number of completed assignments in this program. For example, if the program is assigned to 3 users, and 1 user has completed the program, then TotalCompleted=1."
      },
      "TotalDays": {
        "type": "int",
        "description": "Total days of the program. This value is derived from the latest day of all items in the program, including exercises, milestones, and the outcome. This field is a calculated field. For example, a program has Task A on day 1 and Task B on day 2. Since Task B has the latest days of all tasks, then TotalDays=2."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of the program. Possible values are: Enablement—A sales program in Lightning Experience. PtnrEnablement—A partner program in a supported Experience Cloud site. Available in API version 60.0 and later. EmployeeServiceEnablement—An employee enablement program in Employee Portal. Available in API version 63.0 and later."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_enablementprogram.htm",
    "accessRules": "a supported Partner Relationship Management (PRM) add-on license",
    "clouds": [
      "Core Salesforce"
    ]
  }
}