{
  "EnblProgramTaskProgress": {
    "name": "EnblProgramTaskProgress",
    "description": "Represents a user’s progress towards completing an outcome, a milestone, or an exercise in an Enablement program.",
    "properties": {
      "CompletedDateTime": {
        "type": "dateTime",
        "description": "The date that the user completed the outcome, milestone, or exercise."
      },
      "CompletedOnDay": {
        "type": "int",
        "description": "Number of days that the user took to complete the outcome, milestone, or exercise."
      },
      "CompletedPercent": {
        "type": "percent",
        "description": "Percentage of the outcome, milestone, or exercise that’s complete."
      },
      "ContributingRecordCount": {
        "type": "int",
        "description": "The number of records that qualify for a user’s progress towards completing an outcome or milestone. To qualify, the activity must meet the criteria that the corresponding Enablement measure defines for specific objects, fields, and field values. Available in API version 61.0 and later."
      },
      "DueDate": {
        "type": "date",
        "description": "The date the outcome, milestone, or exercise is due."
      },
      "EnblProgramTaskDefinitionId": {
        "type": "reference",
        "description": "ID of the outcome, milestone, or exercise definition. This field is a relationship field."
      },
      "IsCompleted": {
        "type": "boolean",
        "description": "Whether the outcome, milestone, or exercise is complete (true) or not (false). The default value is false."
      },
      "IsNoLongerTracking": {
        "type": "boolean",
        "description": "If the user hasn’t completed the outcome or milestone and 30 days have elapsed since the program’s due date, the value is true. Otherwise, the value is false. The default value is false. For details, see Completion Statuses in Enablement Analytics."
      },
      "LearningItemProgressId": {
        "type": "reference",
        "description": "ID of the record that tracks the user's progress through the program that includes this outcome, milestone, or exercise. This field is a relationship field."
      },
      "MilestoneComputationResult": {
        "type": "double",
        "description": "Derived from the associated EnblProgramTaskDefinition record. For example, if a milestone has a single measure A with a result of 5, this field’s value is 5."
      },
      "ProgressStatus": {
        "type": "picklist",
        "description": "Status of the outcome, milestone, or exercise progress. Possible values are: Behind Completed Late Completed On Time No Longer Tracking Not Completed Overdue For details, see Completion Statuses in Enablement Analytics."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_enblprogramtaskprogress.htm",
    "accessRules": "a supported Partner Relationship Management (PRM) add-on license",
    "clouds": [
      "Core Salesforce"
    ]
  }
}