{
  "EnrichedField": {
    "name": "EnrichedField",
    "description": "Represents a field selected for Change Data Capture Enrichment for a channel and channel member. A non-empty enriched field is added to an update or delete change event even when not changed. Available in API version 51.0 and later.",
    "properties": {
      "ChannelMemberId": {
        "type": "string",
        "description": "The ID of the PlatformEventChannelMember that this field is part of. For example, if a field is added to the AccountChangeEvent, which is part of PlatformEventChannelMember, ChannelMemberId is the ID of the PlatformEventChannelMember record."
      },
      "Field": {
        "type": "string",
        "description": "The name of the field to enrich change events with. For a list of supported field types, see Enrich Change Events with Extra Fields When Subscribed with CometD in the Change Data Capture Developer Guide."
      },
      "ManageableState": {
        "type": "string",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "Industry": {
        "type": "string",
        "description": ""
      },
      "00NRM000001gEx32AE": {
        "type": "string",
        "description": ""
      },
      "Phone": {
        "type": "string",
        "description": ""
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_enrichedfield.htm",
    "accessRules": "This object is part of Change Data Capture Enrichment. Use the EnrichedField object to query, retrieve, or delete enriched fields. Add an enriched field as part of PlatformEventChannelMember. For more information about Change Data Capture Enrichment and adding enriched fields, see Enrich Change Events with Extra Fields When Subscribed with CometD and Example: Add Event Enrichment Fields with Tooling API in the Change Data Capture Developer Guide. To retrieve or query this object, you must have the View Setup and Configuration permission. To delete this object, you must have the Customize Application permission.",
    "clouds": [
      "Tooling API"
    ]
  }
}