{
  "EntityDefinition": {
    "name": "EntityDefinition",
    "description": "Provides row-based access to metadata about standard and custom objects.",
    "properties": {
      "ApexTriggers": {
        "type": "string",
        "description": "Represents the Apex triggers associated with this object. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "AssignmentRules": {
        "type": "string",
        "description": "Represents assignment rules that allow you to automatically route cases to the appropriate users or queues. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "AutoResponseRules": {
        "type": "string",
        "description": "Represents the auto-response rules defined for the object. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "BusinessProcesses": {
        "type": "string",
        "description": "Represents the business processes defined for the object. Business processes display different picklist values for users based on their profile and associated record type. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "ChildRelationships": {
        "type": "string",
        "description": "Represents the child relationships defined for the object. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "CompactLayouts": {
        "type": "string",
        "description": "Represents the compact layouts defined for the object. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "CustomFields": {
        "type": "string",
        "description": "Represents the custom fields defined for the object. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "DefaultCompactLayout": {
        "type": "string",
        "description": "Metadata about the compact layout defined as the default for this object, if any."
      },
      "DefaultCompactLayoutId": {
        "type": "string",
        "description": "ID of the default compact layout, if any.",
        "maxLength": 70,
        "nullable": true,
        "readOnly": true
      },
      "DefaultImplementation": {
        "type": "string",
        "description": "Reserved for future use.",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "DeploymentStatus": {
        "type": "string",
        "description": "Specifies the deployment status of the object. Controls whether a custom object and its associated custom tab, related lists, and reports are visible to non-admin users. This field is available in Tooling API version 37.0 and later. Valid values are: InDevelopment Deployed",
        "format": "enum",
        "enum": [
          "InDevelopment",
          "Deployed"
        ],
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "Description": {
        "type": "string",
        "description": "The description of the object. A meaningful description makes it easier to distinguish between custom objects when they're viewed in a list. This field is available in Tooling API version 37.0 and later."
      },
      "DetailUrl": {
        "type": "string",
        "description": "URL to the read-only detail page for this object. Corresponds to the urlDetail field in DescribeSobjectResult. This field is available in Tooling API version 34.0 and later.",
        "format": "uri",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "DeveloperName": {
        "type": "string",
        "description": "The developer’s internal name for the object. This field isn't unique, so if you query by this field, you can get multiple records with the same DeveloperName value. For example, in an org, you could have these three objects with a DeveloperName of Account: a standard Account object, a custom object, and a packaged custom object. If you want to query by a unique identifier, use QualifiedApiName.",
        "maxLength": 40,
        "nullable": true,
        "readOnly": true
      },
      "DurableId": {
        "type": "string",
        "description": "Unique identifier for the field. Always retrieve this value before using it, as the value isn’t guaranteed to stay the same from one release to the next. Simplify queries by using this field instead of making multiple queries.",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "EditDefinitionUrl": {
        "type": "string",
        "description": "This field is available in Tooling API version 34.0 and later.",
        "format": "uri",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "EditUrl": {
        "type": "string",
        "description": "The URL used when editing the custom object definition. Corresponds to the urlEdit field on DescribeSobjectResult. This field is available in Tooling API version 34.0 and later.",
        "format": "uri",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "ExtendedBy": {
        "type": "string",
        "description": "Reserved for future use.",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "ExtendsInterfaces": {
        "type": "string",
        "description": "Reserved for future use.",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "ExternalSharingModel": {
        "type": "string",
        "description": "The external sharing model. Possible values are: None Read Edit ControlledByLeadOrContact ControlledByCampaign This field is available in Tooling API version 38.0 and later.",
        "format": "enum",
        "enum": [
          "None",
          "Read",
          "Edit",
          "ControlledByLeadOrContact",
          "ControlledByCampaign"
        ],
        "maxLength": 255,
        "nullable": false,
        "readOnly": true
      },
      "FieldSets": {
        "type": "string",
        "description": "Represents the field sets defined for the object. Because this field represents a relationship, use only in subqueries."
      },
      "Fields": {
        "type": "string",
        "description": "Represents the standard and custom fields defined for this object. Because this field represents a relationship, use only in subqueries."
      },
      "FormulaVariables": {
        "type": "string",
        "description": "Represents the formulas that are built on this object."
      },
      "FullName": {
        "type": "string",
        "description": "The name of the object. If a field, the name must specify the parent object, for example Account.FirstName."
      },
      "HelpSettingPageName": {
        "type": "string",
        "description": "The name of the custom help setting page. This field is available in Tooling API version 34.0 and later.",
        "maxLength": 80,
        "nullable": true,
        "readOnly": true
      },
      "HelpSettingPageUrl": {
        "type": "string",
        "description": "The URL pointing to the custom help setting page for custom objects. This field is available in Tooling API version 34.0 and later.",
        "format": "uri",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "ImplementedBy": {
        "type": "string",
        "description": "Reserved for future use.",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "ImplementsInterfaces": {
        "type": "string",
        "description": "Reserved for future use.",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "InternalSharingModel": {
        "type": "string",
        "description": "The internal sharing model. Possible values are: None Read Edit ControlledByLeadOrContact ControlledByCampaign This field is available in Tooling API version 38.0 and later.",
        "format": "enum",
        "enum": [
          "None",
          "Read",
          "Edit",
          "ControlledByLeadOrContact",
          "ControlledByCampaign"
        ],
        "maxLength": 255,
        "nullable": false,
        "readOnly": true
      },
      "IsActivityTrackable": {
        "type": "boolean",
        "description": "If true, activities, such as tasks and scheduled calendar events associated with the custom object, can be tracked. Can be enabled only for custom objects. This field is available in Tooling API version 37.0 and later."
      },
      "IsApexTriggerable": {
        "type": "boolean",
        "description": "If true, Apex triggers can be defined for the object.",
        "nullable": false,
        "readOnly": true
      },
      "IsAutoActivityCaptureEnabled": {
        "type": "boolean",
        "description": "If true, the object is enabled for Einstein Activity Capture. This field is available in Tooling API version 41.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsCompactLayoutable": {
        "type": "boolean",
        "description": "If true, the object supports compact layouts. That is, compact layouts can be defined, a system compact layout can be synthesized, or both.",
        "nullable": false,
        "readOnly": true
      },
      "IsCreatable": {
        "type": "boolean",
        "description": "If true, records based on the object (true) can be created."
      },
      "IsCustomSetting": {
        "type": "boolean",
        "description": "If true, the object is a custom setting. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsCustomizable": {
        "type": "boolean",
        "description": "If true, custom fields can be defined for the object.",
        "nullable": false,
        "readOnly": true
      },
      "IsDeletable": {
        "type": "boolean",
        "description": "If true, the object can be deleted."
      },
      "IsDeprecatedAndHidden": {
        "type": "boolean",
        "description": "If true, this object is unavailable for the current version. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsEverCreatable": {
        "type": "boolean",
        "description": "If true, the object can be created using an API, assuming the current user has the appropriate permissions. If false, the application server manages the object and no user can create it. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsEverDeletable": {
        "type": "boolean",
        "description": "If true, the object can be created using an API, assuming the current user has the appropriate permissions. If false, the application server manages the object and no user can delete it. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsEverUpdatable": {
        "type": "boolean",
        "description": "If true, the object can be created using an API, assuming the current user has the appropriate permissions. If false, the application server manages the object and no user can modify it. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsFeedEnabled": {
        "type": "boolean",
        "description": "If true, the Chatter feed is enabled for this object. This field is available in Tooling API version 34.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsFieldHistoryTracked": {
        "type": "boolean",
        "description": "If true, your org can track changes to fields on the custom object records. History data is available for reporting, so users can easily create audit trail reports. Can be enabled only for custom objects. This field is available in Tooling API version 37.0 and later."
      },
      "IsFlsEnabled": {
        "type": "boolean",
        "description": "If true, you can set field-level security on applicable fields. This field is available in Tooling API version 35.0 and later."
      },
      "IsIdEnabled": {
        "type": "boolean",
        "description": "If true, you can include Id in the SELECT clause of a query on this object. This field is available in Tooling API version 35.0 and later.For example, assume that there's an object backed by an OData data source with the High Data Volume option selected. That object’s IsIdEnabled field is false.",
        "nullable": false,
        "readOnly": true
      },
      "IsInterface": {
        "type": "boolean",
        "description": "Reserved for future use.",
        "nullable": false,
        "readOnly": true
      },
      "IsLayoutable": {
        "type": "boolean",
        "description": "If true, layouts can be defined for the object. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsMruEnabled": {
        "type": "boolean",
        "description": "If true, Most Recently Used (MRU) list functionality is enabled for this object. This field is available in Tooling API version 37.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsQueryable": {
        "type": "boolean",
        "description": "If true, the object can be queried.",
        "nullable": false,
        "readOnly": true
      },
      "IsReplicateable": {
        "type": "boolean",
        "description": "If true, the object can be replicated. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsReportingEnabled": {
        "type": "boolean",
        "description": "If true, the data in the custom object's records is available for reporting. Can be enabled only on custom objects. This field is available in Tooling API version 37.0 and later."
      },
      "IsRetrieveable": {
        "type": "boolean",
        "description": "If true, the object can be retrieved. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsSearchable": {
        "type": "boolean",
        "description": "If true, records of this object are indexed for search. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsSearchLayoutable": {
        "type": "boolean",
        "description": "If true, you can customize search layouts for this object. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsTriggerable": {
        "type": "boolean",
        "description": "If true, you can use triggers with this object. This field is available in Tooling API version 35.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "IsWorkflowEnabled": {
        "type": "boolean",
        "description": "If true, workflow rules can be defined for the object.",
        "nullable": false,
        "readOnly": true
      },
      "KeyPrefix": {
        "type": "string",
        "description": "The first three digits of the object’s ID, which identify the object type, such as Account or Opportunity.",
        "maxLength": 3,
        "nullable": true,
        "readOnly": true
      },
      "Label": {
        "type": "string",
        "description": "The label for this object, used in the compact layout and in the user's language locale.",
        "maxLength": 40,
        "nullable": true,
        "readOnly": true
      },
      "Layouts": {
        "type": "string",
        "description": "Represents the layouts defined for this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "Limits": {
        "type": "string",
        "description": "The limits defined for this object. Corresponds to the Limits page for each standard object in Setup, or the Limits related list for each custom object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "LookupFilters": {
        "type": "string",
        "description": "Represents the lookup filters defined for this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label for this object, which displays in Setup. The master label is in the default language locale for the organization. If there's no default language locale, the label is in en_US.",
        "maxLength": 40,
        "nullable": false,
        "readOnly": true
      },
      "Metadata": {
        "type": "string",
        "description": "Metadata about the standard or custom object. Details are available in the CustomObject entry in the metadata namespace in the Tooling API WSDL."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix associated with this object. Each Developer Edition organization that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of these values: In Developer Edition organizations, the namespace prefix is set to the namespace prefix of the organization for all objects that support it. There’s an exception if an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition organization of the package developer. In organizations that aren't Developer Edition organizations, NamespacePrefix is set only for objects that are part of an installed managed package. There’s no namespace prefix for all other objects.",
        "maxLength": 15,
        "nullable": true,
        "readOnly": true
      },
      "NewUrl": {
        "type": "string",
        "description": "The URL used when editing a new standard or custom record. Corresponds to the urlNew field on DescribeSobjectResult. This field is available in Tooling API version 34.0 and later.",
        "format": "uri",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "OwnerChangeOptions": {
        "type": "string",
        "description": "Use only in subqueries. This field is available in Tooling API version 35.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "Particles": {
        "type": "string",
        "description": "The particles defined for this object. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "PluralLabel": {
        "type": "string",
        "description": "The plural version of the object’s Label.",
        "maxLength": 40,
        "nullable": true,
        "readOnly": true
      },
      "Publisher": {
        "type": "string",
        "description": "The publisher of this object, for example Salesforce, a user, or a package name. This field is available in Tooling API version 34.0 and later."
      },
      "PublisherId": {
        "type": "string",
        "description": "ID of the publisher associated with this object. This field is available in Tooling API version 34.0 and later.",
        "maxLength": 70,
        "nullable": true,
        "readOnly": true
      },
      "QualifiedApiName": {
        "type": "string",
        "description": "A unique external ID for the object of the form NamespacePrefix__DeveloperName for standard objects and NamespacePrefix__DeveloperName__c for custom objects. When performing SOQL queries with Custom Metadata Type relationship fields, use this field to obtain fully qualified namespaces.",
        "maxLength": 70,
        "nullable": false,
        "readOnly": true
      },
      "QuickActionDefinitions": {
        "type": "string",
        "description": "Represents the quick actions defined for this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "RecordTypes": {
        "type": "string",
        "description": "Represents the record types defined for this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "RecordTypesSupported": {
        "type": "string",
        "description": "Represents the record types defined for this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later.",
        "nullable": true,
        "readOnly": true
      },
      "RelatedListDefinitions": {
        "type": "string",
        "description": "Represents related lists defined for this object. Because this field represents a relationship, use only in subqueries. Available in API version 55.0 and later."
      },
      "RelationshipDomains": {
        "type": "string",
        "description": "Metadata about the relationships with other objects that this object has. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "RunningUserEntityAccess": {
        "type": "string",
        "description": "Represents the running user’s access to this object. This field is available in Tooling API version 34.0 and later."
      },
      "RunningUserEntityAccessId": {
        "type": "string",
        "description": "ID of the UserEntityAccess record associated with this object. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries.",
        "maxLength": 150,
        "nullable": true,
        "readOnly": true
      },
      "SearchLayouts": {
        "type": "string",
        "description": "Represents the search layouts associated with this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "StandardActions": {
        "type": "string",
        "description": "Represents the standard actions defined for this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "ValidationRules": {
        "type": "string",
        "description": "Represents the validation rules defined for this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "WebLinks": {
        "type": "string",
        "description": "Represents the Weblinks associated with this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "WorkflowAlerts": {
        "type": "string",
        "description": "Represents the workflow alerts associated with this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "WorkflowFieldUpdates": {
        "type": "string",
        "description": "Represents the workflow field updates for this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "WorkflowOutboundMessages": {
        "type": "string",
        "description": "Represents the workflow outbound messages associated with this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "WorkflowTasks": {
        "type": "string",
        "description": "Represents the workflow tasks associated with this object. Use only in subqueries. This field is available in Tooling API version 34.0 and later. Because this field represents a relationship, use only in subqueries."
      },
      "recordTypeInfos": {
        "type": "string",
        "description": ""
      },
      "available": {
        "type": "boolean",
        "description": ""
      },
      "defaultRecordTypeMapping": {
        "type": "boolean",
        "description": ""
      },
      "developerName": {
        "type": "string",
        "description": ""
      },
      "master": {
        "type": "boolean",
        "description": ""
      },
      "name": {
        "type": "string",
        "description": ""
      },
      "recordTypeId": {
        "type": "string",
        "description": ""
      },
      "Id": {
        "type": "string",
        "description": "Entity Definition ID",
        "format": "salesforce-id",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "LastModifiedDate": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "LastModifiedById": {
        "type": "string",
        "description": "User ID",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "IsProcessEnabled": {
        "type": "boolean",
        "description": "Is Approval Process Enabled?",
        "nullable": false,
        "readOnly": true
      },
      "HasSubtypes": {
        "type": "boolean",
        "description": "Has Subtypes?",
        "nullable": false,
        "readOnly": true
      },
      "IsSubtype": {
        "type": "boolean",
        "description": "Is Subtype?",
        "nullable": false,
        "readOnly": true
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_entitydefinition.htm",
    "keyPrefix": "4ie",
    "createable": false,
    "updateable": false,
    "deletable": false,
    "queryable": true,
    "searchable": true,
    "childRelationships": [
      {
        "childObject": "EntityParticle",
        "field": "EntityDefinitionId",
        "relationshipName": "Particles",
        "cascadeDelete": false
      },
      {
        "childObject": "FieldDefinition",
        "field": "EntityDefinitionId",
        "relationshipName": "Fields",
        "cascadeDelete": false
      },
      {
        "childObject": "LogEntryTagRule__mdt",
        "field": "SObjectType__c",
        "relationshipName": "LogEntryTagRules__r",
        "cascadeDelete": false
      },
      {
        "childObject": "LoggerPlugin__mdt",
        "field": "SObjectType__c",
        "relationshipName": "LoggerSObjectHandlerPlugins__r",
        "cascadeDelete": false
      },
      {
        "childObject": "LoggerSObjectHandler__mdt",
        "field": "SObjectType__c",
        "relationshipName": "LoggerSObjectHandlerConfigurations__r",
        "cascadeDelete": false
      },
      {
        "childObject": "OwnerChangeOptionInfo",
        "field": "EntityDefinitionId",
        "relationshipName": "OwnerChangeOptions",
        "cascadeDelete": false
      },
      {
        "childObject": "RelationshipDomain",
        "field": "ChildSobjectId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "RelationshipDomain",
        "field": "ParentSobjectId",
        "relationshipName": "RelationshipDomains",
        "cascadeDelete": false
      },
      {
        "childObject": "RelationshipInfo",
        "field": "ChildSobjectId",
        "relationshipName": "ChildRelationships",
        "cascadeDelete": false
      },
      {
        "childObject": "SearchLayout",
        "field": "EntityDefinitionId",
        "relationshipName": "SearchLayouts",
        "cascadeDelete": false
      },
      {
        "childObject": "UserEntityAccess",
        "field": "EntityDefinitionId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "UserFieldAccess",
        "field": "EntityDefinitionId",
        "relationshipName": null,
        "cascadeDelete": false
      }
    ],
    "clouds": [
      "Tooling API"
    ]
  }
}