{
  "EventRelayFeedback": {
    "name": "EventRelayFeedback",
    "description": "Represents execution state information about an event relay from Salesforce to Amazon EventBridge for platform events and change data capture events. Query this object to get information such as the event relay status and any error message.",
    "properties": {
      "ErrorCode": {
        "type": "string",
        "description": "The error code of the last error that occurred during the relay of event messages. For a list of possible error codes and messages, see Error Codes."
      },
      "ErrorIdentifier": {
        "type": "string",
        "description": "The identifier of an unexpected system error that occurred during the relay of event messages."
      },
      "ErrorMessage": {
        "type": "textarea",
        "description": "The error message of the last error that occurred during the relay of event messages. For a list of possible error codes and messages, see Error Codes."
      },
      "ErrorTime": {
        "type": "dateTime",
        "description": "The date and time in the UTC time zone when the last error occurred during the relay of event messages."
      },
      "EventRelayConfigId": {
        "type": "reference",
        "description": "The ID of the event relay configuration that this feedback record is collecting the execution information of."
      },
      "EventRelayNumber": {
        "type": "string",
        "description": "The number that identifies the EventRelayFeedback record. This field is of type Auto Number."
      },
      "LastRelayedEventTime": {
        "type": "dateTime",
        "description": "The date and time in the UTC time zone when the last event was relayed to Amazon EventBridge."
      },
      "RemoteResource": {
        "type": "string",
        "description": "The name of the partner event source associated with the event relay. It is in the format aws.partner/salesforce.com/orgID/channelID. For example: aws.partner/salesforce.com/00DRM000000Fxts2AC/0YLRM0000004Dfg4AE."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the event relay."
      },
      "UsageType": {
        "type": "picklist",
        "description": "Reserved for future use."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_eventrelayfeedback.htm",
    "clouds": [
      "Core Salesforce"
    ]
  }
}