{
  "ExternalServiceRegistration": {
    "name": "ExternalServiceRegistration",
    "description": "Represents the External Service configuration for an org.",
    "properties": {
      "Description": {
        "type": "string",
        "description": "The description for the external service, defined when the service is created."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The developer’s internal name for the external data source used in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores."
      },
      "Language": {
        "type": "string",
        "description": "The language of the external service configuration. Chinese (Simplified): zh_CN Chinese (Traditional): zh_TW Danish: da Dutch: nl_NL English: en_US Finnish: fi French: fr German: de Italian: it Japanese: ja Korean: ko Norwegian: no Portuguese (Brazil): pt_BR Russian: ru Spanish: es Spanish (Mexico): es_MX Spanish (Mexico) defaults to Spanish for customer-defined translations. Swedish: sv Thai: th The Salesforce user interface is fully translated to Thai, but Help is in English."
      },
      "ManageableState": {
        "type": "string",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label for the External Service."
      },
      "NamedCredential": {
        "type": "string",
        "description": "The name reference of the named credential to be used for the service."
      },
      "NamedCredentialReferenceId": {
        "type": "string",
        "description": "The name reference of the named credential to be used for the service. References NamedCredential. Available in API version 52.0 and later."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace of the package of which the External Service is a part."
      },
      "ProviderAssetEndpoint": {
        "type": "string",
        "description": "Location or ID of the latest schema or metadata at an external site. Currently applies only to MuleSoft assets. Available in API version 57.0 and later."
      },
      "RegistrationProvider": {
        "type": "string",
        "description": "A reference to the registration provider. If the registrationProviderType is ExternalConnector, this field contains the external connector name. If the registrationProviderType is Heroku, this field contains the HerokuAppLink ID. For any other registrationProviderType value, this field is blank and reserved for future use."
      },
      "RegistrationProviderType": {
        "type": "string",
        "description": "The type of schema provider used to create this external service. Valid values are: Anypoint ApexRest Custom ExternalConnector Heroku MuleSoft SchemaInferred Standard For API version 56.0 and later."
      },
      "Schema": {
        "type": "string",
        "description": "The content of the OpenAPI 2.0 or OpenAPI 3.0 schema in JSON or YAML format."
      },
      "SchemaAbsoluteUrl": {
        "type": "string",
        "description": "The full, absolute URL to the schema. For API version 56.0 and later, populated when a user selects Absolute URL during registration."
      },
      "SchemaType": {
        "type": "string",
        "description": "ID format of the schema. For API version 48.0 and later, the valid value is OpenApi. For API version 47.0 and earlier, the valid values are InteragentHyperSchema and OpenApi."
      },
      "SchemaUploadFileExtension": {
        "type": "string",
        "description": "The file's extension. For API version 56.0 and later, populated when a user selects Upload from local during registration."
      },
      "SchemaUploadFileName": {
        "type": "string",
        "description": "The file's name without the file extension. For API version 56.0 and later, populated when a user selects Upload from local during registration."
      },
      "SchemaUrl": {
        "type": "string",
        "description": "The schema's URL defined when registering a service. The path must begin with “/” and be a relative path."
      },
      "ServiceBinding": {
        "type": "string",
        "description": "Maps non-supported media types for this external service registration to supported media types. For API version 53.0 and later."
      },
      "ServiceName": {
        "type": "string",
        "description": "The name of the cataloged API service that this external service registration belongs to. Available in API version 63.0 and later. This field was removed in API version 65.0."
      },
      "Status": {
        "type": "string",
        "description": "Indicates whether the service registration is finished. Valid values are complete and incomplete."
      },
      "SystemVersion": {
        "type": "integer",
        "description": "Identifies the external service registration revision. For valid values, see ExternalServiceRegistation in the Metadata API Developer Guide."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_externalserviceregistration.htm",
    "clouds": [
      "Tooling API"
    ]
  }
}