{
  "ExternalAuthIdentityProvider": {
    "name": "ExternalAuthIdentityProvider",
    "description": "Represents an external authentication (auth) identity provider. An external auth identity provider links to an external credential and obtains OAuth tokens for outbound callouts to external systems.",
    "properties": {
      "AuthenticationFlow": {
        "type": "picklist",
        "description": "Authentication flow to get tokens to call protected APIs."
      },
      "AuthenticationProtocol": {
        "type": "picklist",
        "description": "The authentication protocol that’s required to access the external system."
      },
      "Description": {
        "type": "string",
        "description": "A human-readable description of the external auth identity provider parameter."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique internal name for the named credential used in the API."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated type in Tooling API. The full name can include a namespace prefix. Query this field only if the query result contains no more than one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the external auth identity provider."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label for the external auth identity provider. In the UI, this field is Label."
      },
      "Metadata": {
        "type": "complexvalue",
        "description": "Provides access to the associated metadata type and related fields in Tooling API."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation."
      },
      "ParameterName": {
        "type": "string",
        "description": "The name of the external auth identity provider parameter."
      },
      "ParameterType": {
        "type": "picklist",
        "description": "The type of external auth identity provider parameter. The value of this field drives the behavior of the parameter."
      },
      "ParameterValue": {
        "type": "textarea",
        "description": "If the parameterType field describes a literal value then the literal value is stored in this field."
      },
      "SequenceNumber": {
        "type": "int",
        "description": "Specifies the order of parameters to apply when an external auth identity provider has more than one parameter. Priority is from lower to higher numbers (for example, 1 is the highest priority)."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_externalauthidentityprovider.htm"
  }
}