{
  "UserFinancialAuthority": {
    "name": "UserFinancialAuthority",
    "description": "Represents the maximum monetary amount a user can authorize for a given financial type and product.",
    "properties": {
      "Description": {
        "type": "string",
        "description": "The configuration details for the user financial authority record. This field can't be edited."
      },
      "EndDate": {
        "type": "date",
        "description": "The end date when the user financial authority is in effect."
      },
      "EvaluationMethod": {
        "type": "picklist",
        "description": "The logic that validates the user financial authority. For example, the Claim Coverage Valuation method validates that a payment on a claim coverage doesn’t exceed the maximum amount allowed for the user on that claim coverage product."
      },
      "FinancialType": {
        "type": "picklist",
        "description": "The financial type associated with the user financial authority."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "MaximumApprovalAmount": {
        "type": "currency",
        "description": "The maximum monetary amount a user can approve for a financial activity."
      },
      "Name": {
        "type": "string",
        "description": "The name of the financial user authority."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner associated with the user financial authority."
      },
      "ProductId": {
        "type": "reference",
        "description": "The product associated with the user financial authority."
      },
      "StartDate": {
        "type": "date",
        "description": "The start date when the user financial authority is in effect."
      },
      "UserId": {
        "type": "reference",
        "description": "The user associated with the user financial authority."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_userfinancialauthority.htm",
    "clouds": [
      "Financial Services Cloud"
    ]
  }
}