{
  "UserDailyMetric": {
    "name": "UserDailyMetric",
    "description": "Represents the daily engagement metrics for a user.",
    "properties": {
      "AllCallsCallBackLater": {
        "type": "int",
        "description": "The number of calls in the day for this user with the call result Call Back Later."
      },
      "AllCallsLeftVoicemail": {
        "type": "int",
        "description": "The number of calls in the day for this user with the call result Left Voicemail."
      },
      "AllCallsMeaningfulConnect": {
        "type": "int",
        "description": "The number of calls in the day for this user with the call result Meaningful Connect."
      },
      "AllCallsNotInterested": {
        "type": "int",
        "description": "The number of calls in the day for this user with the call result Not Interested."
      },
      "AllCallsUncategorized": {
        "type": "int",
        "description": "The number of calls in the day for this user with no call result specified."
      },
      "AllCallsUnqualified": {
        "type": "int",
        "description": "The number of calls in the day for this user with the call result Unqualified."
      },
      "AllEmailsBouncedCount": {
        "type": "int",
        "description": "The total of hard and soft bounced emails for this user in the day."
      },
      "AllEmailsDeliveredCount": {
        "type": "int",
        "description": "The number of successfully delivered emails for this user in the day."
      },
      "AllEmailsHardBouncedCount": {
        "type": "int",
        "description": "The number of hard bounced emails for this user in the day."
      },
      "AllEmailsNotDeliveredCount": {
        "type": "int",
        "description": "The number of emails that were undelivered for all recipients on the email. Available in API version 54.0 and later."
      },
      "AllEmailsOutOfOfficeCount": {
        "type": "int",
        "description": "The number of emails that triggered an out-of-office reply for this user in the day."
      },
      "AllEmailsSentCount": {
        "type": "int",
        "description": "The number of emails sent by this user in the day."
      },
      "AllEmailsSoftBouncedCount": {
        "type": "int",
        "description": "The number of emails soft bounced for this user in the day."
      },
      "AllEmailsTrackedSentCount": {
        "type": "int",
        "description": "The number of emails sent by this user with engagement tracking enabled in the day."
      },
      "AllEmailsUntrackedSentCount": {
        "type": "int",
        "description": "The number of emails sent by this user without engagement tracking enabled in the day."
      },
      "AllTotalCallsCount": {
        "type": "int",
        "description": "The total number of calls by this user with all call results in the day."
      },
      "DailyCutOffTimeStamp": {
        "type": "dateTime",
        "description": "The time of day when each 24-hour metrics period starts and ends."
      },
      "Date": {
        "type": "date",
        "description": "The date on which the engagement occurred."
      },
      "DateInt": {
        "type": "int",
        "description": "The date on which the engagement occurred, in yyyymmdd format."
      },
      "HardBounceTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with hard bounce tracking. Available in API version 53.0 and later."
      },
      "LinkClickTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with link click tracking. Available in API version 53.0 and later."
      },
      "OpenTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with open tracking. Available in API version 53.0 and later."
      },
      "OutOfOfficeTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with out-of-office tracking. Available in API version 53.0 and later."
      },
      "RecipientReplies": {
        "type": "int",
        "description": "The number of unique recipients who responded to an email. Available in API version 53.0 and later."
      },
      "RecipientSends": {
        "type": "int",
        "description": "The number of unique recipients who were sent an email. Available in API version 53.0 and later."
      },
      "ReplyTrackableRecipientSends": {
        "type": "int",
        "description": "The number of recipients who were sent an email with reply tracking. Available in API version 53.0 and later."
      },
      "ReplyTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with reply tracking. Available in API version 53.0 and later."
      },
      "SoftBounceTrackableSends": {
        "type": "int",
        "description": "The number of emails sent with soft bounce tracking. Available in API version 53.0 and later."
      },
      "SomeEmailsDeliveredCount": {
        "type": "int",
        "description": "The number of emails that were successfully delivered to at least one recipient on the email. Available in API version 54.0 and later."
      },
      "SomeEmailsDeliveredRate": {
        "type": "percent",
        "description": "The percentage of emails that were successfully delivered to at least one recipient on the email. Available in API version 54.0 and later."
      },
      "TrackableRecipientSendReplyRt": {
        "type": "percent",
        "description": "The percentage of emails sent with reply tracking that received replies from unique recipients. Available in API version 53.0 and later."
      },
      "TrackableSendHardBounceRate": {
        "type": "percent",
        "description": "The percentage of emails sent with hard bounce tracking that hard bounced. Available in API version 54.0 and later."
      },
      "TrackableSendLinkClickRate": {
        "type": "percent",
        "description": "The percentage of emails sent with link tracking that had link clicks. Available in API version 53.0 and later."
      },
      "TrackableSendOpenRate": {
        "type": "percent",
        "description": "The percentage of emails sent with open tracking that were opened by a recipient. Available in API version 53.0 and later."
      },
      "TrackableSendOutOfOfficeRate": {
        "type": "percent",
        "description": "The percentage of emails sent with out-of-office tracking that received out-of-office replies. Available in API version 54.0 and later."
      },
      "TrackableSendReplyRate": {
        "type": "percent",
        "description": "The percentage of emails sent with reply tracking that received replies. Available in API version 53.0 and later."
      },
      "TrackableSendSoftBounceRate": {
        "type": "percent",
        "description": "The percentage of emails sent with soft bounce tracking that soft bounced. Available in API version 54.0 and later."
      },
      "UniqueEmailsLinkClickedCount": {
        "type": "int",
        "description": "The number of unique recipients who clicked a link in an email sent by the user on the day."
      },
      "UniqueEmailsOpenedCount": {
        "type": "int",
        "description": "The number of unique recipients who opened an email sent by the user on the day."
      },
      "UniqueEmailsRepliedCount": {
        "type": "int",
        "description": "The number of unique recipients who replied to an email sent by the user on the day."
      },
      "UserId": {
        "type": "reference",
        "description": "The ID of the related user."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_userdailymetric.htm",
    "accessRules": "Sales Engagement must be enabled.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}