{
  "AccountCleanInfo": {
    "name": "AccountCleanInfo",
    "description": "Stores the metadata Data.com Clean uses to determine an account record’s clean status. AccountCleanInfo helps you automate the cleaning or related processing of account records.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The unique, system-generated ID assigned when the account record was created."
      },
      "AccountSite": {
        "type": "string",
        "description": "Information about the account’s location, such as single location, headquarters, or branch."
      },
      "Address": {
        "type": "address",
        "description": "The compound form of the address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "AnnualRevenue": {
        "type": "currency",
        "description": "Estimated annual revenue of the account."
      },
      "City": {
        "type": "string",
        "description": "Details for the billing address of the account."
      },
      "CleanedByJob": {
        "type": "boolean",
        "description": "Indicates whether the account record was cleaned by a Data.com Clean job (true) or not (false)."
      },
      "CleanedByUser": {
        "type": "boolean",
        "description": "Indicates whether the account record was cleaned by a Salesforce user (true) or not (false)."
      },
      "CompanyName": {
        "type": "string",
        "description": "The name of the company."
      },
      "CompanyStatusDataDotCom": {
        "type": "picklist",
        "description": "The status of the company per Data.com. Values are: Company is In Business per Data.com or Company is Out of Business per Data.com."
      },
      "Country": {
        "type": "string",
        "description": "Details for the billing address of the account."
      },
      "DandBCompanyDunsNumber": {
        "type": "string",
        "description": "The D-U-N-S Number on the D&B Company record (if any) that is linked to the account."
      },
      "DataDotComId": {
        "type": "string",
        "description": "The ID Data.com maintains for the company."
      },
      "Description": {
        "type": "textarea",
        "description": "A description of the account."
      },
      "DunsNumber": {
        "type": "string",
        "description": "The Data Universal Numbering System (D-U-N-S) number is a unique, nine-digit number assigned to every business location in the Dun & Bradstreet database that has a unique, separate, and distinct operation. D-U-N-S numbers are used by industries and organizations around the world as a global standard for business identification and tracking."
      },
      "DunsRightMatchConfidence": {
        "type": "int",
        "description": "The account’s DUNSRight confidence code."
      },
      "DunsRightMatchGrade": {
        "type": "string",
        "description": "The account’s DUNSRight match grade."
      },
      "Fax": {
        "type": "phone",
        "description": "The account’s fax number."
      },
      "Industry": {
        "type": "picklist",
        "description": "The industry the account belongs to."
      },
      "IsDifferentAccountSite": {
        "type": "boolean",
        "description": "Indicates whether the account’s AccountSite field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentAnnualRevenue": {
        "type": "boolean",
        "description": "Indicates whether the account’s AnnualRevenue field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentCity": {
        "type": "boolean",
        "description": "Indicates whether the account’s City field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentCompanyName": {
        "type": "boolean",
        "description": "Indicates whether the account’s AccountName field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentCountry": {
        "type": "boolean",
        "description": "Indicates whether the account’s Country field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentCountryCode": {
        "type": "boolean",
        "description": "Indicates whether the account’s Country Code field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentDandBCompanyDunsNumber": {
        "type": "boolean",
        "description": "Indicates whether the account’s DandBCompanyID field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentDescription": {
        "type": "boolean",
        "description": "Indicates whether the account’s Description field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentDunsNumber": {
        "type": "boolean",
        "description": "Indicates whether the account’s DunsNumber field value is different from the D-U-N-S Number on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentFax": {
        "type": "boolean",
        "description": "Indicates whether the account’s Fax field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentIndustry": {
        "type": "boolean",
        "description": "Indicates whether the account’s Industry field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentNaicsCode": {
        "type": "boolean",
        "description": "Indicates whether the account’s NaicsCode field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentNaicsDescription": {
        "type": "boolean",
        "description": "Indicates whether the account’s NaicsDescription field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentNumberOfEmployees": {
        "type": "boolean",
        "description": "Indicates whether the account’s NumberOf Employees field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentOwnership": {
        "type": "boolean",
        "description": "Indicates whether the account’s Ownership field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentPhone": {
        "type": "boolean",
        "description": "Indicates whether the account’s Phone field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentPostalCode": {
        "type": "boolean",
        "description": "Indicates whether the account’s PostalCode field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentSic": {
        "type": "boolean",
        "description": "Indicates whether the account’s Sic field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentSicDescription": {
        "type": "boolean",
        "description": "Indicates whether the account’s SicDescription field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentState": {
        "type": "boolean",
        "description": "Indicates whether the account’s State field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentStateCode": {
        "type": "boolean",
        "description": "Indicates whether the account’s State Code field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentStreet": {
        "type": "boolean",
        "description": "Indicates whether the account’s State field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentTickerSymbol": {
        "type": "boolean",
        "description": "Indicates whether the account’s TickerSymbol field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentTradestyle": {
        "type": "boolean",
        "description": "Indicates whether the account’s Tradestyle field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentWebsite": {
        "type": "boolean",
        "description": "Indicates whether the account’s Website field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsDifferentYearStarted": {
        "type": "boolean",
        "description": "Indicates whether the account’s YearStarted field value is different from the corresponding value on its matched Data.com record (true) or not (false)."
      },
      "IsFlaggedWrongAccountSite": {
        "type": "boolean",
        "description": "Indicates whether the account’s AccountSite field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongAddress": {
        "type": "boolean",
        "description": "Indicates whether the account’s Address field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongAnnualRevenue": {
        "type": "boolean",
        "description": "Indicates whether the account’s AnnualRevenue field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongCompanyName": {
        "type": "boolean",
        "description": "Indicates whether the account’s CompanyName field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongDescription": {
        "type": "boolean",
        "description": "Indicates whether the account’s Description field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongDunsNumber": {
        "type": "boolean",
        "description": "Indicates whether the account’s DunsNumber field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongFax": {
        "type": "boolean",
        "description": "Indicates whether the account’s Fax field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongIndustry": {
        "type": "boolean",
        "description": "Indicates whether the account’s Industry field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongNaicsCode": {
        "type": "boolean",
        "description": "Indicates whether the account’s NaicsCode field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongNaicsDescription": {
        "type": "boolean",
        "description": "Indicates whether the account’s NaicsDescription field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongNumberOfEmployees": {
        "type": "boolean",
        "description": "Indicates whether the account’s NumberOfEmployees field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongOwnership": {
        "type": "boolean",
        "description": "Indicates whether the account’s Ownership field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongPhone": {
        "type": "boolean",
        "description": "Indicates whether the account’s Phone field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongSic": {
        "type": "boolean",
        "description": "Indicates whether the account’s Sic field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongSicDescription": {
        "type": "boolean",
        "description": "Indicates whether the account’s SicDescription field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongTickerSymbol": {
        "type": "boolean",
        "description": "Indicates whether the account’s TickerSymbol field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongTradestyle": {
        "type": "boolean",
        "description": "Indicates whether the account’s Tradestyle field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongWebsite": {
        "type": "boolean",
        "description": "Indicates whether the account’s Website field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsFlaggedWrongYearStarted": {
        "type": "boolean",
        "description": "Indicates whether the account’s YearStarted field value is flagged as wrong to Data.com (true) or not (false)."
      },
      "IsInactive": {
        "type": "boolean",
        "description": "Indicates whether the account has been reported to Data.com as Inactive (true) or not (false)."
      },
      "IsReviewedAccountSite": {
        "type": "boolean",
        "description": "Indicates whether the account’s AccountSite field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedAddress": {
        "type": "boolean",
        "description": "Indicates whether the account’s Address field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedAnnualRevenue": {
        "type": "boolean",
        "description": "Indicates whether the account’s AnnualRevenue field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedCompanyName": {
        "type": "boolean",
        "description": "Indicates whether the account’s CompanyName field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedDandBCompanyDunsNumber": {
        "type": "boolean",
        "description": "Indicates whether the account’s DandBCompanyID field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedDescription": {
        "type": "boolean",
        "description": "Indicates whether the account’s Description field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedDunsNumber": {
        "type": "boolean",
        "description": "Indicates whether the account’s DunsNumber field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedFax": {
        "type": "boolean",
        "description": "Indicates whether the account’s Fax field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedIndustry": {
        "type": "boolean",
        "description": "Indicates whether the account’s Industry field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedNaicsCode": {
        "type": "boolean",
        "description": "Indicates whether the account’s NaicsCode field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedNaicsDescription": {
        "type": "boolean",
        "description": "Indicates whether the account’s NaicsDescription field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedNumberOfEmployees": {
        "type": "boolean",
        "description": "Indicates whether the account’s NumberOfEmployees field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedOwnership": {
        "type": "boolean",
        "description": "Indicates whether the account’s Ownership field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedPhone": {
        "type": "boolean",
        "description": "Indicates whether the account’s Phone field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedSic": {
        "type": "boolean",
        "description": "Indicates whether the account’s Sic field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedSicDescription": {
        "type": "boolean",
        "description": "Indicates whether the account’s SicDescription field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedTickerSymbol": {
        "type": "boolean",
        "description": "Indicates whether the account’s TickerSymbol field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedTradestyle": {
        "type": "boolean",
        "description": "Indicates whether the account’s Tradestyle field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedWebsite": {
        "type": "boolean",
        "description": "Indicates whether the account’s Website field value is in a Reviewed state (true) or not (false)."
      },
      "IsReviewedYearStarted": {
        "type": "boolean",
        "description": "Indicates whether the account’s YearStarted field value is in a Reviewed state (true) or not (false)."
      },
      "LastMatchedDate": {
        "type": "dateTime",
        "description": "The date the account record was last matched and linked to a Data.com record."
      },
      "LastStatusChangedById": {
        "type": "reference",
        "description": "The ID of who or what last changed the record’s Clean Status field value: a Salesforce user or a Clean job."
      },
      "LastStatusChangedDate": {
        "type": "dateTime",
        "description": "The date on which the record’s Clean Status field value was last changed."
      },
      "Latitude": {
        "type": "double",
        "description": "Used with Longitude to specify the precise geolocation of a billing address. Data not currently provided."
      },
      "Longitude": {
        "type": "double",
        "description": "Used with Latitude to specify the precise geolocation of a billing address. Data not currently provided."
      },
      "NaicsCode": {
        "type": "string",
        "description": "The six-digit North American Industry Classification System (NAICS) code is the standard used by business and government to classify business establishments into industries, according to their economic activity for the purpose of collecting, analyzing, and publishing statistical data related to the U.S. business economy."
      },
      "NaicsDescription": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on its NAICS code."
      },
      "Name": {
        "type": "string",
        "description": "Field label is Account Clean Info Name. The name of the account. Maximum size is 255 characters."
      },
      "NumberOfEmployees": {
        "type": "int",
        "description": "The number of employees working at the account."
      },
      "Ownership": {
        "type": "picklist",
        "description": "Ownership type for the account, for example Private, Public, or Subsidiary."
      },
      "Phone": {
        "type": "phone",
        "description": "The phone number for the account."
      },
      "PostalCode": {
        "type": "string",
        "description": "Details for the billing address of the account."
      },
      "Sic": {
        "type": "string",
        "description": "Standard Industrial Classification code of the company’s main business categorization, for example, 57340 for Electronics."
      },
      "SicDescription": {
        "type": "string",
        "description": "A brief description of an organization’s line of business, based on its SIC code."
      },
      "State": {
        "type": "string",
        "description": "Details for the billing address of the account."
      },
      "Street": {
        "type": "textarea",
        "description": "Details for the billing address of the account."
      },
      "TickerSymbol": {
        "type": "string",
        "description": "The stock market symbol for the account."
      },
      "Tradestyle": {
        "type": "string",
        "description": "A name, different from its legal name, that an organization can use for conducting business. Similar to “Doing business as” (DBA)."
      },
      "Website": {
        "type": "url",
        "description": "The website of the account."
      },
      "YearStarted": {
        "type": "string",
        "description": "The year the company was established or the year when current ownership or management assumed control of the company."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_accountcleaninfo.htm"
  }
}