{
  "AccountPlanObjMeasCalcDefLocalization": {
    "name": "AccountPlanObjMeasCalcDefLocalization",
    "description": "Represents the translated value of the definition of a target object, rollup field, and logic for calculating the current value of a sales account plan objective measure.",
    "properties": {
      "Language": {
        "type": "picklist",
        "description": "The language the AccountPlanObjMeasCalcDef is translated into."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of these values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that aren’t Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "ParentId": {
        "type": "reference",
        "description": "The ID of the related account plan objective measure calculation definition. This field is a relationship field."
      },
      "Value": {
        "type": "textarea",
        "description": "The translated label of the account plan objective measure calculation definition."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_accountplanobjmeascalcdeflocalization.htm",
    "accessRules": "Your organization must be using Lightning Experience with Sales Cloud in Enterprise, Performance, Unlimited, and Einstein 1 Sales Edition editions. Translation Workbench must be enabled for your org. Sales account plans must be turned on. Users with the Customize Application or Manage Translation permission can create or update AccountPlanObjMeasCalcDef translations.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}