{
  "AdvAccountForecastSet": {
    "name": "AdvAccountForecastSet",
    "description": "Represents an advanced account forecast set.",
    "properties": {
      "AccountFieldName": {
        "type": "string",
        "description": "The field name of the account in an advanced account forecast fact record."
      },
      "CalculationFrequency": {
        "type": "string",
        "description": "The frequency at which a forecast set is recalculated automatically."
      },
      "Description": {
        "type": "string",
        "description": "The description for AdvAccountForecastSet."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the advanced account forecast set record."
      },
      "ForecastFactObjectName": {
        "type": "string",
        "description": "The API name of the entity used as a facts table."
      },
      "ForecastPeriodGroupId": {
        "type": "string",
        "description": "The Id of the forecast period group associated with an advanced account forecast."
      },
      "ForecastQuantityFieldName": {
        "type": "string",
        "description": "The field name of the forecast quantity in an advanced account forecast fact record."
      },
      "ForecastRevenueFieldName": {
        "type": "string",
        "description": "The field name of the forecast revenue in an advanced account forecast record."
      },
      "ForecastSetFieldName": {
        "type": "string",
        "description": "The field name of the forecast set in an advanced account forecast record."
      },
      "ForecastSetName": {
        "type": "string",
        "description": "The name of the forecast set in an advanced account forecast record."
      },
      "ForecastStatusFieldName": {
        "type": "string",
        "description": "The field name of the status in an advanced account forecast fact record."
      },
      "GenerationDpeDefNameId": {
        "type": "string",
        "description": "The name of the Data Processing Engine definition that generates advanced account forecast fact records."
      },
      "Language": {
        "type": "string",
        "description": "The language for AdvAccountForecastSet."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label for the AdvAccountForecastSet record."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      },
      "PeriodFieldName": {
        "type": "string",
        "description": "The field name of the period in an advanced account forecast fact record."
      },
      "RecalculateDpeDefNameId": {
        "type": "string",
        "description": "The Data Processing Engine definition used to recalculate advanced account forecast fact records."
      },
      "RegenerationDpeDefNameId": {
        "type": "string",
        "description": "The Data Processing Engine definition used to regenerate advanced account forecast fact records."
      },
      "RolloverDpeDefNameId": {
        "type": "string",
        "description": "The Data Processing Engine definition used to generate rollover advanced account forecast fact records."
      },
      "RolloverFrequency": {
        "type": "string",
        "description": "The frequency of rollover of an advanced account forecast records."
      },
      "Status": {
        "type": "string",
        "description": "Specifies the status of an advanced account forecast set."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated advanced account forecast fact record in Metadata API."
      },
      "Metadata": {
        "type": "string",
        "description": "The AdvAccountForecastSet’s metadata."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_advaccountforecastset.htm",
    "clouds": [
      "Manufacturing Cloud",
      "Tooling API"
    ]
  }
}