{
  "ApexPageMember": {
    "name": "ApexPageMember",
    "description": "Represents the working copy of a Visualforce page for editing, saving, or compiling in a MetadataContainer.",
    "properties": {
      "Body": {
        "type": "string",
        "description": "The data for the Visualforce page. The Body field is the only field you can update() or PATCH."
      },
      "Content": {
        "type": "string",
        "description": "A string representation of ApexPageMetadata that lists the version, status, and packaged versions of the corresponding Visualforce page."
      },
      "ContentEntityId": {
        "type": "string",
        "description": "A reference to a Visualforce page."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated object in the Metadata API. Use to avoid race conditions on create, before you have IDs."
      },
      "LastSyncDate": {
        "type": "dateTime",
        "description": "The date that this ApexPageMember Body was replicated from the underlying entity.When you deploy a MetadataContainer, this value is compared with the LastModifiedDate of the underlying Visualforce page. If LastSyncDate is older than LastModifiedDate, the deployment fails with an error."
      },
      "Metadata": {
        "type": "string",
        "description": "An object that describes the version, status, and packaged versions of the corresponding Visualforce page."
      },
      "MetadataContainerId": {
        "type": "string",
        "description": "A reference to a MetadataContainer or ContainerAsyncRequest object.As part of a successful deployment, this field is reset from the ID of the deployed MetadataContainer to the ID of the corresponding ContainerAsyncRequest object. This field is required."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_apexpagemember.htm",
    "accessRules": "As of Spring ’20 and later, to access ApexPageMember, users must have both the View All Data and Customize Application permissions.",
    "clouds": [
      "Tooling API"
    ]
  }
}