{
  "ApexExecutionOverlayResult": {
    "name": "ApexExecutionOverlayResult",
    "description": "Represents the result from the Apex code snippet or SOQL query defined in the associated ApexExecutionOverlayAction, and the resulting heap dump if one was returned.",
    "properties": {
      "ActionScript": {
        "type": "string",
        "description": "The Apex code or SOQL query that was run."
      },
      "ActionScriptType": {
        "type": "picklist",
        "description": "Indicates whether the ActionScript is written in Apex or SOQL. Valid values are: None Apex SOQL"
      },
      "ApexResult": {
        "type": "ApexResult",
        "description": "A complex type that represents the result of Apex code executed as part of an ApexExecutionOverlayAction, returned in an ApexExecutionOverlayResult."
      },
      "ExpirationDate": {
        "type": "dateTime",
        "description": "The expiration date of the overlay action."
      },
      "HeapDump": {
        "type": "HeapDump",
        "description": "A complex type that represents a heap dump in an ApexExecutionOverlayResult object. You can only have a single row when using HeapDump in SOQL. To select only one row, you can use a LIMIT=1 clause in your SOQL query, or you can list multiple rows for the user and have them select the row to inspect."
      },
      "IsDumpingHeap": {
        "type": "boolean",
        "description": "Indicates whether a heap dump was generated (true) or not (false)."
      },
      "Iteration": {
        "type": "int",
        "description": "The number of times the specified line should execute before the heap dump is generated. This field is required."
      },
      "Line": {
        "type": "int",
        "description": "The line number of the checkpoint."
      },
      "SOQLResult": {
        "type": "SOQLResult",
        "description": "A complex type that represents the result of a SOQL query in an ApexExecutionOverlayResult object."
      },
      "UserId": {
        "type": "reference",
        "description": "The user who executed the action."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_apexexecutionoverlayresult.htm"
  }
}