{
  "ApexComponentMember": {
    "name": "ApexComponentMember",
    "description": "Represents the working copy of a Visualforce component for editing, saving, or compiling in a MetadataContainer.",
    "properties": {
      "Body": {
        "type": "string",
        "description": "The data for the Visualforce component. The Body field is the only field you can update() or PATCH."
      },
      "Content": {
        "type": "string",
        "description": "A string representation of ApexComponentMetadata that lists the version, status, and packaged versions of the corresponding Visualforce component."
      },
      "ContentEntityId": {
        "type": "reference",
        "description": "A reference to a Visualforce component.There can be only one ContentEntityId per ApexComponentMember, otherwise, an error is reported. This field is required if FullName is not specified."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated object in the Metadata API. Use to avoid race conditions on create, before you have IDs."
      },
      "LastSyncDate": {
        "type": "dateTime",
        "description": "The date that this ApexComponentMember Body was replicated from the underlying entity. When you deploy a MetadataContainer, this value is compared with the LastModifiedDate of the underlying Visualforce component. If LastSyncDate is older than LastModifiedDate, the deployment fails with an error."
      },
      "Metadata": {
        "type": "ApexComponentMetadata",
        "description": "An object that describes the version, status, and packaged versions of the corresponding Visualforce component."
      },
      "MetadataContainerId": {
        "type": "reference",
        "description": "A reference to a MetadataContainer or ContainerAsyncRequest object.As part of a successful deployment, this field is reset from the ID of the deployed MetadataContainer to the ID of the corresponding ContainerAsyncRequest object. This field is required."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_apexcomponentmember.htm"
  }
}