{
  "ApexClassMember": {
    "name": "ApexClassMember",
    "description": "Represents the working copy of an Apex class for editing, saving, or compiling in a MetadataContainer.",
    "properties": {
      "Body": {
        "type": "string",
        "description": "The data for the Apex class. The Body field is the only field you can update() or PATCH."
      },
      "Content": {
        "type": "string",
        "description": "A string representation of ApexClassMetadata that lists the version, status, and packaged versions of the corresponding Apex class."
      },
      "ContentEntityId": {
        "type": "string",
        "description": "A reference to an Apex class."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated object in the Metadata API. Use to avoid race conditions on create, before you have IDs."
      },
      "LastSyncDate": {
        "type": "dateTime",
        "description": "The date and time that this ApexClassMember Body was replicated from the underlying Apex class. When you deploy a MetadataContainer, this value is compared with the LastModifiedDate of the underlying Apex class. If LastSyncDate is older than LastModifiedDate, the deployment fails with an error."
      },
      "Metadata": {
        "type": "string",
        "description": "An object that describes the version, status, and packaged versions of the corresponding Apex class."
      },
      "MetadataContainerId": {
        "type": "string",
        "description": "A reference to a MetadataContainer or ContainerAsyncRequest object. As part of a successful deployment, this field is reset from the ID of the deployed MetadataContainer to the ID of the corresponding ContainerAsyncRequest object. This field is required."
      },
      "SymbolTable": {
        "type": "string",
        "description": "A complex type that represents all user-defined tokens in the Body of an ApexClass, ApexClassMember, or ApexTriggerMember and their associated line and column locations within the Body. This field is null if the symbol table can’t be created. A symbol table can’t be created if the content referenced by the ContentEntityId field doesn’t use a symbol table. Compiler errors for the last deployment of the MetadataContainer in the MetadataContainerId field also prevent a symbol table from being created."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_apexclassmember.htm",
    "accessRules": "As of the Spring '20 release, to access ApexClassMember you must have both the View All Data and the Author Apex user permissions.",
    "clouds": [
      "Tooling API"
    ]
  }
}