{
  "Apex Limit Event Object": {
    "name": "Apex Limit Event Object",
    "description": "ApexLimitEvent represents an Apex execution governor limit.",
    "properties": {
      "EntryPointId": {
        "type": "reference",
        "description": "The ID of the entity that set off the Apex event. See EntryPointType."
      },
      "EntryPointName": {
        "type": "string",
        "description": "The name of the Apex class, component, page, or trigger that set off the Apex event."
      },
      "EntryPointType": {
        "type": "string",
        "description": "The type of entity that set off the event. Possible values include: ApexClass ApexComponent ApexPage ApexTrigger"
      },
      "EventDate": {
        "type": "dateTime",
        "description": "The time of the specified event. For example, 2013-01-01T03:01:01Z. Seconds are the most granular setting."
      },
      "ExecutionIdentifier": {
        "type": "string",
        "description": "Identifies each Apex limit event associated with a particular code execution. For example, if one Apex class triggers four Apex limit events, all four events have the same value for ExecutionIdentifier."
      },
      "LimitType": {
        "type": "string",
        "description": "The Apex governor limit that was exceeded. Possible values are: DATABASE_TIME: Database time HEAP_CHECK_INTERVAL: Heap check interval MAX_CPU_MILLISECONDS: Maximum CPU time (in ms) MAX_HEAP_SIZE: Maximum heap size CALLOUT: Number of callouts DML_ROWS: Number of DML rows DML: Number of DML statements EMAIL_INVOCATIONS: Number of email invocations FUTURE: Number of future calls MOBILE_PUSHES: Number of Mobile Apex push calls QUERY_LOCATOR_SOQL_ROWS: Number of query locator rows SOQL_ROWS: Number of query rows APEX_CURSOR_SOQL_ROWS: Number of query rows in an APEX cursor QUEUEABLE: Number of queueable jobs added to the queue AGGS: Number of SOQL aggregate queries SOQL: Number of SOQL queries SOSL: Number of SOSL queries SOQL_BATCH_SIZE: Query batch size"
      },
      "LimitValue": {
        "type": "double",
        "description": "Represents the percentage of the maximum allowed limit value. For example, a value of 1.01 indicates that a transaction exceeded the limit by 1%. A value of 0.01 indicates that a transaction only consumed 1% of the limit."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix for the executed Apex class, component, or trigger. See Namespace Prefix."
      },
      "UserId": {
        "type": "reference",
        "description": "The 18-character ID of the user who hit the Apex governor limit."
      },
      "Username": {
        "type": "string",
        "description": "The username of the user who hit the Apex governor limit."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_apexlimitevent.htm",
    "clouds": [
      "Core Salesforce"
    ]
  }
}