{
  "ApexSoapApiEventLog": {
    "name": "ApexSoapApiEventLog",
    "description": "Apex SOAP event logs contain details about custom SOAP web service calls.",
    "properties": {
      "ClassName": {
        "type": "string",
        "description": "The Apex class name. If the class is part of a managed package, this string includes the package namespace."
      },
      "ClientIp": {
        "type": "string",
        "description": "The IP address of the client that’s using Salesforce services. A Salesforce internal IP (such as a login from AppExchange) is shown as “Salesforce.com IP”. For example: 96.43.144.26."
      },
      "ClientName": {
        "type": "string",
        "description": "The name of the client that’s using Salesforce services. This field is an optional parameter that can be passed in API calls. If blank, the caller didn't specify a client in the CallOptions header."
      },
      "CpuTime": {
        "type": "double",
        "description": "The CPU time in milliseconds used to complete the request. This field indicates the amount of activity taking place in the app server layer."
      },
      "DatabaseTotalTime": {
        "type": "double",
        "description": "Time (in milliseconds) spent waiting for database processing in aggregate for all operations in the request. Compare this field to CpuTime to determine whether performance issues are occurring in the database layer or in your own code."
      },
      "LimitUsagePercent": {
        "type": "double",
        "description": "The percentage of Apex SOAP calls that were made against the organization’s limit."
      },
      "LoginKey": {
        "type": "string",
        "description": "The string that ties together all events in a given user’s login session. It starts with a login event and ends with either a logout event or the user session expiring. For example: GeJCsym5eyvtEK2I."
      },
      "MethodName": {
        "type": "string",
        "description": "The name of the calling Apex method."
      },
      "QueryString": {
        "type": "string",
        "description": "The SOQL query, if one was performed."
      },
      "RateLimitUsage": {
        "type": "string",
        "description": "The percent of the current usage of your rate limit."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "The unique ID of a single transaction. A transaction can contain one or more events. Each event in a given transaction has the same RequestIdentifier. For example: 3nWgxWbDKWWDIk0FKfF5DV."
      },
      "RequestStatus": {
        "type": "String",
        "description": "For example: S—Success. Salesforce handled the request successfully. If an Apex controller throws an exception, this status is also returned. F—Failure. Typically 4xx or 5xx HTTP codes, such as no permission to view page, page took too long to render, page is read-only. U—Undefined A—Authorization Error R—Redirect. Typically a 3xx HTTP code, possibly initiated by an Apex controller in a Visualforce page. N—Not Found. 404 error. This field can have a blank value."
      },
      "RunTime": {
        "type": "double",
        "description": "The amount of time that the request took in milliseconds.Requests with a value over five seconds are considered long-running requests for the purposes of the Concurrent Long-Running Apex Limit. HTTP callout processing time isn't included when calculating the 5-second limit. We pause the timer for the callout and resume it when the callout completes."
      },
      "SessionKey": {
        "type": "string",
        "description": "The user’s unique session ID. You can use this value to identify all user events within a session. When a user logs out and logs in again, a new session is started. For example: d7DEq/ANa7nNZZVD."
      },
      "Timestamp": {
        "type": "dateTime",
        "description": "The access time of Salesforce services in GMT. For example, 2020-01-20T19:12:26.965Z. Milliseconds are the most granular setting."
      },
      "Uri": {
        "type": "string",
        "description": "The URI of the page that’s receiving the request. For example: /home/home.jsp."
      },
      "UserIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the user who’s using Salesforce services through the UI or the API. For example: 00530000009M943."
      },
      "UserType": {
        "type": "string",
        "description": "The category of user license."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_apexsoapapieventlog.htm",
    "accessRules": "View Event Log Object Data",
    "clouds": [
      "Core Salesforce",
      "Shield"
    ]
  }
}