{
  "ApexExecutionOverlayAction": {
    "name": "ApexExecutionOverlayAction",
    "description": "Specifies an Apex code snippet or SOQL query to execute at a specific line of code in an Apex class or trigger. Optionally, generates a heap dump.",
    "properties": {
      "ActionScript": {
        "type": "string",
        "description": "The Apex code or SOQL query to run when execution reaches the line in the Apex class or trigger at the specified iteration. Results are included in the heap dump file."
      },
      "ActionScriptType": {
        "type": "string",
        "description": "Indicates whether the ActionScript is written in Apex or SOQL. Valid values are: None Apex SOQL If a value for this field is not supplied, or if an empty string is supplied for this value, a default value of None is used."
      },
      "ExecutableEntityId": {
        "type": "string",
        "description": "The ID of the Apex class or trigger being executed. This field is required if ExecutableEntityName is not provided. If both ExecutableEntityName and ExecutableEntityId are provided, ExecutableEntityId takes precedence."
      },
      "ExecutableEntityName": {
        "type": "string",
        "description": "The Apex typeRef of the class or trigger being executed. A type lookup is done and, if the typeRef is valid, ExecutableEntityId is set to the ID of the class or trigger.For a trigger, the typeRef must begin with the SFDC trigger prefix __sfdc_trigger/. For example, __sfdc_trigger/YourTriggerName or __sfdc_trigger/YourNamespace/YourTriggerName. For a class, use the format YourClass, YourClass$YourInnerClass, or YourNamespace/YourClass$YourInnerClass. This field is required if ExecutableEntityId is not provided. If both ExecutableEntityName and ExecutableEntityId are provided, ExecutableEntityId takes precedence."
      },
      "ExpirationDate": {
        "type": "dateTime",
        "description": "The expiration date of the overlay action.If no value is provided for this field, a default value of 30 minutes from the current time is used."
      },
      "IsDumpingHeap": {
        "type": "boolean",
        "description": "Indicates whether a heap dump is generated (true) or not (false). To execute the ActionScript without generating a heap dump, set this field to false. If no value for this field is provided, a default value of true is used."
      },
      "Iteration": {
        "type": "number",
        "description": "The number of times to execute the specified line execute before the heap dump is generated. This field is required."
      },
      "Line": {
        "type": "number",
        "description": "The line number of the heap dump marker. This field is required."
      },
      "ScopeId": {
        "type": "string",
        "description": "The user who executed the action.If no value for this field is provided, ScopeId is set to your UserId value."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_apexexecutionoverlayaction.htm",
    "clouds": [
      "Tooling API"
    ]
  }
}