{
  "ApptBookingConfig": {
    "name": "ApptBookingConfig",
    "description": "Represents a collection of fields to set up appointment scheduling.",
    "properties": {
      "ApexClassId": {
        "type": "reference",
        "description": "The Apex class that's used when scheduling an appointment using an external scheduling system. If not specified, the default Health Cloud-supplied Apex class is used."
      },
      "AssignedProviderRole": {
        "type": "string",
        "description": "Role used in an Account Contact Relation record to associate a patient (Person Account) with their assigned provider (Contact)."
      },
      "AttendanceThresholdPct": {
        "type": "double",
        "description": "Percentage of attended appointments above which a time slot is highlighted in the scheduling console."
      },
      "BestTimeSlotsDefinition": {
        "type": "string",
        "description": "ID of the attendance prediction taken from Einstein Discovery."
      },
      "CanCreateDuplicateRecord": {
        "type": "boolean",
        "description": "If true, Health Cloud creates a new record when two or more existing records contain duplicate data. If false, Health Cloud stops processing and creates a case you can review to reconcile the duplicates."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Record Type Name. This field is automatically generated, but you can supply your own value if you create the record using the API. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow as a DeveloperName is generated for each record."
      },
      "GetSlotStatusTimeout": {
        "type": "int",
        "description": "The number of milliseconds before a request to retrieve time slot statuses from a scheduling system times out. Valid values are from 0 through 60000."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether a configuration is active."
      },
      "IsSingleSourceSystem": {
        "type": "boolean",
        "description": "Indicates whether the configuration is associated with a single source system."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the appointment booking configuration."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The UI label of Appointment Booking Configuration"
      },
      "NamedCredentialId": {
        "type": "reference",
        "description": "The fully-qualified named credential used by the Apex class to connect to an external scheduling system."
      },
      "ServiceApptRecordTypeName": {
        "type": "string",
        "description": "The record type of the service appointment used for appointment scheduling."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/tooling_api_objects_apptbookingconfig.htm",
    "clouds": [
      "Health Cloud"
    ]
  }
}