{
  "ApptBundleConfig": {
    "name": "ApptBundleConfig",
    "description": "Represents the general parameters that define the behavior of the bundle.",
    "properties": {
      "AddToBundleStatuses": {
        "type": "multipicklist",
        "description": "The statuses of service appointment that are allowed to be bundled."
      },
      "BundleStatusesToPropagate": {
        "type": "multipicklist",
        "description": "The bundle statuses that when updated are inherited by the bundle members."
      },
      "CriteriaForAutoUnbundlingId": {
        "type": "reference",
        "description": "The criteria that causes a bundle service appointment to be unbundled."
      },
      "DoesAddTravelTime": {
        "type": "boolean",
        "description": "If the bundle members aren’t in the same location, add travel time between them to the bundle’s duration according to their sort order. The default value is false."
      },
      "DoesDeleteEmptyBundles": {
        "type": "boolean",
        "description": "If the bundle has no remaining bundle members, the bundle is deleted."
      },
      "EmptyBundleStatus": {
        "type": "picklist",
        "description": "The status from the Canceled category that a bundle service appointment changes to if it has no remaining bundle members, but still appears in the appointment list."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "MemberStatusesNotToPropagate": {
        "type": "multipicklist",
        "description": "The bundle member statuses that aren’t overridden when the bundle's status is updated."
      },
      "Name": {
        "type": "string",
        "description": "The name of the Appointment Bundle Config."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this object."
      },
      "RemoveFromBundleStatuses": {
        "type": "multipicklist",
        "description": "The statuses of service appointments that are allowed to be removed from a bundle."
      },
      "StatusOnRemovalFromBundle": {
        "type": "picklist",
        "description": "The status that a service appointment is given when it’s removed from a bundle."
      },
      "StatusesNotToUpdateOnUnbundle": {
        "type": "multipicklist",
        "description": "The statuses that aren’t updated when a bundle is unbundled."
      }
    },
    "module": "Field Service Lightning",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.field_service_dev.meta/field_service_dev/sforce_api_objects_apptbundleconfig.htm"
  }
}