{
  "ApptBundlePolicy": {
    "name": "ApptBundlePolicy",
    "description": "Policy that defines how the bundling of service appointments should be handled.",
    "properties": {
      "BundleEndTimeFieldName": {
        "type": "picklist",
        "description": "If IsTimeCalcByBundleDurationField is true, this field represents the name of the field used for entering the end time of the bundle."
      },
      "BundleStartTimeFieldName": {
        "type": "picklist",
        "description": "If IsTimeCalcByBundleDurationField is true, this field represents the name of the field used for entering the start time of the bundle."
      },
      "CanAllowSchleDepndInBundle": {
        "type": "boolean",
        "description": "This field is reserved for future use."
      },
      "ConstantTimeValue": {
        "type": "int",
        "description": "If IsTimeCalcByBundleDurationField is true, this field represents the total time of the bundle as a preset constant value."
      },
      "FilterCriteriaId": {
        "type": "reference",
        "description": "The active recordset filter criteria used for the bundle members. Only service appointments that meet the criteria can be bundled."
      },
      "IsAutomaticBundling": {
        "type": "boolean",
        "description": "Indicates if the policy is relevant for automatic bundling."
      },
      "IsManualBundling": {
        "type": "boolean",
        "description": "Indicates if the policy is relevant for manual bundling."
      },
      "IsTimeCalcByBundleDurationFld": {
        "type": "boolean",
        "description": "Indicates if the bundle’s duration is validated. If true, the bundle’s start time is subtracted from the bundle’s end time. If the result is a negative value, it uses ConstantTimeValue as the bundle’s duration."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "LimitAmountOfBundleMembers": {
        "type": "int",
        "description": "The maximum number of bundle members that can be included in a bundle."
      },
      "LimitDurationOfBundle": {
        "type": "int",
        "description": "The maximum duration of a bundle."
      },
      "Name": {
        "type": "string",
        "description": "Name of the bundle policy."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this object."
      },
      "Priority": {
        "type": "int",
        "description": "The priority level that this bundle policy should be given when the bundle policies are analyzed using the automatic mode."
      }
    },
    "module": "Field Service Lightning",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.field_service_dev.meta/field_service_dev/sforce_api_objects_apptbundlepolicy.htm"
  }
}