{
  "ApptBookingUrlConfig": {
    "name": "ApptBookingUrlConfig",
    "description": "Represents a collection of fields used to set up the URL paths for appointment scheduling endpoints.",
    "properties": {
      "AdditionalHeaders": {
        "type": "textarea",
        "description": "Specify headers added to the HTTP request. The format is: key:value;key:value;key:value;"
      },
      "ApptBookingConfigId": {
        "type": "reference",
        "description": "The appointment scheduling config associated with the record."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Record Type Name. This field is automatically generated, but you can supply your own value if you create the record using the API. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow as a DeveloperName is generated for each record."
      },
      "EndpointName": {
        "type": "picklist",
        "description": "Specifies the name of the endpoint to be called."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the Appointment Booking URL Configuration."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The UI label of Appointment Booking URL Configuration."
      },
      "UrlPath": {
        "type": "string",
        "description": "The URL path for the endpoint."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/tooling_api_objects_apptbookingurlconfig.htm",
    "clouds": [
      "Health Cloud"
    ]
  }
}