{
  "AssetRateCardEntry": {
    "name": "AssetRateCardEntry",
    "description": "Stores the negotiated rate card entries that are associated with an asset in Revenue Cloud.",
    "properties": {
      "AssetId": {
        "type": "reference",
        "description": "The ID of the asset rate card entry record."
      },
      "BindingObjectFormula": {
        "type": "string",
        "description": "The formula that returns the ID of the associated binding object, if specified. If binding object isn't added, the formula returns the asset ID of the asset related to this asset rate card entry. This field is read-only. Available in API version 65.0 and later."
      },
      "BindingObjectId": {
        "type": "reference",
        "description": "The ID of the binding object associated with the asset rate card entry. Available in API version 65.0 and later."
      },
      "BindingObjectRateOrder": {
        "type": "double",
        "description": "The order that determines the applicable binding object rate when multiple rates are defined for an Anchor binding object within a effective period. Available in API version 65.0 and later."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "The ID of the binding object associated with the asset rate card entry."
      },
      "EndDate": {
        "type": "dateTime",
        "description": "The date when the rate card's time period becomes inactive. The rate card becomes inactive at 11:59:00 PM on the end date."
      },
      "Name": {
        "type": "string",
        "description": "An auto-generated number assigned to the asset rate card entry. Read-only."
      },
      "NegotiatedRate": {
        "type": "double",
        "description": "The base negotiated rate used to charge overage consumption."
      },
      "RateCardEntryId": {
        "type": "reference",
        "description": "The ID of the rate card entry record containing the catalog rates that's associated with the asset rate card entry."
      },
      "RateCardId": {
        "type": "reference",
        "description": "The ID of the rate card record that's associated with the asset rate card entry."
      },
      "RateUnitOfMeasureId": {
        "type": "reference",
        "description": "The ID of the unit of measure record that's associated with the asset rate card entry."
      },
      "StartDate": {
        "type": "dateTime",
        "description": "The date when the rate card's time period becomes active. The rate card becomes active at 12:00:00 AM on the start date."
      },
      "UsageResourceId": {
        "type": "reference",
        "description": "The ID of the usage resource record that's associated with the asset rate card entry."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_assetratecardentry.htm",
    "accessRules": "This object is available in orgs where Revenue Cloud is enabled.",
    "clouds": [
      "Revenue Lifecycle Management",
      "Core Salesforce"
    ]
  }
}