{
  "AttributeBasedAdjustment": {
    "name": "AttributeBasedAdjustment",
    "description": "Represents the association between the product selling model and the price adjustment for product or service being sold based on its attributes. This object stores information about the attributes that define the price of the product or service, the discounts applied, along with its value for a given date range.",
    "properties": {
      "AdjustmentType": {
        "type": "picklist",
        "description": "The type of pricing adjustment being made."
      },
      "AdjustmentValue": {
        "type": "double",
        "description": "The value of the adjustment being made based on the adjustment type."
      },
      "AttributeBasedAdjRuleId": {
        "type": "reference",
        "description": "The attribute based adjustment rule associated with this attribute based adjustment record."
      },
      "AttributeCount": {
        "type": "int",
        "description": "The number of attributes."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "ISO code of the currency. Must be one of the valid alphabetic, three-letter currency ISO codes defined by the ISO 4217 standard, such as USD, GBP, or JPY. Must be unique within your organization."
      },
      "EffectiveFrom": {
        "type": "dateTime",
        "description": "The date and time when the price list entry comes into effect."
      },
      "EffectiveTo": {
        "type": "dateTime",
        "description": "The date and time till when the price list entry remains effective."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date the attribute based adjustment was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "Name": {
        "type": "string",
        "description": "Name of the attribute based adjustment."
      },
      "PriceAdjustmentScheduleId": {
        "type": "reference",
        "description": "The price adjustment schedule associated with the attribute based adjustment record."
      },
      "PricingTerm": {
        "type": "int",
        "description": "The number of pricing term units in the pricing term. Used with PricingTermUnit to define the length of the pricing term. For example, if PricingTermUnit is Months and this field is 1, the subscription is priced monthly.If the selling model is one-time, this field must be null."
      },
      "PricingTermUnit": {
        "type": "picklist",
        "description": "The unit of time used to define the pricing term. Used with PricingTerm to define the length of the pricing term. For example, if this field is Months and PricingTerm is 1, the subscription is priced monthly. If the selling model is one-time, this field must be null."
      },
      "ProductId": {
        "type": "reference",
        "description": "The ID of the product associated with the product attribute set."
      },
      "ProductSellingModelId": {
        "type": "reference",
        "description": "The ID of the ProductSellingModel record associated with this attribute based adjustment record."
      },
      "SellingModelType": {
        "type": "picklist",
        "description": "Indicates whether the product is sold as a one-time sale, an evergreen subscription, or a subscription with a defined term."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_attributebasedadjustment.htm",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}