{
  "PartyFinancialAssetTerm": {
    "name": "PartyFinancialAssetTerm",
    "description": "Represents a term or condition associated with a financial asset. Aids in identifying and tracking the terms set by a lender or the legal or regulatory terms around a financial asset's ownership, usage, maintenance, and monitoring.",
    "properties": {
      "AdditionalInformation": {
        "type": "string",
        "description": "The additional details about the term or condition."
      },
      "EffectiveEndDate": {
        "type": "date",
        "description": "The date until when the party financial asset term remains effective."
      },
      "EffectiveStartDate": {
        "type": "date",
        "description": "The date from which the party financial asset term becomes effective."
      },
      "IsLegallyEnforceable": {
        "type": "boolean",
        "description": "Indicates whether the party financial asset term is enforceable under regulations (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "PartyFinancialAssetId": {
        "type": "reference",
        "description": "The party financial asset asssociated with the party financial asset term."
      },
      "ReferenceRecordId": {
        "type": "reference",
        "description": "The reference record associated with the party financial asset term."
      },
      "TermId": {
        "type": "reference",
        "description": "The term or condition associated with the party financial asset term."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the type of term associated with the party financial asset term. For example, term related to lien repayment, additional ownership, or title related."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_partyfinancialassetterm.htm"
  }
}