{
  "PartyRelationshipGroup": {
    "name": "PartyRelationshipGroup",
    "description": "Represents a group of people living together such as a household, or a group of people affiliated with each other.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The parent account associated with the party relationship group."
      },
      "Category": {
        "type": "picklist",
        "description": "Specifies the category of the party relationship group."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the party relationship group."
      },
      "EndDate": {
        "type": "date",
        "description": "The end date associated with the party relationship group."
      },
      "GroupIncome": {
        "type": "currency",
        "description": "The total income of the party relationship group."
      },
      "GroupSize": {
        "type": "int",
        "description": "The number of active members associated with the party relationship group."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "Name": {
        "type": "string",
        "description": "The name of the party relationship group."
      },
      "PrimaryAddress": {
        "type": "address",
        "description": "The primary address of the party relationship group."
      },
      "PrimaryCity": {
        "type": "string",
        "description": "The primary city of the party relationship group."
      },
      "PrimaryCountry": {
        "type": "string",
        "description": "The primary country of the party relationship group."
      },
      "PrimaryGeocodeAccuracy": {
        "type": "picklist",
        "description": "The level of accuracy of a location’s geographical coordinates compared with its physical address. A geocoding service typically provides this value based on the party relationship group’s latitude and longitude coordinates."
      },
      "PrimaryLatitude": {
        "type": "double",
        "description": "Used with Longitude to specify the precise geolocation of the party relationship group. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "PrimaryLongitude": {
        "type": "double",
        "description": "Used with Latitude to specify the precise geolocation of the party relationship group. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "PrimaryPostalCode": {
        "type": "string",
        "description": "The primary postal code of the party relationship group."
      },
      "PrimaryState": {
        "type": "string",
        "description": "The primary state of the party relationship group."
      },
      "PrimaryStreet": {
        "type": "textarea",
        "description": "The primary street of the party relationship group."
      },
      "StartDate": {
        "type": "date",
        "description": "The start date associated with the party relationship group."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the party relationship group."
      },
      "Subtype": {
        "type": "picklist",
        "description": "The subclassification of the party relationship group type."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of the party relationship group."
      }
    },
    "module": "Public Sector Cloud"
  }
}