{
  "PartnerMarketingBudget": {
    "name": "PartnerMarketingBudget",
    "description": "",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "Total amount of the budget."
      },
      "ChannelPartnerId": {
        "type": "reference",
        "description": "The ID of the channel partner. This field is available in API version 45.0 and later. Note The ChannelPartnerId field isn’t supported for formula fields, custom buttons, or custom links for the PartnerMarketingBudget object. This limitation also applies to the PartnerFundAllocation and PartnerFundRequest objects."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the budget."
      },
      "EndDate": {
        "type": "date",
        "description": "Date when the budget is no longer available."
      },
      "IsIgnoreValidation": {
        "type": "boolean",
        "description": "When enabled, ignores restrictions related to the child objects connected to the budget. Note that individual totals for allocation amounts, request amounts, and claims amounts cannot exceed the total of their parent budget. Field is default off (false) on create. Once enabled (true), this field cannot be disabled. This field is available in API version 44.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last interacted with this record, directly or indirectly. Some sample scenarios are:"
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of the budget."
      },
      "StartDate": {
        "type": "date",
        "description": "Date when the budget becomes available."
      },
      "Title": {
        "type": "string",
        "description": "Title of the budget."
      },
      "TotalAllocatedAmount": {
        "type": "currency",
        "description": "Total funds allocated to channel partners or as a fund pool."
      },
      "TotalApprovedFcs": {
        "type": "currency",
        "description": "Total amount of approved fund claims."
      },
      "TotalApprovedFrs": {
        "type": "currency",
        "description": "Total amount of approved fund requests."
      },
      "TotalReimbursedFcs": {
        "type": "currency",
        "description": "Total amount of reimbursed fund claims."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of budget. Values are: Co-Operated Budget—Funds accrue based on a percentage of partner sales. The funds are available based on previous activity. Marketing Funds—Funds are issued to partners in advance of sales. The funds are awarded based on predicted or expected behavior."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_partnermarketingbudget.htm"
  }
}