{
  "PartnerNetworkSyncLog": {
    "name": "PartnerNetworkSyncLog",
    "description": "Represents the Org Sync Log tab in Salesforce, where Salesforce administrators can track the replication of record inserts and updates being performed in Organization Sync. The Connection Detail page for the replication connection also displays the Org Sync Log’s twenty most recent entries, and provides a link to the log.",
    "properties": {
      "ConnectionEvent": {
        "type": "picklist",
        "description": "The action being replicated to the partner organization, such as a record insertion."
      },
      "ConnectionId": {
        "type": "reference",
        "description": "The ID of the Salesforce to Salesforce replication connection in which the replication event succeeded or failed."
      },
      "Description": {
        "type": "textarea",
        "description": "A description of the replication event."
      },
      "EntityType": {
        "type": "string",
        "description": "The type of record being inserted or updated."
      },
      "Error": {
        "type": "string",
        "description": "The code used to describe the replication failure or success."
      },
      "LocalRecord": {
        "type": "string",
        "description": "The record being inserted or updated."
      },
      "Status": {
        "type": "picklist",
        "description": "An item is added to the Organization Sync Log if it failed to be replicated to the linked organization. This picklist includes the following values: Failed: The replication continued to fail after multiple retries, and won’t be retried further. Resolved: The replication succeeded after retrying. Retrying: Salesforce is retrying the replication. This field is available in API version 35.0 and later."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_partnernetworksynclog.htm"
  }
}