{
  "PartnerNetworkConnection": {
    "name": "PartnerNetworkConnection",
    "description": "Represents a Salesforce to Salesforce connection between Salesforce organizations.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "ID of the Account associated with this connection."
      },
      "ConnectionName": {
        "type": "string",
        "description": "A descriptive name for the connection. Limit: 295 characters."
      },
      "ConnectionStatus": {
        "type": "picklist",
        "description": "The status of the Salesforce to Salesforce connection. The picklist includes the following values: Sent Received Pending Accepted Rejected Inactive Disconnecting ConnectionSuspended SubscribeInProgress UsersInitialSync BulkSyncMetadata"
      },
      "ConnectionType": {
        "type": "picklist",
        "description": "The type of Salesforce to Salesforce connection. The picklist includes the following values: Standard Replication This field is available in API version 30.0 and later."
      },
      "ContactId": {
        "type": "reference",
        "description": "ID of the Contact associated with this connection."
      },
      "IsSyncAuditFields": {
        "type": "boolean",
        "description": "Specifies whether audit fields are synced between the primary and secondary organization in a replication connection. This field is available in API version 32.0 and later, and is only accessible in Salesforce organizations where Organization Sync is enabled."
      },
      "IsSyncMetadata": {
        "type": "boolean",
        "description": "Specifies whether supported types of metadata are synced from the primary to the secondary organization in a replication connection. This field is available in API version 33.0 and later, and is only accessible in Salesforce organizations where Organization Sync is enabled."
      },
      "IsSyncUsers": {
        "type": "boolean",
        "description": "Specifies whether users with standard Salesforce user licenses are synced between the primary and secondary organization in a replication connection. This field is available in API version 35.0 and later, and is only accessible in Salesforce organizations where Organization Sync is enabled."
      },
      "PrimaryContactId": {
        "type": "reference",
        "description": "ID of the User associated with this connection."
      },
      "ReplicationRole": {
        "type": "picklist",
        "description": "The role of this Salesforce organization in the replication connection. The picklist includes the following values: Primary Secondary This field is available in API version 30.0 and later, and is only accessible in Salesforce organizations where Organization Sync is enabled."
      },
      "ResponseDate": {
        "type": "dateTime",
        "description": "The date and time that the connection was accepted or rejected."
      }
    },
    "module": "Core Salesforce"
  }
}