{
  "PaymentScheduleTreatmentDtl": {
    "name": "PaymentScheduleTreatmentDtl",
    "description": "Contains configuration information for the payment schedule treatment detail.",
    "properties": {
      "DateOffset": {
        "type": "int",
        "description": "A number equal to or less than 0. The date offset is subtracted from the processing date reference to determine the processing date. For example, suppose that the invoice due date is 01/17/2022 and offset is -7. In this case, the payment schedule item is processed by the jobs that run on or before 01/10/2022."
      },
      "Description": {
        "type": "textarea",
        "description": "The user-entered description of the payment schedule treatment detail."
      },
      "InstallmentPaymentType": {
        "type": "picklist",
        "description": "Indicates how the payment amount is divided into multiple payments."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "PaymentMethodSelectionType": {
        "type": "picklist",
        "description": "Indicates how the payment method is specified."
      },
      "PaymentRunMatchingValue": {
        "type": "picklist",
        "description": ""
      },
      "PaymentScheduleTreatmentDetailNumber": {
        "type": "string",
        "description": "System-generated unique identifier for this payment schedule treatment detail."
      },
      "PaymentScheduleTreatmentId": {
        "type": "reference",
        "description": "The ID of the related payment schedule treatment."
      },
      "Percentage": {
        "type": "percent",
        "description": "Indicates the percentage of the source amount that is used to create the payment schedule."
      },
      "ProcessingDateReference": {
        "type": "picklist",
        "description": "Indicates the source of the reference date."
      },
      "PymtSchdDistributionMethodId": {
        "type": "reference",
        "description": "The distribution method that contains the information on how to create the payment schedule items."
      }
    },
    "module": "Core Salesforce"
  }
}