{
  "PaymentScheduleItem": {
    "name": "PaymentScheduleItem",
    "description": "A payment schedule contains one or more payment schedule items, where each item represents one payment to be processed. Each of a schedule’s items can have different payment configuration fields, such as payment methods, payment dates, and payment accounts. When a payment scheduler launches a payment run, the run evaluates active payment schedule items, and picks them up for payment processing if they align with the scheduler’s payment criteria.",
    "properties": {
      "Comments": {
        "type": "textarea",
        "description": "Optional user-defined comments."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Three-letter ISO 4217 currency code associated with the payment schedule item record."
      },
      "LastPaymentGatewayLogId": {
        "type": "reference",
        "description": "The most recent payment gateway log created following a payment gateway request to make a payment based on the payment schedule item."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "PaymentAccountId": {
        "type": "reference",
        "description": "The account assigned to payments made from the payment schedule item. When a payment schedule item is created, its PaymentAccountId inherits the payment schedule’s DefaultPaymentAccountId. However, you can provide a new PaymentAccountId at any time. If you change the PaymentAccountId, only payments made after the change use the new account."
      },
      "PaymentBatchRunId": {
        "type": "reference",
        "description": "The payment batch run that evaluated the payment schedule item for payment processing."
      },
      "PaymentId": {
        "type": "reference",
        "description": "The payment that a payment run created for the payment schedule item after picking up the parent payment schedule. This field is unique within your organization"
      },
      "PaymentMethodId": {
        "type": "reference",
        "description": "The payment method assigned to payments created from the payment schedule item. When a payment schedule item is created, its PaymentMethodId inherits the payment schedule’s DefaultPaymentMethodId. However, you can provide a new PaymentMethodId at any time. If you change the PaymentMethodId, only payments made after the change use the new account."
      },
      "PaymentProcessingMessage": {
        "type": "string",
        "description": "Shows information about whether the payment creation process has completed."
      },
      "PaymentsReceived": {
        "type": "currency",
        "description": "The payment received from the borrower for the payment schedule item."
      },
      "PaymentRunMatchingValue": {
        "type": "picklist",
        "description": "The value used to match a payment schedule item to a payment run based on the payment run’s matching criteria."
      },
      "PaymentScheduleId": {
        "type": "reference",
        "description": "The parent payment schedule for the payment schedule item."
      },
      "PaymentScheduleItemNumber": {
        "type": "string",
        "description": "User-defined reference number for the payment schedule item."
      },
      "PaymentSource": {
        "type": "picklist",
        "description": "The feature that caused a payment to be created from the payment schedule item."
      },
      "ProcessedAmount": {
        "type": "currency",
        "description": "The amount of the payment schedule item that has been processed for payment and converted to a payment record."
      },
      "RequestedAmount": {
        "type": "currency",
        "description": "The initial amount of the payment schedule item upon creation."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the payment schedule item."
      },
      "TargetPaymentProcessingDate": {
        "type": "date",
        "description": "The date after picking up a payment schedule item that the payment run makes a payment request to the payment gateway."
      },
      "UsageType": {
        "type": "picklist",
        "description": "Specifies the usage type for the record."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_paymentscheduleitem.htm"
  }
}