{
  "PaymentGatewayProvider": {
    "name": "PaymentGatewayProvider",
    "description": "Setup entity for payment gateways. Defines the connection to a payment gateway Apex adapter.",
    "properties": {
      "ApexAdapterId": {
        "type": "reference",
        "description": "ID of an APEX adapter class. The adapter interacts with your payment gateway to complete transactions. This field is unique within your organization."
      },
      "Comments": {
        "type": "textarea",
        "description": "Additional details about a record. Maximum of 1000 characters."
      },
      "DeveloperName": {
        "type": "string",
        "description": "(Optional) An internal name you assign the adapter. For reference only."
      },
      "IdempotencySupported": {
        "type": "picklist",
        "description": "If the same payment request is made in rapid succession, this field defines whether the Payments platform charges the customer or merchant’s card multiple times for the same transaction. This situation can occur when a user clicks a Pay button twice, or the gateway’s server goes down after fulfilling a payment request and the client immediately tries making another payment. If this field has a value of Yes, the Payments platform ignores identical payment requests made immediately after an original request."
      },
      "Language": {
        "type": "picklist",
        "description": "Customer language used for the payment gateway."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "MasterLabel": {
        "type": "string",
        "description": "User-friendly name of the payment gateway provider."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "Namespace for the payment gateway platform."
      }
    },
    "module": "Core Salesforce"
  }
}