{
  "PaymentBatchRun": {
    "name": "PaymentBatchRun",
    "description": "Represents a batch processing job that processes payments in Billing. During a payment batch run, all the payment schedules that meet the specified criteria are processed and the corresponding Payment records are created. These payments are then applied to invoices or invoice lines.",
    "properties": {
      "BillingBatchSchedulerId": {
        "type": "reference",
        "description": "Required. The ID of the billing batch scheduler that's used to schedule the payment batch run."
      },
      "Comments": {
        "type": "textarea",
        "description": "Additional details about the payment batch run."
      },
      "CompletionTime": {
        "type": "dateTime",
        "description": "The date and time when the payment batch run completed processing payments."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Required. The ID of the owner of the Payment Batch Run record."
      },
      "PaymentBatchRunNumber": {
        "type": "string",
        "description": "Required. The auto-generated reference number for the payment batch run."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The date and time when the payment batch run started processing payments."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the payment batch run."
      },
      "TotalFailedScheduleItems": {
        "type": "int",
        "description": "The total number of payment schedules that weren’t processed by the payment batch run. When a payment schedule isn’t processed, the system doesn’t generate a Payment record for it. For details about errors, check the Revenue Transaction Error Log records for the payment batch run."
      },
      "TotalFilteredScheduleItems": {
        "type": "int",
        "description": "The total number of payment schedule items that meet the payment run scheduler’s matching criteria. The matching criteria identifies the payment schedule items that are included for processing by the payment batch run."
      },
      "TotalProcessedScheduleItems": {
        "type": "int",
        "description": "The total number of payment schedule items that were processed by the payment batch run."
      },
      "TotalScheduleItemsApplied": {
        "type": "int",
        "description": "The total number of payment schedule items that were processed and had corresponding payments also applied to invoices or invoice lines."
      },
      "TotalScheduleItemsApplyFailed": {
        "type": "int",
        "description": "The total number of payment schedule items that were processed but had corresponding payments that weren't applied to invoices or invoice lines."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_paymentbatchrun.htm"
  }
}