{
  "PaymentSchedule": {
    "name": "PaymentSchedule",
    "description": "Represents information about a set of payments that a customer wants to collect at different times for a certain record. A schedule contains one or more payment schedule items, where each item represents one payment to be processed. Each of a schedule’s items can have different payment configuration fields, such as payment methods, payment dates, and payment accounts. When a payment scheduler launches a payment run, the run evaluates active payment schedule items, and picks them up for payment processing if they match the scheduler’s payment criteria.",
    "properties": {
      "AvailableRequestedAmount": {
        "type": "currency",
        "description": "The payment schedule’s remaining amount available for the creation of payment schedule items. This value is calculated by deducting the TotalLineRequestedAmount value from the TotalRequestedAmount value."
      },
      "Comments": {
        "type": "textarea",
        "description": "Additional details about the payment schedule."
      },
      "DefaultPaymentAccountId": {
        "type": "reference",
        "description": "When a payment run creates payments from a payment schedule item, it sets the payment’s account to the item’s PaymentAccountId value. When the payment schedule item is created, the item’s PaymentAccountId inherits the schedule’s DefaultPaymentAccountId. However, you can override the PaymentAccountId with a different account as needed. If you do, future payments made from the item use the new account."
      },
      "DefaultPaymentMethodId": {
        "type": "reference",
        "description": "When a payment run creates payments from a payment schedule item, it sets the payment’s payment method to the item’s PaymentMethodId. When the payment schedule item is created, the item’s PaymentMethodId inherits the schedule’s DefaultPaymentMethodId. However, you can override the PaymentMethodId with a different method as needed. If you do, future payments made from the item will use the new method."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Required. The ID of the owner of the Payment Schedule record."
      },
      "PaymentScheduleNumber": {
        "type": "string",
        "description": "Required. The auto-generated reference number for the payment schedule."
      },
      "PaymentSource": {
        "type": "picklist",
        "description": ""
      },
      "ReferenceEntityId": {
        "type": "reference",
        "description": "The object record that receives payments as a result of the related payment schedule items that are processed."
      },
      "RemainingAmountToBeProcessed": {
        "type": "currency",
        "description": "The total pending amount of payment schedule items that haven’t yet been processed for payment. This value is calculated by deducting the TotalProcessedAmount value from the TotalLineRequestedAmount value."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the payment schedule."
      },
      "TotalAppliedAmount": {
        "type": "currency",
        "description": "The amount of all the related payment schedule items that have been applied to payments."
      },
      "TotalCanceledAmount": {
        "type": "currency",
        "description": "The sum of all RequestedAmount values of all the related payment schedule items with a status of Canceled."
      },
      "TotalPaymentScheduleItemAmount": {
        "type": "currency",
        "description": "The total amount allocated from the payment schedule to its payment schedule items. This value is calculated by deducting the sum of each payment schedule item’s CanceledAmount from the sum of each payment schedule item’s RequestedAmount."
      },
      "TotalPaymentsReceived": {
        "type": "currency",
        "description": "The sum of all the total payment received for all the related payment schedule items."
      },
      "TotalProcessedAmount": {
        "type": "currency",
        "description": "The sum of ProcessedAmount values of all the related payment schedule items with a status of Processed."
      },
      "TotalRequestedAmount": {
        "type": "currency",
        "description": "Required. The total amount available for a payment schedule to distribute to its payment schedule items. The sum of payment schedule items can’t be greater than the TotalLineRequestedAmount value of the parent payment schedule."
      },
      "UsageType": {
        "type": "picklist",
        "description": "The feature using the payment schedule."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_paymentschedule.htm"
  }
}