{
  "PaymentLink": {
    "name": "PaymentLink",
    "description": "A link that a merchant can share with customers to collect payments for products and services. The payment link, which you can embed into a Salesforce app or send directly to a customer, directs the customer to a Pay Now payment page. The page can show a total amount owed or an itemized list or products, shipping and tax charges, and a total amount owed. The customer enters their contact and payment details, and submits their payment. The amounts are shown in the store's currency.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "Payer account."
      },
      "Amount": {
        "type": "currency",
        "description": "Amount the payer owes."
      },
      "CartId": {
        "type": "reference",
        "description": "The ID of the cart record."
      },
      "": {
        "type": "",
        "description": ""
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "3-digit ISO code for the payment currency that is shown on the Pay Now page. Possible values are: EUR – Euro GBP – British Pound USD – US Dollar"
      },
      "Description": {
        "type": "textarea",
        "description": "Text on the Pay Now payment page that’s visible to your customers. This text can communicate any information you want."
      },
      "Expiry Time": {
        "type": "dateTime",
        "description": "The date and time that the payment link expires. The time is based on the user’s time zone, not the org’s time zone."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record can be referenced and not viewed directly."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PaymentInitiationSource": {
        "type": "string",
        "description": "The origin of the payment, based on the information in the Payment Link record."
      },
      "PaymentLinkNumber": {
        "type": "string",
        "description": "Auto-generated number that identifies the payment link."
      },
      "PaymentMethodSetId": {
        "type": "reference",
        "description": "Reference to the PaymentMethodSet object, which determines what payment methods are shown to the payer."
      },
      "PaymentUrl": {
        "type": "url",
        "description": "Unique URL of the Pay Now page. This URL IS auto-generated, and not editable."
      },
      "QrCodeImageId": {
        "type": "reference",
        "description": "Reference to the QR code image included in the payment link record."
      },
      "Status": {
        "type": "picklist",
        "description": "Indicates whether the payment link is active and can be used."
      },
      "TaxAmount": {
        "type": "currency",
        "description": "Amount of the tax for the purchase. This amount is shown on the Pay Now page."
      },
      "Title": {
        "type": "string",
        "description": "Title of the Pay Now page, indicating what is being paid."
      },
      "Type": {
        "type": "picklist",
        "description": "Indicates the type of payment link created, which the merchant can share with the customer to receive payment. The payment link also determines which Pay Now page is generated and what’s included on that page."
      },
      "UsageType": {
        "type": "picklist",
        "description": "Determines whether the payment link is used one time or multiple times before the configured expiration date and time."
      }
    },
    "module": "Core Salesforce"
  }
}