{
  "PendingServiceRouting": {
    "name": "PendingServiceRouting",
    "description": "Represents the routing details of a work item that’s waiting to be routed or assigned.",
    "properties": {
      "BotId": {
        "type": "reference",
        "description": "The ID of the Enhanced Einstein Bot or AI agent that performed the work. This is a relationship field. This field is available in API version 52.0 and later."
      },
      "BotType": {
        "type": "picklist",
        "description": "Indicates the type of bot. Valid values are: Bot. Refers to an Einstein bot. ExternalCopilot. Refers to an AI agent with whom your customers can interact."
      },
      "CapacityPercentage": {
        "type": "percent",
        "description": "Indicates the amount of work that this work item represents as a percentage. Valid values are from 0 to 100. Voice calls must have a capacity percentage of 100. If an agent receives a voice call, the agent won’t receive new work items until the call ends, because at that point the agent’s capacity will have reached 100%."
      },
      "CapacityWeight": {
        "type": "double",
        "description": "Indicates the amount of work that this work item represents as a whole number. Voice calls must use the entire capacity weight."
      },
      "CustomRequestedDateTime": {
        "type": "dateTime",
        "description": "Retains the datetime of this work item’s initial request, so work items are rerouted using the datetime of the initial work request. When left blank, work items are rerouted using the datetime when they’re rerouted."
      },
      "DropAdditionalSkillsTimeout": {
        "type": "int",
        "description": "Time to wait before a skill marked as additional is dropped from Omni-Channel routing. The case is then routed to the best-matched agent even if they don’t have all the skills. If CustomRequestedDateTime is set in the PendingServiceRouting object, DropAdditionalSkillsTimeout uses CustomRequestedDateTime as the start time. If CustomRequestedDateTime + DropAdditionalSkillsTimeout has already passed, Omni-Channel immediately drops the additional skills after the pending service request is created."
      },
      "ExternalBotId": {
        "type": "reference",
        "description": "The ID of the third-party bot that handles the work item. This is a relationship field. This field is available in API version 64.0 and later."
      },
      "GroupId": {
        "type": "reference",
        "description": "ID of the Omni-Channel queue."
      },
      "IsInterruptible": {
        "type": "boolean",
        "description": "Indicates whether a work item consumes interruptible or primary capacity. The default value is false. Available in version 57.0 and later when the Interruptible Capacity feature is enabled."
      },
      "IsOwnerChangeInitiated": {
        "type": "boolean",
        "description": "Indicates whether a work item owner change triggered the direct assignment of this work item to the agent. The default value is false."
      },
      "IsPreferredUserRequired": {
        "type": "boolean",
        "description": "Indicates whether this work item stays with the preferred user even when the user isn’t available. The default value is false. This field is available in API version 50.0 and later."
      },
      "IsPushAttempted": {
        "type": "boolean",
        "description": "Indicates whether a push has been attempted. true if this work item was pushed to an agent at least one time and false otherwise."
      },
      "IsPushed": {
        "type": "boolean",
        "description": "Indicates whether this work item is pushed to an agent."
      },
      "IsReadyForRouting": {
        "type": "boolean",
        "description": "Indicates whether this work item is ready to be routed to an agent. If true, you can’t edit this PendingServiceRouting record."
      },
      "IsStatusChangeInitiated": {
        "type": "boolean",
        "description": "Indicates whether a work item status change triggered the direct assignment of this work item to the agent. The default value is false. This field is available in API version 50.0 and later."
      },
      "IsTransfer": {
        "type": "boolean",
        "description": "Indicates whether this work item routing is a transfer request."
      },
      "LastDeclinedAgentSession": {
        "type": "string",
        "description": "Chat session ID of the agent who last declined this work item."
      },
      "Name": {
        "type": "string",
        "description": "Name of the PendingServiceRouting record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this PendingServiceRouting record."
      },
      "PausedCapacityPercentage": {
        "type": "percent",
        "description": "The percentage of capacity that’s consumed when this work item is paused. The paused capacity feature is available with status-based capacity and Enhanced Omni-Channel only. This field is available in API version 62.0 and later."
      },
      "PausedCapacityWeight": {
        "type": "double",
        "description": "The amount of capacity that’s consumed when this work item is paused. The paused capacity feature is available with status-based capacity and Enhanced Omni-Channel only. This field is available in API version 62.0 and later."
      },
      "PreferredUserId": {
        "type": "reference",
        "description": "ID of the preferred user to handle the work item."
      },
      "PushTimeout": {
        "type": "int",
        "description": "The time limit set for an agent to respond to an item before it’s rerouted and the agent’s status is changed accordingly. The time limit is measured in seconds. This field is available in API version 36.0 and later."
      },
      "QueueId": {
        "type": "reference",
        "description": "ID of the Omni-Channel queue. Due to API changes, QueueId is no longer recommended. Use GroupId instead."
      },
      "RoutingModel": {
        "type": "picklist",
        "description": "Type of routing model."
      },
      "RoutingPriority": {
        "type": "int",
        "description": "Order in which work items are routed to agents. This field is considered with skills-based routing only. Queue-based routing sets a work item's priority from the routing configuration."
      },
      "RoutingType": {
        "type": "picklist",
        "description": "Indicates whether the work item is routed by queue or by skills-based routing. Possible values are: QueueBased SkillsBased"
      },
      "SecondaryRoutingPriority": {
        "type": "int",
        "description": "Indicates the secondary routing priority."
      },
      "Serial": {
        "type": "int",
        "description": "Serial number of the PendingServiceRouting record. The serial number is automatically incremented each time the PendingServiceRouting record is modified."
      },
      "ServiceChannelId": {
        "type": "reference",
        "description": "ID of the service channel."
      },
      "TransferRequesterId": {
        "type": "reference",
        "description": "The user ID of the rep who reassigned the work using the Reassign action. This field is populated in reassigned AgentWork records only, not the original AgentWork record. This is a relationship field. This field is available in API version 63.0 and later."
      },
      "WorkItemId": {
        "type": "reference",
        "description": "ID of the work item."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_pendingservicerouting.htm"
  }
}