{
  "PercentileBsdCareFeeAgreement": {
    "name": "PercentileBsdCareFeeAgreement",
    "description": "Specifies the payment terms for contracts of Percentile Based Care Fee Agreement.",
    "properties": {
      "BracketInformation": {
        "type": "string",
        "description": "The description of the percentile bracket information."
      },
      "ContractPaymentAgreementId": {
        "type": "reference",
        "description": "The contract payment agreement record to which this percentile based care fee agreement is associated."
      },
      "FifthBracketPrice": {
        "type": "currency",
        "description": "The price for the procedure if the member falls into the fifth percentile bracket based on the factor considered by the payer."
      },
      "FirstBracketPrice": {
        "type": "currency",
        "description": "The price for the procedure if the member falls into the first percentile bracket based on the factor considered by the payer."
      },
      "FourthBracketPrice": {
        "type": "currency",
        "description": "The price for the procedure if the member falls into the fourth percentile bracket based on the factor considered by the payer."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced the record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed the record."
      },
      "Name": {
        "type": "string",
        "description": "The name of the percentile based care fee agreement."
      },
      "ProcedureCodeDescription": {
        "type": "string",
        "description": "The description of the procedure code."
      },
      "ProcedureCodeId": {
        "type": "reference",
        "description": "The industry standard code for the procedure such as CPT or HCPCS."
      },
      "RelativeValueUnit": {
        "type": "double",
        "description": "The relative value unit for the procedure."
      },
      "SecondBracketPrice": {
        "type": "currency",
        "description": "The price for the procedure if the member falls into the second percentile bracket based on the factor considered by the payer."
      },
      "StandardPrice": {
        "type": "currency",
        "description": "The standard price for the procedure defined by the governing body."
      },
      "ThirdBracketPrice": {
        "type": "currency",
        "description": "The price for the procedure if the member falls into the third percentile bracket based on the factor considered by the payer."
      }
    },
    "module": "Health Cloud"
  }
}