{
  "PermissionSet": {
    "name": "PermissionSet",
    "description": "Represents a set of permissions that’s used to grant more access to users without changing their profile or reassigning profiles.",
    "properties": {
      "Description": {
        "type": "string",
        "description": "A description of the permission set. Limit: 255 characters."
      },
      "HasActivationRequired": {
        "type": "boolean",
        "description": "Indicates whether the permission set requires an associated active session (true) or not (false)."
      },
      "IsCustom": {
        "type": "boolean",
        "description": "If true, the permission set is custom (created by an admin); if false, the permission set is standard and related to a specific permission set license."
      },
      "IsOwnedByProfile": {
        "type": "boolean",
        "description": "If true, the permission set is owned by a profile. Available in API version 25.0 and later."
      },
      "Label": {
        "type": "string",
        "description": "The permission set label, which corresponds to Label in the user interface. Limit: 80 characters."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "Name": {
        "type": "string",
        "description": "The permission set group name."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix associated with this object. Each Developer Edition organization that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. This field is available in API version 30.0 and later. The namespace prefix can have one of the following values: In Developer Edition organizations, the namespace prefix is set to the namespace prefix of the organization for all objects that support it. There is an exception if an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition organization of the package developer. In organizations that are not Developer Edition organizations, NamespacePrefix is only set for objects that are part of an installed managed package. There is no namespace prefix for all other objects."
      },
      "PermissionSetGroupId": {
        "type": "reference",
        "description": "If the permission set is owned by a permission set group, this field returns the ID of the permission set group. If the permission set isn’t owned by a permission set group, this field returns a null value. Available in API version 45.0 and later."
      },
      "ProfileId": {
        "type": "reference",
        "description": "If the permission set is owned by a profile, this field returns the ID of the profile. If the permission set isn’t owned by a profile, this field returns a null value."
      },
      "Type": {
        "type": "picklist",
        "description": "The permission set type."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_permissionset.htm"
  }
}