{
  "PermissionSetGroup": {
    "name": "PermissionSetGroup",
    "description": "Represents a group of permission sets and the permissions within them. Use permission set groups to organize permissions based on job functions or tasks. Then, you can package the groups as needed.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The permission set group description."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The permission set group name used in the API."
      },
      "HasActivationRequired": {
        "type": "boolean",
        "description": "Indicates whether the permission set group requires an associated active session (true) or not (false). The default value is false.This field is available in API version 53.0 and later."
      },
      "Language": {
        "type": "picklist",
        "description": "The Permission Set Group language. Valid values are: Chinese (Simplified): zh_CN Chinese (Traditional): zh_TW Danish: da Dutch: nl_NL English: en_US Finnish: fi French: fr German: de Italian: it Japanese: ja Korean: ko Norwegian: no Portuguese (Brazil): pt_BR Russian: ru Spanish: es Spanish (Mexico): es_MX Spanish (Mexico) defaults to Spanish for customer-defined translations. Swedish: sv Thai: th The Salesforce user interface is fully translated to Thai, but Help is in English."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "The permission set group label for the aggregated permissions."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The permission set group namespace prefix."
      },
      "Status": {
        "type": "string",
        "description": "Indicates the permission set group recalculation status. Updated. The group is current. Outdated. The group requires recalculation. Updating. The group is in recalculation mode. Failed. The group recalculation failed."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_permissionsetgroup.htm"
  }
}