{
  "PermissionSetAssignment": {
    "name": "PermissionSetAssignment",
    "description": "Represents a user’s assignment to a permission set or permission set group.",
    "properties": {
      "AssigneeId": {
        "type": "reference",
        "description": "The ID of the user that is assigned the permission set indicated in PermissionSetId or the permission set group indicated in PermissionSetGroupId."
      },
      "ExpirationDate": {
        "type": "dateTime",
        "description": "The date that the assignment of the permission set or permission set group expires for the specified user. This field is available in API version 52.0 and later."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the assignment is active (true) or not (false). Defaults to false. This field is available in API version 52.0 and later."
      },
      "IsRevoked": {
        "type": "boolean",
        "description": "Indicates whether the assignment was revoked (true) or not (false). Defaults to false. This field is available only if user access policies are enabled. This field is available in API version 57.0 and later."
      },
      "LastCreatedByChangeId": {
        "type": "reference",
        "description": "The ID of the user access change record related to this permission set or permission set group assignment. This field is available only if user access policies are enabled. This field is available in API version 57.0 and later."
      },
      "LastDeletedByChangeId": {
        "type": "reference",
        "description": "The ID of the user access change record related to this permission set or permission set group assignment being revoked. This field is available only if user access policies are enabled. This field is available in API version 57.0 and later."
      },
      "PermissionSetGroupId": {
        "type": "reference",
        "description": "The ID of the permission set group assigned to the user specified in AssigneeId. This field is available in API version 45.0 and later."
      },
      "PermissionSetId": {
        "type": "reference",
        "description": "The ID of the permission set assigned to the user specified in AssigneeId."
      }
    },
    "module": "Core Salesforce"
  }
}