{
  "PermissionSet": {
    "name": "PermissionSet",
    "description": "Represents a set of permissions that’s used to grant more access to one or more users without changing their profile or reassigning profiles.",
    "properties": {
      "Description": {
        "type": "string",
        "description": "A description of the permission set. Limit: 255 characters."
      },
      "HasActivationRequired": {
        "type": "boolean",
        "description": "Indicates whether the permission set requires an associated active session (true) or not (false)."
      },
      "IsCustom": {
        "type": "boolean",
        "description": "If true, the permission set is custom (created by an admin); if false, the permission set is standard and related to a specific permission set license."
      },
      "IsOwnedByProfile": {
        "type": "boolean",
        "description": "If true, the permission set is owned by a profile. Available in API version 25.0 and later."
      },
      "Label": {
        "type": "string",
        "description": "The permission set label, which corresponds to Label in the user interface. Limit: 80 characters."
      },
      "LicenseId": {
        "type": "reference",
        "description": "The ID of either the related PermissionSetLicense or UserLicense associated with this permission set. Available in API version 38.0 and later. Use this field instead of UserLicenseId, which is deprecated and only available up to API Version 37.0."
      },
      "Name": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your organization. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. Corresponds to API Name in the user interface. Limit: 80 characters."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix for a permission set that's been installed as part of a managed package. If the permission set isn't packaged or is part of an unmanaged package, this value is empty. Available in API version 23.0 and later."
      },
      "PermissionsPermissionName": {
        "type": "boolean",
        "description": "One field for each permission. If true, users assigned to this permission set have the named permission. The number of fields varies depending on the permissions for the organization and license type. Tip To get a list of available permissions in the SOAP API, use describeSObjects()."
      },
      "PermissionSetGroupId": {
        "type": "reference",
        "description": "If the permission set is owned by a permission set group, this field returns the ID of the permission set group. If the permission set isn’t owned by a permission set group, this field returns a null value. Available in API version 45.0 and later."
      },
      "ProfileId": {
        "type": "reference",
        "description": "If the permission set is owned by a profile, this field returns the ID of the Profile. If the permission set isn’t owned by a profile, this field returns a null value. Available in API version 25.0 and later."
      },
      "Type": {
        "type": "reference",
        "description": "Available in API version 46.0 and later."
      },
      "UserLicenseId": {
        "type": "reference",
        "description": "ID of the UserLicense associated with this permission set. This field is nillable in API version 26.0 and later and available up to API version 37.0 In API version 38.0 and later, use LicenseId."
      }
    },
    "module": "Core Salesforce"
  }
}