{
  "PipelineInspectionListView": {
    "name": "PipelineInspectionListView",
    "description": "Represents a pipeline view, an intelligence view, or a saved filter. A pipeline view shows a set of opportunity records, based on specific criteria. An intelligence view shows a set of account, lead, or contact records, based on specific criteria.",
    "properties": {
      "ChangePeriodLiteralType": {
        "type": "picklist",
        "description": "The date literal associated with the pipeline changes metrics group, used for filtering by a custom time period."
      },
      "ChangePeriodStartDate": {
        "type": "date",
        "description": "The start date used when filtering by a custom time period for pipeline changes metrics and forecast category metrics groups."
      },
      "DateLiteralType": {
        "type": "picklist",
        "description": "The date literal associated with the pipeline and intelligence views, used for filtering by the close date, created date, or activity date."
      },
      "EndDate": {
        "type": "date",
        "description": "The end date used when filtering by a custom time period for close dates."
      },
      "IsSystemManaged": {
        "type": "boolean",
        "description": "Indicates whether the system is managing changes to visibility and deletion of a pipeline view (true) or not (false)."
      },
      "ListViewId": {
        "type": "reference",
        "description": "The ID of the associated ListView record. This field is unique within your organization."
      },
      "MarketSegments": {
        "type": "textarea",
        "description": "The customer segments selected in the Prospecting Center view."
      },
      "StartDate": {
        "type": "date",
        "description": "The start date used when filtering by a custom time period for close dates."
      },
      "SummaryField": {
        "type": "picklist",
        "description": "The opportunity field specified in a pipeline view to summarize pipeline inspection metrics."
      },
      "UserId": {
        "type": "reference",
        "description": "The ID of the user whose records you want to see by default in the list view. This field is a relationship field."
      },
      "ViewType": {
        "type": "picklist",
        "description": "The corresponding API name for the pipeline or intelligence view type."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_pipelineinspectionlistview.htm"
  }
}