{
  "PlanBenefitItem": {
    "name": "PlanBenefitItem",
    "description": "Represents the details of a benefit available under a purchaser’s plan that is offered to their members.",
    "properties": {
      "BenefitCategory": {
        "type": "string",
        "description": "Name of the benefit category this item belongs to."
      },
      "CoverageLevel": {
        "type": "string",
        "description": "Description of the level of coverage provided."
      },
      "InNetworkCoverage": {
        "type": "currency",
        "description": "The amount available to contribute towards treatment costs for each treatment undertaken by the health plan’s preferred providers."
      },
      "IsInPlanNetwork": {
        "type": "boolean",
        "description": "Indicates if the benefit is only available in the plan network."
      },
      "ItemCodeId": {
        "type": "reference",
        "description": "The code of the plan benefit item."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Name of this benefit item."
      },
      "Notes": {
        "type": "textarea",
        "description": "Additional information about this benefit item."
      },
      "OutofNetworkCoverage": {
        "type": "currency",
        "description": "The amount available to contribute towards treatment costs for each treatment undertaken by non-preferred providers."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PauthRequirementEndDate": {
        "type": "dateTime",
        "description": "The date from which preauthorization for the plan benefit item is required or not."
      },
      "PauthRequirementStartDate": {
        "type": "dateTime",
        "description": "The last date for which preauthorization for the plan benefit item is required or not."
      },
      "PlanBenefitId": {
        "type": "reference",
        "description": "The ID of the benefit this item belongs to."
      },
      "PreauthorizationTypeCodeId": {
        "type": "reference",
        "description": "The code which represents the type of preauthorization that the plan benefit item requires."
      },
      "ServiceType": {
        "type": "string",
        "description": "The type of service this plan benefit item provides for."
      },
      "ServiceTypeCode": {
        "type": "string",
        "description": "The code for the type of service this plan benefit item provides for."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the system this benefits item record came from."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of this benefits item record on its source system."
      },
      "SourceSystemModified": {
        "type": "date",
        "description": "The date on which this benefits item was last updated from the source system."
      },
      "TimePeriod": {
        "type": "string",
        "description": "A description of the period during which services under this plan benefit item are to be rendered or continued."
      }
    },
    "module": "Health Cloud"
  }
}