{
  "PlatformAction": {
    "name": "PlatformAction",
    "description": "PlatformAction is a virtual read-only object. It enables you to query for actions displayed in the UI, given a user, a context, device format, and a record ID. Examples include standard and custom buttons, quick actions, and productivity actions.",
    "properties": {
      "ActionListContext": {
        "type": "picklist",
        "description": "Required. The list context this action applies to. Valid values are: Assistant BannerPhoto Chatter Dockable FeedElement Flexipage Global ListView ListViewDefinition ListViewRecord Lookup MruList MruRow ObjectHomeChart Photo Record RecordEdit RelatedList RelatedListRecord"
      },
      "ActionTarget": {
        "type": "textarea",
        "description": "The URL to invoke or describe the action when the action is invoked. If the action is a standard button overridden by a Visualforce page, the ActionTarget returns the URL of the Visualforce page, such as /apex/pagename."
      },
      "ActionTargetType": {
        "type": "picklist",
        "description": "The type of the target when this action is triggered. Valid values are: Describe—applies to actions with a user interface, such as quick actions Invoke—applies to actions with no user interface, such as action links or invocable actions Visualforce—applies to standard buttons overridden by a Visualforce page"
      },
      "ActionTargetUrl": {
        "type": "string",
        "description": "URL to invoke or describe the action when the action is invoked. This field is deprecated in API version 35.0 and later. Use ActionTarget instead."
      },
      "Category": {
        "type": "picklist",
        "description": "Applies only to action links. Denotes whether the action link shows up in the feed item list of actions or the overflow list of actions. Valid values are: Primary Overflow"
      },
      "ConfirmationMessage": {
        "type": "string",
        "description": "Applies only to action links. The message to display before the action is invoked. Field is null if no confirmation is required before invoking the action."
      },
      "DeviceFormat": {
        "type": "picklist",
        "description": "Specifies which action icon the PlatformAction query returns. If this field isn’t specified, it defaults to Phone. Valid values are: Aloha Desktop Phone Tablet"
      },
      "ExternalId": {
        "type": "string",
        "description": "The unique ID for the PlatformAction. If the action doesn’t have an ID, its API name is used."
      },
      "GroupId": {
        "type": "reference",
        "description": "The unique ID of a group of action links."
      },
      "IconContentType": {
        "type": "string",
        "description": "The content type—such as .jpg, .gif, or .png—of the icon for this action. Applies to both custom and standard icons assigned to actions."
      },
      "IconHeight": {
        "type": "int",
        "description": "The height of the icon for this action. Applies only to standard icons."
      },
      "IconUrl": {
        "type": "url",
        "description": "The URL of the icon for this action."
      },
      "IconWidth": {
        "type": "int",
        "description": "The width of the icon for this action. Applies only to standard icons."
      },
      "InvocationStatus": {
        "type": "picklist",
        "description": "The status of the action within the feed item. Applies to action links only. Valid values are: Failed New Pending Successful"
      },
      "InvokedByUserId": {
        "type": "reference",
        "description": "The ID of the user who most recently invoked this action within the current feed item. Applies to action links only."
      },
      "IsGroupDefault": {
        "type": "boolean",
        "description": "Denotes whether this action is the default in an action link group. False for other action types. Applies to action links only."
      },
      "IsMassAction": {
        "type": "boolean",
        "description": "Indicates whether the action can be performed on multiple records.This field is available in API version 38.0 and later."
      },
      "Label": {
        "type": "string",
        "description": "The label to display for this action."
      },
      "PrimaryColor": {
        "type": "string",
        "description": "The primary color of the icon for this action."
      },
      "RelatedListRecordId": {
        "type": "string",
        "description": "Represents the ID of a record in an object’s related list.This field is available in API version 38.0 and later."
      },
      "RelatedSourceEntity": {
        "type": "string",
        "description": "When the ActionListContext is RelatedList or RelatedListRecord, this field represents the API name of the related list to which the action belongs."
      },
      "Section": {
        "type": "picklist",
        "description": "The section of the user interface the action resides in. Applicable only to Lightning Experience. Valid values are: ActivityComposer CollaborateComposer NotesComposer Page SingleActionLinks This field is available in API version 35.0 and later."
      },
      "SourceEntity": {
        "type": "string",
        "description": "Required. The object or record with which this action is associated."
      },
      "Subtype": {
        "type": "string",
        "description": "The subtype of the action. For quick actions, the subtype is QuickActionType. For custom buttons, the subtype is WebLinkTypeEnum. For action links, subtypes are Api, ApiAsync, Download, and Ui. Standard buttons and productivity actions have no subtype."
      },
      "TargetObject": {
        "type": "string",
        "description": "The type of object record the action creates, such as a contact or opportunity.This field is available in API version 41.0 and later."
      },
      "TargetUrl": {
        "type": "string",
        "description": "The URL that a custom button or link points to.This field is available in API version 41.0 and later."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of the action. Valid values are: ActionLink—An indicator on a feed element that targets an API, a web page, or a file, represented by a button in the Salesforce Chatter feed UI. CustomButton—When clicked, opens a URL or a Visualforce page in a window or executes JavaScript. InvocableAction ProductivityAction—Productivity actions are predefined and attached to a limited set of objects. Productivity actions include Send Email, Call, Map, View Website, and Read News. Except for the Call action, you can’t edit productivity actions. QuickAction—A global or object-specific action. StandardButton—A predefined Salesforce button such as New, Edit, and Delete."
      }
    },
    "module": "Core Salesforce"
  }
}