{
  "PlatformEventUsageMetric": {
    "name": "PlatformEventUsageMetric",
    "description": "Contains usage data for event publishing and delivery to CometD and Pub/Sub API clients, empApi Lightning components, and event relays. If Enhanced Usage Metrics isn't enabled, usage data is available for the last 24 hours, ending at the last hour, and for historical daily usage. In API 58.0 and later, you can enable Enhanced Usage Metrics to get usage data by event name and client for granular time intervals. PlatformEventUsageMetric contains separate usage metrics for platform events and change data capture events.",
    "properties": {
      "Client": {
        "type": "string",
        "description": "This field is available only when Enhanced Usage Metrics is enabled. The ID of the client. The Client field is populated with one of the following values."
      },
      "EndDate": {
        "type": "dateTime",
        "description": "The end date and time in UTC used for querying usage metrics. The date granularity is hourly."
      },
      "EventName": {
        "type": "string",
        "description": "This field is available only when Enhanced Usage Metrics is enabled. The API name of a custom platform event or a change event. Custom platform event with the label My Event: My_Event__e Change event example: AccountChangeEvent"
      },
      "EventType": {
        "type": "picklist",
        "description": "This field is available when Enhanced Usage Metrics is enabled. The type of event you would like to query usage metrics for, such as a change event or a custom platform event."
      },
      "ExternalId": {
        "type": "string",
        "description": "This field is not in use."
      },
      "Name": {
        "type": "picklist",
        "description": "The name of the metric to get usage for."
      },
      "StartDate": {
        "type": "dateTime",
        "description": "The start date and time in UTC used for querying usage metrics. The date granularity is hourly."
      },
      "TimeSegment": {
        "type": "picklist",
        "description": "This field is available when Enhanced Usage Metrics is enabled. The time interval used for aggregating usage data returned in the query results. Valid TimeSegment values depend on the time range specified with StartDate and EndDate."
      },
      "UsageType": {
        "type": "picklist",
        "description": "This field is available when Enhanced Usage Metrics is enabled. The type of event usage metrics to query for, such as event publishing or event delivery. Use this field with the EventName or EventType fields."
      },
      "Value": {
        "type": "long",
        "description": "The usage value for the specified metric and date range."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_platformeventusagemetric.htm"
  }
}