{
  "PresenceUserConfig": {
    "name": "PresenceUserConfig",
    "description": "Represents a configuration that determines a presence user’s settings.",
    "properties": {
      "AcwExtensionDuration": {
        "type": "int",
        "description": "The maximum length of time, measured in seconds, an agent can spend on After Conversation Work (ACW) each time they extend the timer. You must set this field if HasAcwExtensionEnabled is set to true. Specify a value from 10 through 3600. This field is available in API version 56.0 and later."
      },
      "AfterConvoWorkMaxTime": {
        "type": "int",
        "description": "The maximum length of time, measured in seconds, an agent has to complete After Conversation Work (ACW). You must set this field if HasAfterConvoWorkTimer is set to true. Specify a value from 10 through 3600.This field is available in API version 56.0 and later."
      },
      "Capacity": {
        "type": "int",
        "description": "The maximum number of work units an agent can be assigned at one time."
      },
      "": {
        "type": "",
        "description": ""
      },
      "CustomSoundId": {
        "type": "reference",
        "description": "CustomSound"
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization.When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow while Salesforce generates one for each record. Only users with View DeveloperName OR View Setup and Configuration permission can view, group, sort, and filter this field."
      },
      "HasAcwExtensionEnabled": {
        "type": "boolean",
        "description": "If set to true, agents can extend their After Conversation Work (ACW) time. Available only if HasAfterConvoWorkTimer is set to true. If set to true, you must also set the AcwExtensionDuration and MaxExtensions fields. The default value is true.This field is available in API version 56.0 and later."
      },
      "HasAfterConvoWorkTimer": {
        "type": "boolean",
        "description": "If set to true, After Conversation Work (ACW) time can be configured for the channel. If set to true, you must also set the AfterConvoWorkMaxTime field. The default value is false.This field is available in API version 56.0 and later."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the presence configuration."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label of the presence configuration."
      },
      "MaxExtensions": {
        "type": "picklist",
        "description": "The maximum number of times an agent can extend their After Work Conversation (ACW) time. Specify a value from 1 through 10. You must set this field if HasAcwExtensionEnabled is set to true.This field is available in API version 56.0 and later."
      },
      "OptionsIsAllowAnyDestinationQueueForTransferEnabled": {
        "type": "boolean",
        "description": "Indicates that a rep can transfer a message from an enhanced Messaging channel to any queue (true) or only the selected queues (false). This field is available in API version 61.0 and later."
      },
      "OptionsIsAllowAnyDestinationFlowForTransferEnabled": {
        "type": "boolean",
        "description": "Indicates that a rep can transfer a message from an enhanced Messaging channel to any flow (true) or only the selected flows (false). This field is available in API version 61.0 and later."
      },
      "OptionsIsAllowAnyDestinationProfileForTransferEnabled": {
        "type": "boolean",
        "description": "Indicates that a rep can transfer a message from an enhanced Messaging channel to any profile (true) or only the selected profiles (false). This field is available in API version 61.0 and later."
      },
      "OptionsIsAutoAcceptEnabled": {
        "type": "boolean",
        "description": "Indicates whether work items that are routed to agents are automatically accepted (true) or not (false). Available only if OptionsIsDeclineEnabled is set to false."
      },
      "OptionsIsDeclineEnabled": {
        "type": "boolean",
        "description": "Indicates whether agents can decline work items that are routed to them (true) or not (false). Available only if OptionsIsAutoAcceptEnabled is set to false."
      },
      "OptionsIsDeclineReasonEnabled": {
        "type": "boolean",
        "description": "Indicates whether agents can select a reason for declining work requests (true) or not (false). This can be selected only if decline reasons are enabled."
      },
      "OptionsIsDisconnectSoundEnabled": {
        "type": "boolean",
        "description": "Indicates whether a sound is played when agents are disconnected from Omni-Channel (true) or not (false)."
      },
      "OptionsIsRequestSoundEnabled": {
        "type": "boolean",
        "description": "Indicates whether a sound plays with incoming work requests (true) or not (false). Set to true by default."
      },
      "PresenceStatusOnDeclineId": {
        "type": "reference",
        "description": "The ID of the presence status that’s automatically assigned to the agent when the agent declines a work item. Available only if OptionsIsDeclineEnabled is set to true."
      },
      "PresenceStatusOnPushTimeoutId": {
        "type": "reference",
        "description": "The ID of the presence status that’s automatically assigned to the agent when the agent doesn’t respond to a work item before push timeout occurs. Available in API version 36.0 and later."
      },
      "SoundLength": {
        "type": "int",
        "description": "The length of time that a sound plays when new work is assigned to an agent."
      }
    },
    "module": "Core Salesforce"
  }
}