{
  "PresenceUserConfig": {
    "name": "PresenceUserConfig",
    "description": "Represents a configuration that determines a presence user’s settings. This object is available in API version 65.0 and later.",
    "properties": {
      "AcwExtensionDuration": {
        "type": "int",
        "description": "The maximum length of time, measured in seconds, an agent can spend on After Conversation Work (ACW) each time they extend the timer. You must set this field if HasAcwExtensionEnabled is set to true. Specify a value from 10 through 3600."
      },
      "AfterConvoWorkMaxTime": {
        "type": "int",
        "description": "The maximum length of time, measured in seconds, an agent has to complete ACW. You must set this field if HasAfterConvoWorkTimer is set to true. Specify a value from 10 through 3600."
      },
      "Capacity": {
        "type": "int",
        "description": "The maximum number of work units an agent can be assigned at one time."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API."
      },
      "HasAcwExtensionEnabled": {
        "type": "boolean",
        "description": "Indicates whether agents can extend their ACW time (true) or not (false). Available only if HasAfterConvoWorkTimer is set to true. If this field is set to true, you must also set the AcwExtensionDuration and MaxExtensions fields."
      },
      "HasAfterConvoWorkTimer": {
        "type": "boolean",
        "description": "Indicates whether ACW time can be configured for the agent (true) or not (false). If set to true, you must also set the AfterConvoWorkMaxTime field to true."
      },
      "InterruptibleCapacity": {
        "type": "int",
        "description": "The maximum number of work units using interruptible capacity that can be assigned to an agent at a time. If the value in this field is empty it defaults to the value set in the Capacity field. This field is available only when the Interruptible Capacity feature is enabled."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the presence configuration."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label of the presence configuration."
      },
      "MaxExtensions": {
        "type": "picklist",
        "description": "Maximum number of times an agent can extend their ACW time. Specify a value from 1 through 10. You must set this field if HasAcwExtensionEnabled is set to true."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_presenceuserconfig.htm"
  }
}