{
  "PriceAdjustmentTier": {
    "name": "PriceAdjustmentTier",
    "description": "Represents a discount tier in a price adjustment schedule.",
    "properties": {
      "AdjustmentType": {
        "type": "picklist",
        "description": "The type of price adjustment."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only if the multicurrency feature is enabled. Contains the ISO code for any currency allowed by the organization."
      },
      "EffectiveFrom": {
        "type": "dateTime",
        "description": "The date and time when the price adjustment tier comes into effect."
      },
      "EffectiveTo": {
        "type": "dateTime",
        "description": "The date and time when the price adjustment tier remains effective."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Indicates when the user last referred to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "LowerBound": {
        "type": "double",
        "description": "The minimum quantity the discount can be applied to. It must be a positive integer and less than or equal to the upper bound of the tier."
      },
      "Name": {
        "type": "string",
        "description": "The name of the price adjustment tier."
      },
      "PriceAdjustmentScheduleId": {
        "type": "reference",
        "description": "The ID of the price adjustment schedule that the discount is applied to."
      },
      "PricingTerm": {
        "type": "int",
        "description": "The number of pricing term units in the pricing term. Used with PricingTermUnit to define the length of the pricing term. For example, if PricingTermUnit is Months and this field is 1, the subscription is priced monthly.If the selling model is one-time, this field must be null."
      },
      "PricingTermUnit": {
        "type": "picklist",
        "description": "The unit of time used to define the pricing term. Used with PricingTerm to define the length of the pricing term. For example, if this field is Months and PricingTerm is 1, the subscription is priced monthly. If the selling model is one-time, this field must be null."
      },
      "Product2Id": {
        "type": "reference",
        "description": "The ID of the product associated with the price adjustment tier."
      },
      "ProductSellingModelId": {
        "type": "reference",
        "description": "The ID of the ProductSellingModel record associated with this price adjustment tier record."
      },
      "SellingModelType": {
        "type": "picklist",
        "description": "Indicates whether the product is sold as a one-time sale, an evergreen subscription, or a subscription with a defined term."
      },
      "TierType": {
        "type": "picklist",
        "description": "The unit of the discount. Possible values are: AdjustmentAmount—An amount discounted from an item’s list price AdjustmentPercentage—A percentage discounted from an item’s list price"
      },
      "TierValue": {
        "type": "double",
        "description": "The value of the discount."
      },
      "UpperBound": {
        "type": "double",
        "description": "The maximum quantity the discount can be applied to. Must be a positive integer. Not inclusive. Set this value one digit higher than the quantity you want the tier to include. For example, if a tier’s upper bound is 99, set the value of UpperBound to 100. For the last tier, the value is optional."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_priceadjustmenttier.htm"
  }
}