{
  "Pricebookentry": {
    "name": "Pricebookentry",
    "description": "Represents a product entry (an association between a price book and product) in a price book.",
    "properties": {
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether this price book entry is active."
      },
      "IsArchived": {
        "type": "boolean",
        "description": "Indicates whether the price book entry has been archived (true) or not (false). This is set to true when the product record it’s associated with is archived, or when the price book record is archived. This field is read only. Available in API version 45.0 and later. Label is Archived."
      },
      "Name": {
        "type": "string",
        "description": "Name of this price book entry record. This read-only field references the value in the Name field of the product record. Label is Product Name."
      },
      "Pricebook2Id": {
        "type": "reference",
        "description": "Required. ID of the price book record with which this record is associated. This field must be specified when creating price book records. It can’t be changed in an update."
      },
      "Product2Id": {
        "type": "reference",
        "description": "Required. ID of the product record with which this record is associated. This field must be specified when creating product records. It can’t be changed in an update."
      },
      "ProductCode": {
        "type": "string",
        "description": "Product code for this record. This read-only field references the value in the ProductCode field of the associated product record."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "Required. Unit price for this price book entry. You can specify a value only if UseStandardPrice is set to false. Label is List Price."
      },
      "UseStandardPrice": {
        "type": "boolean",
        "description": "Indicates whether this price book entry uses the standard price defined in the standard price book record."
      }
    },
    "module": "Health Cloud"
  }
}