{
  "PriceProtectionTerm": {
    "name": "PriceProtectionTerm",
    "description": "Represents a configuration record that defines the rules, types, and eligible conditions for price protection.",
    "properties": {
      "CalculationReferenceRecordId": {
        "type": "reference",
        "description": "Rebate type that's applicable for the claim amount calculation. This field is a relationship field."
      },
      "IsPayable": {
        "type": "boolean",
        "description": "Indicates whether the inventory is eligible for payment or refund after a price protection adjustment."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": ""
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Date and the timestamp when the record was last viewed by the user. Helps in understanding record engagement."
      },
      "Name": {
        "type": "string",
        "description": "Unique name for the Price Protection Term. This is typically used as a primary identifier for UI display or business logic."
      },
      "NewSalePriceType": {
        "type": "picklist",
        "description": "Defines the type of new sale price applicable after a price protection scenario. This helps classify how the adjusted sale price can be handled."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Identifier for the user or group who owns the record."
      },
      "PriceProtectionType": {
        "type": "picklist",
        "description": "Defines the type of price protection applied."
      },
      "SalePriceType": {
        "type": "picklist",
        "description": "Specifies the type of sale price before price protection is applied. This helps calculate the protection delta during claim processing."
      },
      "SupportedPricePercent": {
        "type": "percent",
        "description": "Indicates the percentage of the price that is supported for price protection. Helps calculate eligible claim amounts."
      },
      "SupportedQuantityPercent": {
        "type": "percent",
        "description": "Indicates the percentage of quantity that is eligible for price protection. Used to determine prorated reimbursement."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_priceprotectionterm.htm"
  }
}