{
  "PriceAdjustmentSchedule": {
    "name": "PriceAdjustmentSchedule",
    "description": "Represents a series of tiered discounts based on the number of items purchased.",
    "properties": {
      "AdjustmentMethod": {
        "type": "picklist",
        "description": "The method for applying tiered pricing. Possible values are: Range—All items receive the discount of the highest tier the quantity falls in. Slab—Items receive the discount defined for the tier they fall in."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only if the multicurrency feature is enabled. Contains the ISO code for any currency allowed by the organization."
      },
      "Description": {
        "type": "textarea",
        "description": "Text description of the price adjustment schedule."
      },
      "EffectiveFrom": {
        "type": "dateTime",
        "description": "The date and time when the price adjustment schedule comes into effect."
      },
      "EffectiveTo": {
        "type": "dateTime",
        "description": "The date and time when the price adjustment schedule remains effective."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the price adjustment schedule is active (true) or not (false). You can change this field’s value as often as necessary. Label is Active. Default value is False."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Indicates whether the price adjustment schedule has been archived (true) or not (false). This field is read-only."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the price adjustment schedule. This field is read-only. Label is Price Adjustment Schedule Name."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The Salesforce ID of the sales representative who owns the price adjustment schedule."
      },
      "Pricebook2Id": {
        "type": "reference",
        "description": "The price book associated with this price adjustment schedule record."
      },
      "ScheduleType": {
        "type": "picklist",
        "description": "The type of price adjustment schedule."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_priceadjustmentschedule.htm"
  }
}