{
  "PrivacyObjectSession": {
    "name": "PrivacyObjectSession",
    "description": "Represents the status of each object being processed in past, ongoing, and scheduled policy jobs in Privacy Center.",
    "properties": {
      "CurrentEntity": {
        "type": "string",
        "description": "The name of the object in the policy."
      },
      "Name": {
        "type": "string",
        "description": "Represents the job session record. This is a serialized, automatically generated number field."
      },
      "ObjectFailureLog": {
        "type": "textarea",
        "description": "This field is reserved for later use."
      },
      "ObjectStatus": {
        "type": "picklist",
        "description": "The policy execution status for the object."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the owner of the account associated with the customer that the policy was executed for."
      },
      "PolicyNode": {
        "type": "string",
        "description": "The ID of the object in the serialized policy. This field associates the object session in the policy execution with the coordinating object in the Privacy Center policy."
      },
      "Position": {
        "type": "int",
        "description": "Represents a record’s position in the batch queue for the object being processed."
      },
      "PrivacyJobSessionObjectId": {
        "type": "reference",
        "description": "The ID of the policy job session."
      },
      "ProcessType": {
        "type": "picklist",
        "description": "The type of action being executed on the object in the policy."
      },
      "ProcessedFailures": {
        "type": "int",
        "description": "The number of records the policy execution failed to process."
      },
      "ProcessedSuccesses": {
        "type": "int",
        "description": "The number of records the policy execution successfully processed."
      },
      "ProcessedTotal": {
        "type": "int",
        "description": "The total number of records processed in the policy job."
      },
      "Processor": {
        "type": "string",
        "description": "The name of the deletion, masking, or traversal processor executing the policy job."
      },
      "Queue": {
        "type": "string",
        "description": "This field is reserved for later use."
      },
      "QueueLength": {
        "type": "int",
        "description": "The total number of records in the queue to be processed by the policy job."
      },
      "RecordsAffected": {
        "type": "int",
        "description": "The number of records processed by the policy job."
      },
      "Retry": {
        "type": "int",
        "description": "The queue number of the retry session after a failed policy execution attempt. Each attempt to retry the policy execution is put into a retry queue."
      },
      "TraversalEndTime": {
        "type": "dateTime",
        "description": "The end time of the record-capturing phase for the object session."
      },
      "TraversalStartTime": {
        "type": "dateTime",
        "description": "The start time of the record-capturing phase for the object session."
      },
      "UniqueConstraint": {
        "type": "string",
        "description": "For internal use only."
      }
    },
    "module": "Core Salesforce"
  }
}