{
  "PrivacyJobSession": {
    "name": "PrivacyJobSession",
    "description": "Represents the status of past, ongoing, and scheduled policy jobs in Privacy Center.",
    "properties": {
      "CreationDate": {
        "type": "dateTime",
        "description": "The date and time the policy job was created."
      },
      "CurrentObject": {
        "type": "string",
        "description": "The name of the object that the policy job is currently processing."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The date and time the policy job finished executing."
      },
      "FailureLog": {
        "type": "textarea",
        "description": "The description of why the policy job failed to execute."
      },
      "JobStartType": {
        "type": "picklist",
        "description": "How the policy job session was started."
      },
      "JobStatus": {
        "type": "picklist",
        "description": "Represents the status of the policy job session."
      },
      "Name": {
        "type": "string",
        "description": "Represents the job session record. This is a serialized, automatically generated number field."
      },
      "OptionsProcessingFailed": {
        "type": "boolean",
        "description": "Indicates that the policy job session failed to process the records with the deletion or masking rules in the policy."
      },
      "OptionsTraversalComplete": {
        "type": "boolean",
        "description": "Indicates that the policy job session was completed without errors."
      },
      "OptionsTraversalFailed": {
        "type": "boolean",
        "description": "Indicates that the policy job session was completed with errors."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the owner of the account associated with this customer."
      },
      "PolicyDescription": {
        "type": "string",
        "description": "The description of the policy the job session is associated with."
      },
      "PolicyName": {
        "type": "string",
        "description": "The name of the policy the job session is associated with."
      },
      "PolicyType": {
        "type": "picklist",
        "description": "The type of policy the job session is associated with."
      },
      "PrivacyPolicyDefinitionId": {
        "type": "reference",
        "description": "The ID of the policy the job session is executing for."
      },
      "PrivacyRtbfRequestId": {
        "type": "reference",
        "description": "The ID of the Right to Be Forgotten request the policy job is executing for."
      },
      "ScheduledTime": {
        "type": "dateTime",
        "description": "The date and time the policy job session is scheduled to run."
      },
      "SerializedPolicy": {
        "type": "textarea",
        "description": "The serial ID of a snapshot of the policy the job session is for. A snapshot of the policy is taken to maintain consistent metadata for the policy the job is for, in case changes are made to the policy while the job is executing."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The date and time the policy job session started executing."
      }
    },
    "module": "Core Salesforce"
  }
}