{
  "Problem": {
    "name": "Problem",
    "description": "Problems represent the root cause data of one or more incidents. This object contains all the details of a problem, documenting the history of the problem from detection to closure.",
    "properties": {
      "Category": {
        "type": "picklist",
        "description": "The type of problem. Administrators set field values."
      },
      "Description": {
        "type": "textarea",
        "description": "A description of the problem. This field can store up to 32 KB of data, but only the first 255 characters appear in reports."
      },
      "Impact": {
        "type": "picklist",
        "description": "The problem's impact."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time (in UTC) when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time (in UTC) when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view. (LastReferencedDate) but not viewed it."
      },
      "OwnerId": {
        "type": "reference",
        "description": "This is a polymorphic relationship field that represents the user or group assigned to resolve the problem."
      },
      "ParentProblemId": {
        "type": "reference",
        "description": "The ID of a problem above one or more related problems in a problem hierarchy."
      },
      "Priority": {
        "type": "picklist",
        "description": "The impact and urgency of the problem."
      },
      "PriorityOverrideReason": {
        "type": "string",
        "description": "The reason why the priority should be changed or edited."
      },
      "ProblemNumber": {
        "type": "string",
        "description": "The unique, system-generated problem number."
      },
      "ResolutionDateTime": {
        "type": "dateTime",
        "description": "The date and time (in UTC) when the problem was resolved."
      },
      "ResolutionSummary": {
        "type": "textarea",
        "description": "A description of the steps needed to resolve the incident."
      },
      "ResolvedById": {
        "type": "reference",
        "description": "The ID of the user who resolved the problem."
      },
      "RootCauseSummary": {
        "type": "textarea",
        "description": "A description of the problem resolution or root cause. This field can store up to 32 KB of data, but only the first 255 characters display in reports."
      },
      "Status": {
        "type": "picklist",
        "description": "Any custom or granular stages customers wants to track. This will be a dependent picklist."
      },
      "StatusCode": {
        "type": "picklist",
        "description": "The status of the problem."
      },
      "SubCategory": {
        "type": "picklist",
        "description": "The type of problem. One level deeper than Category. Administrators set field values."
      },
      "Subject": {
        "type": "string",
        "description": "A brief description of the problem."
      },
      "Urgency": {
        "type": "picklist",
        "description": "A measure of how long a resolution can be delayed until an incident, problem, or change has a significant business impact."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_problem.htm"
  }
}