{
  "ProcessException": {
    "name": "ProcessException",
    "description": "Represents a business exception, such as a processing failure on an order summary. A separate process is required to resolve the failure that caused the process exception before processing can continue.",
    "properties": {
      "AttachedToId": {
        "type": "reference",
        "description": "ID of the object associated with the ProcessException."
      },
      "CaseId": {
        "type": "reference",
        "description": "ID of the case associated with the ProcessException."
      },
      "Category": {
        "type": "picklist",
        "description": "ProcessingException type. You can customize the category picklist to represent your business processes."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for orgs with the multicurrency feature enabled. Contains the ISO code for the currency of the OrderSummary associated with the ProcessException."
      },
      "Description": {
        "type": "textarea",
        "description": "Detailed description of the ProcessException."
      },
      "ExternalReference": {
        "type": "string",
        "description": "Description of external entities associated with the ProcessException."
      },
      "FlowOrchestrationInstRelaObj": {
        "type": "reference",
        "description": "The flow orchestration instance related object associated with this record."
      },
      "GroupById": {
        "type": "reference",
        "description": "ID used in the entity to group exceptions, such as the Async Operation Tracker."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Timestamp for when the current user last viewed this record. A null value can mean that this record has only been referenced (LastReferencedDate) and not viewed."
      },
      "Message": {
        "type": "string",
        "description": "Short description of the ProcessException"
      },
      "OrderSummaryId": {
        "type": "reference",
        "description": "ID of the OrderSummary associated with the ProcessException. The ProcessException component is displayed on this OrderSummary."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the User who currently owns this ProcessException. Default value is the User who created the record."
      },
      "Priority": {
        "type": "picklist",
        "description": "Resolution priority for the ProcessException. You can customize the priority picklist to represent your business processes."
      },
      "ProcessExceptionNumber": {
        "type": "string",
        "description": "The unique name of the ProcessException, formatted as PE-(00000000)."
      },
      "Severity": {
        "type": "picklist",
        "description": "Severity of the ProcessException. Each severity value corresponds to one severity category. You can customize the severity picklist to represent your business processes. If you customize the severity picklist, include at least one severity value for each severity category."
      },
      "SeverityCategory": {
        "type": "picklist",
        "description": "Severity category of the ProcessException. Each severity category corresponds to one or more severity values. The severity category is used to show the severity icon in the ProcessException list view."
      },
      "Status": {
        "type": "picklist",
        "description": "Status of the ProcessException. Each status corresponds to one status category, shown here in parentheses. You can customize the status picklist to represent your business processes. If you customize the status picklist, include at least one status value for each status category."
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "Status category of the ProcessException. Each status category corresponds to one or more statuses."
      }
    },
    "module": "Core Salesforce"
  }
}