{
  "ProductClassificationAttr": {
    "name": "ProductClassificationAttr",
    "description": "Represents the relationship between a product classification and its attributes. This is the default configuration for products based on the product classification.",
    "properties": {
      "AttributeCategoryId": {
        "type": "reference",
        "description": "The ID of the attribute category assigned to the parent object."
      },
      "AttributeDefinitionId": {
        "type": "reference",
        "description": "The ID of the attribute assigned to the parent object."
      },
      "AttributeNameOverride": {
        "type": "string",
        "description": "The overridden attribute name to display for the attribute when shown for this object. For example, \"Color\" overridden to \"Laptop Color.\""
      },
      "DefaultValue": {
        "type": "string",
        "description": "The default value of the attribute for a product based on the product classification. This value can be changed."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of this product classification attribute definition."
      },
      "DisplayType": {
        "type": "picklist",
        "description": "The type to display data for the selected data type."
      },
      "ExcludedPicklistValues": {
        "type": "textarea",
        "description": "The picklist values excluded from the attribute picklist. This field ensures that the product classification attribute only has valid values."
      },
      "HelpText": {
        "type": "textarea",
        "description": "The help text to display when end users are configuring this attribute. This field overrides the help text defined for the attribute itself."
      },
      "IsHidden": {
        "type": "boolean",
        "description": "Indicates if this product attribute is hidden from end users in the run time (true) or not (false)."
      },
      "IsPriceImpacting": {
        "type": "boolean",
        "description": "Indicates whether this attribute dictates the price of a product (true) or not (false)."
      },
      "IsReadOnly": {
        "type": "boolean",
        "description": "Indicates whether the attribute is read-only for users in the run time (true) or not (false)."
      },
      "IsRequired": {
        "type": "boolean",
        "description": "Indicates whether this attribute requires a value when assigned to a parent object (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date the product classification attribute was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date the product classification attribute was last viewed."
      },
      "MaximumCharacterCount": {
        "type": "int",
        "description": "The maximum number of characters that can be entered for an attribute value."
      },
      "MaximumValue": {
        "type": "string",
        "description": "The maximum value that can be entered as an attribute value."
      },
      "MinimumCharacterCount": {
        "type": "int",
        "description": "The minimum number of characters that can be entered for an attribute value."
      },
      "MinimumValue": {
        "type": "string",
        "description": "The minimum value that can be entered as an attribute value."
      },
      "Name": {
        "type": "string",
        "description": "The name of the product classification attribute."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the product classification attribute owner."
      },
      "ProductClassificationId": {
        "type": "reference",
        "description": "The ID of the product classification that the attribute is associated with. This field is unique within your organization."
      },
      "Sequence": {
        "type": "int",
        "description": "The display sequence of the attribute when configuring the product during run time."
      },
      "Status": {
        "type": "picklist",
        "description": "The lifecycle status of the product classification attribute."
      },
      "StepValue": {
        "type": "string",
        "description": "The increment or decrement by which a slider's value changes as the user adjusts the product classification attribute value. Available in API version 61.0 and later."
      },
      "ValueDescription": {
        "type": "textarea",
        "description": "The description of the value assigned to this attribute. This field takes on the value description from the attribute definition."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_productclassificationattr.htm"
  }
}