{
  "ProductSellingModel": {
    "name": "ProductSellingModel",
    "description": "Defines one method by which a product can be sold; for example, as a one-time sale, an evergreen subscription, or a termed subscription. If the product is sold on subscription, this object defines the subscription’s term. A product can have multiple product selling models.",
    "properties": {
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Indicates when the user last referred to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Indicates when the user last viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "The name given to the product selling model."
      },
      "PricingTerm": {
        "type": "int",
        "description": "The number of pricing term units in the pricing term. Used with PricingTermUnit to define the length of the pricing term. For example, if PricingTermUnit is Months and this field is 1, the subscription is priced monthly.If the selling model is one-time, this field must be null."
      },
      "PricingTermUnit": {
        "type": "picklist",
        "description": "The unit of time used to define the pricing term. Used with PricingTerm to define the length of the pricing term. For example, if this field is Months and PricingTerm is 1, the subscription is priced monthly. If the selling model is one-time, this field must be null."
      },
      "SellingModelType": {
        "type": "picklist",
        "description": "Indicates whether the product is sold as a one-time sale, an evergreen subscription, or a subscription with a defined term."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the product selling model."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_productsellingmodel.htm"
  }
}