{
  "ProductServiceCampaign": {
    "name": "ProductServiceCampaign",
    "description": "Represents a set of activities to be performed for a product service campaign. For example, a recall of products due to potential safety hazards or an upgrade of products to comply with legal regulations.",
    "properties": {
      "ActionableListId": {
        "type": "reference",
        "description": "The actionable list of the assets that are a part of a product service campaign."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the product service campaign."
      },
      "EndDate": {
        "type": "date",
        "description": "The date on which the product service campaign ends."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this object."
      },
      "Priority": {
        "type": "picklist",
        "description": "The priority of the product service campaign."
      },
      "Product2Id": {
        "type": "reference",
        "description": "The product associated with the product service campaign."
      },
      "ProductServiceCampaignName": {
        "type": "string",
        "description": "The name of the product service campaign."
      },
      "StartDate": {
        "type": "date",
        "description": "The date on which the product service campaign starts."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the product service campaign."
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "The category of a status value. StatusCategory field has eight default values: seven values that are identical to the default Status values, and None for statuses without a status category.If you create custom Status values, you must indicate which category it belongs to. For example, if you create a Waiting for Response value, add it the On Hold category."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of the product service campaign."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The work type associated with the product service campaign."
      }
    },
    "module": "Manufacturing Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.mfg_api_devguide.meta/mfg_api_devguide/sforce_api_objects_productservicecampaign.htm"
  }
}