{
  "ProductItem": {
    "name": "ProductItem",
    "description": "Represents the stock of a product at a particular inventory location, such as a warehouse or a distribution lot. Product item records represent your inventory. A product item is associated with an inventory location and stores the quantity of products at that location.",
    "properties": {
      "IsProduct2Serialized": {
        "type": "boolean",
        "description": "Specifies if the product associated with the product item is a serialized product (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate isn’t null, the user accessed this record or list view indirectly."
      },
      "LocationId": {
        "type": "reference",
        "description": "The location that’s associated with the product item. This usually indicates where the product item is stored."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the product item."
      },
      "Product2Id": {
        "type": "reference",
        "description": "The product that’s associated with the product item. This usually represents the type of product in your inventory."
      },
      "ProductItemNumber": {
        "type": "string",
        "description": "The auto-generated number identifying the product item."
      },
      "ProductName": {
        "type": "string",
        "description": "The name of the product item. We recommend you use a name that indicates the name of the product along with its location."
      },
      "QuantityOnHand": {
        "type": "double",
        "description": "The quantity at the location. If you want to add a serial number, this value must be 1."
      },
      "QuantityUnitOfMeasure": {
        "type": "picklist",
        "description": "The unit of the quantity of the product that’s consumed. For example, kilograms or liters. Quantity Unit of Measure values are inherited from the Quantity Unit of Measure field on products."
      },
      "SerialNumber": {
        "type": "string",
        "description": "A unique number for identification purposes. If you want to enter a serial number, the Quantity on Hand must be 1."
      }
    },
    "module": "Manufacturing Cloud"
  }
}