{
  "ProductFulfillmentDecompRule": {
    "name": "ProductFulfillmentDecompRule",
    "description": "Represents a rule that determines how an order is broken into sub-orders with specific technical details that help in order fulfillment. It can be applied to a commercial or a technical product.",
    "properties": {
      "DestinationProductId": {
        "type": "reference",
        "description": "The destination product for the decomposition rule."
      },
      "DestinationIdentifier": {
        "type": "string",
        "description": "The destination entity in the product fulfillment decomposition rule. This field can store a Salesforce product ID or an external identifier. This field is available in API version 65.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date when a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date when a user viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "The name of the decomposition rule."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who created the record."
      },
      "Priority": {
        "type": "int",
        "description": "The priority of the decomposition rule. Decomposition rules are executed in order of priority."
      },
      "SourceProductClassificationId": {
        "type": "reference",
        "description": "The classification of the source product that's used for decomposition. This field is available in API version 62.0 and later."
      },
      "SourceClassIdentifier": {
        "type": "string",
        "description": "The source classification entity in the product fulfillment decomposition rule. This field can store a Salesforce product ID or an external identifier. This field is available in API version 65.0 and later."
      },
      "SourceIdentifier": {
        "type": "string",
        "description": "The source entity in the product fulfillment decomposition rule. This field can store a Salesforce product ID or an external identifier. This field is available in API version 65.0 and later."
      },
      "SourceProductId": {
        "type": "reference",
        "description": "Source product for the decomposition rule."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_productfulfillmentdecomprule.htm"
  }
}