{
  "ProductConsumed": {
    "name": "ProductConsumed",
    "description": "Represents an item from your product inventory that was used to complete a work order or work order line item.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the product consumed record."
      },
      "Discount": {
        "type": "percent",
        "description": "The discount on the product consumed."
      },
      "IsConsumed": {
        "type": "boolean",
        "description": "Specifies that a product consumed has been consumed if the product it refers to is serialized. The default is false."
      },
      "IsProduct2Serialized": {
        "type": "boolean",
        "description": "Specifies if the associated product that was consumed is a serialized product (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate isn’t null, the user accessed this record or list view indirectly."
      },
      "ListPrice": {
        "type": "currency",
        "description": "The list price of the product."
      },
      "PricebookEntryId": {
        "type": "reference",
        "description": "The price book associated with the product consumed. If the work order and the product item’s associated product are related to the same price book, the Price Book Entry auto-populates based on the product item."
      },
      "Product2Id": {
        "type": "reference",
        "description": "The product associated with the product consumed."
      },
      "ProductConsumedNumber": {
        "type": "string",
        "description": "An auto-generated number identifying the product consumed."
      },
      "ProductItemId": {
        "type": "reference",
        "description": "The product item associated with the product consumed."
      },
      "ProductName": {
        "type": "string",
        "description": "The name of the product that’s consumed."
      },
      "QuantityConsumed": {
        "type": "double",
        "description": "The quantity of product that’s consumed. When you create a product consumed record, the quantity consumed is subtracted from the product item’s quantity."
      },
      "QuantityUnitOfMeasure": {
        "type": "picklist",
        "description": "The unit of the quantity of the product that’s consumed. For example, kilograms or liters. Quantity Unit of Measure values are inherited from the Quantity Unit of Measure field on products."
      },
      "TotalPrice": {
        "type": "currency",
        "description": "The total price paid for the product items."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "The price per unit of the product consumed."
      },
      "WorkOrderId": {
        "type": "reference",
        "description": "The work order for which the product was consumed."
      },
      "WorkOrderLineItemId": {
        "type": "reference",
        "description": "The work order line item for which the product was consumed."
      }
    },
    "module": "Manufacturing Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.mfg_api_devguide.meta/mfg_api_devguide/sforce_api_objects_productconsumed.htm"
  }
}