{
  "Product2": {
    "name": "Product2",
    "description": "Represents a product that your org sells.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "A text description of this record. Label is Product Description."
      },
      "DisplayUrl": {
        "type": "url",
        "description": "URL leading to a specific version of a record in the linked external data source."
      },
      "ExternalDataSourceId": {
        "type": "reference",
        "description": "ID of the related external data source."
      },
      "ExternalId": {
        "type": "string",
        "description": "The unique identifier of a record in the linked external data source. For example, ID #123."
      },
      "Family": {
        "type": "picklist",
        "description": "Name of the product family associated with this record. Product families are configured as picklists in the user interface. Label is Product Family."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether this record is active."
      },
      "IsArchived": {
        "type": "boolean",
        "description": "Indicated whether the product is archived."
      },
      "IsSerialized": {
        "type": "boolean",
        "description": "Indicates whether the product supports serial numbers. If an associated product item record already exists, this boolean can’t be set to true unless the product item’s quantity is zero."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Time stamp for the last time this record was referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": ""
      },
      "Name": {
        "type": "string",
        "description": "Required. Default name of this record. Label is Product Name."
      },
      "ProductCode": {
        "type": "string",
        "description": "Default product code for this record. Your org defines the product code naming pattern."
      },
      "QuantityUnitOfMeasure": {
        "type": "picklist",
        "description": "Unit of the product; for example, kilograms, liters, or cases. This field comes with only one value, Each, so you may want to create your own. The QuantityUnitOfMeasure field on ProductItem inherits this field’s values."
      },
      "StockKeepingUnit": {
        "type": "string",
        "description": "The SKU for the product. Use in tandem with or instead of the ProductCode field. For example, you can track the manufacturer’s identifying code in the Product Code field and assign the product a SKU when you resell it."
      }
    },
    "module": "Health Cloud"
  }
}