{
  "ProductTransfer": {
    "name": "ProductTransfer",
    "description": "Represents the transfer or the movement of a product item between two inventory locations.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the product transfer."
      },
      "DestinationLocationId": {
        "type": "reference",
        "description": "The place the product is to be delivered."
      },
      "ExpectedPickupDate": {
        "type": "dateTime",
        "description": "The date when the product is expected to be picked up."
      },
      "IsReceived": {
        "type": "boolean",
        "description": "Specifies whether the product was received (true) or not (false)."
      },
      "IsProduct2Serialized": {
        "type": "boolean",
        "description": "Specifies whether the product associated with the product transfer is a serialized product (true) or not (false)."
      },
      "IsSent": {
        "type": "boolean",
        "description": "Specifies whether the product was sent as a part of the transfer (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the product transfer."
      },
      "Product2Id": {
        "type": "reference",
        "description": "The product that’s associated with the product transfer."
      },
      "Product2TransferRecordMode": {
        "type": "reference",
        "description": "If serialized, specifies when the serial number is recorded. It is visible on the product transfer as a read-only field depending on the field-level security. Possible values are: SendAndReceive —The serial number is recorded when sending or receiving. ReceiveOnly —The serial number is recorded when receiving only."
      },
      "ProductRequestId": {
        "type": "reference",
        "description": "The product request that’s associated with the product transfer"
      },
      "ProductRequestLineItemId": {
        "type": "reference",
        "description": "The product request line item associated with the product transfer."
      },
      "ProductTransferNumber": {
        "type": "string",
        "description": "An auto-generated number that identifies the product transfer."
      },
      "QuantityReceived": {
        "type": "double",
        "description": "The quantity of product received at the destination location."
      },
      "QuantitySent": {
        "type": "double",
        "description": "The quantity of product sent from the source location."
      },
      "QuantityUnitOfMeasure": {
        "type": "picklist",
        "description": "The units of the product, for example grams, liters, or units."
      },
      "ReceivedById": {
        "type": "reference",
        "description": "The person that receives the product at the destination location."
      },
      "ReturnOrderId": {
        "type": "reference",
        "description": "The return order associated with the product transfer."
      },
      "ReturnOrderLineItemId": {
        "type": "reference",
        "description": "The return order line item associated with the product transfer."
      },
      "ShipmentExpectedDeliveryDate": {
        "type": "dateTime",
        "description": "The date when the shipment is expected at the product transfer shipment."
      },
      "ShipmentId": {
        "type": "reference",
        "description": "The shipment associated with the product transfer."
      },
      "ShipmentStatus": {
        "type": "picklist",
        "description": "The status of the shipment associated with the product transfer."
      },
      "ShipmentTrackingNumber": {
        "type": "string",
        "description": "The number of the shipment associated with the product transfer."
      },
      "ShipmentTrackingUrl": {
        "type": "url",
        "description": "The tracking URL of the shipment associated with the product transfer."
      },
      "SourceLocationId": {
        "type": "reference",
        "description": "The source location associated with the product transfer."
      },
      "SourceProductItemId": {
        "type": "reference",
        "description": "The product item associated with the product transfer."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the product transfer."
      }
    },
    "module": "Manufacturing Cloud"
  }
}