{
  "ProductRequestLineItem": {
    "name": "ProductRequestLineItem",
    "description": "Represents a product that’s requested as a part of a product request. Product request line items are components of product requests. Each line item is associated with a specific product being requested.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The account associated with the product request line item."
      },
      "CaseId": {
        "type": "reference",
        "description": "The case associated with the product request line item."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the product request line item."
      },
      "DestinationLocationId": {
        "type": "reference",
        "description": "The destination of the product delivery."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate isn’t null, the user accessed this record or list view indirectly."
      },
      "NeedByDate": {
        "type": "dateTime",
        "description": "The date when the product must be delivered by."
      },
      "ParentId": {
        "type": "reference",
        "description": "The product request that’s associated with the product request line item."
      },
      "Product2Id": {
        "type": "reference",
        "description": "The product associated with the product request line item."
      },
      "ProductRequestLineItemNumber": {
        "type": "string",
        "description": "An auto-generated number for the product request line item."
      },
      "QuantityRequested": {
        "type": "double",
        "description": "The quantity of the requested product."
      },
      "QuantityUnitOfMeasure": {
        "type": "picklist",
        "description": "The units of the requested product; for example, grams, liters, or units. The picklist values can be customized."
      },
      "ShipToAddress": {
        "type": "address",
        "description": "The physical address where the product is needed."
      },
      "ShipToCity": {
        "type": "string",
        "description": "The city of the address where the product is needed."
      },
      "ShipToCountry": {
        "type": "string",
        "description": "The country of the address where the product is needed."
      },
      "ShipToGeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the address where the product is needed."
      },
      "ShipToLatitude": {
        "type": "double",
        "description": "Used with Longitude to specify the precise geolocation of the address where the product is needed. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "ShipToLongitude": {
        "type": "double",
        "description": "Used with Latitude to specify the precise geolocation of the address where the product is needed. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "ShipToPostalCode": {
        "type": "string",
        "description": "The postal code of the address where the product is needed."
      },
      "ShipToState": {
        "type": "string",
        "description": "The state of the address where the product is needed."
      },
      "ShipToStreet": {
        "type": "textarea",
        "description": "The street of the address where the product is needed."
      },
      "ShipmentType": {
        "type": "picklist",
        "description": "The type of shipment. The picklist includes the following values, which can be customized: Rush Overnight Next Business Day Pick Up"
      },
      "SourceLocationId": {
        "type": "reference",
        "description": "Where the product is at the time of the request."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the shipment. The picklist includes the following values, which can be customized: Draft Submitted Received"
      },
      "WorkOrderId": {
        "type": "reference",
        "description": "The work order for which the product is needed."
      },
      "WorkOrderLineItemId": {
        "type": "reference",
        "description": "The work order line item for which the product is needed."
      }
    },
    "module": "Manufacturing Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.mfg_api_devguide.meta/mfg_api_devguide/sforce_api_objects_productrequestlineitem.htm"
  }
}