{
  "ProductItemTransaction": {
    "name": "ProductItemTransaction",
    "description": "Represents an action taken on a product item. Product item transactions track when a product is consumed, replenished, adjusted, or transferred. Product item transactions are auto-generated records that specify the quantity of products impacted by the action.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The description of the product item transaction."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate isn’t null, the user accessed this record or list view indirectly."
      },
      "ProductItemId": {
        "type": "reference",
        "description": "The product item associated with the product item transaction."
      },
      "ProductItemTransactionNumber": {
        "type": "string",
        "description": "The auto-generated number identifying the product item transaction."
      },
      "Quantity": {
        "type": "double",
        "description": "The quantity of the product item involved in the transaction. If inventory was consumed, the quantity is negative."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "The product consumed, product transfer, or visit related to the action. If the action wasn’t related to consumption or transfer, the related record is blank."
      },
      "TransactionType": {
        "type": "picklist",
        "description": "The action that the transaction tracks."
      }
    },
    "module": "Manufacturing Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.mfg_api_devguide.meta/mfg_api_devguide/sforce_api_objects_productitemtransaction.htm"
  }
}