{
  "ProgramEnrollment": {
    "name": "ProgramEnrollment",
    "description": "Represents details of enrollment for benefits in a program.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The ID of the account that’s associated with an individual or an organization enrolled in the program."
      },
      "ApplicationDate": {
        "type": "date",
        "description": "The date when the enrollee applied to the program."
      },
      "ContactId": {
        "type": "reference",
        "description": "The ID of the contact that’s associated with an individual enrolled in the program."
      },
      "CurrentMonthDisbCount": {
        "type": "double",
        "description": "The count of benefits disbursed to the enrollee in the current month. Data Processing Engine calculates this field if you activate the Program Management Data Processing Engine Definition templates in Setup. You can schedule this calculation to run on a regular basis."
      },
      "CurrentYearDisbCount": {
        "type": "double",
        "description": "The count of benefits disbursed to the enrollee in the current year. Data Processing Engine calculates this field if you activate the Program Management Data Processing Engine Definition templates in Setup. You can schedule this calculation to run on a regular basis."
      },
      "EndDate": {
        "type": "date",
        "description": "The end date of the enrollment in the program."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the enrollment for the participant in the program is active (true) or not (false)."
      },
      "IsAnonymous": {
        "type": "boolean",
        "description": "Indicates whether the participant enrolled to the program anonymously (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view."
      },
      "Name": {
        "type": "string",
        "description": "The name of the program enrollment record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The user who owns the object."
      },
      "PreviousMonthDisbCount": {
        "type": "double",
        "description": "The count of benefit disbursed to the enrollee in the previous month. Data Processing Engine calculates this field if you activate the Program Management Data Processing Engine Definition templates in Setup. You can schedule this calculation to run on a regular basis."
      },
      "PreviousYearDisbCount": {
        "type": "double",
        "description": "The count of benefits disbursed to the enrollee in the previous year. Data Processing Engine calculates this field if you activate the Program Management Data Processing Engine Definition templates in Setup. You can schedule this calculation to run on a regular basis."
      },
      "ProgramId": {
        "type": "reference",
        "description": "The identifier of the program that's associated with the enrollee."
      },
      "SessionsAbsentCount": {
        "type": "int",
        "description": "The total number of benefit sessions for the program that were scheduled for the participant but not attended."
      },
      "SessionsAttendanceRate": {
        "type": "percent",
        "description": "The percentage of scheduled benefit sessions for the program that the participant attended.The value of this field is calculated by a formula: (Attended Sessions Count) / (Attended Sessions Count + Absent Sessions Count)"
      },
      "SessionsAttendedCount": {
        "type": "int",
        "description": "The total number of benefit sessions for the program that were scheduled for and attended by the participant."
      },
      "StartDate": {
        "type": "date",
        "description": "The start date of the enrollment in the program."
      },
      "Status": {
        "type": "picklist",
        "description": "The enrollment status of the enrollee for the program."
      }
    },
    "module": "Nonprofit Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.nonprofit_cloud.meta/nonprofit_cloud/sforce_api_objects_programenrollment.htm"
  }
}