{
  "ProgramRebateType": {
    "name": "ProgramRebateType",
    "description": "Represents a rebate structure associated with a Rebate Program.",
    "properties": {
      "AccrualRate": {
        "type": "double",
        "description": "The rate of accrual based on the value selected in the Measure Type field. For example, when the measure type is percent and you enter 10, the accrual rate is 10%."
      },
      "AggregateObjectName": {
        "type": "picklist",
        "description": "The object that stores the aggregation results."
      },
      "BenefitQualifierField": {
        "type": "picklist",
        "description": "The field on the aggregation object used to define thresholds for qualifying benefits (minimum or maximum)."
      },
      "CalcObjectId": {
        "type": "reference",
        "description": "Links to a calculation definition from the Data Processing Engine."
      },
      "CalculationBasis": {
        "type": "picklist",
        "description": "Specifies the method used to calculate the rebate amount."
      },
      "CalculationMethod": {
        "type": "picklist",
        "description": "Defines how tiered rebate benefits are calculated."
      },
      "CalculationType": {
        "type": "picklist",
        "description": "Specifies the type of rebate calculation logic to use."
      },
      "ExecutionProcedureId": {
        "type": "reference",
        "description": "Links to business rules that define custom execution logic."
      },
      "FilterAction": {
        "type": "picklist",
        "description": "Logical operator to apply between filter conditions."
      },
      "FilterCriteria": {
        "type": "textarea",
        "description": "Holds the filter conditions in textual format. Used to define eligibility criteria for rebate qualification."
      },
      "FilterLogic": {
        "type": "string",
        "description": "Logical formula used to combine filter conditions, typically using field references and logical operators."
      },
      "IsIntegratable": {
        "type": "boolean",
        "description": "When selected, allows this rebate type to be applied on transactional records such as orders or opportunities."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Date and the timestamp when the record was last referenced by the user. Useful for user activity tracking."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Date and the timestamp when the record was last opened or viewed. Tracks user interaction history."
      },
      "MeasureField": {
        "type": "picklist",
        "description": "The aggregation object field used with measure type and benefit value to calculate the rebate amount. This is required for the Amount per Unit and Percentage of Revenue measure types."
      },
      "Name": {
        "type": "string",
        "description": "Unique name that identifies the rebate type configuration. Used as a reference label across related components."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Identifies the user or group that owns this record."
      },
      "ProductFilterType": {
        "type": "picklist",
        "description": "Specifies whether the rebate applies to included or excluded products."
      },
      "RebateMeasureType": {
        "type": "picklist",
        "description": "Specifies the method to measure benefit payout."
      },
      "RebateProgramId": {
        "type": "reference",
        "description": "Links this rebate type to its parent rebate program."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies whether the rebate type is currently active."
      },
      "UnitOfMeasureId": {
        "type": "reference",
        "description": "Identifies the unit of measure associated with the rebate type."
      },
      "ValidityDuration": {
        "type": "int",
        "description": "Duration for which the inventory is eligible for price protection."
      },
      "ValidityDurationType": {
        "type": "picklist",
        "description": "Unit of time used to measure ValidityDuration."
      }
    },
    "module": "Core Salesforce"
  }
}