{
  "Promotion": {
    "name": "Promotion",
    "description": "Represents a promotion associated with the loyalty program. It captures the information such as type of the promotion, issue of a voucher or credit points, promotion enrollment, and status of the promotion.",
    "properties": {
      "BusinessUnitId": {
        "type": "reference",
        "description": "ID of the internal organization unit that contains the details of the Marketing Cloud business unit associated with the promotion."
      },
      "CampaignId": {
        "type": "reference",
        "description": "The campaign associated with the promotion."
      },
      "CumulativeUsageTarget": {
        "type": "int",
        "description": "The number of times a member must participate or the amount of money spent to qualify for a reward."
      },
      "CurrentLiabilityAmount": {
        "type": "currency",
        "description": "The liability amount incurred for the promotion until now. This field is available in API version 52.0 and later."
      },
      "CurrentPointCount": {
        "type": "int",
        "description": "The liability amount incurred for the promotion until now. This field is available in API version 52.0 and later."
      },
      "DefaultVoucherDefinitionId": {
        "type": "reference",
        "description": "The voucher associated with the promotion."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the promotion."
      },
      "DisplayName": {
        "type": "string",
        "description": "The display name of the promotion. This field is available in API version 60.0 and later where Global Promotions Management is enabled."
      },
      "EndDate": {
        "type": "date",
        "description": "End date of the promotion."
      },
      "EndDateTime": {
        "type": "date",
        "description": "The end date and time of the promotion. This field is available in API version 60.0 and later where Unified Promotions is enabled."
      },
      "EnrollmentEndDate": {
        "type": "date",
        "description": "The last date to enroll in the promotion."
      },
      "EnrollmentStartDate": {
        "type": "date",
        "description": "The first date to enroll in the promotion."
      },
      "FulfillmentAction": {
        "type": "picklist",
        "description": "Select how a loyalty member is rewarded for fulfilling promotion requirements."
      },
      "GameDefinitionId": {
        "type": "reference",
        "description": "ID of the game definition associated with the promotion."
      },
      "ImageUrl": {
        "type": "url",
        "description": "The URL for the promotion image. This field is available in API version 57.0 and later."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the promotion is active. This field is available in API version 52.0 and later."
      },
      "IsCloned": {
        "type": "boolean",
        "description": "Indicates whether the promotion has been created by cloning an existing promotion. This field is available in API version 61.0 and later."
      },
      "IsEnrollmentRequired": {
        "type": "boolean",
        "description": "Indicates whether enrollment is required to participate in the promotion."
      },
      "IsPointsWithFactor": {
        "type": "boolean",
        "description": "Indicates whether the promotion is applied by multiplying points with a factor or by using the fixed value in the TotalRewardPoints field. This field is available in API version 52.0 and later."
      },
      "IsQuickPromotion": {
        "type": "boolean",
        "description": "Indicates whether the records represent a quick promotion (true) or not (false). This field is available in API version 57.0 and later."
      },
      "IssuedVoucherCount": {
        "type": "int",
        "description": "The number of vouchers issued for the promotion until current date. This field is available in API version 52.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "LoyaltyProgramCurrencyId": {
        "type": "reference",
        "description": "The loyalty program currency associated with the promotion."
      },
      "LoyaltyProgramId": {
        "type": "reference",
        "description": "The loyalty program associated with the promotion."
      },
      "LoyaltyPromotionType": {
        "type": "picklist",
        "description": "The type of promotion."
      },
      "MaximumLiabilityAmount": {
        "type": "currency",
        "description": "The maximum liability amount that can be incurred for the promotion."
      },
      "MaximumRewardValue": {
        "type": "int",
        "description": "The total value that can be accumulated for the promotion."
      },
      "MaximumVoucherCount": {
        "type": "int",
        "description": "The maximum number of vouchers that can be issued for the promotion. This field is available in API version 52.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "Unique identifier for the promotion."
      },
      "Objective": {
        "type": "textarea",
        "description": "Business objective of the promotion. For example, launching a new product, keeping customers satisfied, or clearing stock."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PointFactor": {
        "type": "double",
        "description": "The factor with which points are multiplied or divided when IsPointsWithFactor is set to true. This field is available in API version 52.0 and later."
      },
      "PriorityNumber": {
        "type": "int",
        "description": "The priority number of the promotion. This field is available in API version 60.0 and later, where Global Promotions Management is enabled."
      },
      "ProductCatalogId": {
        "type": "reference",
        "description": "ID of the product catalog associated with the promotion. This field is available in API version 60.0 and later, where Global Promotions Management is enabled."
      },
      "PromotionCode": {
        "type": "string",
        "description": "The unique code of the promotion. This field is available in API version 60.0 and later, where Global Promotions Management is enabled."
      },
      "PromotionConfiguration": {
        "type": "textarea",
        "description": "The configuration of a quick promotion. This field is available in API version 57.0 and later."
      },
      "RelatedPromotionId": {
        "type": "reference",
        "description": "ID of the promotion that was cloned to create the promotion."
      },
      "RuleLibraryId": {
        "type": "reference",
        "description": "ID of the promotion that was cloned to create the promotion. This field is available in API version 62.0 and later."
      },
      "StartDate": {
        "type": "date",
        "description": "Required. The start date of the promotion."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "The start date and time of the promotion. This field is available in API version 60.0 and later where Global Promotions Management is enabled."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the promotion."
      },
      "TotalRewardPoints": {
        "type": "int",
        "description": "The points awarded on availing the promotion."
      },
      "TransactionJournalType": {
        "type": "picklist",
        "description": "The journal type that has been applied for the promotion. This field is available in API version 52.0 and later."
      }
    },
    "module": "Loyalty"
  }
}