{
  "PromotionQualifier": {
    "name": "PromotionQualifier",
    "description": "Represents the product, product category, or order that you want to target with your promotion qualifier in a B2B or D2C store.",
    "properties": {
      "ApproachingDiscountThreshold": {
        "type": "currency",
        "description": "The amount that a customer has to reach before seeing an approaching discount message."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for orgs with the multicurrency feature enabled. Contains the ISO code for any currency allowed by the organization."
      },
      "ExternalQualifier": {
        "type": "string",
        "description": "A qualifying product or product category stored outside of Salesforce. This field is available in API version 56.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "MinimumAmount": {
        "type": "currency",
        "description": "The minimum dollar amount that a buyer must purchase to qualify for the promotion."
      },
      "MinimumQuantity": {
        "type": "double",
        "description": "The minimum quantity that a buyer must purchase to qualify for the promotion."
      },
      "Name": {
        "type": "string",
        "description": "Name of the promotion qualifier."
      },
      "PromotionId": {
        "type": "reference",
        "description": "The ID of the promotion that you want to associate with your promotion qualifier."
      },
      "PromotionTierId": {
        "type": "reference",
        "description": "The ID of the promotion tier associated with the qualifier. Only used with tiered promotions."
      },
      "QualifierId": {
        "type": "reference",
        "description": "The ID of the qualifier."
      },
      "QualifierOperator": {
        "type": "picklist",
        "description": ""
      },
      "QualifierProductCategoryName": {
        "type": "string",
        "description": "The name of the product category referenced in the qualifier. This field is available in API version 55.0 and later."
      },
      "QualifierProductName": {
        "type": "string",
        "description": "The name of the product referenced in the qualifier. This field is available in API version 55.0 and later."
      },
      "QualifierProductSku": {
        "type": "string",
        "description": "The stock keeping unit of the product referenced in the qualifier. This field is available in API version 55.0 and later."
      },
      "QualifierRuleCriteriaType": {
        "type": "picklist",
        "description": "The type of qualifier rule criteria."
      },
      "QualifierType": {
        "type": "picklist",
        "description": "The type of qualifier that you want to add to the promotion. Product applies the qualifier to a single product, ProductCategory to a predetermined group of products, and TransactionTotal to the entire order."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_promotionqualifier.htm"
  }
}