{
  "Publisher": {
    "name": "Publisher",
    "description": "",
    "properties": {
      "DurableId": {
        "type": "string",
        "description": "Unique identifier for the field. Always retrieve this value before using it, as the value isn’t guaranteed to stay the same from one release to the next. To simplify queries, use this field.",
        "maxLength": 255,
        "nullable": true,
        "readOnly": true
      },
      "IsSalesforce": {
        "type": "boolean",
        "description": "Indicates whether Salesforce provided the associated objects or fields (true).",
        "nullable": false,
        "readOnly": true
      },
      "MajorVersion": {
        "type": "int",
        "description": "The first number in a package version number. A complete version number combines the values of the MajorVersion and MinorVersion fields into either an x.y format or an x.y.z format. The x represents the major version, y the minor version, and z the patch version. (The patch version can’t be specified; it’s automatically assigned when a managed beta package is uploaded.)",
        "nullable": true,
        "readOnly": true
      },
      "MinorVersion": {
        "type": "int",
        "description": "The second number in a package version number. A complete version number combines the values of the MajorVersion and MinorVersion fields into either an x.y format or an x.y.z format. The x represents the major version, y the minor version, and z the patch version. (The patch version can’t be specified; it’s automatically assigned when a managed beta package is uploaded.)If MinorVersion isn’t specified, the default value is 1 more than the minor version of the currently released package (0 if not released).",
        "nullable": true,
        "readOnly": true
      },
      "Name": {
        "type": "string",
        "description": "The presentation-friendly name of the publisher.",
        "maxLength": 70,
        "nullable": true,
        "readOnly": true
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix.",
        "maxLength": 70,
        "nullable": true,
        "readOnly": true
      },
      "Id": {
        "type": "string",
        "description": "Publisher ID",
        "format": "salesforce-id",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_publisher.htm",
    "keyPrefix": "4pb",
    "createable": false,
    "updateable": false,
    "deletable": false,
    "queryable": true,
    "searchable": false,
    "childRelationships": [
      {
        "childObject": "EntityDefinition",
        "field": "PublisherId",
        "relationshipName": "InstalledEntityDefinitions",
        "cascadeDelete": false
      },
      {
        "childObject": "FieldDefinition",
        "field": "PublisherId",
        "relationshipName": "InstalledFieldDefinitions",
        "cascadeDelete": false
      }
    ]
  }
}