{
  "FieldRestrictionRule": {
    "name": "FieldRestrictionRule",
    "description": "Represents a field visibility rule that controls whether a field is visible to a user, based on the field’s inclusion in the PersonalInfo_EPIM field set. If Enhanced Personal Information Management setting was enabled before Spring ’22, field visibility is based on the field’s compliance categorization.",
    "properties": {
      "Classification": {
        "type": "string",
        "description": "Required. The data classification compliance categorization or field set that is targeted by the rule. The rule applies to fields that are marked with this categorization or included in this field set. If you enabled Enhanced Personal Information Management before Spring ‘22 (API version 54.0), you can use Salesforce's default compliance categorization values or values that you add yourself. If you enabled Enhanced Personal Information Management after Spring ‘22 (API version 54.0), use the PersonalInfo_EPIM field set or a field set that you add yourself."
      },
      "ClassificationType": {
        "type": "string",
        "description": "The type of classification method used in your org. If you enabled Enhanced Personal Information Management before Spring ‘22 (API version 54.0), use ComplianceCategory. If you enabled Enhanced Personal Information Management after Spring ‘22, use FieldSet. ComplianceCategory— FieldSet—"
      },
      "Description": {
        "type": "string",
        "description": "Required. The description of the rule."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name for the FieldRestrictionRule object."
      },
      "EnforcementType": {
        "type": "string",
        "description": "Required. The type of rule."
      },
      "FullName": {
        "type": "string",
        "description": "Required. The full name of the associated FieldRestrictionRule in Metadata API. The full name can include a namespaceprefix."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the rule is active (true) or not (false). The default value is false."
      },
      "Language": {
        "type": "string",
        "description": "The language of the field visibility rule. The value for this field is the language value of the org."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Required. Label for the field visibility rule."
      },
      "Metadata": {
        "type": "string",
        "description": "The field visibility rule’s metadata."
      },
      "RecordFilter": {
        "type": "string",
        "description": "Required. The criteria that determine which fields are visible to the specified users. For example, the field can check if the logged-in user matches the Employee’s ID."
      },
      "TargetEntity": {
        "type": "string",
        "description": "Required. The object for which you're creating the rule. Only the Employee and User objects are supported."
      },
      "UserCriteria": {
        "type": "string",
        "description": "Required. The users that this rule applies to, such as all active users or users with a specified role or profile."
      },
      "Version": {
        "type": "number",
        "description": "Required. The rule's version number."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_fieldrestrictionrule.htm",
    "clouds": [
      "Tooling API"
    ]
  }
}