{
  "FlowOrchestrationWorkItem": {
    "name": "FlowOrchestrationWorkItem",
    "description": "Represents a work item associated with a run-time instance of an interactive step in a run-time instance of an orchestration.",
    "properties": {
      "AssigneeId": {
        "type": "reference",
        "description": "The ID of the user, group, or queue assigned to the orchestration work item."
      },
      "Description": {
        "type": "string",
        "description": "The description of the orchestration work item."
      },
      "ElapsedTimeSinceAsgntInSec": {
        "type": "long",
        "description": "When status is Assigned, the number of seconds that have passed since the work item was last assigned. When status is Completed, this value is null. This field is available in API version 63.0 and later."
      },
      "ElapsedTimeSinceCreationInSec": {
        "type": "long",
        "description": "When status is Assigned, the number of seconds that have passed since the work item was created. When status is Completed, this value is null. This field is available in API version 63.0 and later."
      },
      "Label": {
        "type": "string",
        "description": "The label of the orchestration work item."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent time a user viewed a record related to the orchestration work item. This field is available in API version 55.0 and later."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent time a user viewed the orchestration work item. This field is available in API version 55.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "The API name of the orchestration work item."
      },
      "OwnerId": {
        "type": "reference",
        "description": "When the assignee is an internal user: the ID of the internal user When the assignee is a credentialed Experience Cloud site visitor: the ID of the credentialed Experience Cloud site visitor When the assignee is a group or queue: the ID of the automated process user This field is available in API version 56.0 and later."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "The ID of the context record, such as an account, case, or expense, that the orchestration work item is related to. An assigned user completes the associated orchestration work item on the page for this record."
      },
      "ScreenFlow": {
        "type": "picklist",
        "description": "The screen flow associated with the orchestration work item."
      },
      "ScreenFlowInputs": {
        "type": "textarea",
        "description": "The input parameters required by the screen flow."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the work item."
      },
      "StepInstanceId": {
        "type": "reference",
        "description": "The ID of the flow orchestration step associated with the orchestration work item."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_floworchestrationworkitem.htm",
    "accessRules": "An assignee can see all work item records assigned to them. If sharing rules are defined for FlowOrchestrationWorkItem, they determine access to specific orchestration work item records for users other than the assignee. Or the user must have the View All Data permission.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}