{
  "ForecastingFilterCondition": {
    "name": "ForecastingFilterCondition",
    "description": "Represents the custom filter condition logic for including or excluding data from opportunity forecasts.",
    "properties": {
      "DeveloperName": {
        "type": "string",
        "description": "The developer name of the forecast filter condition."
      },
      "FieldName": {
        "type": "string",
        "description": "The name of the opportunity field to be filtered."
      },
      "ForecastingFilterId": {
        "type": "string",
        "description": "The ID of the forecast filter."
      },
      "ForecastingSourceDefinitionId": {
        "type": "string",
        "description": "The ID of the forecasting source definition."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the forecast filter condition."
      },
      "Language": {
        "type": "string",
        "description": "The language of the forecast filter condition."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label for this object, which displays in Setup. The label is in the default language locale for the organization. If there’s no default language locale, the label is in en_US."
      },
      "Metadata": {
        "type": "string",
        "description": "The metadata of the forecast filter condition."
      },
      "Operation": {
        "type": "string",
        "description": "The operator in the filter condition."
      },
      "SortOrder": {
        "type": "number",
        "description": "The index value for the condition. This value represents the condition in the FilterLogic field on the ForecastingFilter object. For example, 1."
      },
      "Value": {
        "type": "string",
        "description": "The value of the filter condition. If multiple values are specified, they must be separated by a comma delimiter. Note If you have multiple currencies enabled, and add a custom filter on a currency field as part of your forecast type definition, the corporate currency at the time the filter was created is used. If you have a single currency enabled, the absolute value is used in your filter condition."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_forecastingfiltercondition.htm",
    "accessRules": "As of Spring ’20 and later, only standard users with the View All Forecasts permission OR Allow Forecasting permission OR delegated forecast manager status can access this object.",
    "clouds": [
      "Tooling API",
      "Core Salesforce"
    ]
  }
}