{
  "FulfillmentStep": {
    "name": "FulfillmentStep",
    "description": "Represents a task that's required to perform a certain action as part of order fulfillment. This task can be manual or automated.",
    "properties": {
      "ActualCompletionDate": {
        "type": "dateTime",
        "description": "The date and time when the fulfillment step state changed to Completed or Skipped."
      },
      "ActualStartDate": {
        "type": "dateTime",
        "description": "The date and time when the fulfillment step state changed to Ready."
      },
      "AssignedToId": {
        "type": "reference",
        "description": "The user or queue associated with the fulfillment step."
      },
      "CompensatedStepId": {
        "type": "reference",
        "description": "The alternative step that's executed when a particular step in the fulfillment plan is amended or canceled."
      },
      "DelayOf": {
        "type": "int",
        "description": "The value of the delay. This field is available in API version 63.0 and later."
      },
      "DelayUnit": {
        "type": "picklist",
        "description": "The unit for the delay of the fulfillment step. This field is available in API version 63.0 and later."
      },
      "ExecuteOn": {
        "type": "picklist",
        "description": "Specifies when to execute the fulfillment step. This field is available in API version 63.0 and later."
      },
      "ExecuteOnRuleId": {
        "type": "reference",
        "description": "The name of the expression set. The fulfillment step is executed only when its corresponding expression set returns the value true."
      },
      "ExecutionMessage": {
        "type": "string",
        "description": "For internal use only."
      },
      "FalloutQueueId": {
        "type": "reference",
        "description": "The fallout queue that's associated with the fallout task. This field is available in API version 62.0 and later."
      },
      "FlowDefinitionName": {
        "type": "string",
        "description": "The name of the flow definition that's associated with the AutoTask type of fulfillment step. This field is available in API version 62.0 and later."
      },
      "FlowInterviewId": {
        "type": "reference",
        "description": "The flow interview associated with the fulfillment step."
      },
      "ForcePlanFreezeDuringExecution": {
        "type": "picklist",
        "description": "Specifies whether to freeze the plan while the step is in progress. If enabled, specifies how to complete the step before resuming the plan. This field is available in API version 63.0 and later."
      },
      "FulfillmentPlanId": {
        "type": "reference",
        "description": "The fulfillment plan associated with the fulfillment step."
      },
      "FulfillmentStepDefinitionId": {
        "type": "reference",
        "description": "The fulfillment step definition associated with the fulfillment step."
      },
      "IntegrationDefinitionNameId": {
        "type": "reference",
        "description": "For internal use only."
      },
      "IsSkipBranch": {
        "type": "boolean",
        "description": "Indicates whether the remaining steps in the fulfillment step group are skipped from execution when the Execute On Rule condition is set (true) or not (false). This field is available in API version 62.0 and later."
      },
      "JeopardyStatus": {
        "type": "string",
        "description": "The jeopardy status of the fulfillment step."
      },
      "JeopardyThreshold": {
        "type": "int",
        "description": "The number of days, hours, minutes, or seconds, counting back from the expected duration, before a fulfillment step is in jeopardy."
      },
      "JeopardyThresholdUnit": {
        "type": "picklist",
        "description": "The time unit of the jeopardy threshold."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date when a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date when a user viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "The name of the fulfillment step."
      },
      "NextEarliestRunTime": {
        "type": "dateTime",
        "description": "The next available time for the process execution. This field is available in API version 62.0 and later."
      },
      "OmniscriptName": {
        "type": "string",
        "description": "For inyternal use only."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who created the record."
      },
      "PlannedCompletionDate": {
        "type": "dateTime",
        "description": "The date and time Dynamic Revenue Orchestrator estimates that the fulfillment step will complete."
      },
      "PlannedStartDate": {
        "type": "dateTime",
        "description": "The date and time when the Dynamic Revenue Orchestrator calculates the fulfillment step state change to Ready."
      },
      "PointOfNoReturn": {
        "type": "multipicklist",
        "description": "The type of source change applied to the line item. This field is available in API version 62.0 and later."
      },
      "RequestedCompletionDate": {
        "type": "dateTime",
        "description": "The planned completion date and time of the fulfillment step."
      },
      "RequestedStartDate": {
        "type": "dateTime",
        "description": "The planned start date and time of the fulfillment step."
      },
      "ResumeOnRuleId": {
        "type": "reference",
        "description": "The rule set or expression set for the fulfillment step. The step is completed only when the corresponding expression set returns the isExecuteStep output as true."
      },
      "RetryAttempts": {
        "type": "int",
        "description": "The number of attempts allowed for retry as set up in the Fallout Qualification Rule table."
      },
      "RunAsUserId": {
        "type": "reference",
        "description": "Overrides user context for an automated step. The default user context is AutomatedProc user."
      },
      "State": {
        "type": "picklist",
        "description": "The state of the fulfillment step. For example, In Progress or Completed."
      },
      "StepType": {
        "type": "picklist",
        "description": "The fulfillment step type associated with the fulfillment step."
      },
      "TaskAllocationType": {
        "type": "picklist",
        "description": "The method of assigning the manual step. This field is available in API version 63.0 and later."
      },
      "TaskId": {
        "type": "reference",
        "description": "The ID of the task assigned to a user or queue. This field is available in API version 63.0 and later."
      },
      "UsageType": {
        "type": "picklist",
        "description": "The details about the business that uses Fulfillment Orchestration. Some examples of UsageBy include Financial Services Cloud and CPQ."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_fulfillmentstep.htm"
  }
}