{
  "QueueRoutingConfig": {
    "name": "QueueRoutingConfig",
    "description": "Represents configuration settings that determine how work items are routed to agents. This object is available in API version 65.0 and later.",
    "properties": {
      "CapacityPercentage": {
        "type": "percent",
        "description": "The percentage of an agent’s capacity for work items that’s consumed by a specific type of work item from the service channel. For example, capacity percentage for phone call is 100. If the configured limit is reached, the call isn't routed to the agent."
      },
      "CapacityWeight": {
        "type": "double",
        "description": "The amount of an agent’s capacity for work items that’s consumed by a work item from the service channel. For example, if an agent has a capacity of 6, and cases are assigned a capacity weight of 2, an agent can be assigned up to 3 cases before the agent is at capacity and can’t receive new work items."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API."
      },
      "DropAdditionalSkillsTimeout": {
        "type": "int",
        "description": "The number of seconds to wait before additional skills are dropped from Omni-Channel routing. In skills-based routing, you can set some skills to Additional Skill. After the timeout elapses, a skill marked as Additional Skill is dropped from Omni-Channel routing and the case is routed to the best-matched agent, even if the agent doesn’t have all the skills. If CustomRequestedDateTime is set in the PendingServiceRouting object, DropAdditionalSkillsTimeout uses CustomRequestedDateTime as the start time. If CustomRequestedDateTime and DropAdditionalSkillsTimeout have already passed, Omni-Channel drops the additional skills."
      },
      "IsAttributeBased": {
        "type": "boolean",
        "description": "Indicates whether the routing configuration is used with skills-based routing rules (true) or not (false)."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the queue routing configuration."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label of the queue routing configuration."
      },
      "PausedCapacityPercentage": {
        "type": "percent",
        "description": "The percentage of an agent's capacity that’s consumed when a work item is paused. This field is available only with status-based capacity and Enhanced Omni-Channel."
      },
      "PausedCapacityWeight": {
        "type": "double",
        "description": "The amount of an agent's capacity that’s consumed when a work item is paused. This field is available only with status-based capacity and Enhanced Omni-Channel."
      },
      "PushTimeout": {
        "type": "int",
        "description": "The time limit set for an agent to respond to an item before it’s pushed to another agent. The time limit is measured in seconds."
      },
      "RoutingModel": {
        "type": "picklist",
        "description": "The routing type that determines how work items are routed to agents."
      },
      "RoutingPriority": {
        "type": "int",
        "description": "The priority in which work items from the service channels are routed to agents. Work items that have lower values (for example, 0) are routed to agents first."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_queueroutingconfig.htm"
  }
}