{
  "QuickActionDefinition": {
    "name": "QuickActionDefinition",
    "description": "Represents the definition of a quick action.",
    "properties": {
      "ActionSubtype": {
        "type": "picklist",
        "description": "The subtype of the action. Valid values are: Action ScreenAction This field is available in API version 50.0 and later."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the action."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the action in the API. This field corresponds to the Name field in the user interface."
      },
      "EntityDefinitionId": {
        "type": "string",
        "description": "The ID of the object associated with the quick action."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the associated metadata object in Metadata API."
      },
      "Height": {
        "type": "int",
        "description": "The height of the action, in pixels. This field is set only when the quick action has a custom icon."
      },
      "IconId": {
        "type": "reference",
        "description": "The ID of the action icon. This field is set only when the quick action has a custom icon."
      },
      "Label": {
        "type": "string",
        "description": "The action label that corresponds to the Label field in the user interface."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the action. Valid values are: Chinese (Simplified): zh_CN Chinese (Traditional): zh_TW Danish: da Dutch: nl_NL English: en_US Finnish: fi French: fr German: de Italian: it Japanese: ja Korean: ko Norwegian: no Portuguese (Brazil): pt_BR Russian: ru Spanish: es Spanish (Mexico): es_MX Spanish (Mexico) defaults to Spanish for customer-defined translations. Swedish: sv Thai: th The Salesforce user interface is fully translated to Thai, but Help is in English."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MasterLabel": {
        "type": "string",
        "description": "The action label."
      },
      "Metadata": {
        "type": "QuickAction",
        "description": "The metadata for the quick action."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace of the action."
      },
      "OptionsCreateFeedItem": {
        "type": "boolean",
        "description": "Indicates whether successful completion of the action creates a feed item (true) or not (false). Applies only to Create Record, Update Record, and Log a Call quick action types. Available in API version 36.0 and later."
      },
      "SobjectType": {
        "type": "picklist",
        "description": "The associated object’s API name. For example, FeedItem."
      },
      "StandardLabel": {
        "type": "picklist",
        "description": "The standard label for the action. Valid values are: AddRecord AddMember ChangeDueDate ChangePriority ChangeStatus CreateNew CreateNewRecordType (For example, a label with something like “Create New Idea”) Defer EditDescription EnrollInProgram (Available in API versions 46.0 and later only if the org has Health Cloud enabled) Escalate EscalateToRecord Forward (Available in API version 42.0 and later) LogACall LogANote ModifyAppointment (Available in API version 47.0 and later) New (A new record) NewChild (A new child record) NewChildRecordType NewRecordType (For example, a label with something like “New Idea”) OfferFeedback PatientDetails (Available in API version 57.0 and later if the org has Health Cloud enabled) PerformCount (Available in API version 63.0 and later.) Quick (A quick record) QuickRecordType RelocateAsset (Available in API version 63.0 and later) ReplaceAsset (Available in API version 63.0 and later) Reply (Available in API version 42.0 and later) ReplyAll (Available in API version 42.0 and later) RequestFeedback SendEmail (This value is available in API version 31.0 and later.) Update"
      },
      "SuccessMessage": {
        "type": "string",
        "description": "The message that displays to the user upon successful completion of the action. Available in API version 36.0 and later."
      },
      "TargetField": {
        "type": "picklist",
        "description": "The API name of the parent object for the record created by this quick action. For example, CollaborationGroup."
      },
      "TargetRecordTypeId": {
        "type": "reference",
        "description": "The ID of the target record type."
      },
      "TargetSobjectType": {
        "type": "picklist",
        "description": "The API name of the type of object record this action creates. For example, OpportunityLineItem."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of action. Valid values are: Canvas Create Flow (This value is available as a Beta in API version 41.0 and later.) LightningComponent (This value is available in API version 38.0 and later.) LogACall Post SendEmail SocialPost Update VisualforcePage"
      },
      "Width": {
        "type": "int",
        "description": "The width of the action, in pixels. This field is set only when the quick action has a custom icon."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_quickactiondefinition.htm"
  }
}