{
  "QuickText": {
    "name": "QuickText",
    "description": "This object stores a snippet of text that allows users to send a quick response to a customer. Use quick text to create greetings, answers to common questions, short notes, and more.",
    "properties": {
      "Category": {
        "type": "picklist",
        "description": "A customizable picklist that can be used to group multiple related quick text records together"
      },
      "Channel": {
        "type": "multipicklist",
        "description": "A multi-select picklist that can be used to specify where specific quick text messages are available, such as in Chat or in the Email publisher in Case Feed."
      },
      "FolderId": {
        "type": "reference",
        "description": "Returns the ID of the folder that contains the quick text. Available in API version 44.0 and later."
      },
      "FolderName": {
        "type": "string",
        "description": "Name of the folder that contains the quick text. Available in API version 44.0 and later."
      },
      "IsInsertable": {
        "type": "boolean",
        "description": "If true, the quick text is available in the channels selected in the Channel field. If false, the quick text is not available. The label in the UI is Include in selected channels. By default: This field is set to true on quick text records created from the Quick Text page or via the API. This field is set to false on quick text records created during the Einstein Reply Recommendations reply publishing process."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last interacted with this record, directly or indirectly. Some sample scenarios are:"
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "Message": {
        "type": "textarea",
        "description": "The content of the quick text record"
      },
      "Name": {
        "type": "string",
        "description": "A descriptive label for the quick text record"
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the User or Queue that owns the quick text record"
      },
      "SourceType": {
        "type": "picklist",
        "description": "(Used with Einstein Reply Recommendations.) Indicates how the text was composed. This field is not available in the UI."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_quicktext.htm"
  }
}