{
  "QuoteLinePriceAdjustment": {
    "name": "QuoteLinePriceAdjustment",
    "description": "Indicates the calculated price adjustment that is applied to the quote line, for example, a calculated volume discount or the prorated value of a manual discount. Use the quote line price adjustment to inform potential customers about the type, value, and total amount of their discounts.",
    "properties": {
      "AdjustmentAmountScope": {
        "type": "picklist",
        "description": "Used with AdjustmentValue to determine the amount of the adjustment."
      },
      "AdjustmentSource": {
        "type": "picklist",
        "description": "The source of the adjustment."
      },
      "AdjustmentType": {
        "type": "picklist",
        "description": "The type of adjustment to apply to a quote line."
      },
      "AdjustmentValue": {
        "type": "double",
        "description": "The value of the adjustment. Used together with AdjustmentAmountScope to determine the amount of the adjustment."
      },
      "Description": {
        "type": "textarea",
        "description": "The system-entered description of the quote line price adjustment."
      },
      "Name": {
        "type": "string",
        "description": "The system-entered name of the quote line price adjustment."
      },
      "PriceAdjustmentCauseId": {
        "type": "reference",
        "description": "The ID of the record that caused the adjustment. Null if AdjustmentSource is Discretionary, indicating a manual adjustment.For example, if the price adjustment is due to a price adjustment tier, this field contains the ID of the PriceAdjustmentTier record."
      },
      "Priority": {
        "type": "int",
        "description": "Reserved for future use."
      },
      "QuoteAdjustmentGroupId": {
        "type": "int",
        "description": "The ID of the quote adjustment group, which totals all price adjustments for the quote."
      },
      "QuoteLineItemId": {
        "type": "reference",
        "description": "The ID of the quote line item that this price adjustment applies to."
      },
      "TotalAmount": {
        "type": "currency",
        "description": "The total amount of the adjustment that applies to the quote line item, inclusive of quantity, prorated for the duration of the subscription."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_quotelinepriceadjustment.htm"
  }
}