{
  "QuotLineItmUseRsrcGrant": {
    "name": "QuotLineItmUseRsrcGrant",
    "description": "Represents the negotiated grants for the usage resource that's associated with the usage product added in the quote line item.",
    "properties": {
      "GrantQuantity": {
        "type": "double",
        "description": "The granted or negotiated quantity of a usage resource associated with the usage product."
      },
      "GrantType": {
        "type": "picklist",
        "description": "Specifies the type of model that defines how the usage resource is consumed."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when this record was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "Name": {
        "type": "string",
        "description": "The auto-generated identifier for the quote line item usage resource grant record. For example, QLIURG-00004 or QLIURG-4567."
      },
      "ProductUsageGrantId": {
        "type": "reference",
        "description": "The product usage grant associated with the quote line item."
      },
      "QuoteLineItemId": {
        "type": "reference",
        "description": "The quote line item associated with the usage product."
      },
      "TokenResourceId": {
        "type": "reference",
        "description": "The usage resource of category Token associated with the usage resource related to the usage product added in the order item."
      },
      "UsageGrantRefreshPolicyId": {
        "type": "reference",
        "description": "The usage grant refresh policy associated with the usage resource related to the usage product added in the quote line item."
      },
      "UsageGrantRolloverPolicyId": {
        "type": "reference",
        "description": "The usage grant rollover policy associated with the usage resource related to the usage product added in the quote line item."
      },
      "UsageResourceId": {
        "type": "reference",
        "description": "The usage resource associated with the usage product that's added as the quote line item."
      },
      "ValidityPeriodTerm": {
        "type": "int",
        "description": "The duration for which the usage resource grant is valid, when used with the validity period units."
      },
      "ValidityPeriodUnit": {
        "type": "picklist",
        "description": "The length of a validity period for the usage resource grant, when used with the validity period term."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_quotlineitmusersrcgrant.htm"
  }
}