{
  "Quote": {
    "name": "Quote",
    "description": "Represents a quote, which is a record showing proposed prices for products and services.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "ID of the account that’s associated with the quote."
      },
      "AdditionalAddress": {
        "type": "address",
        "description": "Compound form of the additional address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "AdditionalCity": {
        "type": "string",
        "description": "City for the quote's additional address. Up to 40 characters allowed."
      },
      "AdditionalCountry": {
        "type": "string",
        "description": "Country for the quote's additional address. Up to 80 characters allowed."
      },
      "AdditionalCountryCode": {
        "type": "picklist",
        "description": "ISO country code for the quote’s additional address."
      },
      "AdditionalLatitude": {
        "type": "double",
        "description": "Used with AdditionalLongitude to specify the precise geolocation of an additional address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "AdditionalLongitude": {
        "type": "double",
        "description": "Used with AdditionalLatitude to specify the precise geolocation of an additional address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "AdditionalName": {
        "type": "string",
        "description": "Name associated with the quote's additional address. Limited: 255 characters."
      },
      "AdditionalPostalCode": {
        "type": "string",
        "description": "Postal Code for the quote's additional address."
      },
      "AdditionalState": {
        "type": "string",
        "description": "State for the quote's additional address. Up to 80 characters allowed."
      },
      "AdditionalStateCode": {
        "type": "picklist",
        "description": "ISO state code for the quote’s additional address."
      },
      "AdditionalStreet": {
        "type": "textarea",
        "description": "Street name for the quote's additional address."
      },
      "BillToContactId": {
        "type": "reference",
        "description": "ID of the contact that the order is billed to. This field is available in API version 56.0 and later. This field is available with Subscription Management."
      },
      "BillingAddress": {
        "type": "address",
        "description": "Compound form of the billing address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "BillingCity": {
        "type": "string",
        "description": "City for the quote's billing address. Up to 40 characters allowed."
      },
      "BillingCountry": {
        "type": "string",
        "description": "Country for the quote's billing address. Up to 80 characters allowed."
      },
      "BillingCountryCode": {
        "type": "picklist",
        "description": "ISO country code for the quote’s billing address."
      },
      "BillingLatitude": {
        "type": "double",
        "description": "Used with BillingLongitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "BillingLongitude": {
        "type": "double",
        "description": "Used with BillingLatitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "BillingName": {
        "type": "string",
        "description": "Entity that the quote is billed to."
      },
      "BillingPostalCode": {
        "type": "string",
        "description": "Postal Code for the quote's billing address."
      },
      "BillingState": {
        "type": "string",
        "description": "State for the quote's billing address. Up to 80 characters allowed."
      },
      "BillingStateCode": {
        "type": "picklist",
        "description": "ISO state code for the quote’s billing address."
      },
      "BillingStreet": {
        "type": "textarea",
        "description": "Street name for the quote's billing address."
      },
      "CalculationStatus": {
        "type": "picklist",
        "description": "Price calculations are performed by Salesforce. Tax calculations are performed by a third-party tax provider integration with Salesforce. Both of these calculations are asynchronous, and you can use this field to see the status of the asynchronous processes."
      },
      "CanCreateQuoteLineItems": {
        "type": "boolean",
        "description": "This field isn’t used."
      },
      "ContactId": {
        "type": "reference",
        "description": "ID of the contact that’s associated with the quote."
      },
      "ContractId": {
        "type": "reference",
        "description": "ID of the contract that’s associated with the quote."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for organizations with the multicurrency feature enabled. Contains the ISO code for any currency allowed by the organization.If the organization has multicurrency and a Pricebook2Id specified on the quote, then the currency value of this field must match the currency of the PricebookEntry objects that are associated with any quote line items it has. This value is copied from the related Opportunity and can't be changed."
      },
      "Description": {
        "type": "textarea",
        "description": "Text description of the quote. Limit: 32,000 characters."
      },
      "Discount": {
        "type": "percent",
        "description": "Difference between the sum of the QuoteLineItem record'sSubtotal and the sum of the QuoteLineItem record's Discount totals. Expressed as a percentage."
      },
      "Email": {
        "type": "email",
        "description": "The email address of the contact who’s associated with the quote."
      },
      "ExpirationDate": {
        "type": "date",
        "description": "The date when this quote is no longer valid."
      },
      "Fax": {
        "type": "phone",
        "description": "The fax number for the contact who’s associated with the quote."
      },
      "GrandTotal": {
        "type": "currency",
        "description": "The total price of the quote plus shipping and taxes. Note The GrandTotal is a system-calculated summary field and is not directly referenceable or usable in custom formula fields on the Quote object. Attempts to do so result in an error message. For example, \"Error: Field GrandTotal does not exist. Check spelling.\" To perform calculations based on the total value of a quote, consider using a Roll-Up Summary field from related Quote Line Items or performing calculations directly on the QuoteLineItem object."
      },
      "IsSyncing": {
        "type": "boolean",
        "description": "Indicates whether the quote is syncing with an opportunity."
      },
      "LastReferencedDate": {
        "type": "date",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "date",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view but not viewed it directly."
      },
      "LineItemCount": {
        "type": "int",
        "description": "The number of line items on the quote."
      },
      "Name": {
        "type": "string",
        "description": "Required. Name for the quote. Limit: 225 characters."
      },
      "OpportunityId": {
        "type": "reference",
        "description": "ID for the opportunity associated with the quote."
      },
      "Phone": {
        "type": "phone",
        "description": "The phone number of the contact who’s associated with the quote."
      },
      "Pricebook2Id": {
        "type": "reference",
        "description": "ID of the price book associated with the quote."
      },
      "QuoteAccountId": {
        "type": "reference",
        "description": "ID of the account associated with the quote. This field is available in API version 58.0 and later only when the Create Quotes Without a Related Opportunity setting on the Quotes Settings page is enabled."
      },
      "QuoteNumber": {
        "type": "string",
        "description": "A system-generated number that identifies the quote."
      },
      "QuoteToAddress": {
        "type": "address",
        "description": "Compound form of the quote to address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "QuoteToCity": {
        "type": "string",
        "description": "City for the address to send the quote to for approval, such as a third party-agency representing a buyer. Up to 40 characters allowed."
      },
      "QuoteToCountry": {
        "type": "string",
        "description": "Country for the address to send the quote to for approval. Up to 80 characters allowed."
      },
      "QuoteToLatitude": {
        "type": "double",
        "description": "Used with QuoteToLongitude to specify the precise geolocation of a quote to address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "QuoteToLongitude": {
        "type": "double",
        "description": "Used with QuoteToLatitude to specify the precise geolocation of a quote to address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "QuoteToName": {
        "type": "string",
        "description": "The name of the entity (such as a person or business) that the quote is sent to for approval. Limit: 255 characters."
      },
      "QuoteToPostalCode": {
        "type": "string",
        "description": "Postal code for the address to send the quote to for approval."
      },
      "QuoteToState": {
        "type": "string",
        "description": "State for the address to send the quote to for approval. Up to 80 characters allowed."
      },
      "QuoteToStreet": {
        "type": "textarea",
        "description": "Street name for the address to send the quote to for approval."
      },
      "RecordTypeID": {
        "type": "reference",
        "description": "ID of the record type assigned to the object."
      },
      "RelatedWorkId": {
        "type": "reference",
        "description": "Relationship field that’s visible only if Field Service and Quotes are enabled in the Salesforce org. This field refers to the work order that the quote is created from. When a mobile worker creates a quote using the New Quote action in the Field Service mobile app, this field is automatically populated. This field is used in the related list that shows all of the quotes related to the work order."
      },
      "ShippingAddress": {
        "type": "address",
        "description": "Compound form of the shipping address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "ShippingCity": {
        "type": "string",
        "description": "City for the quote's shipping address. Up to 40 characters allowed."
      },
      "ShippingCountry": {
        "type": "string",
        "description": "Country for the quote's shipping address. Up to 80 characters allowed."
      },
      "ShippingCountryCode": {
        "type": "picklist",
        "description": "ISO country code for the quote’s shipping address."
      },
      "ShippingHandling": {
        "type": "currency",
        "description": "The total shipping and handling costs for the quote."
      },
      "ShippingLatitude": {
        "type": "double",
        "description": "Used with ShippingLongitude to specify the precise geolocation of a shipping address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "ShippingLongitude": {
        "type": "double",
        "description": "Used with ShippingLatitude to specify the precise geolocation of an address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "ShippingName": {
        "type": "string",
        "description": "The name of the entity (such as a person or business) that the quote is sent to for approval."
      },
      "ShippingPostalCode": {
        "type": "string",
        "description": "Postal code for the quote's shipping address."
      },
      "ShippingState": {
        "type": "string",
        "description": "State for the quote's shipping address. Up to 80 characters allowed."
      },
      "ShippingStateCode": {
        "type": "picklist",
        "description": "ISO state code for the quote’s shipping address."
      },
      "ShippingStreet": {
        "type": "textarea",
        "description": "Street name for the quote's shipping address."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the quote. The standard options are: —None— Draft Needs Review In Review Approved Rejected Presented Accepted Denied"
      },
      "Subtotal": {
        "type": "currency",
        "description": "The sum of sales price multiplied by quantity for line items, not including the discount."
      },
      "Tax": {
        "type": "currency",
        "description": "The total taxes for the quote."
      },
      "TotalPrice": {
        "type": "currency",
        "description": "The total of the quote line items after discounts and before taxes and shipping."
      },
      "TotalPriceWithTax": {
        "type": "currency",
        "description": "The sum of TotalPrice and TotalTaxAmount. This field is available in API version 55.0 and later. This field is available if Subscription Management is enabled in your org."
      },
      "TotalTaxAmount": {
        "type": "currency",
        "description": "The total amount of all taxes. This field is available in API version 55.0 and later. This field is available if Subscription Management is enabled in your org."
      }
    },
    "module": "Core Salesforce"
  }
}