{
  "QuoteLineRelationship": {
    "name": "QuoteLineRelationship",
    "description": "Describes the relationship between quote line items, such as items in a bundle.",
    "properties": {
      "AssociatedQuantScaleMethod": {
        "type": "picklist",
        "description": "How to scale the quantity of the associated quote line, relative to the main quote line. If this field has a non-null value, you can't edit the associated quote line's quantity."
      },
      "AssociatedQuoteLineId": {
        "type": "reference",
        "description": "The unique identifier of the associated quote line item."
      },
      "AssociatedQuoteLinePricing": {
        "type": "picklist",
        "description": "Indicates how the associated quote line item is priced relative to the main quote line item."
      },
      "AssociatedQuoteLineRole": {
        "type": "picklist",
        "description": "Describes the position of the associated quote line item in the relationship."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "MainQuoteLineId": {
        "type": "reference",
        "description": "The unique identifier of the main quote line item."
      },
      "MainQuoteLineRole": {
        "type": "picklist",
        "description": "Indicates the position of the main quote line item in the relationship."
      },
      "Name": {
        "type": "string",
        "description": "The name of the quote line relationship."
      },
      "ProductRelatedComponentId": {
        "type": "reference",
        "description": "The ID of the product related component."
      },
      "ProductRelationshipTypeId": {
        "type": "reference",
        "description": "The unique identifier of record that describes the relationship between the main and associated quote lines."
      },
      "QuoteId": {
        "type": "reference",
        "description": "The unique identifier of the quote to which the main and associated quote lines belong."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_quotelinerelationship.htm"
  }
}