{
  "NamedCredentialEventLog": {
    "name": "NamedCredentialEventLog",
    "description": "The Named Credential event type captures information about Apex callouts that use named credentials as their endpoints. Use this event type to audit the installed managed packages that use named credentials. If you don’t recognize the package namespace in the named credential event log file, then you can investigate whether a security breach has occurred.",
    "properties": {
      "CallerPackageNamespace": {
        "type": "string",
        "description": "If an Apex callout using a Named Credential endpoint is initiated from a package, then this field contains the package’s namespace. If the callout isn’t initiated from a package, then this field is empty."
      },
      "ClientIp": {
        "type": "string",
        "description": "The IP address of the client that’s using Salesforce services. A Salesforce internal IP (such as a login from AppExchange) is shown as “Salesforce.com IP”."
      },
      "CpuTime": {
        "type": "double",
        "description": "The CPU time in milliseconds used to complete the request. This field indicates the amount of activity taking place in the app server layer."
      },
      "LoginKey": {
        "type": "string",
        "description": "The string that ties together all events in a given user’s login session. It starts with a login event and ends with either a logout event or the user session expiring."
      },
      "NamedCredentialName": {
        "type": "string",
        "description": "The name of the named credential that’s the endpoint of the Apex callout."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "The unique ID of a single transaction. A transaction can contain one or more events. Each event in a given transaction has the same REQUEST_ID."
      },
      "RunTime": {
        "type": "double",
        "description": "The amount of time that the request took in milliseconds.."
      },
      "SessionKey": {
        "type": "string",
        "description": "The user’s unique session ID. You can use this value to identify all user events within a session. When a user logs out and logs in again, a new session is started."
      },
      "Timestamp": {
        "type": "dateTime",
        "description": "The access time of Salesforce services in GMT."
      },
      "Uri": {
        "type": "string",
        "description": "The URI of the page that’s receiving the request."
      },
      "UserIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the user who’s using Salesforce services through the UI or the API."
      }
    },
    "module": "Core Salesforce"
  }
}