{
  "Name": {
    "name": "Name",
    "description": "Non-queryable object that provides information about foreign key traversals when the foreign key has more than one parent.",
    "properties": {
      "Alias": {
        "type": "string",
        "description": "The user alias. This field contains a value only if the related record is a user."
      },
      "Email": {
        "type": "email",
        "description": "The email address of the user or group (queue)."
      },
      "FirstName": {
        "type": "string",
        "description": "The first name of the user, contact, or lead."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the related record is an active user (true) or not (false). This field contains a value only if the related record is a user."
      },
      "LastName": {
        "type": "string",
        "description": "The last name of the user, contact, or lead."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last interacted with this record, directly or indirectly. Some sample scenarios are:"
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "MiddleName": {
        "type": "string",
        "description": "The middle name of the user contact, or lead."
      },
      "Name": {
        "type": "string",
        "description": "The name of the parent of the object queried. If the parent is a user, contact, or lead, the value is a concatenation of the FirstName, MiddleName, LastName, and Suffix fields of the related record."
      },
      "Phone": {
        "type": "phone",
        "description": "The phone number of the user. This field contains a value only if the related record is a user."
      },
      "Profile": {
        "type": "reference",
        "description": "The Profile of the user. Only populated if the related record is a user."
      },
      "ProfileId": {
        "type": "reference",
        "description": "ID of the user’s Profile. Only populated if the related record is a user."
      },
      "Suffix": {
        "type": "string",
        "description": "The name suffix of the user, contact, or lead."
      },
      "Title": {
        "type": "string",
        "description": "The title of the user, for example CFO or CEO."
      },
      "Type": {
        "type": "picklist",
        "description": "A list of the types of sObject that can be an owner of this object. You can use this field to filter on a type of owner, for example, return only the leads owned by a user."
      },
      "Username": {
        "type": "string",
        "description": "Contains the name that a user enters to log into the API or the user interface. The value for this field is in the form of an email address, and is only populated if the related record is a user."
      },
      "UserRole": {
        "type": "picklist",
        "description": "Name of the Role played by the user. Only populated for user rows."
      },
      "UserRoleId": {
        "type": "reference",
        "description": "The ID of the user role associated with this object."
      }
    },
    "module": "Core Salesforce"
  }
}