{
  "NetworkAuthApiSettings": {
    "name": "NetworkAuthApiSettings",
    "description": "Represents the settings that control enablement, access, and security for the Headless Registration Flow, Headless Forgot Password Flow, Headless Passwordless Login Flow, and their associated APIs.",
    "properties": {
      "CustomOtpDeliveryHandlerId": {
        "type": "reference",
        "description": "This field is a relationship field."
      },
      "DoesForgotPasswordRequireAuth": {
        "type": "boolean",
        "description": "Determines whether authentication is required to access Headless Forgot Password API when a password reset is requested. If true, an access token issued to an internal integration user in your initial POST request to the /services/auth/headless/forgot_password endpoint is required. The access token must include the forgot_password scope."
      },
      "DoesPasswordLoginRequireAuth": {
        "type": "boolean",
        "description": "Determines whether reCAPTCHA is required for headless username-password login that uses the OAuth 2.0 for First-Party Applications draft protocol."
      },
      "DoesPwdlessLoginRequireAuth": {
        "type": "boolean",
        "description": "Determines whether authentication is required to access Headless Passwordless Login API when user information is submitted to Salesforce. If true, an access token issued to an internal integration user is required in your initial POST request to the /services/auth/headless/init/passwordless/login endpoint. The access token must include the pwdless_login_api scope."
      },
      "DoesRegistrationRequireAuth": {
        "type": "boolean",
        "description": "Determines whether authentication is required to access Headless Registration API when user registration information is submitted to Salesforce. If true, an access token issued to an internal integration user in your initial POST request to the /services/auth/headless/init/registration endpoint is required. The access token must include the user_registration_api scope."
      },
      "HeadlessDiscoveryExecutionUserId": {
        "type": "reference",
        "description": "This field is a relationship field."
      },
      "HeadlessDiscoveryHandlerId": {
        "type": "reference",
        "description": "This field is a relationship field."
      },
      "isFirstPartyAppsAllowed": {
        "type": "boolean",
        "description": "Determines whether the Experience Cloud site can use headless identity flows that use the OAuth 2.0 for First-Party Applications draft protocol."
      },
      "IsForgotPwdAllowed": {
        "type": "boolean",
        "description": "Determines whether the Headless Forgot Password Flow is enabled."
      },
      "IsForgotPwdEmailTemplateAllowlistingEnabled": {
        "type": "boolean",
        "description": "Determines whether email template allowlisting is enabled for the Headless Registration Flow, Headless Passwordless Login Flow, and Headless Forgot Password Flow. If true, the initial request to the headless API must include an emailtemplate parameter that contains only allowlisted email templates."
      },
      "IsHeadlessUserRegistrationAllowed": {
        "type": "boolean",
        "description": "Determines whether the Headless Registration Flow is enabled."
      },
      "IsPwdlessLoginAllowed": {
        "type": "boolean",
        "description": "Determines whether the Headless Passwordless Login Flow is enabled (true) or not (false)."
      },
      "IsRecaptchaRequiredForgotPwd": {
        "type": "boolean",
        "description": "Determines whether a reCAPTCHA token is required to access Headless Forgot Password API when a password reset is requested. If true, a reCAPTCHA token is required in your initial POST request to the /services/auth/headless/forgot_password endpoint."
      },
      "IsRecaptchaRequiredPwdlessLogin": {
        "type": "boolean",
        "description": "Determines whether a reCAPTCHA token is required to access Headless Passwordless Login API when user information is submitted to Salesforce. If true, a reCAPTCHA token is required in your initial POST request to the /services/auth/headless/init/passwordless/login endpoint."
      },
      "IsRecaptchaRequiredRgstr": {
        "type": "boolean",
        "description": "Determines whether a reCAPTCHA token is required to access Headless Registration API when user registration information is submitted to Salesforce. If true, a reCAPTCHA token is required in your initial POST request to the /services/auth/headless/init/registration endpoint."
      },
      "IsUniversalClientRgstrAllowed": {
        "type": "boolean",
        "description": "Determines whether self-registration and passwordless login via Universal Registration API are enabled."
      },
      "IsUserDisambiguationAllowedForgotPwd": {
        "type": "boolean",
        "description": "Determines whether the Headless Forgot Password Flow uses the headless user discovery Apex handler that's specified in the HeadlessDiscoveryHandlerId field. The handler enables users to reset their password with an identifier other than their username, such as an email address, phone number, or order number."
      },
      "IsUserDisambiguationAllowedUsernamePwd": {
        "type": "boolean",
        "description": "Determines whether headless login flows use the headless user discovery Apex handler that's specified in the HeadlessDiscoveryHandlerId field. The handler enables users to log in with an identifier other than their username, such as an email address, phone number, or order number. This field applies to the Authorization Code and Credentials Flow and the OAuth 2.0 for First-Party Applications login flow."
      },
      "MaxPasswordResetAttempts": {
        "type": "int",
        "description": "The maximum number of password reset attempts you allow for the Headless Forgot Password Flow before the user must request a new one-time password (OTP)."
      },
      "NetworkId": {
        "type": "reference",
        "description": "The ID of your Experience Cloud site. This ID is unique within your org."
      },
      "RecaptchaScoreThreshold": {
        "type": "double",
        "description": "The lowest reCAPTCHA score that is accepted before rejecting a request to access Headless Identity APIs. This value must be between 0.5 and 1. Scores closer to 0.5 are more likely to be bots, while scores closer to 1 are more likely to be valid users."
      },
      "RecaptchaSecretKey": {
        "type": "encryptedstring",
        "description": "The reCAPTCHA secret key from your API key pair. You get the API key pair from Google when you set up reCAPTCHA. The secret key helps your app securely communicate with Google."
      },
      "RegistrationExecutionUserId": {
        "type": "reference",
        "description": "The ID of the user who runs your headless registration Apex handler."
      },
      "RegistrationHandlerId": {
        "type": "reference",
        "description": "The ID of your headless registration Apex handler."
      },
      "RegistrationUserDefaultProfileId": {
        "type": "reference",
        "description": "The ID of the default profile that gets assigned to new users when they register."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_networkauthapisettings.htm"
  }
}