{
  "NetworkMember": {
    "name": "NetworkMember",
    "description": "Represents a member of an Experience Cloud site. Members can be either users in your company or external users with portal profiles.",
    "properties": {
      "DefaultGroupNotificationFrequency": {
        "type": "picklist",
        "description": "Required. The default frequency for sending the member’s group email notifications when the member joins groups in the Experience Cloud site. The valid values are: P—Email on every post D—Daily digests W—Weekly digests N—Never The default value is W. In sites, the Email on every post option is disabled once more than 10,000 members choose this setting for the group. All members who had this option selected are automatically switched to Daily digests. However, this field is not currently enabled. These values are reserved for future use."
      },
      "DigestFrequency": {
        "type": "picklist",
        "description": "Required. The frequency for sending the member’s personal email digest for the Experience Cloud site. The valid values are: D—Daily W—Weekly N—Never The default value is D. However, daily and weekly personal digests aren’t currently available in sites. These values are reserved for future use."
      },
      "LastChatterActivityDate": {
        "type": "date",
        "description": "The last time the member posted or commented in the Experience Cloud site."
      },
      "MemberId": {
        "type": "reference",
        "description": "The ID of a person who is a member of an Experience Cloud site."
      },
      "NetworkId": {
        "type": "reference",
        "description": "The ID of the Experience Cloud site that the member is part of."
      },
      "PreferencesDisableAllFeedsEmail": {
        "type": "boolean",
        "description": "When false, the member can automatically receive email for updates in the Experience Cloud site, based on the types of feed emails and digests the member has enabled."
      },
      "PreferencesDisableBestAnswerEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email when someone selects their answer to a post as best. Available in API 46.0 and later."
      },
      "PreferencesDisableBookmarkEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone comments on a feed item after the member has bookmarked it."
      },
      "PreferencesDisableChangeCommentEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone comments on a change the member has made, such as an update to their profile."
      },
      "PreferencesDisableDirectMessageEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone sends them a direct message in the Experience Cloud site."
      },
      "PreferencesDisableEndorsementEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone endorses them for a topic."
      },
      "PreferencesDisableFollowersEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone in the Experience Cloud site starts following the member."
      },
      "PreferencesDisableItemFlaggedEmail": {
        "type": "boolean",
        "description": "When false, the user automatically receives email every time a member flags a post or comment. This setting only applies for community moderators (with the Moderate Experiences Feeds permission) and group owners or managers.This field is available in API version 29.0 and later."
      },
      "PreferencesDisableLaterCommentEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone comments on a feed item after the member has commented on the feed item."
      },
      "PreferencesDisableLikeEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone comments on a feed item after the member has liked the feed item."
      },
      "PreferencesDisableMarketingCloudEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives marketing emails sent by Journey Builder. Available in API version 41.0 and later."
      },
      "PreferencesDisableMentionsPostEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time the member is mentioned in posts."
      },
      "PreferencesDisableMessageEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time the member is sent a Chatter message."
      },
      "PreferencesDisableProfilePostEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone posts to the member’s profile."
      },
      "PreferencesDisableSharePostEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time the member’s post is shared."
      },
      "PreferencesDisCommentAfterLikeEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone comments on a post the member has liked."
      },
      "PreferencesDisMentionsCommentEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time the member is mentioned in comments."
      },
      "PreferencesDisProfPostCommentEmail": {
        "type": "boolean",
        "description": "When false, the member automatically receives email every time someone comments on posts on the member’s profile."
      },
      "ReputationPoints": {
        "type": "double",
        "description": "The number of reputation points the user has accumulated by performing actions in the Experience Cloud site."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_networkmember.htm"
  }
}