{
  "NetworkSelfRegistration": {
    "name": "NetworkSelfRegistration",
    "description": "Represents the account that self-registering Experience Cloud users are associated with by default.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The ID of the account that self-registering users in the Experience Cloud site are associated with."
      },
      "ApexHandlerId": {
        "type": "reference",
        "description": "The ID of the Apex handler created by Configurable Self-Reg registration page type."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for orgs with the multicurrency feature enabled. Contains the ISO code for any currency allowed by the org."
      },
      "ExecuteApexHandlerAsId": {
        "type": "reference",
        "description": "The ID of the user who is executing the configurable self-registration handler."
      },
      "NetworkId": {
        "type": "reference",
        "description": "The ID of NetworkId is unique within your org. You can use only one account per Experience Cloud site to assign self-registering users."
      },
      "OptionsDisableStandardRgstrComponent": {
        "type": "boolean",
        "description": "Determines whether you can use standard Aura and Lightning Web Runtime (LWR) components for self-registration. If this field is true, self-registration flows that use these components don’t work.For more control over self-registration, set this field to true if you’re not using the standard self-registration component."
      },
      "OptionsIncludePassword": {
        "type": "Boolean",
        "description": "Option on Configurable Self-Reg registration page. If true, the Include Password field is selected."
      },
      "OptionsShowEmail": {
        "type": "Boolean",
        "description": "Option on Configurable Self-Reg registration page. If true, the Email field appears on the self-registration form."
      },
      "OptionsShowFirstName": {
        "type": "Boolean",
        "description": "Option on the Configurable Self-Reg registration page. If true, the First Name field appears on the self-registration form."
      },
      "OptionsShowLastName": {
        "type": "Boolean",
        "description": "Option on the Configurable Self-Reg registration page. If true, the Last Name field appears on the self-registration form."
      },
      "OptionsShowMobilePhone": {
        "type": "Boolean",
        "description": "Option on the Configurable Self-Reg registration page. If true, the Mobile field appears on the self-registration form."
      },
      "OptionsShowNickname": {
        "type": "Boolean",
        "description": "Option on the Configurable Self-Reg registration page. If true, the Nickname field appears on the self-registration form."
      },
      "OptionsShowUsername": {
        "type": "Boolean",
        "description": "Option on the Configurable Self-Reg registration page. If true, the Username field appears on the self-registration form."
      },
      "PermissionSetGroupId": {
        "type": "reference",
        "description": "ID of the permission set group used for the self registration. This field is a relationship field."
      },
      "VerificationMethod": {
        "type": "picklist",
        "description": "The type of verification method that a user must supply when registering, which can be: SyncEmail—User must supply an email address to verify identity. SMS—User must supply a phone number to verify identity."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_networkselfregistration.htm"
  }
}