{
  "PackageInstallRequest": {
    "name": "PackageInstallRequest",
    "description": "",
    "properties": {
      "ApexCompileType": {
        "type": "string",
        "description": "For unlocked package installs and upgrades, specifies whether to require successful compilation of all Apex in the org, or only Apex within the package.Valid values are: all package For package installs into production orgs, or any org that has Apex Compile on Deploy enabled, the platform compiles all Apex in the org after the package install or upgrade operation completes. This approach assures that package installs and upgrades don’t impact the performance of an org, and is done even if --apexcompile package is specified. Available in API version 46.0 and later."
      },
      "EnableRss": {
        "type": "boolean",
        "description": "Specifies whether the package can send and receive Remote Site Settings (RSS) and Content Security Policy (CSP) data from third-party websites (true) or not (false).The default value is false. Available in API version 43.0 and later."
      },
      "Errors": {
        "type": "string",
        "description": "Nillable"
      },
      "NameConflictResolution": {
        "type": "string",
        "description": "Controls name conflicts between package members in an unmanaged package. Valid values are: Block: Throw an exception on name conflicts. RenameMetadata: Rename only those components that can be renamed, otherwise throw an exception."
      },
      "PackageInstallSource": {
        "type": "string",
        "description": "For internal use only."
      },
      "Password": {
        "type": "string",
        "description": "The installation key for the package. Required for packages that are protected by an installation key."
      },
      "ProfileMappings": {
        "type": "string",
        "description": "Mappings between profile settings in the package and profiles in the subscriber org.When installing a package, the admin for the subscriber org chooses which profiles in the org to map the profile settings in the package to."
      },
      "SecurityType": {
        "type": "string",
        "description": "Users for which this package is installed. Valid values are: Custom: Installed for specified custom profiles. Full: Installed for all users. None: Installed for administrators only."
      },
      "SkipHandlers": {
        "type": "string",
        "description": "Specifies the handlers that are skipped when the package is installed. There’s only one valid value: FeatureEnforcement: For package installs in scratch orgs only. Specifying FeatureEnforcement in this field decreases the length of time a package installation takes to complete.The feature enforcement handler adds object and feature validations in the subscriber org that prevent an admin from turning off a feature that can cause your app to malfunction. This enforcement isn’t critical in scratch orgs. Available in API version 61.0 and later."
      },
      "Status": {
        "type": "string",
        "description": "The status of the install request. Valid values are: Error InProgress Success Unknown"
      },
      "SubscriberPackageVersionKey": {
        "type": "string",
        "description": "Foreign key to the subscriber package version."
      },
      "UpgradeType": {
        "type": "string",
        "description": "For unlocked package upgrades, specifies whether to mark all removed components as deprecated (deprecate-only, delete removed components that can be safely deleted and deprecate the others (mixed-mode), or delete all removed components (delete-only). The default is mixed-mode. Valid values are: delete-only deprecate-only mixed-mode"
      },
      "errors": {
        "type": "string",
        "description": ""
      },
      "message": {
        "type": "string",
        "description": ""
      },
      "profileMappings": {
        "type": "string",
        "description": ""
      },
      "source": {
        "type": "string",
        "description": ""
      },
      "target": {
        "type": "string",
        "description": ""
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_packageinstallrequest.htm",
    "clouds": [
      "Tooling API"
    ]
  }
}