{
  "PaymentLineInvoiceLine": {
    "name": "PaymentLineInvoiceLine",
    "description": "Represents information about a payment line that's applied to or unapplied from an invoice line.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The account of the customer who made a payment that's related to the payment line invoice line."
      },
      "Amount": {
        "type": "currency",
        "description": "Required. The amount that's been applied or unapplied by a payment line."
      },
      "AppliedDateTime": {
        "type": "dateTime",
        "description": "The date and time when a payment line was applied to an invoice line."
      },
      "AppliedImpactAmount": {
        "type": "currency",
        "description": "If the payment line invoice line's Type value is Applied, the applied impact amount is the same as the ImpactAmount value. The applied impact amount is 0 when the Type value is Unapplied."
      },
      "Description": {
        "type": "textarea",
        "description": "Additional details about the payment line invoice line."
      },
      "EffectiveDateTime": {
        "type": "dateTime",
        "description": "The date and time when a payment line's application to or unapplication from an invoice line becomes effective."
      },
      "ImpactAmount": {
        "type": "currency",
        "description": "If the payment line invoice line's Type value is Applied, the impact amount is the negative equivalent of the payment line invoice line's Amount value. Otherwise, it's equal to the payment line invoice line's Amount value."
      },
      "InvoiceLineBalance": {
        "type": "currency",
        "description": "The balance of the invoice line after a payment line was applied to it or unapplied from it."
      },
      "InvoiceLineId": {
        "type": "reference",
        "description": "Required. The invoice line to which a payment line has been applied or unapplied."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "LegalEntityAccountingPeriodId": {
        "type": "reference",
        "description": "The legal entity accounting period related to the payment line invoice line."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "The legal entity related to the payment line invoice line."
      },
      "PaymentBalance": {
        "type": "currency",
        "description": "The balance of the Payment record after it was applied to or unapplied from an invoice line."
      },
      "PaymentId": {
        "type": "reference",
        "description": "Required. The parent Payment record that's related to the payment line invoice line."
      },
      "PaymentLineInvoiceLineNumber": {
        "type": "string",
        "description": "Required. An auto-generated number identifying the payment line invoice line."
      },
      "RelatedPaymentLineInvcLineId": {
        "type": "reference",
        "description": "The related payment line invoice line with the Type value as Applied when the payment line invoice line's Type value is Unapplied."
      },
      "Type": {
        "type": "picklist",
        "description": "Required. Specifies whether a payment line has been applied to or unapplied from an invoice line."
      },
      "UnappliedDateTime": {
        "type": "dateTime",
        "description": "The date and time when a payment line was unapplied from an invoice line."
      },
      "UnappliedStatus": {
        "type": "picklist",
        "description": "Required. Specifies whether a payment line has been unapplied from an invoice line."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_paymentlineinvoiceline.htm",
    "accessRules": "Revenue Cloud Billing license, and the Payment Admin permission set or the Payment Operations",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}