{
  "PaymentScheduleTreatment": {
    "name": "PaymentScheduleTreatment",
    "description": "Represents information about the processing of payment schedules including the payment method and the payment amount for the payment schedule.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The user-entered description of the payment schedule treatment."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "Name": {
        "type": "string",
        "description": "Required. The user-entered name of the payment schedule treatment."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Required. The ID of the owner of the PaymentScheduleTreatment record."
      },
      "PaymentSchedulePolicyId": {
        "type": "reference",
        "description": "The ID of the related payment schedule policy."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the payment schedule treatment."
      },
      "TriggerSource": {
        "type": "picklist",
        "description": "Required. The action that caused the payment schedule treatment to be created."
      },
      "IsApprovalRequired": {
        "type": "boolean",
        "description": "Indicates whether this payment schedule treatment requires approval or not."
      },
      "PaymentPlanTag": {
        "type": "textarea",
        "description": "A list of key annotations or insights about the payment plan, such as requires approval or recommended, to help guide the user in selecting the most suitable payment plan."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_paymentscheduletreatment.htm",
    "accessRules": "Revenue Cloud Billing license, and the Payment Admin permission set or the Payment Operations",
    "clouds": [
      "Revenue Lifecycle Management",
      "Core Salesforce"
    ]
  }
}