{
  "PickTicket": {
    "name": "PickTicket",
    "description": "A PickTicket represents quantities of one or more products to be picked for fulfillment at a location. It can include products belonging to one or more fulfillment orders.",
    "properties": {
      "AssignedToId": {
        "type": "reference",
        "description": "The user assigned to pick the items associated with the PickTicket."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed data in this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it's possible the user accessed data in this record or list view but didn't view it directly."
      },
      "LocationId": {
        "type": "reference",
        "description": "The location fulfilling the items to be picked."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the PickTicket record. By default, the asset owner is the user who created the record."
      },
      "PickTicketNumber": {
        "type": "string",
        "description": "Name of the PickTicket."
      },
      "Status": {
        "type": "picklist",
        "description": "Status of the PickTicket. Each status corresponds to one status category, shown here in parentheses. You can customize the status picklist to represent your business processes, but the status category picklist is fixed because processing is based on those values. If you customize the status picklist, include at least one status value for each status category."
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "Status category of the PickTicket. Processing of the PickTicket depends on this value. Each status category corresponds to one or more status values."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_pickticket.htm",
    "accessRules": "This object is available with an Order Management Growth license.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}