{
  "PlanBenefit": {
    "name": "PlanBenefit",
    "description": "Represents the standard benefits available under a plan that the purchaser offers to their members.",
    "properties": {
      "BenefitNotes": {
        "type": "textarea",
        "description": "Additional information about the benefits available to members under this plan’s coverage."
      },
      "CoinsuranceNotes": {
        "type": "textarea",
        "description": "Information about the contribution a member makes towards treatment."
      },
      "CopayNotes": {
        "type": "textarea",
        "description": "Additional information on the copayment amounts that members contribute."
      },
      "DeductibleNotes": {
        "type": "textarea",
        "description": "Additional information about a member’s deductibles."
      },
      "DocumentLocation": {
        "type": "url",
        "description": "Hyperlink to internal or external resources."
      },
      "EffectiveDate": {
        "type": "date",
        "description": "The date on which these benefits are communicated to plan members."
      },
      "EffectiveFrom": {
        "type": "date",
        "description": "The date on which these benefits become effective."
      },
      "EffectiveTo": {
        "type": "date",
        "description": "The date on which these benefits ceased to be effective."
      },
      "EmergencyDepartmentCopay": {
        "type": "currency",
        "description": "Patient's portion of payment for using emergency department services."
      },
      "FamilyInNetworkDeductible": {
        "type": "currency",
        "description": "The amount a member pays for health care provided by the health plan’s preferred providers for all family members. When this amount is reached, the plan starts to contribute towards treatment."
      },
      "FamilyInNetworkOutofPocket": {
        "type": "currency",
        "description": "The most a member pays during a coverage year for health care provided by the health plan’s preferred providers for all family members. It includes deductibles, copayments, and coinsurance, but is in addition to premiums."
      },
      "FamilyOutofNetworkDeductible": {
        "type": "currency",
        "description": "The amount a member pay for health care provided by non-preferred providers for all family members before this plan starts to contribute towards treatment."
      },
      "FamilyOutofNetworkOutofPocket": {
        "type": "currency",
        "description": "The most a member pays during a coverage year for health care provided by non-preferred providers for all family members. It includes deductibles, copayments, and coinsurance, but is in addition to premiums."
      },
      "IndividualInNetworkDeductible": {
        "type": "currency",
        "description": "The amount a member pays for health care provided by the health plan’s preferred providers to any one family member. When this amount is reached, the plan starts to contribute towards treatment."
      },
      "IndividualInNetworkOutofPocket": {
        "type": "currency",
        "description": "The most a member pays during a coverage year for health care provided by the health plan’s preferred providers for any one family member. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "IndividualOutofNetworkDeductible": {
        "type": "currency",
        "description": "The amount a member pays for health care provided by non-preferred providers to any one family member before this plan starts to contribute towards treatment."
      },
      "IndividualOutofNetworkOutofPocket": {
        "type": "currency",
        "description": "The most a member pays during a coverage year for health care provided by non-preferred providers for any one family member. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "InNetworkCoinsuranceAmount": {
        "type": "double",
        "description": "The amount a member contributes towards each treatment undertaken by the health plan’s preferred providers."
      },
      "InNetworkCoinsurancePercentage": {
        "type": "double",
        "description": "The percentage of treatment cost the member pays for each treatment undertaken by the health plan’s preferred providers."
      },
      "InNetworkLifetimeMaximum": {
        "type": "currency",
        "description": "The most a member pays during the lifetime membership on this plan for health care provided by the health plan’s preferred providers. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "LifetimeMaximumNotes": {
        "type": "textarea",
        "description": "Additional information about a member’s maximum lifetime payments."
      },
      "Name": {
        "type": "string",
        "description": "Name of these plan coverage benefits."
      },
      "OutofNetworkCoinsuranceAmount": {
        "type": "double",
        "description": "The amount a member contributes towards treatment undertaken by non-preferred providers."
      },
      "OutofNetworkCoinsurancePercentage": {
        "type": "double",
        "description": "The percentage of treatment cost the member pays for treatment undertaken by non-preferred providers."
      },
      "OutofNetworkLifetimeMaximum": {
        "type": "currency",
        "description": "The most a member pays during the lifetime membership on this plan for health care provided by non-preferred providers. It includes deductibles, copayments, and coinsurance, but excludes premiums."
      },
      "OutofPocketNotes": {
        "type": "textarea",
        "description": "Additional information about the out-of-pocket payment a member makes."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PrimaryCareCopay": {
        "type": "currency",
        "description": "The amount a member contributes towards primary care treatment."
      },
      "PurchaserPlanId": {
        "type": "reference",
        "description": "The ID of the purchaser plan offering these benefits."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the system this benefits record came from."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of this benefits record on its source system."
      },
      "SourceSystemModified": {
        "type": "date",
        "description": "The date on which these benefits were last changed on their source system."
      },
      "SpecialistCopay": {
        "type": "currency",
        "description": "The amount a member contributes towards specialist consultations."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of these benefits. The default the picklist values are: Active Inactive"
      },
      "UrgentCareCopay": {
        "type": "currency",
        "description": "The amount a member contributes towards urgent care."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/sforce_api_objects_planbenefit.htm",
    "clouds": [
      "Health Cloud"
    ]
  }
}