{
  "PriceProtectionExecution": {
    "name": "PriceProtectionExecution",
    "description": "Represents an instance of running the price protection process, capturing execution time, status, and the effective date of price changes.",
    "properties": {
      "ExecutionJobId": {
        "type": "reference",
        "description": "Data processing engine instance responsible for creating price protection records."
      },
      "ExecutionReferenceNumber": {
        "type": "string",
        "description": "Unique reference number generated by the Data Processing Engine for this execution. This can be used to associate related line items to the same execution."
      },
      "LastExecutionTime": {
        "type": "dateTime",
        "description": "Date and time when the price protection execution was last performed by the Data Processing Engine."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the record was last referenced. This is used internally to optimize performance and user experience."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Date and timestamp when the record was last viewed in the Salesforce UI. Helps track user engagement."
      },
      "Name": {
        "type": "string",
        "description": "Auto-generated name for the price protection execution record. Used as the primary identifier within the system."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Identifier for the user or group that owns this record."
      },
      "PriceChangeEffectiveDate": {
        "type": "date",
        "description": "Date when the new price goes into effect as part of the price protection execution."
      },
      "Status": {
        "type": "picklist",
        "description": "Represents the current lifecycle status of the price protection execution process."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_priceprotectionexecution.htm"
  }
}