{
  "ProcedureOutputResolution": {
    "name": "ProcedureOutputResolution",
    "description": "Represents the pricing resolution for an pricing element determined using strategy name and formula.",
    "properties": {
      "BusinessVertical": {
        "type": "picklist",
        "description": "The business vertical associated with the procedure output resolution record."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The name of the procedure output resolution."
      },
      "Formula": {
        "type": "string",
        "description": "The formula function used to determine the minimum or maximum price of a product. The supported operations are MIN and MAX."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the procedure output resolution is active (true) or not (false). Only active procedure output resolutions can be applied to a procedure."
      },
      "IsInternal": {
        "type": "boolean",
        "description": "Indicates if the procedure output resolution record is created internally by the Salesforce platform (true) or not (false)."
      },
      "Language": {
        "type": "picklist",
        "description": "The languages in which pricing recipe is supported."
      },
      "MasterLabel": {
        "type": "string",
        "description": "A user-friendly name for procedure output resolution, which is defined when the procedure output resolution record is created."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation."
      },
      "PricingElement": {
        "type": "picklist",
        "description": "Specifies the pricing element on which the procedure output resolution is defined."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_procedureoutputresolution.htm",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}