{
  "ProductUsageGrant": {
    "name": "ProductUsageGrant",
    "description": "Represents the details of a grant associated with a resource, product, or service, such as the purchased quantity, renewal and rollover policy, and validity of the grant.",
    "properties": {
      "DrawdownOrder": {
        "type": "picklist",
        "description": "The order that's used to debit entitlement consumption from the usage entitlement bucket."
      },
      "EffectiveEndDate": {
        "type": "dateTime",
        "description": "The date and time until when the grant remains effective."
      },
      "EffectiveStartDate": {
        "type": "dateTime",
        "description": "The date and time when the grant becomes effective."
      },
      "Label": {
        "type": "string",
        "description": "The identifying label for the product usage grant."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when this record was last referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "OverageChargeable": {
        "type": "picklist",
        "description": "Specifies whether to charge for overages."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the owner of the product usage grant."
      },
      "ProductOfferId": {
        "type": "reference",
        "description": "The sellable product that grants the usage resource."
      },
      "ProductSellingModelId": {
        "type": "reference",
        "description": "The product selling model associated with the product usage grant. This field is available in API version 65.0 and later."
      },
      "ProductUsageGrantNum": {
        "type": "string",
        "description": "The number of each resource grant map that starts with one and is consecutive."
      },
      "ProductUsageResourceId": {
        "type": "reference",
        "description": "The product usage resource associated with the product usage grant. Available in API version 64.0 and later."
      },
      "Quantity": {
        "type": "double",
        "description": "The quantity of the granted resource."
      },
      "RenewalPolicyId": {
        "type": "reference",
        "description": "The grant renewal policy associated with the product usage grant."
      },
      "RolloverPolicyId": {
        "type": "reference",
        "description": "The grant rollover policy associated with the product usage grant."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the product usage grant."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of model that defines how the usage resource is consumed."
      },
      "UnitOfMeasureClassId": {
        "type": "reference",
        "description": "The unit of measure class associated with the product usage grant."
      },
      "UnitOfMeasureId": {
        "type": "reference",
        "description": "The unit for measure associated with the product usage grant. This value when specified, overrides the default unit of measure defined in the associated unit of measure class."
      },
      "UsageDefinitionProductId": {
        "type": "reference",
        "description": "The sellable product associated with the usage resource that's used to retrieve tax policy, calculate rating during overages, and other invoicing actions."
      },
      "UsageModelType": {
        "type": "picklist",
        "description": "The ID of the unit of measure associated with the product. The type of usage model for a product or service. Anchor is the main subscription product or service. Pack is the add-on product or service that grants additional usage resources for consumption. Commit is the product or service with a specific committed quantity of consumption."
      },
      "UsageResourceId": {
        "type": "reference",
        "description": "The usage resource associated with the product usage grant."
      },
      "ValidityPeriodTerm": {
        "type": "int",
        "description": "The period until when the resource grant is valid."
      },
      "ValidityPeriodUnit": {
        "type": "picklist",
        "description": "The length of a validity period for the resource grant, when used with the ValidityPeriodTerm field."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_productusagegrant.htm"
  }
}