{
  "PromptActionOwnerSharingRule": {
    "name": "PromptActionOwnerSharingRule",
    "description": "Represents a rule which determines PromptAction sharing access for the owners.",
    "properties": {
      "AccessLevel": {
        "type": "picklist",
        "description": "Indicates the access level of users for in-app guidance. Valid values are Read and Edit."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the in-app guidance. Maximum of 255 characters."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "GroupId": {
        "type": "reference",
        "description": "ID of the group whose PromptAction are shared."
      },
      "Name": {
        "type": "string",
        "description": "Name of the in-app guidance."
      },
      "UserOrGroupID": {
        "type": "reference",
        "description": "ID of the user or group with whom PromptAction access is shared."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_promptactionownersharingrule.htm",
    "accessRules": "To add, edit, manage, and view prompts and walkthroughs in Lightning Experience or in Experience Cloud sites, multiple permissions are required. See Permissions for Creating and Accessing In-App Guidance in Salesforce Help.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}