{
  "PromotionTarget": {
    "name": "PromotionTarget",
    "description": "Represents the product, product category, or order that you want to target with your promotion in a B2B Store or D2C store.",
    "properties": {
      "AdjustmentAmount": {
        "type": "currency",
        "description": "The promotion discount is expressed as an amount, not as a percentage."
      },
      "AdjustmentPercent": {
        "type": "percent",
        "description": "The percentage discount of the promotion. Valid values include numbers from 1 through 100."
      },
      "AdjustmentType": {
        "type": "picklist",
        "description": "The type of adjustment discount applied to the product or group of products."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for orgs with the multicurrency feature enabled. Contains the ISO code for any currency allowed by the organization."
      },
      "ExternalTarget": {
        "type": "string",
        "description": "A target product or product category stored outside of Salesforce. This field is available in API version 56.0 and later."
      },
      "IsMinItemCountRequired": {
        "type": "boolean",
        "description": "If true, the max value in the RestrictionQuantity field must be met before the promotion is applied. The default value is false. This field is available in API version 56.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the promotion target."
      },
      "PromotionId": {
        "type": "reference",
        "description": "The ID of the promotion that you want to reference."
      },
      "PromotionTierId": {
        "type": "reference",
        "description": "The ID of the promotion tier associated with the target. Only used with tiered promotions."
      },
      "RestrictionQuantity": {
        "type": "double",
        "description": "Maximum number of times the discount can be applied to the target. This field is available in API version 56.0 and later."
      },
      "TargetId": {
        "type": "reference",
        "description": "The ID of the product or product category that you want to target."
      },
      "TargetOperator": {
        "type": "enum",
        "description": "For product and category targets, specify if the qualifying product or item in the qualifying category must be in the cart to determine if the cart satisfies the promotions criteria. For example, a quantity or amount across one or more items. This field is available in API version 59.0 and later."
      },
      "TargetProductCategoryName": {
        "type": "string",
        "description": "The name of the product category referenced in the target. This field is available in API version 55.0 and later."
      },
      "TargetProductName": {
        "type": "string",
        "description": "The name of the product referenced in the target. This field is available in API version 55.0 and later."
      },
      "TargetProductSku": {
        "type": "string",
        "description": "The stock keeping unit of the product referenced in the target. This field is available in API version 55.0 and later."
      },
      "TargetRuleCriteriaType": {
        "type": "enum",
        "description": "Controls what promotion rules must be met for the promotion to be valid. This field is available in API version 59.0 and later."
      },
      "TargetType": {
        "type": "picklist",
        "description": "The target of the promotion."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_promotiontarget.htm"
  }
}