{
  "RebateClaim": {
    "name": "RebateClaim",
    "description": "Represents proof of sale of a vehicle submitted by a dealer in the form of a retail delivery report. This report can also be used for rebate payout calculations.",
    "properties": {
      "AssetId": {
        "type": "reference",
        "description": "The asset associated with the record."
      },
      "AssetIdentificationNumber": {
        "type": "string",
        "description": "The unique identifier of the associated vehicle or asset, such as a vehicle identification number or serial number of an accessory."
      },
      "AssetSaleType": {
        "type": "picklist",
        "description": "Specifies the type of sale that's associated with the rebate claim."
      },
      "ClaimAmount": {
        "type": "currency",
        "description": "The amount claimed by the dealer."
      },
      "ClaimDate": {
        "type": "dateTime",
        "description": "The date when the claim is submitted by the dealer."
      },
      "ClaimedByAccountId": {
        "type": "reference",
        "description": "The account of the dealer who is submitting the claim."
      },
      "ClaimedByAccountNumber": {
        "type": "string",
        "description": "The reference number of the account of the dealer who is submitting the claim."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the claim."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which a user viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "Autogenerated unique identifier for the rebate claim record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the rebate claim record owner."
      },
      "ParticipatingAccountId": {
        "type": "reference",
        "description": "The account of a participant in the claim. It can be the end customer or a partner."
      },
      "ParticipatingAccountNumber": {
        "type": "string",
        "description": "The reference number of the account of a participant in the claim."
      },
      "ProcessingStatus": {
        "type": "picklist",
        "description": "The processing status of the rebate claim."
      },
      "ProcessingStatusMessage": {
        "type": "string",
        "description": "The message with the details of the rebate claim’s processing status when it isn’t completed."
      },
      "ProductCode": {
        "type": "string",
        "description": "The reference number of the product for which the rebate claim is submitted."
      },
      "ProductId": {
        "type": "reference",
        "description": "The product for which the rebate claim is submitted."
      },
      "ProgramReferenceNumber": {
        "type": "string",
        "description": "The reference number of the rebate program that the dealer is enrolled in. Note Use this field if you have enabled Rebate Management in your org."
      },
      "Quantity": {
        "type": "double",
        "description": "The quantity of the product for which the rebate claim is submitted."
      },
      "ReferencePricePerUnit": {
        "type": "currency",
        "description": "The price of a product unit that’s agreed upon between the manufacturer and the dealer or between the dealer and customer for the rebate claim."
      },
      "ResalePricePerUnit": {
        "type": "currency",
        "description": "The price at which a unit of the product was bought by the customer."
      },
      "SaleApprovalDate": {
        "type": "date",
        "description": "The date on which the manufacturer approves the retail delivery report (RDR) of the dealer and acknowledges the sale of the vehicle."
      },
      "SalePricePerUnit": {
        "type": "currency",
        "description": "The original price at which a product unit is sold to the dealer by the manufacturer."
      },
      "TradedFromAccountId": {
        "type": "reference",
        "description": "The account of the dealer who sells a product to another dealer or distributor who further fulfills the final demand."
      },
      "TradedToAccountId": {
        "type": "reference",
        "description": "The account of the dealer who purchases a product from another dealer or distributor to complete their inventory requirement."
      },
      "VehicleDeliveryStatus": {
        "type": "picklist",
        "description": "Specifies the delivery status of the associated vehicle."
      },
      "VehicleDlvrOdometerReading": {
        "type": "int",
        "description": "The odometer reading that’s taken at the time of vehicle delivery."
      },
      "VehicleId": {
        "type": "reference",
        "description": "The vehicle associated with the rebate claim."
      }
    },
    "module": "Automotive Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.automotive_cloud.meta/automotive_cloud/sforce_api_objects_rebateclaim.htm"
  }
}