{
  "RecommendationResponse": {
    "name": "RecommendationResponse",
    "description": "Represents the user responses to a presented offer or recommendation for Einstein Next Best Action. This object is available in API version 51.0 and later.",
    "properties": {
      "ActionReference": {
        "type": "string",
        "description": "The full name of an action flow at the time of the response. The full name includes the action’s namespace."
      },
      "ContextRecord": {
        "type": "string",
        "description": "The ID of context record that contains the Einstein Next Best Action component. For example, if the Einstein Next Best Action component is on a case record the ContextRecord is the ID of the case record."
      },
      "ContextRecordName": {
        "type": "string",
        "description": "The name of the context record."
      },
      "ContextRecordType": {
        "type": "string",
        "description": "The name of the object that’s associated with the value stored in the ContextRecord field. For example, Account, Case, or Contact."
      },
      "NetworkId": {
        "type": "reference",
        "description": "ID of the Experience Cloud site associated with the recommendation (if applicable). This is a relationship field."
      },
      "OnBehalfOf": {
        "type": "string",
        "description": "The user ID or record that is indirectly reacting to the recommendation."
      },
      "OnBehalfOfName": {
        "type": "string",
        "description": "Name of the value stored for OnBehalfOf at time of response."
      },
      "OnBehalfOfType": {
        "type": "string",
        "description": "The name of the object that’s associated with the value stored in the OnBehalfOf field. For example, Account, Case, or Contact."
      },
      "RecommendationKey": {
        "type": "string",
        "description": "RecommendationId if available, otherwise a generated string that represents the recommendation name."
      },
      "RecommendationName": {
        "type": "string",
        "description": "Name of the recommendation returned from the recommendation strategy."
      },
      "RecommendationType": {
        "type": "string",
        "description": "Object type of the recommendation. It can be Recommendation or any object type mapped to the Recommendation object. For example, if you map Product to Recommendation, the RecommendationType is Product."
      },
      "Response": {
        "type": "picklist",
        "description": "The user’s response to the recommendation."
      },
      "StrategyReference": {
        "type": "string",
        "description": "The full name of a recommendation strategy flow at the time of the response. The response is formatted as namespace underscore prefix double underscore flowname, such as namespace_prefix__flowname."
      },
      "StrategyVersion": {
        "type": "string",
        "description": "The recommendation strategy version that’s active at the time of the response."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_recommendationresponse.htm"
  }
}