{
  "RecordAlertCategory": {
    "name": "RecordAlertCategory",
    "description": "Represents a category to group and present record alerts.",
    "properties": {
      "Description": {
        "type": "string",
        "description": "The description of the record alert category."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "FullName": {
        "type": "string",
        "description": "Full name of the associated metadata type in Metadata API."
      },
      "Language": {
        "type": "picklist",
        "description": "Language of the record alert category."
      },
      "ManageableState": {
        "type": "picklist",
        "description": "Indicates the manageable state of the specified component that is contained in a package."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label of the record alert category."
      },
      "Metadata": {
        "type": "complexvalue",
        "description": "Record alert category metadata."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "Namespace prefix associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix."
      },
      "Severity": {
        "type": "picklist",
        "description": "Indicates the degree of impact that an alert in this category can have."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/tooling_api_objects_recordalertcategory.htm"
  }
}