{
  "RevenueSourceCategoryConfig": {
    "name": "RevenueSourceCategoryConfig",
    "description": "Represents the Revenue Data Source-related stage information and the revenue metric that you want to measure and track.",
    "properties": {
      "ClosedDateFieldName": {
        "type": "string",
        "description": "The name of the field from Revenue Data Source that stores the opportunity close date."
      },
      "ClosedLostStageOption": {
        "type": "textarea",
        "description": "The options that represent the Closed Lost stage."
      },
      "ClosedWonStageOption": {
        "type": "textarea",
        "description": "The options that represent the Closed Won stage."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Label is Record Type Name."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the category configurations are active (true) or not (false)"
      },
      "": {
        "type": "",
        "description": ""
      },
      "Language": {
        "type": "string",
        "description": "The language of the revenue source category object."
      },
      "MasterLabel": {
        "type": "string",
        "description": "Label for the revenue source category configuration. In the UI, this field is Revenue Source Category Configuration."
      },
      "RevenueDataSourceFieldName": {
        "type": "string",
        "description": "The name of the field from Revenue Data Source that stores the revenue details as either amount or quantity."
      },
      "RevenueDataSourceId": {
        "type": "reference",
        "description": "The revenue data source record associated with this record."
      },
      "StageFieldName": {
        "type": "string",
        "description": "The name of the field from Revenue Data Source that stores the stage picklist values."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/tooling_api_objects_revenuesourcecategoryconfig.htm",
    "clouds": [
      "Financial Services Cloud"
    ]
  }
}