{
  "BenefitDisbursement": {
    "name": "BenefitDisbursement",
    "description": "Represents the allocation of an enrollee's benefit that can be made as monetary or non-monetary with different frequencies.",
    "properties": {
      "ActualCompletionDate": {
        "type": "dateTime",
        "description": "Required. The date when the benefit disbursement was completed."
      },
      "AdjustmentAmount": {
        "type": "currency",
        "description": "The total amount that's adjusted in the benefit disbursement."
      },
      "ApprovalStatus": {
        "type": "picklist",
        "description": "Specifies the disbursement status of the benefit."
      },
      "BenefitAssignmentId": {
        "type": "reference",
        "description": "Required. The benefit assignment that's associated with the disbursement."
      },
      "BenefitCategory": {
        "type": "picklist",
        "description": "The category of the benefit that's allocated to the enrollee or the recipient."
      },
      "BenefitSessionId": {
        "type": "reference",
        "description": "The benefit session that's associated with the benefit disbursement. This field is accessible if you enabled Data Protection and Privacy in Setup."
      },
      "CodeSetId": {
        "type": "reference",
        "description": "The code set associated with the benefit disbursement record."
      },
      "Description": {
        "type": "string",
        "description": "A description about the benefit that is disbursed. This field is accessible if you enabled Data Protection and Privacy in Setup."
      },
      "DisbursedQuantity": {
        "type": "double",
        "description": "The quantity of the benefit that's disbursed. This field is accessible if you enabled Data Protection and Privacy in Setup."
      },
      "DisbursementStatus": {
        "type": "picklist",
        "description": "Specifies the status of the benefit disbursement."
      },
      "EndDate": {
        "type": "dateTime",
        "description": "The end date of the benefit period in every payment cycle."
      },
      "EntitlementAmount": {
        "type": "currency",
        "description": "The benefit amount that an enrollee is eligible for."
      },
      "ExternalPaymentReference": {
        "type": "string",
        "description": "The ID of the payment on an external system."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "Name": {
        "type": "string",
        "description": "Name of the benefit disbursement."
      },
      "PaymentStatus": {
        "type": "picklist",
        "description": "Specifies the status of the disbursement payment."
      },
      "PayoutAmount": {
        "type": "currency",
        "description": "The payout amount after adjustment that's to be paid to the enrollee or the recipient."
      },
      "PractitionerFacilityId": {
        "type": "reference",
        "description": "The practitioner facility associated with the benefit session record."
      },
      "ProgramEnrollmentId": {
        "type": "reference",
        "description": "The program enrollment record that's associated with the benefit disbursement. This field is accessible if you enabled Data Protection and Privacy in Setup."
      },
      "ProviderFacilitySpecialtyId": {
        "type": "reference",
        "description": "The care specialty to be provided to the enrollee or the recipient at a particular care provider facility."
      },
      "RecipientCount": {
        "type": "int",
        "description": "The count of recipients who received the benefit. This field is accessible if you enabled Data Protection and Privacy in Setup."
      },
      "RecipientId": {
        "type": "reference",
        "description": "Required. The participant who receives a benefit."
      },
      "RecipientType": {
        "type": "picklist",
        "description": "Specifies the recipient type of the benefit that's disbursed."
      },
      "StartDate": {
        "type": "dateTime",
        "description": "The start date of the benefit period in every payment cycle."
      },
      "UnitOfMeasureId": {
        "type": "reference",
        "description": "The identifier of the unit of measure that's used to calculate the benefit type. This field is accessible if you enabled Data Protection and Privacy in Setup."
      }
    },
    "module": "Public Sector Cloud"
  }
}