{
  "BenefitAssignment": {
    "name": "BenefitAssignment",
    "description": "Represents the enrollment information of an individual or business that is captured in an application. For example, an individual who is unemployed can raise an application requesting help from the government. If it is approved, the individual is enrolled into the unemployment insurance benefit.",
    "properties": {
      "ApprovalRejectionReason": {
        "type": "string",
        "description": "The reason for rejecting the benefit amount requested by the enrollee."
      },
      "ApprovalStatus": {
        "type": "picklist",
        "description": "Indicates whether the benefit assignment has been approved or not."
      },
      "BenefitId": {
        "type": "reference",
        "description": "Required. Name of the benefit that is associated with the assignment."
      },
      "EarningThresholdAmount": {
        "type": "currency",
        "description": "The maximum amount the enrollee can earn for a given period to be eligible for a benefit."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "The end date up to when the assignment is valid."
      },
      "EnrolleeId": {
        "type": "reference",
        "description": "Name of the individual being enrolled for the benefit."
      },
      "EnrollmentCount": {
        "type": "int",
        "description": "The number of times the benefit is applicable to an individual."
      },
      "EntitlementAmount": {
        "type": "currency",
        "description": "The benefit amount that an enrollee is eligible for."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "MaximumBenefitAmount": {
        "type": "currency",
        "description": "The maximum amount that can be disbursed during an enrollment period."
      },
      "MinimumBenefitAmount": {
        "type": "currency",
        "description": "The minimum amount that can be disbursed during an enrollment period."
      },
      "Name": {
        "type": "string",
        "description": "Name of the benefit assignment."
      },
      "NextPayoutDate": {
        "type": "date",
        "description": "The due date for the next scheduled benefit payment."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this object."
      },
      "ParentRecordId": {
        "type": "reference",
        "description": "Required. The parent record associated with the benefit assignment."
      },
      "PayoutFrequency": {
        "type": "picklist",
        "description": "Specifies the frequency of the benefit payment."
      },
      "Priority": {
        "type": "picklist",
        "description": "Specifies the priority of the benefit assignment."
      },
      "ProgramEnrollmentId": {
        "type": "reference",
        "description": "The identifier of the program enrollment record that's associated with the benefit assignment."
      },
      "Quantity": {
        "type": "int",
        "description": "The benefit quantity allocated to the enrollee."
      },
      "RecertificationDueDate": {
        "type": "date",
        "description": "The date by when the enrolee must recertify eligibility to continue receiving the benefit."
      },
      "RecertificationStatus": {
        "type": "picklist",
        "description": "Specifies the recertification status of the enrollee's eligibility for the benefit assignment."
      },
      "ReferenceNumber": {
        "type": "string",
        "description": "The reference number used to indicate the enrollee's benefit request."
      },
      "RemainingAmount": {
        "type": "currency",
        "description": "The remainder benefit amount that is to be paid to the enrollee."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "The start date from when the assignment begins."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the benefit assignment."
      },
      "TaskJobStatus": {
        "type": "picklist",
        "description": "Specifies the status of the task in the task queue."
      },
      "TaskJobStatusMessage": {
        "type": "textarea",
        "description": "The message that describes the status of the task in the queue."
      },
      "TotalApprovedAmount": {
        "type": "currency",
        "description": "The total benefit amount approved for an enrollee."
      },
      "TotalPaidAmount": {
        "type": "currency",
        "description": "The total benefit amount that has already been paid to the enrollee."
      },
      "UnitOfMeasureId": {
        "type": "reference",
        "description": "Specifies the unit of measurement of the benefit allocated to the enrollee."
      }
    },
    "module": "Public Sector Cloud"
  }
}