{
  "BillingBatchScheduler": {
    "name": "BillingBatchScheduler",
    "description": "Represents a scheduled processing job that triggers recurring invoice batch runs and payment batch runs in Subscription Management.",
    "properties": {
      "BillingSchedulerName": {
        "type": "string",
        "description": "Name of the scheduler."
      },
      "Comments": {
        "type": "textarea",
        "description": "Optional field for comments about the scheduler."
      },
      "CronExpression": {
        "type": "string",
        "description": "Determines how often the scheduler recurs."
      },
      "EndDate": {
        "type": "date",
        "description": "The date when the scheduler stops triggering batch processing jobs."
      },
      "FrequencyCadence": {
        "type": "picklist",
        "description": "Indicates how often the scheduler triggers the invoice batch run or the payment batch run."
      },
      "FrequencyOptions": {
        "type": "textarea",
        "description": "Derived field that stores the scheduler configuration."
      },
      "JobType": {
        "type": "picklist",
        "description": "Indicates the type of batch processing job that the scheduler triggers."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "NextRunTime": {
        "type": "dateTime",
        "description": "The date and timestamp of the next scheduled batch invoice run or batch payment run are shown in the user's time zone."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who created the scheduler."
      },
      "RecurringSubType": {
        "type": "picklist",
        "description": "Specifies the frequency at which the batch processing job recurs when the FrequencyCadence is set to Monthly."
      },
      "RecurringType": {
        "type": "picklist",
        "description": "Specifies the frequency at which the batch processing job is repeated when the FrequencyCadence is set to Weekly."
      },
      "RecursOn": {
        "type": "picklist",
        "description": "Specifies the interval at which the scheduler triggers a batch processing job."
      },
      "RecursOnDate": {
        "type": "string",
        "description": "Specifies the date on which the scheduler triggers a batch processing job."
      },
      "RecursOnDay": {
        "type": "picklist",
        "description": "Specifies the day on which the scheduler triggers a batch processing job."
      },
      "RunCriteriaId": {
        "type": "reference",
        "description": "The ID of the filter criteria that’s defined for the invoice batch run or the payment batch run."
      },
      "StartDate": {
        "type": "date",
        "description": "The date when the scheduler triggers its first batch processing job."
      },
      "StartTime": {
        "type": "time",
        "description": "The time when the scheduler triggers the batch processing job."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the scheduler. Only Active schedulers can trigger batch processing jobs."
      },
      "TimeZone": {
        "type": "picklist",
        "description": "The time zone is either the value selected when the run was configured, or it's the user's time zone. The time zone is shown in Greenwich Mean Time (GMT)."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_billingbatchscheduler.htm"
  }
}