{
  "BillingMilestonePlan": {
    "name": "BillingMilestonePlan",
    "description": "Represents a structured approach to invoicing where invoices are scheduled based on predefined milestones.",
    "properties": {
      "BillingTreatmentId": {
        "type": "reference",
        "description": "Required. The billing treatment associated with the billing milestone plan."
      },
      "Description": {
        "type": "string",
        "description": "Additional details about the billing milestone plan."
      },
      "ExternalReference": {
        "type": "string",
        "description": "The external reference item that links a billing milestone plan item to the original transaction item. Available in API version 65.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a billing milestone plan record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a billing milestone plan record. If this value is null, it’s possible that the user only accessed the billing milestone plan record or a related list view (LastReferencedDate), but not viewed the billing milestone plan record itself."
      },
      "Name": {
        "type": "string",
        "description": "Required. The name of the billing milestone plan."
      },
      "ReferenceItemAmount": {
        "type": "currency",
        "description": "The total reference item amount to be billed."
      },
      "ReferenceItemId": {
        "type": "reference",
        "description": "The ID of the reference item that links a billing milestone plan item to the original order item."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the billing milestone plan."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_billingmilestoneplan.htm"
  }
}