{
  "BillingTreatment": {
    "name": "BillingTreatment",
    "description": "Defines how Subscription Management bills an order item. The Exclude From Billing field controls whether the order item is invoiced. Child billing treatment items control how much of the order item's balance is invoiced for each invoice across the subscription's lifecycle. Billing treatments are assigned to order items based on the parent billing policy's Billing Treatment Selection field.",
    "properties": {
      "BillingPolicyId": {
        "type": "reference",
        "description": "The ID of the billing policy for the billing treatment."
      },
      "Description": {
        "type": "textarea",
        "description": "Optional user-defined description of the billing treatment."
      },
      "ExcludeFromBilling": {
        "type": "picklist",
        "description": "Excludes any order items assigned to the treatment from creating billing schedules."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "The ID of the legal entity used to assign the treatment to order items when the parent billing policy's BillingTreatmentSelection is LegalEntity."
      },
      "Name": {
        "type": "string",
        "description": "Optional user-defined name for the billing treatment."
      },
      "Status": {
        "type": "picklist",
        "description": "Draft or inactive billing treatments can't be assigned to order items."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_billingtreatment.htm"
  }
}