{
  "BillingSchedule": {
    "name": "BillingSchedule",
    "description": "Stores the order item information used in the invoicing process.",
    "properties": {
      "BillDayOfMonth": {
        "type": "int",
        "description": "An integer from 1 to 31 that indicates the day of the month."
      },
      "BilledAmount": {
        "type": "currency",
        "description": "The total amount (excluding tax) that has been invoiced from the billing schedule."
      },
      "BillingAccountId": {
        "type": "reference",
        "description": "This field is a relationship field."
      },
      "BillingPeriodAmount": {
        "type": "currency",
        "description": "The amount to be invoiced each billing period."
      },
      "BillingScheduleEndDate": {
        "type": "date",
        "description": "The last date that the billing schedule is available for invoicing. Inherited from the EndDate field on the order item."
      },
      "BillingScheduleGroupId": {
        "type": "reference",
        "description": "ID of the billing schedule group that contains the billing schedule. Billing schedules are grouped when they have the same source order item. The source order item is the original order item that a customer bought. Afterwards, if the customer amends, cancels, or renews the order item, a new billing schedule is created with the BillingScheduleGroupId for the original order item."
      },
      "BillingScheduleNumber": {
        "type": "string",
        "description": "Autogenerated reference number for the billing schedule."
      },
      "BillingScheduleStartDate": {
        "type": "date",
        "description": "The date that the billing schedule is available for invoicing. Inherited from the ServiceDate on the order item."
      },
      "BilledThroughPeriod": {
        "type": "date",
        "description": "The last billing period that includes this date."
      },
      "BillingTreatmentItemId": {
        "type": "reference",
        "description": "The billing treatment item used to configure invoiceable amounts on the billing schedule."
      },
      "CancellationDate": {
        "type": "date",
        "description": "The date on which the subscriber can no longer access the service. For example, if a service ends on August 31, then the cancellation date is September 1, because that’s the date when the subscriber can no longer use the service."
      },
      "Category": {
        "type": "picklist",
        "description": "The business action represented by the billing schedule."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Three-letter ISO 4217 currency code associated with the invoice."
      },
      "InvoiceBatchRunId": {
        "type": "reference",
        "description": "The invoice batch run that evaluated this billing schedule and its billing period items to produce an invoice."
      },
      "InvoiceRunBatch": {
        "type": "picklist",
        "description": "The batch value used by the invoice run that evaluated this billing schedule. During an invoice run, billing schedules with the same batch value (including null) are grouped to the same invoice run."
      },
      "NextBillingDate": {
        "type": "date",
        "description": "The date that the next billing period starts for the invoice. Used to calculate which invoice lines are included on an invoice. When an invoice scheduler or API evaluates an order for invoicing, billing schedules with a next billing date on or before the invoice's target date are included on the invoice."
      },
      "NextChargeFromDate": {
        "type": "date",
        "description": "The date that the billing schedule is invoiced in the upcoming billing period. For example, if you invoiced a customer for a billing period of 01/01/22 through 01/31/22, the billing schedule's NextChargeFromDate is 02/01/22."
      },
      "OriginalBillingScheduleId": {
        "type": "reference",
        "description": "If this billing schedule is an amended or canceled billing schedule, then this field shows the original billing schedule. Otherwise, this field is null."
      },
      "PendingAmount": {
        "type": "currency",
        "description": "The amount from the current billing term that hasn't been billed yet. For example, the unbilled amount for a month, quarter, or year, depending on this billing schedule's billing term."
      },
      "Quantity": {
        "type": "double",
        "description": "The quantity of the order item that created the billing schedule."
      },
      "ReferenceEntityId": {
        "type": "reference",
        "description": "The parent order of the order item that created the billing schedule."
      },
      "ReferenceEntityItemId": {
        "type": "reference",
        "description": "The order item or asset that created the billing schedule."
      },
      "Status": {
        "type": "picklist",
        "description": "The state of the order item that the billing schedule represents."
      },
      "TaxTreatmentId": {
        "type": "reference",
        "description": "Shows the treatment used to calculate tax for the billing schedule. Defined based on the order item's tax policy."
      },
      "TotalAmount": {
        "type": "currency",
        "description": "The total amount of the order item represented by the billing schedule."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "The price for an individual unit of the billing schedule's parent order item, including charges, adjustments, and discounts. Inherited from the order item's UnitPrice field."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_billingschedule.htm"
  }
}