{
  "BillingPeriodItem": {
    "name": "BillingPeriodItem",
    "description": "Represents one payment period for a subscription. The billing period item is used to pass billing information to an invoice line item in Subscription Management.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "Price for the billing period item. Used to calculate the invoice line's Amount field."
      },
      "BillingPeriodEndDate": {
        "type": "date",
        "description": "Used to calculate the invoice line's end date."
      },
      "BillingPeriodItemNumber": {
        "type": "string",
        "description": "System-defined number that refers to the billing period item."
      },
      "BillingPeriodStartDate": {
        "type": "date",
        "description": "Used to calculate the invoice line's start date."
      },
      "BillingScheduleId": {
        "type": "reference",
        "description": "Parent billing schedule of the billing period item."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Contains the ISO code for any currency allowed by the org. Available only for orgs with the multicurrency feature enabled."
      },
      "InvoiceBatchRunId": {
        "type": "reference",
        "description": "Parent invoice batch run of the billing period item."
      },
      "InvoiceLineId": {
        "type": "reference",
        "description": "This field looks up to the invoice line that's generated from the billing period item. This field is populated only when a billing period item is generated via an invoice batch run. Otherwise, this field is empty."
      },
      "InvoiceStatus": {
        "type": "picklist",
        "description": "Status of the invoice that contains the invoice line created from the billing period item."
      },
      "Status": {
        "type": "picklist",
        "description": "Status of the billing period item. Draft billing period items aren't evaluated for invoice line creation."
      }
    },
    "module": "Core Salesforce"
  }
}