{
  "BillingScheduleGroup": {
    "name": "BillingScheduleGroup",
    "description": "Represents a consolidated view of all billing schedules related to the order items generated from one asset, including new orders and amendment orders.",
    "properties": {
      "BillDayOfMonth": {
        "type": "int",
        "description": "The Billing Day of Month for the billing schedules that comprise the billing schedule group."
      },
      "BillToContactId": {
        "type": "reference",
        "description": "The contact related to the billing schedule group."
      },
      "BillingAccountId": {
        "type": "reference",
        "description": "The Salesforce account for the billing schedule group."
      },
      "BillingAddress": {
        "type": "address",
        "description": "The compound form of the billing address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "BillingCity": {
        "type": "string",
        "description": "Details for the billing address of this billing schedule group. Maximum size is 40 characters."
      },
      "BillingCountry": {
        "type": "string",
        "description": "Details for the billing address of this billing schedule group. Maximum size is 80 characters."
      },
      "BillingGeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the billing address. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "BillingLatitude": {
        "type": "double",
        "description": "Used with BillingLongitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "BillingLongitude": {
        "type": "double",
        "description": "Used with BillingLatitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "BillingMethod": {
        "type": "picklist",
        "description": "Shows the type of billing used for the source item."
      },
      "BillingPostalCode": {
        "type": "string",
        "description": "Details for the billing address of this billing schedule group. Maximum size is 20 characters."
      },
      "BillingScheduleGroupNumber": {
        "type": "string",
        "description": "System-generated reference number for the billing schedule group."
      },
      "BillingStartMonth": {
        "type": "picklist",
        "description": "Read-only field used with annual billing. The field shows the numbers from 1 to 12, which indicate the month when billing begins for an annual subscription. For example, if billing starts in January, the value is 1; if billing starts in June, the value is 6. This field is available in API version 58.0 and later."
      },
      "BillingState": {
        "type": "string",
        "description": "Details for the billing address of this billing schedule group. Maximum size is 80 characters."
      },
      "BillingStreet": {
        "type": "textarea",
        "description": "Street address for the billing address of this billing schedule group."
      },
      "BillingTerm": {
        "type": "int",
        "description": "Used with BillingTermUnit to define a billing cycle. For example, bill every 20 days or every two months. In this example, the BillingTerm is 20 and the BillingTermUnit is days"
      },
      "BillingTermUnit": {
        "type": "picklist",
        "description": "The frequency with which the billing schedule is invoiced."
      },
      "BillingType": {
        "type": "picklist",
        "description": "Inherited from the shared value of each billing schedule in the billing schedule group. Defines when Subscription Management bills a product or service relative to when it’s provided to the customer. Advance billing invoices a product or service before you provide it, while arrears billing invoices a product or service after you provide it. Subscription Management evaluates the billing type when it calculates an order's next billing date."
      },
      "CancellationDate": {
        "type": "date",
        "description": "The date that a cancellation was made against the billing schedule. Subscription Management doesn't invoice billing schedules past their cancellation date."
      },
      "Controller": {
        "type": "picklist",
        "description": "During the invoicing process, this field determines which date is used when the billing schedule group and billing schedule have a related field with conflicting values."
      },
      "CurrentBillingPeriodAmount": {
        "type": "currency",
        "description": "This field was removed in Subscription Management API version 55.0."
      },
      "CurrentQuantity": {
        "type": "double",
        "description": "This field was removed in Subscription Management API version 55.0."
      },
      "EffectiveNextBillingDate": {
        "type": "date",
        "description": "The earliest NextBillingDate from all billing schedules in the billing schedule group. This field is a reference field that isn't used for any features or calculations."
      },
      "EndDate": {
        "type": "date",
        "description": "The latest end date from all billing schedules in the billing schedule group."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The Salesforce user who owns the billing schedule group."
      },
      "PaymentTermId": {
        "type": "reference",
        "description": "The ID of the payment term used in this billing schedule group."
      },
      "PeriodBoundary": {
        "type": "picklist",
        "description": "Inherited from the order item's parent quote line item or sales transaction item. The period boundary helps determine the start and end date of the billing periods."
      },
      "Product2Id": {
        "type": "reference",
        "description": "The ID of the product for the order item represented by each billing schedule in the billing schedule group."
      },
      "ProductName": {
        "type": "string",
        "description": "The name of the product for the order item represented by each billing schedule in the billing schedule group."
      },
      "ProrationPolicyId": {
        "type": "reference",
        "description": "Refers to the proration policy that applies to this billing schedule group. The proration policy defines how time periods are calculated for subscription orders. For example, whether partial periods are allowed."
      },
      "ReferenceEntityId": {
        "type": "reference",
        "description": "The asset used to create the billing schedules in the billing schedule group."
      },
      "ShippingAddress": {
        "type": "address",
        "description": "The compound form of the shipping address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "": {
        "type": "string",
        "description": "Details for the shipping address for this billing schedule group. City maximum size is 40 characters"
      },
      "ShippingCity": {
        "type": "string",
        "description": "Details for the shipping address for this billing schedule group. Country maximum size is 80 characters."
      },
      "ShippingCountry": {
        "type": "picklist",
        "description": "Accuracy level of the geocode for the shipping address. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "ShippingGeocodeAccuracy": {
        "type": "double",
        "description": "Used with ShippingLongitude to specify the precise geolocation of a shipping address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "ShippingLatitude": {
        "type": "double",
        "description": "Used with ShippingLatitude to specify the precise geolocation of an address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places. See Compound Field Considerations and Limitations for details on geolocation compound fields."
      },
      "ShippingLongitude": {
        "type": "string",
        "description": "Details for the shipping address for this billing schedule group. Postal code maximum size is 20 characters."
      },
      "ShippingPostalCode": {
        "type": "string",
        "description": "Details for the shipping address for this billing schedule group. State maximum size is 80 characters."
      },
      "ShippingState": {
        "type": "textarea",
        "description": "The street address of the shipping address for this billing schedule group. Maximum of 255 characters."
      },
      "ShippingStreet": {
        "type": "date",
        "description": "The earliest start date from all billing schedules in the billing schedule group."
      },
      "StartDate": {
        "type": "currency",
        "description": "The amount that has been invoiced for all billing schedules within the billing schedule group."
      },
      "TotalBilledAmount": {
        "type": "currency",
        "description": "The amount that hasn't yet been invoiced for all billing schedules within the billing schedule group."
      },
      "TotalPendingAmount": {
        "type": "",
        "description": ""
      }
    },
    "module": "Core Salesforce"
  }
}