{
  "BillingTreatmentItem": {
    "name": "BillingTreatmentItem",
    "description": "A billing treatment item defines how the order item's total amount is distributed into billing schedules over the course of the order item's lifecycle. In the Subscription Management pilot, billing treatments must have only one billing treatment item, so that the billing treatment item covers 100% of the order item's total value.",
    "properties": {
      "BillingTreatmentId": {
        "type": "reference",
        "description": "The parent billing treatment for the billing treatment item."
      },
      "BillingType": {
        "type": "picklist",
        "description": "Defines when Subscription Management invoices a product or service relative to when it’s provided to the customer. Advance billing invoices a product or service before it's provided, while arrears billing invoices a product or service after it has provided Subscription Management evaluates billing type when calculating an order product’s next billing date."
      },
      "Controller": {
        "type": "picklist",
        "description": "During the invoicing process, this field determines which value Subscription Management uses when the billing schedule group and billing schedule have a shared field with different values. For example, when Controller has a value of BillingScheduleGroup, if the billing schedule's billing day of month is 5 while the billing schedule group's billing day of month is 10, Subscription Management uses the value of 10."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Three-letter ISO 4217 currency code associated with the billing treatment item."
      },
      "Description": {
        "type": "textarea",
        "description": "Optional user-defined description for the billing treatment item."
      },
      "FlatAmount": {
        "type": "currency",
        "description": "The amount in terms of units of currency (such as $10 or $21.52) to invoice from the order item. Used only when Type has a value of FlatAmount."
      },
      "Handling0Amount": {
        "type": "picklist",
        "description": "Shows how Subscription Management invoices billing period items that have an amount of $0."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record, a record related to this record, or a list view."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, the user might have only accessed this record or list view (LastReferencedDate) but not viewed it."
      },
      "Name": {
        "type": "string",
        "description": "Required. Default name of this record."
      },
      "Percentage": {
        "type": "percent",
        "description": "The percentage (such as 10% or 12.5%) to invoice from the order item. Used only when Type has a value of Percentage."
      },
      "ProcessingOrder": {
        "type": "int",
        "description": "Defines the order in which Subscription Management creates billing schedules based on each billing treatment item. Lower numbers are evaluated first. For example, if your billing treatment has a billing treatment item that invoices at 25 Percentage and a ProcessingOrder of 1, and another item that invoices at 75 Percentage and a ProcessingOrder of 2, your first billing schedule will be for 25 percent of the order item's total amount, and your second billing schedule will be for 75% of the order item's total amount."
      },
      "Sequencing": {
        "type": "picklist",
        "description": "Allows users to define the number used to start invoice numbers on invoices generated from this billing treatment item."
      },
      "Status": {
        "type": "picklist",
        "description": "Draft billing treatment items aren't evaluated for creating billing schedules."
      },
      "Type": {
        "type": "picklist",
        "description": "Defines whether billing schedules created from this billing treatment item are based on a flat amount or a percentage of the order item's total amount."
      }
    },
    "module": "Core Salesforce"
  }
}