{
  "BldgEnrgyIntensityVal": {
    "name": "BldgEnrgyIntensityVal",
    "description": "Represents the calculated average energy intensity for an individual fuel type across a set of buildings. Each record stores the fuel use intensity as a function of the floor area of the occupied space of that building.",
    "properties": {
      "AnnualIntensityValueInKwhM2": {
        "type": "double",
        "description": "The annual building energy consumption intensity of the selected fuel type for a year in kWh per square meter."
      },
      "AnnualIntensityValueInKwhSqft": {
        "type": "double",
        "description": "The annual building energy consumption intensity of the selected fuel type for a year in kWh per square foot."
      },
      "BuildingEnergyIntensityId": {
        "type": "reference",
        "description": "The parent building energy intensity record for this intensity value record."
      },
      "EnergyUseRecordCount": {
        "type": "double",
        "description": "The number of energy use records used to calculate the building energy intensity value."
      },
      "ExternalIdentifier": {
        "type": "string",
        "description": "The external identifier for the emissions factor."
      },
      "FuelType": {
        "type": "picklist",
        "description": "The type of fuel for this intensity value record."
      },
      "IsRecordLocked": {
        "type": "boolean",
        "description": "Indicates whether the record is locked for editing."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "NumberOfDaysUsedForCalc": {
        "type": "double",
        "description": "The number of days between the averaging window start date and end date that contained energy use data, which is used to calculate the building energy intensity."
      },
      "ReferenceDataLoadLogId": {
        "type": "reference",
        "description": "The reference data load log record that's associated with the emissions factor."
      },
      "ShouldLockDtastUpdtForRec": {
        "type": "boolean",
        "description": "Indicates whether the emissions factor record can be locked from dataset updates."
      }
    },
    "module": "Net Zero Cloud"
  }
}