{
  "BranchUnit": {
    "name": "BranchUnit",
    "description": "Represents details about a branch of an organization.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "The ID of an account that contains additional information about a branch. The value must be unique within this organization."
      },
      "BranchCode": {
        "type": "string",
        "description": "An identifier that relates this branch to an external system."
      },
      "BranchManagerId": {
        "type": "reference",
        "description": "The ID of a user who is the manager or main point of contact for the branch unit."
      },
      "EndDate": {
        "type": "date",
        "description": "The date the branch most recently stopped being active."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the branch is currently active and can be used for banker assignments and automatic associations."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date when a user referenced this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date when a user viewed this record."
      },
      "LocationId": {
        "type": "reference",
        "description": "The ID of a location where the branch does business."
      },
      "Name": {
        "type": "string",
        "description": ""
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The ID of an operating hours record that specifies the hours when the branch is open for normal business operations."
      },
      "OperationalState": {
        "type": "picklist",
        "description": "Specifies the operational readiness of a branch."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "ParentBranchUnitId": {
        "type": "reference",
        "description": "The ID of this branch's parent branch unit, if it has one."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The ID of a service territory that corresponds to this branch unit."
      },
      "StartDate": {
        "type": "date",
        "description": "The date the branch most recently became active."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the branch interaction type with customers."
      }
    },
    "module": "Financial Services Cloud"
  }
}