{
  "BriefcaseDefinition": {
    "name": "BriefcaseDefinition",
    "description": "Represents a briefcase definition. A briefcase makes selected records available for users to view when they’re offline in the Salesforce Field Service mobile app for iOS and Android.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "Description of the briefcase definition. Limited to 1024 characters."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Limited to 80 characters. Label is Name."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the briefcase is available for use (true) or not (false). Label is Active."
      },
      "Language": {
        "type": "picklist",
        "description": "The language for the briefcase. This field defaults to the user's language unless the org is multi-language enabled. Specifies the language of the labels returned."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The master label for the briefcase. This internal label doesn’t get translated. Limited to 80 characters."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      }
    },
    "module": "Core Salesforce"
  }
}