{
  "BriefcaseRule": {
    "name": "BriefcaseRule",
    "description": "Represents a rule that specifies records for a briefcase definition.",
    "properties": {
      "BriefcaseId": {
        "type": "reference",
        "description": "Required. ID of the briefcase definition. Label is Briefcase Definition ID."
      },
      "FilterLogic": {
        "type": "string",
        "description": "The filter logic for record selection, for example, 1 AND 2 where 1 and 2 correspond to filter 1 and filter 2. Filter logic operators include AND and OR. Limited to 255 characters. Label is Filter Logic."
      },
      "IsAscendingOrder": {
        "type": "boolean",
        "description": "Required. Indicates whether the records should be sorted in ascending order. Label is Ascending."
      },
      "OptionsIsRelatedFilesRule": {
        "type": "boolean",
        "description": "Indicates whether the briefcase rule is part of a hierarchical set of rules that configure the offline priming of file attachments. Available only for the Offline App (Salesforce Mobile App Plus)."
      },
      "OrderBy": {
        "type": "picklist",
        "description": "The field to order the records by, which determines how the records can be sorted. For example, AccountName or CreatedBy. Label is Order By."
      },
      "ParentRuleId": {
        "type": "reference",
        "description": "The ID of the parent rule of this briefcase rule. This field is a relationship field."
      },
      "QueryScope": {
        "type": "picklist",
        "description": "Required. A group of records to restrict the scope of this rule."
      },
      "RecordLimit": {
        "type": "int",
        "description": "The record limit for the object. The recommended number for record limit is up to 500 records per object for optimal performance. The maximum number is 2000. Label is Limit."
      },
      "RelationshipField": {
        "type": "picklist",
        "description": "The Salesforce object field that relates the briefcase rule to another briefcase rule. For example, an Account rule can be related to a Contact rule using the Account ID object field. In this example, the value for the briefcase rule's RelationshipField is AccountID."
      },
      "RelationshipType": {
        "type": "picklist",
        "description": "The relationship of the briefcase rule to another briefcase rule. Possible values are:"
      },
      "TargetEntity": {
        "type": "picklist",
        "description": "The standard object, custom object, or custom metadata type that the briefcase rule selects records from. The UI label is Target Object."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_briefcaserule.htm"
  }
}