{
  "BroadcastCommunication": {
    "name": "BroadcastCommunication",
    "description": "Represents a broadcast communication related to an incident.",
    "properties": {
      "Body": {
        "type": "textarea",
        "description": "If BroadcastType is Alert, this field contains the alert message. If BroadcastType is Email, this field contains the email body text. If BroadcastType is ExperienceSiteBanner, this field is empty. If BroadcastType is Slack, this field contains the Slack message."
      },
      "BroadcastCommunicationNumber": {
        "type": "string",
        "description": "Auto-generated number for every BroadcastCommunication record."
      },
      "BroadcastType": {
        "type": "picklist",
        "description": "Medium used to distribute the message."
      },
      "CustomNotificationTypeId": {
        "type": "reference",
        "description": "ID of the custom notification template used to frame the Slack message. Only applies if BroadcastType is Slack."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this object."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "ID of the incident associated with the broadcast communication."
      },
      "Subject": {
        "type": "textarea",
        "description": "If BroadcastType is Alert, this field is the alert message in the format “Incident Alert | <Incident subject> | <Incident Number>.” If BroadcastType is Email, this field is the subject of the email sent. If BroadcastType is ExperienceSiteBanner, this field is empty. If BroadcastType is Slack, this field is in the format “Incident Alert | <Incident Subject>.\""
      }
    },
    "module": "Core Salesforce"
  }
}