{
  "BsgRelationship": {
    "name": "BsgRelationship",
    "description": "Represents a relationship between billing schedule groups to support bundles where one parent billing schedule group has multiple child billing schedule groups.",
    "properties": {
      "AssociatedBsgId": {
        "type": "reference",
        "description": "Required. The ID of the related billing schedule group. In a bundle relationship, this billing schedule group is the child."
      },
      "AssociatedBsgPricing": {
        "type": "picklist",
        "description": "Required. This field describes how the related billing schedule group is priced relative to the primary billing schedule group."
      },
      "AssociatedBsgRole": {
        "type": "picklist",
        "description": "Required. This field describes the role of the related billing schedule group in the relationship."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a billing schedule group record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a billing schedule group relationship record. If this value is null, it’s possible that the user only accessed the billing schedule group relationship record or a related list view (LastReferencedDate), but not viewed the billing schedule group relationship record itself."
      },
      "MainBsgId": {
        "type": "reference",
        "description": "Required. The ID of the primary billing schedule group. In a bundle relationship, this billing schedule group is the parent."
      },
      "MainBsgRole": {
        "type": "picklist",
        "description": "Required. This field describes the role of the primary billing schedule group in the relationship."
      },
      "Name": {
        "type": "string",
        "description": "Required. The auto-generated reference number for the billing schedule relationship."
      },
      "ProductRelationshipTypeId": {
        "type": "reference",
        "description": "The ID of the relationship type between the main and associated billing schedule group."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_bsgrelationship.htm"
  }
}