{
  "FeedItem": {
    "name": "FeedItem",
    "description": "FeedItem represents an entry in the feed, such as changes in a record feed, including text posts, link posts, and content posts.",
    "properties": {
      "BestCommentId": {
        "type": "reference",
        "description": "The ID of the comment marked as best answer on a question post.",
        "format": "salesforce-id",
        "x-object": "FeedComment",
        "maxLength": 18,
        "nullable": true,
        "readOnly": true
      },
      "Body": {
        "type": "textarea",
        "description": "The body of the feed item. Required when Type is TextPost or AdvancedTextPost. Optional when Type is ContentPost or LinkPost.",
        "maxLength": 10000,
        "nullable": true
      },
      "CommentCount": {
        "type": "int",
        "description": "The number of comments associated with this feed item.",
        "nullable": false,
        "readOnly": true
      },
      "ConnectionId": {
        "type": "reference",
        "description": "When a PartnerNetworkConnection modifies a record that is tracked, the CreatedBy field contains the ID of the system administrator. The ConnectionId contains the ID of the PartnerNetworkConnection. Available if Salesforce to Salesforce is enabled for your org.",
        "format": "salesforce-id",
        "x-object": "PartnerNetworkConnection",
        "maxLength": 18,
        "nullable": true,
        "readOnly": true
      },
      "ContentData": {
        "type": "base64",
        "description": "This field was removed in API version 35.0, and is available in earlier versions for backward compatibility only. This field is required if Type is ContentPost. Encoded file data in any format, and can’t be 0 bytes. Setting this field automatically sets Type to ContentPost."
      },
      "ContentDescription": {
        "type": "textarea",
        "description": "This field was removed in API version 35.0, and is available in earlier versions for backward compatibility only. The description of the file specified in ContentData."
      },
      "ContentFileName": {
        "type": "string",
        "description": "This field was removed in API version 35.0, and is available in earlier versions for backward compatibility only. The name of the file uploaded to the feed. Setting ContentFileName automatically sets Type to ContentPost."
      },
      "ContentSize": {
        "type": "int",
        "description": "This field was removed in API version 35.0, and is available in earlier versions for backward compatibility only. This field is the size of the file (in bytes) uploaded to the feed. This field is read-only and is automatically determined during insert."
      },
      "ContentType": {
        "type": "string",
        "description": "This field was removed in API version 35.0, and is available in earlier versions for backward compatibility only. This field is the MIME type of the file uploaded to the feed. This field is read-only and is automatically determined during insert."
      },
      "FeedPostId": {
        "type": "reference",
        "description": "This field was removed in API version 22.0, and is available in earlier versions for backward compatibility only. ID of the associated FeedPost. A FeedPost represents the following types of changes in a feed item: changes to tracked fields, text posts, link posts, and content posts."
      },
      "HasContent": {
        "type": "boolean",
        "description": "Indicates whether the feed item has content.",
        "nullable": false,
        "readOnly": true
      },
      "HasFeedEntity": {
        "type": "boolean",
        "description": "Indicates whether the feed item has a feed entity, for example, a post, as an attachment. Available in API version 39 and later when sharing a feed entity in Lightning Experience.",
        "nullable": false,
        "readOnly": true
      },
      "HasLink": {
        "type": "boolean",
        "description": "Indicates whether the feed item has a link attached.",
        "nullable": false,
        "readOnly": true
      },
      "HasVerifiedComment": {
        "type": "boolean",
        "description": "Determines whether a question has an answer that is marked as Company Verified.This field is available in API version 41.0 and later.",
        "nullable": false,
        "readOnly": true
      },
      "InsertedById": {
        "type": "reference",
        "description": "ID of the user who added this item to the feed. For example, if an application migrates posts and comments from another application into a feed, the InsertedBy value is set to the ID of the context user.",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "IsClosed": {
        "type": "boolean",
        "description": "As of API version 43, a read-only field that indicates whether the feed item is open or closed to new actions. A value of true places restrictions on the actions a user can take on a feed item and its comments. For more information, see the Usage section.",
        "nullable": false,
        "readOnly": true
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Standard system field. Indicates whether the record has been moved to the Recycle Bin (true) or not (false).",
        "nullable": false,
        "readOnly": true
      },
      "IsRichText": {
        "type": "boolean",
        "description": "Indicates whether the feed item Body contains rich text. If you post a rich text feed comment using SOAP API, set IsRichText to true and escape HTML entities from the body. Otherwise, the post is rendered as plain text.Rich text supports the following HTML tags: <p> Tip Though the <br> tag isn’t supported, you can use <p>&nbsp;</p> to create lines. <a> <b> <code> <i> <u> <s> <ul> <ol> <li> <img>The <img> tag is accessible only through the API and must reference files in Salesforce similar to this example: <img src=\"sfdc://069B0000000omjh\"></img> Note In API version 35.0 and later, the system replaces special characters in rich text with escaped HTML. In API version 34.0 and prior, all rich text appears as a plain-text representation.",
        "nullable": false
      },
      "LastEditById": {
        "type": "reference",
        "description": "ID of the user who last edited the feed item.",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": true,
        "readOnly": true
      },
      "LastEditDate": {
        "type": "datetime",
        "description": "The date the feed item was last edited.",
        "format": "date-time",
        "nullable": true,
        "readOnly": true
      },
      "LikeCount": {
        "type": "int",
        "description": "The number of likes associated with this feed item.",
        "nullable": false,
        "readOnly": true
      },
      "LinkUrl": {
        "type": "url",
        "description": "The URL of a LinkPost.",
        "format": "uri",
        "maxLength": 1000,
        "nullable": true,
        "readOnly": true
      },
      "NetworkScope": {
        "type": "picklist",
        "description": "Specifies whether this feed item is available in the default Experience Cloud site, a specific Experience Cloud site, or all sites. This field is available in API version 26.0 and later, if digital experiences is enabled for your org. NetworkScope can have the following values: NetworkId—The ID of the Experience Cloud site in which the FeedItem is available. If left empty, the feed item is only available in the default Experience Cloud site. AllNetworks—The feed item is available in all Experience Cloud sites. Note the following exceptions for NetworkScope: Only feed items with a Group or User parent can set a NetworkId or a null value for NetworkScope. For feed items with a record parent, users can set NetworkScope only to AllNetworks. You can’t filter a feed item on the NetworkScope field.",
        "format": "enum",
        "enum": [
          "AllNetworks"
        ],
        "maxLength": 40,
        "nullable": true,
        "readOnly": true
      },
      "ParentId": {
        "type": "reference",
        "description": "ID of the object type to which the feed item is related. For example, set this field to a UserId to post to someone’s profile feed, or an AccountId to post to a specific account.",
        "format": "salesforce-id",
        "x-objects": [
          "AD2C_propagerAffaireDistributeur__c",
          "Account",
          "Account_Opportunity_Junction__c",
          "ActionPlan",
          "ActivationTarget",
          "ActivationTrgtIntOrgAccess",
          "ApiAnomalyEventStore",
          "AssessmentIndicatorDefinition",
          "AssessmentTask",
          "AssessmentTaskContentDocument",
          "AssessmentTaskDefinition",
          "AssessmentTaskIndDefinition",
          "AssessmentTaskOrder",
          "Asset",
          "AssetContactRole__c",
          "AssetRelationship",
          "AuthorizationFormText",
          "BatchJob",
          "BatchJobPart",
          "BatchJobPartFailedRecord",
          "BenefitManagementRecertification__c",
          "BusinessLicense",
          "Campaign",
          "CampainTestCase__c",
          "Case",
          "CollaborationGroup",
          "CommSubscription",
          "CommSubscriptionChannelType",
          "CommSubscriptionConsent",
          "CommSubscriptionTiming",
          "Contact",
          "ContentDocument",
          "Contract",
          "ContractLineItem",
          "CredentialStuffingEventStore",
          "Dashboard",
          "DashboardComponent",
          "DataStream",
          "DocumentChecklistItem",
          "EngagementChannelType",
          "EnhancedLetterhead",
          "Entitlement",
          "EntityMilestone",
          "Entity__c",
          "Event",
          "GlobalSettings__c",
          "INSEE__c",
          "Image",
          "In_App_Checklist_Settings__c",
          "IndividualApplication",
          "Knowledge__ka",
          "Lead",
          "LinkedArticle",
          "Location",
          "LogEntryTag__c",
          "LogEntry__c",
          "Log__c",
          "LoggerScenario__c",
          "LoggerSettings__c",
          "LoggerTag__c",
          "MarketSegment",
          "MarketSegmentActivation",
          "MessagingSession",
          "NewObject__c",
          "Opportunity",
          "Order",
          "OrderItem",
          "OrgBypass__c",
          "PartyConsent",
          "Product2",
          "ProductCatalog",
          "ProductCategory",
          "ProductFulfillmentLocation",
          "ProductRequest",
          "ProductRequestLineItem",
          "ProfileSkill",
          "ProfileSkillEndorsement",
          "ProfileSkillUser",
          "Quote",
          "RFC_Bouchon_V1_getPersonneById_contact__c",
          "RedirectionURLCinkevol__c",
          "ReferenceAffaire__c",
          "ReferenceQueue__c",
          "RegionalDirectorate__c",
          "Report",
          "ReportAnomalyEventStore",
          "ServiceContract",
          "ServicePoint__c",
          "SessionHijackingEventStore",
          "Site",
          "SocialPost",
          "Solution",
          "Task",
          "TaskTypeMapping__c",
          "TeamMember__c",
          "ThreatDetectionFeedback",
          "Topic",
          "User",
          "Visit",
          "VisitedParty",
          "Visitor",
          "WorkBadgeDefinition",
          "WorkOrder",
          "WorkOrderLineItem",
          "WorkPlan",
          "WorkPlanTemplate",
          "WorkPlanTemplateEntry",
          "WorkStep",
          "WorkStepTemplate",
          "WorkTypeGroup",
          "canalDeContact__c",
          "omnistudio__CardFrameworkConfiguration__c",
          "omnistudio__DRBatchQueue__c",
          "omnistudio__DRBulkData__c",
          "omnistudio__DREncryption__c",
          "omnistudio__DRWorker__c",
          "omnistudio__Interface_DRGeneric__c",
          "omnistudio__TestResult__c",
          "omnistudio__TriggerSetup__c",
          "omnistudio__UISettings__c",
          "omnistudio__VlocityDataPack__c",
          "omnistudio__VlocityDocuSignTemplate__c",
          "omnistudio__VlocityErrorLogEntry__c",
          "omnistudio__VlocityScheduledJob__c",
          "omnistudio__VlocityTrackingEntry__c"
        ],
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "ID of the ContentVersion record associated with a ContentPost. For WDC thanks posts, it’s the ID of the WorkThanks object associated with a RypplePost. This field is typically null for all posts except ContentPost and RypplePost.For example, set this field to an existing ContentVersion ID and post it to a feed with Type set to ContentPost.",
        "format": "salesforce-id",
        "x-objects": [
          "ContentVersion",
          "ProfileSkillUser",
          "WorkThanks"
        ],
        "maxLength": 18,
        "nullable": true,
        "readOnly": true
      },
      "Revision": {
        "type": "int",
        "description": "The revision number of the feed item.",
        "nullable": true,
        "readOnly": true
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies whether this feed item is published and visible to all who can access the feed. This field is available in API version 37.0 and later.",
        "format": "enum",
        "enum": [
          "Published",
          "PendingReview",
          "Draft",
          "Isolated"
        ],
        "maxLength": 40,
        "nullable": true
      },
      "Title": {
        "type": "string",
        "description": "The title of the feed item. When the Type is LinkPost, the LinkUrl is the URL and this field is the link name. The Title field can be updated on posts of Type QuestionPost.",
        "maxLength": 255,
        "nullable": true
      },
      "Type": {
        "type": "picklist",
        "description": "The type of feed item. Except for ContentPost, LinkPost, QuestionPost, and TextPost, all the FeedItem types listed here are system-generated. In most situations, we recommend that you don't create system-generated fields using Apex or our APIs. One exception is during Chatter data migrations, which can require admins to migrate system-generated post types. ActivityEvent—indirectly generated event when a user or the API adds a Task associated with a feed-enabled parent record (excluding email tasks on cases). Also occurs when a user or the API adds or updates a Task or Event associated with a case record (excluding email and call logging). For a recurring Task with CaseFeed disabled, one event is generated for the series only. For a recurring Task with CaseFeed enabled, events are generated for the series and each occurrence. AdvancedTextPost—created when a user posts a group announcement and, in Lightning Experience as of API version 39.0 and later, when a user shares a post. AnnouncementPost—Not used. ApprovalPost—generated when a user submits an approval. BasicTemplateFeedItem—Not used. CanvasPost—a post made by a canvas app posted on a feed. CollaborationGroupCreated—generated when a user creates a public group. CollaborationGroupUnarchived—Not used. ContentPost—a post with an attached file. CreatedRecordEvent—generated when a user creates a record from the publisher. DashboardComponentAlert—generated when a dashboard metric or gauge exceeds a user-defined threshold. DashboardComponentSnapshot—created when a user posts a dashboard snapshot on a feed. LinkPost—a post with an attached URL. PollPost—a poll posted on a feed. ProfileSkillPost—generated when a skill is added to a user’s Chatter profile. QuestionPost—generated when a user posts a question. ReplyPost—generated when Chatter Answers posts a reply. RypplePost—generated when a user creates a Thanks badge in WDC. TextPost—a direct text entry on a feed. TrackedChange—a change or group of changes to a tracked field. UserStatus—automatically generated when a user adds a post. Deprecated. The following values appear in the Type picklist for all feed objects but apply only to CaseFeed: AttachArticleEvent—generated event when a user attaches an article to a case. CallLogPost—generated event when a user logs a call for a case through the user interface. CTI calls also generate this event. CaseCommentPost—generated event when a user adds a case comment for a case object. ChangeStatusPost—generated event when a user changes the status of a case. ChatTranscriptPost—generated event when Chat transcript is saved to a case. EmailMessageEvent—generated event when an email related to a case object is sent or received. FacebookPost—generated when a Facebook post is created from a case. Deprecated. MilestoneEvent—generated when a case milestone is completed or reaches violation status. SocialPost—generated when a social post is created from a case. Note If you set Type to ContentPost, also specify ContentData and ContentFileName.",
        "format": "enum",
        "enum": [
          "TrackedChange",
          "UserStatus",
          "TextPost",
          "AdvancedTextPost",
          "LinkPost",
          "ContentPost",
          "PollPost",
          "RypplePost",
          "ProfileSkillPost",
          "DashboardComponentSnapshot",
          "ApprovalPost",
          "CaseCommentPost",
          "ReplyPost",
          "EmailMessageEvent",
          "CallLogPost",
          "ChangeStatusPost",
          "AttachArticleEvent",
          "MilestoneEvent",
          "ActivityEvent",
          "ChatTranscriptPost",
          "CollaborationGroupCreated",
          "CollaborationGroupUnarchived",
          "SocialPost",
          "QuestionPost",
          "FacebookPost",
          "BasicTemplateFeedItem",
          "CreateRecordEvent",
          "CanvasPost",
          "AnnouncementPost"
        ],
        "maxLength": 40,
        "nullable": true,
        "readOnly": true
      },
      "Visibility": {
        "type": "picklist",
        "description": "Specifies whether this feed item is available to all users or internal users only. This field is available in API version 26.0 and later, if digital experiences is enabled for your org. Visibility can have the following values: AllUsers—The feed item is available to all users who have permission to see the feed item. InternalUsers—The feed item is available to internal users only. Note the following exceptions for Visibility: For record posts, Visibility is set to InternalUsers for all internal users by default. External users can set Visibility only to AllUsers. Visibility can be updated on record posts. The Update property is supported only for feed items posted on records.",
        "format": "enum",
        "enum": [
          "AllUsers",
          "InternalUsers"
        ],
        "maxLength": 40,
        "nullable": true
      },
      "Id": {
        "type": "string",
        "description": "Feed Item ID",
        "format": "salesforce-id",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "CreatedById": {
        "type": "string",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "CreatedDate": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "LastModifiedDate": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "SystemModstamp": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_feeditem.htm",
    "keyPrefix": "0D5",
    "createable": true,
    "updateable": true,
    "deletable": true,
    "queryable": true,
    "searchable": true,
    "childRelationships": [
      {
        "childObject": "Announcement",
        "field": "FeedItemId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "FeedAttachment",
        "field": "FeedEntityId",
        "relationshipName": "FeedAttachments",
        "cascadeDelete": true
      },
      {
        "childObject": "FeedAttachment",
        "field": "RecordId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "FeedComment",
        "field": "FeedItemId",
        "relationshipName": "FeedComments",
        "cascadeDelete": true
      },
      {
        "childObject": "FeedLike",
        "field": "FeedEntityId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "FeedLike",
        "field": "FeedItemId",
        "relationshipName": "FeedLikes",
        "cascadeDelete": true
      },
      {
        "childObject": "FeedPollChoice",
        "field": "FeedItemId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "FeedPollVote",
        "field": "FeedItemId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "FeedRevision",
        "field": "FeedEntityId",
        "relationshipName": "FeedRevisions",
        "cascadeDelete": true
      },
      {
        "childObject": "FeedSignal",
        "field": "FeedEntityId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "FeedSignal",
        "field": "FeedItemId",
        "relationshipName": "FeedSignals",
        "cascadeDelete": true
      },
      {
        "childObject": "FeedTrackedChange",
        "field": "FeedItemId",
        "relationshipName": "FeedTrackedChanges",
        "cascadeDelete": true
      },
      {
        "childObject": "FlowExecutionErrorEvent",
        "field": "ContextRecordId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "FlowRecordRelation",
        "field": "RelatedRecordId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "TopicAssignment",
        "field": "EntityId",
        "relationshipName": "TopicAssignments",
        "cascadeDelete": true
      },
      {
        "childObject": "WorkThanks",
        "field": "FeedItemId",
        "relationshipName": "FeedItemThanks",
        "cascadeDelete": false
      }
    ]
  }
}