{
  "FieldServiceOrgSettings": {
    "name": "FieldServiceOrgSettings",
    "description": "Represents the org settings for Field Service, such as Appointment Assistant settings.",
    "properties": {
      "ApptAssistantExpiration": {
        "type": "int",
        "description": "The expiry time in minutes of when the customer stops seeing the mobile worker’s location. Appointment Assistant must also be enabled to see this field."
      },
      "ApptAssistantInfoUrl": {
        "type": "string",
        "description": "The page URL that enables Appointment Assistant. Appointment Assistant must also be enabled to see this field."
      },
      "ApptAssistantRadiusUnit": {
        "type": "picklist",
        "description": "The unit of the radius of the service appointment that prompts the Last Mile event for Appointment Assistant. Appointment Assistant must also be enabled to see this field."
      },
      "ApptAssistantRadiusValue": {
        "type": "int",
        "description": "The radius of the service appointment that prompts the Last Mile event for Appointment Assistant. Appointment Assistant must also be enabled to see this field."
      },
      "ApptAssistantStatus": {
        "type": "picklist",
        "description": "The value that prompts the En Route event for Appointment Assistant. Appointment Assistant must also be enabled to see this field."
      },
      "CanPopulateGoogleAddress": {
        "type": "boolean",
        "description": "Allows desktop and mobile to send geolocation and map data to Google and Apple. Available in API version 57.0 and later."
      },
      "CanSendAppCenterCrashReports": {
        "type": "boolean",
        "description": "Allows Salesforce to send crash reports to Microsoft App Center. Available in API version 57.0 and later."
      },
      "CanStoreMobileAnalytics": {
        "type": "boolean",
        "description": "Allows third parties to store mobile analytics. Available in API version 57.0 and later."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API."
      },
      "DoesAvlCalcInclOvertime": {
        "type": "boolean",
        "description": "Specifies whether overtime is included in work capacity availability calculations. Available in API version 59.0 and later."
      },
      "DoesAvlCalcInclPrimOnly": {
        "type": "boolean",
        "description": "Specifies if primary members only are included in work capacity availability calculations. If the value is false both primary and secondary members of the service territory are included. Available in API version 59.0 and later."
      },
      "": {
        "type": "",
        "description": ""
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the field service org settings."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label of the field service org settings."
      }
    },
    "module": "Core Salesforce"
  }
}