{
  "FieldDefinition": {
    "name": "FieldDefinition",
    "description": "Represents a standard or custom field, providing row-based access to field metadata. Contrast FieldDefinition with EntityParticle, which represents each element of a field that can be presented in a user interface. FieldDefinition has parity with metadata type Field.",
    "properties": {
      "caseSensitive": {
        "type": "reference",
        "description": "Indicates the person or group associated with this field. The business owner understands the importance of the field’s data to your company and might be responsible for determining the minimum security classification. This field is available in API version 45.0 and later."
      },
      "defaultValue": {
        "type": "picklist",
        "description": "Indicates whether the field is in use. Valid values include: Active DeprecateCandidate Hidden This field is available in API version 45.0 and later."
      },
      "deleteConstraint": {
        "type": "QueryResult",
        "description": "The CompactLayoutItemInfo records associated with this field definition. Available in Tooling API starting version 34.0. Because this field represents a relationship, use only in subqueries."
      },
      "description": {
        "type": "QueryResult",
        "description": "The ServiceDataTypes associated with this field. Available in Tooling API starting version 34.0. Because this field represents a relationship, use only in subqueries."
      },
      "displayFormat": {
        "type": "QueryResult",
        "description": "The controlled fields in a dependent picklist. Use in subqueries to reduce the number of queries. Available in Tooling API starting version 34.0. Because this field represents a relationship, use only in subqueries."
      },
      "displayLocationInDecimal": {
        "type": "FieldDefinition",
        "description": "The field definition of the controlling field if this field is a dependent picklist. A dependent picklist works with a controlling picklist or checkbox to filter the available options. The value chosen in the controlling field affects the values available in the dependent field. This field is available in API version 14.0 and later. Available in Tooling API starting version 34.0."
      },
      "externalDeveloperName": {
        "type": "string",
        "description": "The ID of the ControllingFieldDefinition for this field. Available in Tooling API starting version 34.0."
      },
      "externalId": {
        "type": "string",
        "description": "Data type of the field, for example Text(40) or Date/Time. The values are defined as they are in the user interface, not the corresponding API data type names. Available in Tooling API starting version 34.0."
      },
      "formula": {
        "type": "string",
        "description": "A description of the field definition."
      },
      "formulaTreatBlankAs": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s org. Label is Record Type Name."
      },
      "fullName": {
        "type": "string",
        "description": "The ID of the ValueType. Available in Tooling API version 35.0."
      },
      "indexed": {
        "type": "EntityDefinition",
        "description": "A relationship lookup to the object type that contains this field. For example, if the field is defined on an account, the lookup is to Account. You can’t interact directly with this field. Instead, use it in queries. SELECT Entity​Definition.​Label FROM Field​Definition WHERE Entity​Definition.​QualifiedApi​Name='Lead'"
      },
      "inlineHelpText": {
        "type": "string",
        "description": "The durable ID for the object defined in the EntityDefinition field."
      },
      "isFilteringDisabled": {
        "type": "string",
        "description": "Represents further definition of a type. Available in Tooling API starting version 34.0. For type textarea: plaintextarea richtextarea For type URL, image For type reference, externallookup indirectlookup externallookup For Account, switchablepersonname personname"
      },
      "isNameField": {
        "type": "string",
        "description": "The full name of the associated metadata object in Metadata API."
      },
      "isSortingDisabled": {
        "type": "boolean",
        "description": "If true, the field can be specified in the WHERE clause of a query string."
      },
      "reparentableMasterDetail": {
        "type": "boolean",
        "description": "If true, the field can be included in the GROUP BY clause of a SOQL query. Available in Tooling API starting version 34.0."
      },
      "label": {
        "type": "boolean",
        "description": "If true, a query can sort on this field."
      },
      "length": {
        "type": "boolean",
        "description": "If true, the field’s value is calculated. Available in Tooling API starting version 34.0."
      },
      "lookupFilter": {
        "type": "boolean",
        "description": "If true, the field can be included in a compact layout. Available in Tooling API starting version 34.0."
      },
      "maskChar": {
        "type": "boolean",
        "description": "If true, the field is a compound of other fields. The default value is false. Available in Tooling API starting version 38.0."
      },
      "maskType": {
        "type": "boolean",
        "description": "If true, the field is describable in the API. The default value is false. Available in Tooling API starting version 49.0."
      },
      "picklist": {
        "type": "boolean",
        "description": "If true, the field’s history can be tracked. Available in Tooling API starting version 34.0."
      },
      "populateExistingRows": {
        "type": "boolean",
        "description": "If true, you can set field-level security on this field. Available in Tooling API starting version 35.0."
      },
      "precision": {
        "type": "boolean",
        "description": "Indicates whether the field stores numbers to eight decimal places regardless of what’s specified in the field details (true) or not (false). Used to handle currencies for products that cost fractions of a cent, in large quantities. If high-scale unit pricing isn’t enabled in your organization, this field isn’t returned. Available in Tooling API starting version 34.0."
      },
      "referenceTargetField": {
        "type": "boolean",
        "description": "If true, the field contains HTML. Available in Tooling API starting version 34.0."
      },
      "referenceTo": {
        "type": "boolean",
        "description": "If true, the field is indexed in the database. Available in Tooling API version 35.0 and later."
      },
      "relationshipLabel": {
        "type": "boolean",
        "description": "If true, the field can be filtered for a related list. Available in Tooling API starting version 34.0."
      },
      "relationshipName": {
        "type": "boolean",
        "description": "If true, the field can be sorted for a related list. Available in Tooling API starting version 34.0."
      },
      "relationshipOrder": {
        "type": "boolean",
        "description": "If true, the field can be included in a related list. Available in Tooling API starting version 34.0."
      },
      "required": {
        "type": "boolean",
        "description": "If true, the field is a name field. Available in Tooling API starting version 34.0."
      },
      "scale": {
        "type": "boolean",
        "description": "If true, the field can be left out of queries on the object. Available in Tooling API starting version 34.0."
      },
      "startingNumber": {
        "type": "boolean",
        "description": "Indicates whether the foreign key includes multiple object types (true) or not (false). Available in Tooling API version 41.0 and later."
      },
      "stripMarkup": {
        "type": "boolean",
        "description": "Indicates whether a foreign key can be included in prefiltering (true) or not (false) when used in a SOSL WHERE clause. Prefiltering means to filter by a specific field value before executing the full search query. Available in Tooling API version 40.0 and later. Prefiltering is supported only in WHERE clauses with the equals (=) operator."
      },
      "summarizedField": {
        "type": "boolean",
        "description": "If true, the field can be filtered for a workflow. Available in Tooling API starting version 34.0."
      },
      "summaryForeignKey": {
        "type": "string",
        "description": "The label that corresponds to the field in the user interface. If the label has been translated, the value returned is in the user’s language."
      },
      "summaryOperation": {
        "type": "int",
        "description": "The maximum number of bytes available to store the value in this field. Available in Tooling API starting version 34.0."
      },
      "trackFeedHistory": {
        "type": "QueryResult",
        "description": "The lookup filters associated with the field. Because this field represents a relationship, use only in subqueries."
      },
      "trackHistory": {
        "type": "string",
        "description": "Primary label for this object. This display value is the internal label that isn’t translated. Limit: 40 characters."
      },
      "trackTrending": {
        "type": "CustomField",
        "description": "Compact layout metadata, from the mns namespace."
      },
      "trueValueIndexed": {
        "type": "string",
        "description": "The namespace prefix associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation.The namespace prefix can have one of the following values: In a Developer Edition org, the namespace prefix is set to the namespace prefix of the org for all objects that support it. There’s an exception if an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In an org other than a Developer Edition org, NamespacePrefix is only set for objects that are part of an installed managed package. There’s no namespace prefix for all other objects."
      },
      "type": {
        "type": "QueryResult",
        "description": "The EntityParticles associated with this field. Available in Tooling API starting version 34.0. Because this field represents a relationship, use only in subqueries."
      },
      "unique": {
        "type": "int",
        "description": "The maximum number of digits allowed for this field. Available in Tooling API starting version 34.0."
      },
      "visibleLines": {
        "type": "Publisher",
        "description": "The publisher of this field, for example Salesforce, a user, or a package name. Available in Tooling API starting version 34.0."
      },
      "writeRequiresMasterRead": {
        "type": "string",
        "description": "ID of the publisher associated with this field. Available in Tooling API starting version 34.0."
      },
      "controllingField": {
        "type": "string",
        "description": "A unique external name for the field."
      },
      "picklistValues": {
        "type": "string",
        "description": "Available only for indirect lookup relationship fields on external objects. Specifies the field on the parent object to match against this indirect lookup relationship field, whose values come from an external data source. The specified custom field on the parent object must have both externalId and unique set to true. Available in Tooling API starting version 34.0."
      },
      "sorted": {
        "type": "RelationshipReferenceTo",
        "description": "The array of values in this field represents the possible object types of the referenced objects. For example, if a FieldDefinition represents a field on Event.WhoId, the values in this field are Contact, Lead, and custom objects with a relationship to Events. Available in Tooling API starting version 34.0."
      },
      "allowEmail": {
        "type": "QueryResult",
        "description": "Metadata about the relationships this field has with other objects. Available in Tooling API starting version 34.0. Because this field represents a relationship, use only in subqueries."
      },
      "closed": {
        "type": "string",
        "description": "The value for one-to-many relationships. For example, in the object MyObject with a relationship to YourObject, the relationship name is typically YourObjects. Available in Tooling API starting version 34.0."
      },
      "color": {
        "type": "string",
        "description": "Reserved for internal use. Available in Tooling API starting version 34.0."
      },
      "controllingFieldValues": {
        "type": "int",
        "description": "The number of digits to the right of the decimal in an integer. For example, 3.00 has a scale of 2. Available in Tooling API starting version 34.0."
      },
      "converted": {
        "type": "picklist",
        "description": "Indicates the sensitivity of the data contained in this field. Valid values include: Public Internal Confidential Restricted MissionCritical This field is available in API version 45.0 and later."
      },
      "cssExposed": {
        "type": "DataType",
        "description": "The service datatype for this field. Available in Tooling API starting version 34.0."
      },
      "default": {
        "type": "string",
        "description": "The ID of the ServiceDataType. Available in Tooling API version 34.0. Don’t use, provided for backward compatibility only."
      },
      "forecastCategory": {
        "type": "DataType",
        "description": "The data type of the field. Available in Tooling API version 35.0."
      },
      "highPriority": {
        "type": "QueryResult",
        "description": "The workflow field updates for this field. Field updates allow you to automatically update a field value to one that you specify when a workflow rule is triggered. Available in Tooling API starting version 34.0. Because this field represents a relationship, use only in subqueries."
      },
      "probability": {
        "type": "",
        "description": ""
      },
      "reverseRole": {
        "type": "",
        "description": ""
      },
      "reviewed": {
        "type": "",
        "description": ""
      },
      "won": {
        "type": "",
        "description": ""
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_fielddefinition.htm"
  }
}