{
  "FinServ AccountContactRelation Custom Fields": {
    "name": "FinServ AccountContactRelation Custom Fields",
    "description": "Represents the relationship between an individual (specifically the contact part of the individual) and the household (account) that the individual is a member of. AccountContactRelation is a standard object that is available through the Shared Contacts feature. Custom fields extend the AccountContactRelation standard object for use in Financial Services Cloud.",
    "properties": {
      "DecisionMakingAuthorityType": {
        "type": "multipicklist",
        "description": "Specifies the type of the decision-making authority."
      },
      "DeclarationType": {
        "type": "multipicklist",
        "description": "Specifies the formal manner or approach used to officially state the stakeholder's role or position."
      },
      "IsDecisionMakingAuthority": {
        "type": "boolean",
        "description": "Indicates whether the stakeholder is a decision-making authority (true) or not (false)."
      },
      "IncludeInGroup__c": {
        "type": "boolean",
        "description": "Includes this account in a related individual's primary group."
      },
      "IsShareholder": {
        "type": "boolean",
        "description": "Indicates whether the stakeholder is a shareholder (true) or not (false)."
      },
      "Primary__c": {
        "type": "boolean",
        "description": "Indicates the primary member of a group (true) or not (false)."
      },
      "PrimaryGroup__c": {
        "type": "boolean",
        "description": "Indicates a person's primary group. You can roll up summary fields only to a person’s primary group if PrimaryGroup__c is set to true."
      },
      "Rollups__c": {
        "type": "multipicklist",
        "description": "Records associated with the individual that are included in household roll-up summaries. Valid values: All Tasks Events Financial Accounts Assets and Liabilities Financial Goals"
      },
      "ShareholderHierarchyLevel": {
        "type": "int",
        "description": "Specifies the hierarchical level between the account and the intermediate shareholder. The shareholder hierarchy level is applicable only to an intermediate share holder."
      },
      "ShareholderHierarchyRole": {
        "type": "picklist",
        "description": "Specifies the shareholder's ownership type."
      },
      "ShareholderType": {
        "type": "multipicklist",
        "description": "Specifies the type of the shareholder."
      },
      "StartDate": {
        "type": "date",
        "description": "The date when the relationship between the applicant and the related applicant started."
      },
      "SourceSystemId__c": {
        "type": "string",
        "description": "ID that uniquely identifies the individual in an external data source."
      },
      "TotalSharePercent": {
        "type": "percent",
        "description": "The total percentage of shares owned by the stakeholder, combining both direct and indirect ownership."
      }
    },
    "module": "Financial Services Cloud"
  }
}