{
  "FinServ_FinancialAccountRole__c": {
    "name": "FinServ_FinancialAccountRole__c",
    "description": "Represents the role occupied by a person or organizational entity that is involved with a financial account, such as a beneficiary or trustee.",
    "properties": {
      "Active__c": {
        "type": "boolean",
        "description": "Indicates whether the organizational entity or person currently occupies this role (true) or not (false)."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "If multiple currencies is enabled, contains the currency ISO code associated with the record."
      },
      "Editable__c": {
        "type": "boolean",
        "description": "Indicates whether this field is editable (true) or not (false)."
      },
      "EndDate__c": {
        "type": "date",
        "description": "End date when the organizational entity or person relinquished this role."
      },
      "FinancialAccount__c": {
        "type": "reference",
        "description": "Financial account that this role is related to."
      },
      "Name": {
        "type": "string",
        "description": "Name of the financial account role."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "ID of the record type associated with this financial account role."
      },
      "RelatedAccount__c": {
        "type": "reference",
        "description": "Name of the organizational entity that is involved with the financial account."
      },
      "RelatedContact__c": {
        "type": "reference",
        "description": "Name of the person who is involved with the financial account."
      },
      "Role__c": {
        "type": "picklist",
        "description": "Role that describes how the organizational entity or person is involved with the financial account. Don’t manually update the role to either primary owner or secondary owner, because these roles are automatically assigned based on the primary owner and joint owner of the corresponding financial account record. Valid values: When the record type is set to Account Role: Accountant Additional Owner Administrator Advisor Annuitant Appoint / Remove Authority Authorized Agent Authorized Agent / Beneficial Owner Authorized Individual Authorized Signer Beneficiary Business Manager Committee Member Conservator Control Person Corporation Custodian Deceased Grantor Decedent Discretionary Foundation Full Authority Grantor Guardian Insured Interested Party Minor Primary Owner Original Depositor Other Power of Attorney Proprietor TOD Beneficiary Trustee Primary Owner Joint Owner When the record type is set to Contact Role: Accountant Beneficial Owner Beneficiary Business Manager Grantor Trustee"
      },
      "SourceSystemId__c": {
        "type": "string",
        "description": "ID that uniquely identifies the role in an external data source."
      },
      "StartDate__c": {
        "type": "date",
        "description": "Start date when the organizational entity or person assumed this role. The default value is the current date."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_financialaccountrole.htm"
  }
}