{
  "FldSvcObjChg": {
    "name": "FldSvcObjChg",
    "description": "Represents a change made to one of a service appointment’s tracked fields.",
    "properties": {
      "Activity": {
        "type": "picklist",
        "description": "The available scheduling activities for the service appointment."
      },
      "ActivityDetails": {
        "type": "string",
        "description": "Details about the scheduling activity such as the scheduling policy that was used and the unscheduling reason (when applicable)."
      },
      "ActivityTimeStamp": {
        "type": "dateTime",
        "description": "Date and time of when the change to the service appointment was made."
      },
      "IsPrimary": {
        "type": "boolean",
        "description": "Indicates whether the change was made directly to the service appointment or indirectly. If the change was made directly to the appointment, it’s flagged as Primary. If it was made to another appointment and affected this one, it’s flagged as Secondary."
      },
      "OriginalSvcAppointment": {
        "type": "string",
        "description": "The ID of the service appointment that was changed. The field value isn’t deleted when the Service Appointment object is deleted."
      },
      "ServiceAppointmentId": {
        "type": "reference",
        "description": "The ID of the service appointment that was changed. Because this is a relationship field, the field value is deleted when the Service Appointment object is deleted."
      },
      "TimeZone": {
        "type": "picklist",
        "description": "The time zone of the service appointment or the assigned resource."
      },
      "Transaction": {
        "type": "string",
        "description": "The last transaction ID of the scheduling and optimization request that updated this object. The transaction ID is automatically generated and populated by the Enhanced Scheduling and Optimization engine."
      },
      "UserId": {
        "type": "reference",
        "description": "The user who made the change to the service appointment. If an activity is a scheduled job, it’s registered with the System Administrator user who configured it."
      }
    },
    "module": "Field Service Lightning",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.field_service_dev.meta/field_service_dev/sforce_api_objects_fldsvcobjchg.htm"
  }
}