{
  "FlowInterview": {
    "name": "FlowInterview",
    "description": "Represents a flow interview. A flow interview is a running instance of a flow. This object is available in API version 32.0 and later.",
    "properties": {
      "CurrentElement": {
        "type": "string",
        "description": "The flow element at which the interview is paused."
      },
      "FlowVersionViewId": {
        "type": "string",
        "description": "This field is a relationship field. This field is available in API version 51.0 and later."
      },
      "Guid": {
        "type": "string",
        "description": "Globally unique identifier for the interview."
      },
      "InterviewLabel": {
        "type": "string",
        "description": "Label for the interview. This label helps users and administrators differentiate interviews from the same flow. In the user interface, this label appears in the Paused Flow Interviews component on the user’s Home tab and in the list of paused flow interviews in Setup."
      },
      "InterviewStatus": {
        "type": "picklist",
        "description": "Status of the interview. Valid values are: Completed—This flow is complete. There are no more records to process. Error—This flow has one or more errors. To resolve each error, check the error code for instructions. Paused—This flow is paused. No new processes are added until the flow is resumed. Running—This flow is running or is ready to run. VersionPaused—This flow version is paused. No more records are processed until the flow is resumed. This value is available in API version 60.0 and later. This field is available in API version 50.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "The name for the interview."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns the interview. Only this user or an admin can resume the interview."
      },
      "PauseLabel": {
        "type": "string",
        "description": "Information about why the interview was paused. This string is entered by the user who paused the flow interview. The label is Why Paused."
      },
      "WasPausedFromScreen": {
        "type": "boolean",
        "description": "Whether the flow interview was paused by a user from a flow Screen element (true ) or not (false ). This field is available in API version 46.0 and later."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_flowinterview.htm"
  }
}