{
  "ForecastingFact": {
    "name": "ForecastingFact",
    "description": "This object is read-only and links a ForecastingItem with its opportunities, such as opportunities that share the same owner or forecast category and have a closing date within the period of the forecasting item.",
    "properties": {
      "ForecastCategoryName": {
        "type": "picklist",
        "description": "A forecast category is the category within the sales cycle to which an opportunity is assigned based on its opportunity stage. The standard forecast categories are Pipeline, Best Case, Commit, Omitted (not included in forecasts), and Closed. Salesforce admins can customize the forecast category names."
      },
      "ForecastedObjectId": {
        "type": "reference",
        "description": "Contains the Split ID of the forecasted OpportunitySplit object if the forecast data source is opportunity splits or the OpportunityLineItem ID of the forecasted opportunity if the data source is product families. If the data source is product families and the opportunity has no line item, this field is null. If the forecast data source is opportunities, this field is null. This field is available in API version 29 and later. Read-only."
      },
      "ForecastedSubObjectId": {
        "type": "reference",
        "description": "Possible values: If the forecast data source is OpportunityLineItemSplit, and the opportunity has line items and line item splits, then this field contains the ID of the forecasted OpportunityLineItemSplit object. If the forecast data source is OpportunityLineItemSplit, and the opportunity has line items but no line item splits, this field contains the ID of the forecasted OpportunitySplit object. If the forecast data source is OpportunityLineItemSchedule, this field contains the OpportunityLineItemSchedule ID of the forecasted opportunity. If the forecast data source is OpportunityLineItemSplit and the opportunity has no line item, this field is null. If the forecast data source is OpportunityLineItemSchedule and the opportunity has no line item, this field is null."
      },
      "ForecastingItemId": {
        "type": "reference",
        "description": "The ID of the ForecastingItem."
      },
      "ForecastingTypeId": {
        "type": "reference",
        "description": "The ID of the related ForecastingType."
      },
      "OpportunityId": {
        "type": "reference",
        "description": "The opportunity ID."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the opportunity owner."
      },
      "PeriodId": {
        "type": "reference",
        "description": "Period ID for the forecast."
      },
      "TargetValue": {
        "type": "double",
        "description": "Target value of the forecast amount."
      },
      "Territory2Id": {
        "type": "reference",
        "description": "The ID of the territory to forecast on. Available in API version 43 and later."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_forecastingfact.htm"
  }
}