{
  "ForecastingQuota": {
    "name": "ForecastingQuota",
    "description": "This object represents an individual user’s or territory’s quota for a specified time period.",
    "properties": {
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "The currency code of the quota. If omitted, the default is the importing user’s personal currency."
      },
      "ForecastingGroupItemId": {
        "type": "reference",
        "description": "If a forecast group is assigned to the forecast type, the ID of the group value that the quota belongs to. This field is a relationship field. Available in API version 60.0 and later."
      },
      "ForecastingTypeId": {
        "type": "reference",
        "description": "The ID of the related ForecastingType."
      },
      "IsAmount": {
        "type": "boolean",
        "description": "If true, then the adjustment is made in a revenue amount. If false, then IsQuantity must be true. This field is available in API version 28.0 and later."
      },
      "IsQuantity": {
        "type": "boolean",
        "description": "If true, then the adjustment is made in a quantity amount. If false, then IsAmount must be true. This field is available in API version 28.0 and later."
      },
      "PeriodId": {
        "type": "reference",
        "description": "Period ID for the quota. Read only."
      },
      "ProductFamily": {
        "type": "picklist",
        "description": "The product family for the quota. This field is available in API version 29.0 and later."
      },
      "QuotaAmount": {
        "type": "currency",
        "description": "The revenue quota amount for an individual user or territory and for a specific period."
      },
      "QuotaOwnerId": {
        "type": "reference",
        "description": "ID that identifies the quota owner."
      },
      "QuotaQuantity": {
        "type": "double",
        "description": "The quantity quota amount for an individual user and for a specific period. This field is available in API version 28.0 and later."
      },
      "StartDate": {
        "type": "date",
        "description": "The start of the quota, expressed as month and year. The date can include any day in a given month. Stored using the first date of the month."
      },
      "Territory2Id": {
        "type": "reference",
        "description": "The ID of the territory to forecast on. Available in API version 43.0 and later."
      },
      "": {
        "type": "",
        "description": ""
      }
    },
    "module": "Core Salesforce"
  }
}