{
  "ForecastingSubmissionItem": {
    "name": "ForecastingSubmissionItem",
    "description": "Represents the values for each forecast category in a submitted forecast.",
    "properties": {
      "Amount": {
        "type": "currency",
        "description": "For forecasting types that use Amount as the measure, the amount for the forecast category. Amounts must be provided in the corporate currency."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "The currency code of the forecast submission. If omitted, the default is USD."
      },
      "ForecastingItemCategory": {
        "type": "picklist",
        "description": "The category the forecast belongs to. For individual forecast category rollups, the possible values are: PipelineOnly—Rollup from Pipeline opportunities only. BestCaseOnly—Rollup from Best Case opportunities only. MostLikelyOnly—Rollup from Most Likely opportunities only. CommitOnly —Rollup from Commit opportunities only. For cumulative forecast rollups, the possible values are: OpenPipeline—Rollup from Pipeline, Best Case, Most Likely, and Commit opportunities. BestCaseForecast —Rollup from Best Case, Most Likely, Commit, and Closed opportunities. MostLikelyForecast—Rollup from Most Likely, Commit, and Closed opportunities. CommitForecast —Rollup from Commit and Closed opportunities. For either cumulative or individual forecast category rollups, the possible values are: ClosedOnly—Rollup from Closed opportunities only."
      },
      "ForecastingSubmissionId": {
        "type": "reference",
        "description": "The ID of the forecast submission."
      },
      "Name": {
        "type": "string",
        "description": "For internal use only. The ID of this record."
      },
      "Quantity": {
        "type": "double",
        "description": "For forecasting types that use Quantity as the measure, the quantity for the forecast category. Quantities must be provided in the corporate currency."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_forecastingsubmissionitem.htm"
  }
}