{
  "FulfillmentOrder": {
    "name": "FulfillmentOrder",
    "description": "Represents a group of products, fees, and delivery charges on a single order that share the same fulfillment location, delivery method, and recipient. The FulfillmentOrderLineItems belonging to a FulfillmentOrder are associated with OrderItemSummary objects belonging to a single OrderSummary.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "ID of the Account or Person Account associated with the FulfillmentOrder. It represents the shopper in the storefront."
      },
      "ActiveDate": {
        "type": "datetime",
        "description": "Date when the FulfillmentOrder becomes active."
      },
      "BillToContactId": {
        "type": "reference",
        "description": "ID of the Contact associated with the FulfillmentOrder. It represents the shopper in the storefront when not using person accounts."
      },
      "ClosedDate": {
        "type": "datetime",
        "description": "Date the FulfillmentOrder closed. Automatically entered."
      },
      "CurrencyIsoCode": {
        "type": "picklist",
        "description": "Available only for orgs with the multicurrency feature enabled. ISO code for the currency of the OrderSummary associated with the FulfillmentOrder."
      },
      "DeliveryDate": {
        "type": "datetime",
        "description": "The date and time when the FulfillmentOrder was delivered."
      },
      "DeliveryMethodId": {
        "type": "reference",
        "description": "ID of the DeliveryMethod used for this FulfillmentOrder."
      },
      "FulfilledFromLocationId": {
        "type": "reference",
        "description": "ID of the Location handling this FulfillmentOrder."
      },
      "FulfilledToAddress": {
        "type": "address",
        "description": "Address of the recipient."
      },
      "FulfilledToCity": {
        "type": "string",
        "description": "Recipient address city."
      },
      "FulfilledToCountry": {
        "type": "string",
        "description": "Recipient address country."
      },
      "FulfilledToEmailAddress": {
        "type": "email",
        "description": "Email address of the recipient."
      },
      "FulfilledTo​GeocodeAccuracy": {
        "type": "picklist",
        "description": "Accuracy of the geocode for the recipient address."
      },
      "FulfilledToLatitude": {
        "type": "double",
        "description": "Used with FulfilledToLongitude to specify the precise geolocation of the recipient address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "FulfilledToLongitude": {
        "type": "double",
        "description": "Used with FulfilledToLatitude to specify the precise geolocation of the recipient address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "FulfilledToName": {
        "type": "string",
        "description": "Name on the recipient address."
      },
      "FulfilledToPhone": {
        "type": "phone",
        "description": "Phone number of the recipient."
      },
      "FulfilledToPostalCode": {
        "type": "string",
        "description": "Recipient address postal code."
      },
      "FulfilledToState": {
        "type": "string",
        "description": "Recipient address state."
      },
      "FulfilledToStreet": {
        "type": "textarea",
        "description": "Recipient address street."
      },
      "FulfillmentOrderNumber": {
        "type": "string",
        "description": "ID of the FulfillmentOrder."
      },
      "GrandTotalAmount": {
        "type": "currency",
        "description": "Total, including adjustments and tax, of the products, fees, and delivery charges on the FulfillmentOrder. This amount includes all FulfillmentOrderLineItems associated with the FulfillmentOrder. This amount is equal to TotalAmount + TotalTaxAmount."
      },
      "InvoiceId": {
        "type": "reference",
        "description": "ID of the Invoice associated with the FulfillmentOrder."
      },
      "IsReship": {
        "type": "boolean",
        "description": "Indicates whether the FulfillmentOrder is for a reshipment. The default value is false."
      },
      "IsSuspended": {
        "type": "boolean",
        "description": "Indicates whether the FulfillmentOrder is suspended. The default value is false."
      },
      "ItemCount": {
        "type": "double",
        "description": "Sum of the quantities of the FulfillmentOrderLineItems included in the FulfillmentOrder."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "Timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "Timestamp for when the current user last viewed this record. A null value can mean that this record has only been referenced (LastReferencedDate) and not viewed."
      },
      "OrderId": {
        "type": "reference",
        "description": "ID of the original Order that generated the FulfillmentOrder."
      },
      "OrderSummaryId": {
        "type": "reference",
        "description": "ID of the OrderSummary associated with the FulfillmentOrder."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the User who currently owns this FulfillmentOrder. Default value is the User logged in to the API to perform the create."
      },
      "ProcessingTimeInMinutes": {
        "type": "long",
        "description": "How many minutes it took to process the FulfillmentOrder, from the start of processing to completion."
      },
      "StartFulfillmentDate": {
        "type": "datetime",
        "description": "The date and time when the fulfillment process was started for the FulfillmentOrder."
      },
      "Status": {
        "type": "picklist",
        "description": "Status of the FulfillmentOrder. Each status corresponds to one status category, shown here in parentheses. You can customize the status picklist to represent your business processes, but the status category picklist is fixed because processing is based on those values. If you customize the status picklist, include at least one status value for each status category."
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "Status category of the FulfillmentOrder. Processing of the FulfillmentOrder depends on this value. Each status category corresponds to one or more statuses."
      },
      "TaxLocaleType": {
        "type": "picklist",
        "description": "The system used to handle tax on the original Order associated with the FulfillmentOrder. Gross usually applies to taxes like value-added tax (VAT), and Net usually applies to taxes like sales tax."
      },
      "TotalAdjustmentAmount": {
        "type": "currency",
        "description": "Total amount of the price adjustments applied to the products on the FulfillmentOrder. This value only includes adjustments to FulfillmentOrderLineItems of type code Product, not adjustments to delivery charges or fees."
      },
      "TotalAdjustment​AmtWithTax": {
        "type": "currency",
        "description": "Total amount of the price adjustments applied to the products on the Fulfillment Order, inclusive of tax. This value only includes adjustments to FulfillmentOrderLineItems of type code Product. This amount is equal to TotalAdjustmentAmount + TotalAdjustmentTaxAmount."
      },
      "TotalAdjustmentTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalAdjustmentAmount."
      },
      "TotalAmount": {
        "type": "currency",
        "description": "Adjusted total, not including tax, of the FulfillmentOrderLineItems, including products, fees, and delivery charges, on the Fulfillment Order."
      },
      "TotalDelivery​AdjustAmount": {
        "type": "currency",
        "description": "Total amount of the price adjustments applied to the delivery charges on the Fulfillment Order. This value only includes adjustments to FulfillmentOrderLineItems of type Delivery Charge."
      },
      "TotalDeliveryAdjust​AmtWithTax": {
        "type": "currency",
        "description": "Total amount of the price adjustments applied to the delivery charges on the Fulfillment Order, inclusive of tax. This value only includes adjustments to FulfillmentOrderLineItems of type Delivery Charge. This amount is equal to TotalDeliveryAdjustAmount + TotalDeliveryAdjustTaxAmount."
      },
      "TotalDelivery​AdjustTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalDeliveryAdjustAmount."
      },
      "TotalDeliveryAmount": {
        "type": "currency",
        "description": "Total of the delivery charges on the FulfillmentOrder. This value only includes FulfillmentOrderLineItems of type Delivery Charge."
      },
      "TotalDelivery​AmtWithTax": {
        "type": "currency",
        "description": "Total amount of the delivery charges on the FulfillmentOrder, inclusive of tax. This value only includes FulfillmentOrderLineItems of type Delivery Charge. This amount is equal to TotalDeliveryAmount + TotalDeliveryTaxAmount."
      },
      "TotalDeliveryTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalDeliveryAmount."
      },
      "TotalFeeAdjustAmount": {
        "type": "currency",
        "description": "Total amount of the price adjustments applied to the fees on the FulfillmentOrder. This value only includes adjustments to FulfillmentOrderLineItems of type Fee."
      },
      "TotalFeeAdjustAmtWithTax": {
        "type": "currency",
        "description": "Total amount of the price adjustments applied to the fees on the FulfillmentOrder, inclusive of tax. This value only includes adjustments to FulfillmentOrderLineItems of type Fee. This amount is equal to TotalFeeAdjustAmount + TotalFeeAdjustTaxAmount."
      },
      "TotalFeeAdjustTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalFeeAdjustAmount."
      },
      "TotalFeeAmount": {
        "type": "currency",
        "description": "Total amount of the fees on the FulfillmentOrder, excluding adjustments and tax. This value only includes FulfillmentOrderLineItems of type Fee."
      },
      "TotalFeeAmtWithTax": {
        "type": "currency",
        "description": "Total price of the fees on the FulfillmentOrder, inclusive of tax. This value only includes FulfillmentOrderLineItems of type Fee. This amount is equal to TotalFeeAmount + TotalFeeTaxAmount."
      },
      "TotalFeeTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalFeeAmount."
      },
      "TotalProductAmount": {
        "type": "currency",
        "description": "Total price of the products on the FulfillmentOrder, excluding order adjustments, delivery charges, and fees. This value only includes FulfillmentOrderLineItems of type code Product."
      },
      "TotalProduct​AmtWithTax": {
        "type": "currency",
        "description": "Total price of the products on the FulfillmentOrder, inclusive of tax. This value only includes FulfillmentOrderLineItems of type code Product. This amount is equal to TotalProductAmount + TotalProductTaxAmount."
      },
      "TotalProductTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalProductAmount."
      },
      "TotalTaxAmount": {
        "type": "currency",
        "description": "Tax on the TotalAmount."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of the FulfillmentOrder. Each type corresponds to one type category, shown here in parentheses. You can customize the type picklist to represent your business processes, but the type category picklist is fixed because processing is based on those values. If you customize the type picklist, include at least one type value for each type category."
      },
      "TypeCategory": {
        "type": "picklist",
        "description": "Type category of the FulfillmentOrder. Processing of the FulfillmentOrder depends on this value. Each type category corresponds to one or more types."
      }
    },
    "module": "Core Salesforce"
  }
}