{
  "FunctionInvocationRequest": {
    "name": "FunctionInvocationRequest",
    "description": "Represents invocation information for a Salesforce Function.",
    "properties": {
      "CallbackStatus": {
        "type": "picklist",
        "description": "The status of the callback for asynchronous invocations. This field is new in API version 52.0."
      },
      "ExecutionTime": {
        "type": "long",
        "description": "The execution time of the Function in milliseconds."
      },
      "ExtendedResponse": {
        "type": "textarea",
        "description": "JSON object with additional information about the result of the Function execution."
      },
      "FunctionName": {
        "type": "string",
        "description": "Name of the Function that was invoked. This name is case-sensitive and uses the format “project name-function name”"
      },
      "InvokingNamespacePrefix": {
        "type": "string",
        "description": "Prefix of the namespace that invokes the function. A namespace can invoke the global function using an installed package via Apex."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. This object is available in API version 53.0 and later. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the FunctionInvocationRequest."
      },
      "ResponseBody": {
        "type": "base64",
        "description": "Response body of the invoked Function."
      },
      "ResponseContentType": {
        "type": "picklist",
        "description": "Content type of the response body of the invoked Function. For example, the content type could be application/json, text/csv, or various other values depending on what the Function returned."
      },
      "ResponseLength": {
        "type": "int",
        "description": "Length of the response body."
      },
      "ResponseName": {
        "type": "string",
        "description": "Name of response, not currently used."
      },
      "ResponseUncompressedLength": {
        "type": "int",
        "description": "Uncompressed length of the Function response, if the response content was compressed."
      },
      "StackTrace": {
        "type": "textarea",
        "description": "If there was an error invoking the function, this field contains the Function stack trace."
      },
      "Status": {
        "type": "picklist",
        "description": "Status of the invoked Function. Functions that are invoked asynchronously can be in a queued InProgress state before they are invoked."
      }
    },
    "module": "Core Salesforce"
  }
}