{
  "FundingAwardRqmtSection": {
    "name": "FundingAwardRqmtSection",
    "description": "Represents a part of a funding award requirement to be completed or reviewed.",
    "properties": {
      "ApplicationStageDefinitionId": {
        "type": "reference",
        "description": "The application stage definition associated with the funding award requirement section."
      },
      "AssignedUserId": {
        "type": "reference",
        "description": "The user assigned to complete the funding award requirement section."
      },
      "Description": {
        "type": "string",
        "description": "The description of the funding award requirement section."
      },
      "DisplayOrder": {
        "type": "int",
        "description": "The order in which the funding award requirement section shows on the form."
      },
      "DueDate": {
        "type": "date",
        "description": "The date when the funding award requirement section is due."
      },
      "EndDateTime": {
        "type": "dateTime",
        "description": "The date and time when the funding award requirement section ends."
      },
      "FundingAwardRequirementId": {
        "type": "reference",
        "description": "The parent funding award requirement associated with the funding award requirement section."
      },
      "IsAssignedToMe": {
        "type": "boolean",
        "description": "Indicates whether the requirement section is assigned to the logged in user (true) or not (false). This field can be used to filter the sections assigned to the user."
      },
      "IsRequired": {
        "type": "boolean",
        "description": "Indicates whether the funding award requirement section is required (true) or not (false)."
      },
      "IsSubmitted": {
        "type": "boolean",
        "description": "Indicates whether the funding award requirement section has been submitted (true) or not (false)."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed this record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, and LastReferenceDate is not null, the user accessed this record or list view indirectly."
      },
      "Name": {
        "type": "string",
        "description": "The name of the funding award requirement section"
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the owner of this object."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "The date and time when the funding award requirement section starts."
      },
      "Status": {
        "type": "picklist",
        "description": "Specifies the status of the funding award requirement section."
      }
    },
    "module": "Public Sector Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.psc_api.meta/psc_api/sforce_api_objects_fundingawardrqmtsection.htm"
  }
}