{
  "Network": {
    "name": "Network",
    "description": "Represents an Experience Cloud site. Salesforce Experience Cloud lets you create branded spaces for your employees, customers, and partners. You can customize and create experiences, whether they’re communities, sites, or portals, to meet your business needs, then transition seamlessly between them. Experience Cloud sites let you share information, records, and files with coworkers and stakeholders all in one place.",
    "properties": {
      "Id": {
        "type": "string",
        "description": "Network ID",
        "format": "salesforce-id",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "SystemModstamp": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "CreatedDate": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "CreatedById": {
        "type": "string",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "LastModifiedDate": {
        "type": "string",
        "format": "date-time",
        "nullable": false,
        "readOnly": true
      },
      "LastModifiedById": {
        "type": "string",
        "format": "salesforce-id",
        "x-object": "User",
        "maxLength": 18,
        "nullable": false,
        "readOnly": true
      },
      "Name": {
        "type": "string",
        "maxLength": 40,
        "nullable": false,
        "description": "The name of the site."
      },
      "Description": {
        "type": "string",
        "maxLength": 255,
        "nullable": true,
        "description": "Description of the site."
      },
      "Status": {
        "type": "picklist",
        "format": "enum",
        "enum": [
          "UnderConstruction",
          "Live",
          "DownForMaintenance"
        ],
        "maxLength": 40,
        "nullable": false,
        "description": "Status of the site. Available values are: Live—The site is online and members can access it. Label is Published. DownForMaintenance—The site was previously published, but was taken offline. Members with the Create and Set Up Experiences permission can still access the setup for offline sites regardless of profile or membership. Members aren’t able to access offline sites, but they still appear in the user interface dropdown menu as SiteName (Offline). Label is Offline. UnderConstruction—The site hasn’t yet been published. When a user’s profile is associated with the site, and they’ve Create and Set Up Experiences permission, they can access sites in this status.After a site is published, it can never be in this status again. Label is Preview."
      },
      "OptionsInvitationsEnabled": {
        "type": "boolean",
        "description": "Determines whether users can invite others to the site.",
        "nullable": false
      },
      "OptionsSendWelcomeEmail": {
        "type": "boolean",
        "description": "Determines whether a welcome email is sent when a new user is added to the site.",
        "nullable": false
      },
      "OptionsSelfRegistrationEnabled": {
        "type": "boolean",
        "description": "Determines whether customers and partners can self-register to join the site. Customers and partners are users with External Identity, Community, Customer Portal, or partner portal licenses. If true, displays a Not a member? link on the login page that points to the default self-registration page. This field is available in API version 28.0 and later.",
        "nullable": false
      },
      "OptionsAllowMembersToFlag": {
        "type": "boolean",
        "description": "Determines whether users can flag posts, comments, or files as inappropriate.This field is available in API version 29.0 and later. The ability to flag files is available in version 30.0 and later.",
        "nullable": false
      },
      "OptionsSiteAsContainerEnabled": {
        "type": "boolean",
        "description": "Determines whether the site is an Experience Builder site (true) or a Salesforce Tabs + Visualforce site (false).This field is available in API version 29.0 and later.",
        "nullable": false
      },
      "OptionsPrivateMessagesEnabled": {
        "type": "boolean",
        "description": "Determines whether users can send and receive Chatter messages in the site.",
        "nullable": false
      },
      "OptionsKnowledgeableEnabled": {
        "type": "boolean",
        "description": "Determines whether users can see knowledgeable people for topics and endorse people for topics.",
        "nullable": false
      },
      "OptionsReputationEnabled": {
        "type": "boolean",
        "description": "Determines if reputation is calculated and displayed for members. This field is available in API version 31.0 and later.",
        "nullable": false
      },
      "OptionsEinsteinAnswersSnippetEnabled": {
        "type": "boolean",
        "description": "EinsteinAnswersSnippetEnabled",
        "nullable": false
      },
      "OptionsGuestChatterEnabled": {
        "type": "boolean",
        "description": "Specifies whether guest users can access public Chatter groups in the site without logging in.",
        "nullable": false
      },
      "OptionsNicknameDisplayEnabled": {
        "type": "boolean",
        "description": "Determines whether user nicknames display instead of their first and last names in most places in the site.A few restrictions to keep in mind about nickname display: Records and user lookups on records show full names. Keep in mind, though, that you can control record and user visibility with sharing rules. Mobile notifications in the Salesforce mobile app show full names. You can turn off mobile notifications in the app to avoid this display. Searches by first, last, and full names aren’t restricted and return matches, but the search results display only nicknames. Global search auto-complete recommendations show any first, last, and full names that the user has searched by or accessed via a record or another location. The recent items list also shows first, last, and full under the same conditions.",
        "nullable": false
      },
      "OptionsShowAllNetworkSettings": {
        "type": "boolean",
        "description": "Determines whether settings in Experience Management that were hidden based on how you set up your site are visible or remain hidden.This field is available in API version 33.0 and later.",
        "nullable": false
      },
      "OptionsAllowInternalUserLogin": {
        "type": "boolean",
        "description": "Specifies whether internal users can log in with their internal credentials on the site login page. This field is available in API version 37.0 and later.",
        "nullable": false
      },
      "OptionsDirectMessagesEnabled": {
        "type": "boolean",
        "description": "Controls the availability of direct messages in an Experience Builder site.This field is available in API version 39.0 and later.",
        "nullable": false
      },
      "OptionsReputationRecordConversationsDisabled": {
        "type": "boolean",
        "description": "Disables the feed on reputation records.",
        "nullable": false
      },
      "OptionsGuestFileAccessEnabled": {
        "type": "boolean",
        "description": "When true, lets guest users view asset files and CMS content that’s available to the site. Guest users can access shared asset files and published CMS content that’s made for external use, even if it isn’t used. Shared asset files include images that are associated with topics, recognition badges, branding, and account branding. This preference is automatically enabled if public access is enabled at the page or site level in Experience Builder.",
        "nullable": false
      },
      "OptionsGatherCustomerSentimentData": {
        "type": "boolean",
        "description": "When true, collects data about user likes, upvotes, and downvotes.",
        "nullable": false
      },
      "OptionsNetworkSentimentAnalysis": {
        "type": "boolean",
        "description": "If true, enables sentiment analysis in a site. In the UI, this setting is available in the Administration Workspace, under Administration | Preferences. This field is available in API version 40.0 and later.",
        "nullable": false
      },
      "OptionsEnableTopicAssignmentRules": {
        "type": "boolean",
        "description": "When true, displays knowledgeable people in key areas, for example, on Topic Detail pages.",
        "nullable": false
      },
      "OptionsEinsteinAnswersEnabled": {
        "type": "boolean",
        "description": "EinsteinAnswersEnabled",
        "nullable": false
      },
      "OptionsCWBannerState": {
        "type": "boolean",
        "description": "CWBannerState",
        "nullable": false
      },
      "OptionsTopicSuggestionsEnabled": {
        "type": "boolean",
        "description": "Enables topic suggestions when users write posts.This field is available in API version 41.0 and later.",
        "nullable": false
      },
      "OptionsEnableTalkingAboutStats": {
        "type": "boolean",
        "description": "Determines whether site users see how many people are discussing a topic. The number of people discussing the topic appears as the user types the topic and the system gives topic suggestions.This field is available in API version 41.0 and later.",
        "nullable": false
      },
      "OptionsUpDownVoteEnabled": {
        "type": "boolean",
        "description": "Determines whether up and down voting is enabled for the site.This field is available in API version 41.0 and later.",
        "nullable": false
      },
      "OptionsDisableWorkspaceInfo": {
        "type": "boolean",
        "description": "DisableWorkspaceInfo",
        "nullable": false
      },
      "OptionsEinsteinAnswersQAEnabled": {
        "type": "boolean",
        "description": "EinsteinAnswersQAEnabled",
        "nullable": false
      },
      "OptionsEinsteinAnswersKAEnabled": {
        "type": "boolean",
        "description": "EinsteinAnswersKAEnabled",
        "nullable": false
      },
      "OptionsRecognitionBadgingEnabled": {
        "type": "boolean",
        "description": "Determines whether Recognition Badges is enabled for the site.",
        "nullable": false
      },
      "OptionsThreadedDiscussionsEnabled": {
        "type": "boolean",
        "description": "Indicates whether threaded discussions are enabled for the site. Available in API version 44.0 and later.",
        "nullable": false
      },
      "OptionsMemberVisibility": {
        "type": "boolean",
        "description": "Controls user visibility on a per-site basis. If true, the See other members of this site preference is enabled for the selected site. This field is available in API version 45.0 and later.",
        "nullable": false
      },
      "OptionsMobileImageOptimizationEnabled": {
        "type": "boolean",
        "description": "If true, file asset images are optimized for mobile display. This field is available in API version 45.0 and later.",
        "nullable": false
      },
      "OptionsGuestMemberVisibility": {
        "type": "boolean",
        "description": "When true, lets guest users see who else is part of the site, including non-guest users. In the UI, this setting appears in the Administration Workspace under Administration | Preferences .Available in API version 47.0 and later.",
        "nullable": false
      },
      "OptionsActionOverrideEnabled": {
        "type": "boolean",
        "description": "Override the action that occurs when users click a default button, like New or Edit, with a Lightning component. For example, show a custom window instead of the one that Salesforce provides. Assign action overrides in the Object Manager. In the UI, this setting is available in the Administration Workspace, under Administration | Preferences under Experience Management This field is available in API version 49.0 and later.",
        "nullable": false
      },
      "WelcomeEmailTemplateId": {
        "type": "reference",
        "description": "ID of the email template used when sending welcome emails to new members.",
        "format": "salesforce-id",
        "x-object": "EmailTemplate",
        "maxLength": 18,
        "nullable": false
      },
      "ChangePasswordEmailTemplateId": {
        "type": "reference",
        "description": "ID of the email template used when notifying users that their password has been reset.",
        "format": "salesforce-id",
        "x-object": "EmailTemplate",
        "maxLength": 18,
        "nullable": false
      },
      "ForgotPasswordEmailTemplateId": {
        "type": "reference",
        "description": "ID of the email template used when users forget their password.",
        "format": "salesforce-id",
        "x-object": "EmailTemplate",
        "maxLength": 18,
        "nullable": false
      },
      "LockoutEmailTemplateId": {
        "type": "reference",
        "description": "ID of the email template used when users try to reset their password after locking themselves out because of too many login attempts. This field is available in API version 43.0 and later.",
        "format": "salesforce-id",
        "x-object": "EmailTemplate",
        "maxLength": 18,
        "nullable": true
      },
      "VerificationEmailTemplateId": {
        "type": "reference",
        "description": "ID of the email template used when users must verify their identity, for example, when they log in without a password. This field is available in API version 44.0 and later.",
        "format": "salesforce-id",
        "x-object": "EmailTemplate",
        "maxLength": 18,
        "nullable": true
      },
      "ChgEmailVerOldEmailTemplateId": {
        "type": "reference",
        "description": "ID of the email template used when notifying users that their email address has been changed. This email is sent to the user’s old email address.",
        "format": "salesforce-id",
        "x-object": "EmailTemplate",
        "maxLength": 18,
        "nullable": true
      },
      "ChgEmailVerNewEmailTemplateId": {
        "type": "reference",
        "description": "ID of the email template used when notifying users that their email address has been changed. This email is sent to the user’s new email address.",
        "format": "salesforce-id",
        "x-object": "EmailTemplate",
        "maxLength": 18,
        "nullable": true
      },
      "EmailSenderName": {
        "type": "string",
        "description": "Name from which emails are sent.",
        "maxLength": 80,
        "nullable": false
      },
      "EmailSenderAddress": {
        "type": "email",
        "description": "Read only. Email address from which emails are sent. Note To change the EmailSenderAddress value, you must first specify NewSenderAddress, which triggers the sending of an address change verification email. After you complete the address verification process, EmailSenderAddress changes to the specified NewSenderAddress.",
        "format": "email",
        "maxLength": 80,
        "nullable": false,
        "readOnly": true
      },
      "NewSenderAddress": {
        "type": "email",
        "description": "Email address that has been entered as the new value for EmailSenderAddress but hasn’t been verified yet. After a user has requested to change the sender email address and has successfully responded to the verification email, the NewSenderAddress value overwrites the value in EmailSenderAddress. This value becomes the email address from which emails are sent. Note If verification is pending for a new email address and you set NewSenderAddress to null, the verification request is canceled. NewSenderAddress is automatically set to null after EmailSenderAddress has been set to the new verified address. If verification is pending for a new email address, and you specify a different new address for this field, only the latest value is retained and used for verification.",
        "format": "email",
        "maxLength": 80,
        "nullable": true
      },
      "EmailFooterLogoId": {
        "type": "reference",
        "description": "ID of the Document object that displays as an image in the footer of Chatter emails.",
        "format": "salesforce-id",
        "x-object": "Document",
        "maxLength": 18,
        "nullable": true
      },
      "EmailFooterText": {
        "type": "string",
        "maxLength": 1000,
        "nullable": true,
        "description": "Text that displays in the footer of Chatter emails."
      },
      "UrlPathPrefix": {
        "type": "string",
        "description": "The UrlPathPrefix is a unique string at the end of the URL for the site. For example, in the site URL MyDomainName.my.site.com/customers, customers is the UrlPathPrefix.",
        "maxLength": 40,
        "nullable": true
      },
      "CaseCommentEmailTemplateId": {
        "type": "reference",
        "description": "ID of the email template used when submitting a comment on a case. This field is available in API version 28.0 and later.",
        "format": "salesforce-id",
        "x-object": "EmailTemplate",
        "maxLength": 18,
        "nullable": true
      },
      "SelfRegProfileId": {
        "type": "reference",
        "description": "ID of the profile assigned to users who self-register. Only applies if self-registration is enabled for the site.This field is available in API version 29.0 and later.",
        "format": "salesforce-id",
        "x-object": "Profile",
        "maxLength": 18,
        "nullable": true
      },
      "FirstActivationDate": {
        "type": "date",
        "description": "The date the site was first activated.This field is available in API version 34.0 and later. If the site was activated or inactive before the release of API version 34.0, this field returns the date that the site was first created.",
        "format": "date",
        "nullable": true,
        "readOnly": true
      },
      "MaxFileSizeKb": {
        "type": "int",
        "nullable": true,
        "description": "Specifies the maximum file size (in KBs) that members can upload in your site. Available in API version 36.0 and later.Enter a number between 3072 KB and your org’s maximum file size. To use the default limit of 2 GB, leave this field empty."
      },
      "AllowedExtensions": {
        "type": "textarea",
        "maxLength": 1000,
        "nullable": true,
        "description": "Specifies the types of files allowed in your site. This list of file types lets you control what members upload and also prevents spammers from polluting your site with inappropriate files. Available in API version 36.0 and later.Separate file types with a comma (for example: jpg,docx,txt). You can enter lowercase and uppercase letters. You can enter up to 1,000 characters. To allow all file types, leave this field empty."
      },
      "DeviceActEmailTemplateId": {
        "type": "reference",
        "description": "ID of the email template used when users log in from an unrecognized browser, app, or IP address. The email contains a one-time password that users enter to verify their identity.This field is available in API version 53.0 and later."
      },
      "enableImageOptimizationCDN": {
        "type": "boolean",
        "description": "The setting that optimizes cached images for guest users on all devices when a site uses Salesforce’s CDN for Digital Experiences.This field is available in API version 56.0 and later."
      },
      "HeadlessForgotPasswordTemplateId": {
        "type": "reference",
        "description": "ID of the email template to use with the Headless Forgot Password Flow.This field is available in API version 57.0 and later."
      },
      "HeadlessRegistrationTemplateId": {
        "type": "reference",
        "description": "ID of the email template to use for identity verification during the Headless Registration Flow.This field is available in API version 59.0 and later."
      },
      "OptionsApexCDNCachingEnabled": {
        "type": "boolean",
        "description": "Determines whether public data from @wire calls to Apex methods is cached only for guest users. This setting applies only to sites using Salesforce's CDN for Digital Experiences.This field is available in API version 55.0 and later."
      },
      "OptionsEmbeddedLoginEnabled": {
        "type": "boolean",
        "description": "Determines whether the Embedded Login feature is enabled in a site. When true, Embedded Login is turned on.This field is available in API version 61.0 and later."
      },
      "OptionsExpFriendlyUrlsAsDefault": {
        "type": "boolean",
        "description": "When true, URL slugs are on by default for Product and Category pages of LWR Commerce stores (available in API version 58.0 and later) Custom object pages on enhanced LWR sites (available in API version 60.0 and later) Account and contact pages on enhanced LWR sites (available in API version 61.0 and later)"
      },
      "OptionsExperienceBundleBasedSnaOverrideEnabled": {
        "type": "boolean",
        "description": "When true, the Service Not Available Page is an auto-generated Experience Builder-based page. When false, the Service Not Available page uses a static resource page that is set in Workspaces | Administration | Pages. The default value is true. Available in API version 52.0 and later."
      },
      "OptionsHeadlessFrgtPswEnabled": {
        "type": "boolean",
        "description": "When true, Headless Forgot Password Flow is enabled.This field is available in API version 57.0 and later."
      },
      "OptionsImageOptimizationCDNEnabled": {
        "type": "boolean",
        "description": "When true, cached images are optimized to suit any device that guest users use to access your site. This feature is available only for sites that use Salesforce’s CDN for Digital Experiences. In the UI, this setting appears in the Administration Workspace under Administration | Preferences.Available in API version 56.0 and later."
      },
      "OptionsLWRExperienceConnectedAppEnabled": {
        "type": "boolean",
        "description": "When true, enhances the performance and scalability of Connect API calls made from Lightning web components in an enhanced LWR site. This field is available in API version 58.0 and later."
      },
      "OptionsProfileBasedLayoutsForKnowledgeSearchEnabled": {
        "type": "boolean",
        "description": "When true, provides a grid layout for Knowledge search results. With grid layout in place, you can edit search profile layouts on the Knowledge object to show and hide different search result fields for different profiles. When you enable the standard grid layout, search-term highlighting isn’t available. This field is available in API version 51.0 and later."
      },
      "OptionsTopicFilteringForKnowledgeSearchEnabled": {
        "type": "boolean",
        "description": "Determines whether topic filtering is enabled for Knowledge search.This field is available in API version 55.0 and later."
      },
      "PwdlessRegEmailTemplateId": {
        "type": "reference",
        "description": "ID of the email template for the welcome email that users receive when they sign up with passwordless registration. This field is available in API version 61.0 and later."
      },
      "SelfRegMicroBatchSubErrorEmailTemplateId": {
        "type": "reference",
        "description": "ID of the profile assigned to users who self-register using micro-batchng. Only applies if self-registration using micro-batching is enabled for the site. This field is available in API version 54.0 and later."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_network.htm",
    "keyPrefix": "0DB",
    "label": "Network",
    "createable": false,
    "updateable": true,
    "deletable": false,
    "queryable": true,
    "searchable": false,
    "childRelationships": [
      {
        "childObject": "AttachedContentDocument",
        "field": "LinkedEntityId",
        "relationshipName": "AttachedContentDocuments",
        "cascadeDelete": true
      },
      {
        "childObject": "AttachedContentNote",
        "field": "LinkedEntityId",
        "relationshipName": "AttachedContentNotes",
        "cascadeDelete": true
      },
      {
        "childObject": "Audience",
        "field": "ContainerId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "ChatterActivity",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ChatterExtensionConfig",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "CollaborationGroup",
        "field": "NetworkId",
        "relationshipName": "NetworkCollaborationGroups",
        "cascadeDelete": false
      },
      {
        "childObject": "CollaborationGroupMember",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "CollaborationGroupRecord",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "CombinedAttachment",
        "field": "ParentId",
        "relationshipName": "CombinedAttachments",
        "cascadeDelete": true
      },
      {
        "childObject": "Community",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ContentDocumentLink",
        "field": "LinkedEntityId",
        "relationshipName": "ContentDocumentLinks",
        "cascadeDelete": true
      },
      {
        "childObject": "ContentVersion",
        "field": "FirstPublishLocationId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ContentVersion",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "CustomBrand",
        "field": "ParentId",
        "relationshipName": "CustomBrands",
        "cascadeDelete": true
      },
      {
        "childObject": "EntitySubscription",
        "field": "NetworkId",
        "relationshipName": "NetworkEntitySubscriptions",
        "cascadeDelete": false
      },
      {
        "childObject": "FeedItem",
        "field": "NetworkScope",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "FeedRevision",
        "field": "OriginNetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "KnowledgeableUser",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "LoginEvent",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "LoginHistory",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "NavigationLinkSet",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "NetworkActivityAudit",
        "field": "NetworkId",
        "relationshipName": "NetworkActivityAudits",
        "cascadeDelete": false
      },
      {
        "childObject": "NetworkAffinity",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "NetworkDiscoverableLogin",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "NetworkMember",
        "field": "NetworkId",
        "relationshipName": "NetworkMembers",
        "cascadeDelete": true
      },
      {
        "childObject": "NetworkMemberGroup",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "NetworkModeration",
        "field": "NetworkId",
        "relationshipName": "NetworkModerations",
        "cascadeDelete": false
      },
      {
        "childObject": "NetworkPageOverride",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "NetworkSelfRegistration",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "NetworkUserHistoryRecent",
        "field": "NetworkId",
        "relationshipName": "NetworkUserHistoryRecentToNetwork",
        "cascadeDelete": true
      },
      {
        "childObject": "PersonalizationTargetInfo",
        "field": "ContainerId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "RecentlyViewed",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "Recommendation",
        "field": "NetworkId",
        "relationshipName": "NetworkRecommendations",
        "cascadeDelete": true
      },
      {
        "childObject": "RecommendationChangeEvent",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "ReputationLevel",
        "field": "ParentId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "ReputationPointsRule",
        "field": "ParentId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "Stamp",
        "field": "ParentId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "SurveyInvitation",
        "field": "CommunityId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "Topic",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "TopicAssignment",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "TopicUserEvent",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "UserAppMenuCustomization",
        "field": "ApplicationId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "UserCustomBadge",
        "field": "ParentId",
        "relationshipName": null,
        "cascadeDelete": false
      },
      {
        "childObject": "WebStoreNetwork",
        "field": "NetworkId",
        "relationshipName": null,
        "cascadeDelete": true
      },
      {
        "childObject": "WorkBadge",
        "field": "NetworkId",
        "relationshipName": "NetworkBadges",
        "cascadeDelete": true
      },
      {
        "childObject": "WorkBadgeDefinition",
        "field": "NetworkId",
        "relationshipName": "NetworkBadgeDefinitions",
        "cascadeDelete": true
      },
      {
        "childObject": "WorkThanks",
        "field": "NetworkId",
        "relationshipName": "NetworkThanks",
        "cascadeDelete": true
      }
    ],
    "accessRules": "This object is available only when your org has digital experiences enabled.",
    "clouds": [
      "Core Salesforce",
      "Core Salesforce"
    ]
  }
}