{
  "ManagedContentChannel": {
    "name": "ManagedContentChannel",
    "description": "Represents the details of a CMS channel. CMS channels correspond to managed content publishing endpoints. They deliver published content from your Salesforce CMS workspaces to an audience.",
    "properties": {
      "CacheControlMaxAge": {
        "type": "long",
        "description": "The amount of time, in seconds, it takes for a requested CMS content resource in the CMS channel to expire before a new request for the resource must be made."
      },
      "Domain": {
        "type": "picklist",
        "description": "The domain for a public channel. Only public channels can have an assigned domain."
      },
      "DomainHostName": {
        "type": "string",
        "description": "The hostname of the domain assigned to the CMS channel. Only public channels can have an assigned domain."
      },
      "MediaCacheControlMaxAge": {
        "type": "long",
        "description": "The amount of time, in seconds, it takes for a requested CMS image or document content resource in the CMS channel to expire before a new request for the resource must be made. This field is available in API version 57.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "Name of the CMS channel."
      },
      "OptionsIsCacheControlPublic": {
        "type": "boolean",
        "description": "When true, the CMS channel connection type is public. When false, the cache control is private. The default value is false."
      },
      "OptionsIsDomainLocked": {
        "type": "boolean",
        "description": "When true, the domain set to the channel can’t be changed. Only public channels can have this field set to true. If the channel type is COMMUNITY, the default value is true. For all other channel types, the default value is false."
      },
      "OptionsIsSearchable": {
        "type": "boolean",
        "description": "When true, users can search for all published CMS content types within the channel. The default value is false."
      },
      "Type": {
        "type": "picklist",
        "description": "The connection type of the CMS channel. The connection type determines which audience can access the CMS content delivered in the channel."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_managedcontentchannel.htm"
  }
}