{
  "ManagedContent": {
    "name": "ManagedContent",
    "description": "Represents managed content in a Salesforce CMS workspace for use in an Experience Cloud site or a channel. The ManagedContent object represents the complete instance of a managed content record. It provides a consistent identifier for the managed content so that variants of the content item can be created over time.",
    "properties": {
      "ApiName": {
        "type": "string",
        "description": "The unique API name of the Salesforce CMS content. Name requirements: must be 80 characters or fewer must begin with a letter can contain only underscores and alphanumeric characters can't include spaces can't end with an underscore can't contain two consecutive underscores This field is available in API version 62.0 and later."
      },
      "AuthoredManagedContentSpaceId": {
        "type": "reference",
        "description": "The Salesforce CMS workspace ID where the content resides."
      },
      "ContentKey": {
        "type": "string",
        "description": "Unique identifier of the content."
      },
      "ContentTypeFullyQualifiedName": {
        "type": "string",
        "description": "The fully qualified name of the content type of this CMS content. In an enhanced CMS workspace, the ContentTypeFullyQualifiedName for each standard content type is: News: sfdc_cms__news Image: sfdc_cms__image Document: sfdc_cms__document In a CMS workspace, the ContentTypeFullyQualifiedName for each standard content type is: News: news Image: cms_image Document: cms_document In both CMS workspaces and enhanced CMS workspaces, the ContentTypeFullyQualifiedName for a custom content type is the same as the developer name of the custom content type. This field is available in API version 62.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "The name of the Salesforce CMS content. When you view this content in a CMS workspace, Name is the title of the latest content version. In an enhanced CMS workspace, Name is the title of the content in the workspace’s default language."
      },
      "PrimaryLanguage": {
        "type": "picklist",
        "description": "The default language of the Salesforce CMS workspace where the content resides."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_managedcontent.htm"
  }
}