{
  "MarketingAppExtAction": {
    "name": "MarketingAppExtAction",
    "description": "Represents an Action Type, which is an action that you can add to Engagement Studio programs in Account Engagement and execute in a third-party app.",
    "properties": {
      "ActionName": {
        "type": "string",
        "description": "The name of the action for internal use. Appears in the UI."
      },
      "ActionParams": {
        "type": "textarea",
        "description": "The parameters for the invocable action. Appears in the UI."
      },
      "ActionSchema": {
        "type": "textarea",
        "description": "The JSON schema for the invocable action. Appears in the UI."
      },
      "ActionSelector": {
        "type": "string",
        "description": "Invocable action selector. Appears in the UI."
      },
      "ApiName": {
        "type": "string",
        "description": "This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. This field is automatically generated, but you can supply your own value if you create the record using the API. Appears in the UI."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the action for internal reference. Appears in the UI."
      },
      "IsActive": {
        "type": "boolean",
        "description": "The default value is false. Appears in the UI."
      },
      "ManageableState": {
        "type": "ManageableState enumerated list",
        "description": "Indicates the manageable state of the specified component that is contained in a package: beta deleted deprecated deprecatedEditable installed installedEditable released unmanaged"
      },
      "MarketingAppExtensionId": {
        "type": "reference",
        "description": "This field is a relationship field."
      },
      "Version": {
        "type": "double",
        "description": "Reserved for future use."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_marketingappextaction.htm"
  }
}