{
  "LearningPractice": {
    "name": "LearningPractice",
    "description": "Represents a Feedback Request exercise in an Enablement program. Users can submit a sample of their work and request feedback from their peers and managers. Or, users can submit a video call and Einstein Coach generates feedback from the call’s transcription.",
    "properties": {
      "Description": {
        "type": "string",
        "description": "Instructions to the user to provide context for completing the Feedback Request exercise. For example, Record yourself giving a sales pitch and request feedback from your peers."
      },
      "InviteeQuantity": {
        "type": "int",
        "description": "The number of peers or managers that the user is required to invite for giving feedback when Type is PeerFeedback. Each peer or manager receives an invitation to the assessment survey associated with the Feedback Request exercise.When Type is AIFeedback, this value is always 1."
      },
      "LearningItemId": {
        "type": "reference",
        "description": "The ID of the LearningItem record for the Feedback Request exercise. The value must be unique. This field is a relationship field."
      },
      "Name": {
        "type": "string",
        "description": "The title of the Feedback Request exercise. For example, Practice Your Sales Pitch."
      },
      "PromptTemplate": {
        "type": "string",
        "description": "The prompt template to use with this exercise when Type is AIFeedback.Available in API version 61.0 and later."
      },
      "SurveyId": {
        "type": "reference",
        "description": "The ID of the assessment survey that’s sent to peers and managers when Type is PeerFeedback. This field is a relationship field."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of feedback used with this exercise. Possible values are: AIFeedback—Users submit a video call, and Einstein Coach generates feedback from the call’s transcription. With this type, PromptTemplate is required. Available in API version 61.0 and later. PeerFeedback—Users submit a URL to a sample of their work, and select peers and managers to review their work. Selected peers and managers complete an assessment survey. With this type, SurveyId is required. Available in API version 61.0 and later. Survey—Users complete a survey as part of their enrolled employee enablement program. Available in API version 64.0 and later."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_learningpractice.htm",
    "accessRules": "For Enablement admins to create, update, and delete Enablement programs, the Design and Deliver Enablement Programs permission is required. This permission is enabled by default as part of the Manage Enablement Essentials permission set, which comes with the Enablement add-on license. For users who take Enablement programs, the Take Enablement Programs permission is required. This permission is enabled by default as part of the Use Enablement Programs permission set, which comes with the Enablement add-on license. To access exercises that use Einstein Coach, the Use Einstein Coach permission is required. This permission is enabled by default as part of the Access Einstein Coach permission set, which comes with the Enablement add-on license.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}