{
  "LegalEntyAccountingPeriod": {
    "name": "LegalEntyAccountingPeriod",
    "description": "Represents a junction between a legal entity and an accounting period.",
    "properties": {
      "AccountingPeriodId": {
        "type": "reference",
        "description": "The ID of the accounting period record that's related to a legal entity accounting period."
      },
      "ClosureStage": {
        "type": "picklist",
        "description": "Specifies the closure stage of the legal entity accounting period. This field is available in API version 65.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed a legal entity accounting period record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed a legal entity accounting period record. If this value is null, it’s possible that the user only accessed the legal entity accounting period record or a related list view (LastReferencedDate), but not viewed the legal entity accounting period record itself."
      },
      "LegalEntityId": {
        "type": "reference",
        "description": "Required. The ID of the legal entity record that's related to a legal entity accounting period."
      },
      "Name": {
        "type": "string",
        "description": "Required. The auto-generated name of a legal entity accounting period. The name is a combination of the names of the legal entity and the accounting period."
      },
      "OwnerId": {
        "type": "reference",
        "description": "Required. The ID of the user who owns a legal entity accounting period record."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of a legal entity accounting period record."
      },
      "TotalAssetsAmount": {
        "type": "currency",
        "description": "The total assets for a legal entity accounting period is a roll up summary of the closing balances of the general ledger accounting period summary records that are related to an asset type general ledger account. This field is available in API version 65.0 and later."
      },
      "TotalEquitiesAmount": {
        "type": "currency",
        "description": "The total equities for a legal entity accounting period is a roll up summary of the closing balances of the general ledger accounting period summary records that are related to an equity type general ledger account. This field is available in API version 65.0 and later."
      },
      "TotalExpensesAmount": {
        "type": "currency",
        "description": "The total expenses for a legal entity accounting period is a roll up summary of the closing balances of the general ledger accounting period summary records that are related to an expense type general ledger account. This field is available in API version 65.0 and later."
      },
      "TotalLiabilitiesAmount": {
        "type": "currency",
        "description": "The total liabilities for a legal entity accounting period is a roll up summary of the closing balances of the general ledger accounting period summary records that are related to a liability type general ledger account. This field is available in API version 65.0 and later."
      },
      "TotalRevenueAmount": {
        "type": "currency",
        "description": "The total revenue for a legal entity accounting period is a roll up summary of the closing balances of the general ledger accounting period summary records that are related to a revenue type general ledger account. This field is available in API version 65.0 and later."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_legalentyaccountingperiod.htm",
    "accessRules": "the Accounts Receivables Admin permission set to access this object",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}