{
  "LightningPageViewEventLog": {
    "name": "LightningPageViewEventLog",
    "description": "Lightning Page View event logs represent information about the page on which the event occurred in Lightning Experience and the Salesforce mobile app. A Lightning Page View event log tracks the page a user visited, how long the user spent on the page, and the load time for the page.",
    "properties": {
      "AppName": {
        "type": "string",
        "description": "The name of the application that the user accessed."
      },
      "BrowserName": {
        "type": "string",
        "description": "The name of the browser that the user accessed. For example: Chrome, IE, Safari, Gecko."
      },
      "BrowserVersion": {
        "type": "string",
        "description": "The version of the browser that the user accessed in major.minor version format. Some browsers don’t provide a minor version."
      },
      "ClientGeolocation": {
        "type": "string",
        "description": "The geolocation of the client in the form of <Country>/<State|Province>. For example: United States/California."
      },
      "ClientIdentifier": {
        "type": "string",
        "description": "The API client ID."
      },
      "ClientIp": {
        "type": "string",
        "description": "IP address of the client employing salesforce.com services."
      },
      "ConnectionType": {
        "type": "string",
        "description": "The type of connection."
      },
      "DeviceIdentifier": {
        "type": "string",
        "description": "The unique identifier used to identify a device when tracking events. DeviceIdentifier is a generated value that’s created when the mobile app is initially run after installation."
      },
      "DeviceModel": {
        "type": "string",
        "description": "The name of the device model. For example: iPad, iPhone."
      },
      "DevicePlatform": {
        "type": "string",
        "description": "The type of application experience in name:experience:form format. Possible values are:"
      },
      "DeviceSessionIdentifier": {
        "type": "string",
        "description": "The unique identifier of the user’s session based on page load time. When the user reloads a page, a new session is started. For example: 321a1ddfaf924803a075f1e69fc87bc06f53ccd0."
      },
      "DoesEffectivePageTimeDeviate": {
        "type": "boolean",
        "description": "When a deviation is detected, DoesEffectivePageTimeDeviate records true. The default value is false."
      },
      "Duration": {
        "type": "double",
        "description": "The duration in milliseconds since the page start time. This field is being deprecated. Use EffectivePageTime instead."
      },
      "EffectivePageTime": {
        "type": "double",
        "description": "Indicates how many milliseconds it took for the page to load before a user could interact with the page’s functionality. Multiple factors can affect effective page time, such as network speed, hardware performance, or page complexity. If an effective page time greater than 60 seconds is detected, the value of this field is set to null or 0."
      },
      "EffectivePageTimeErrorType": {
        "type": "string",
        "description": "Indicates the origin of an error. This field is populated when EFFECTIVE_PAGE_TIME_DEVIATION_REASON contains the PAGE_HAS_ERROR value."
      },
      "EffectivePageTimeReason": {
        "type": "string",
        "description": "The reason for deviation in page loading time."
      },
      "GrandparentUiElement": {
        "type": "string",
        "description": "The grandparent scope of the page element where the event occurred."
      },
      "LoginKey": {
        "type": "string",
        "description": "The string that ties together all events in a user’s login session. It starts with a login event and ends with either a logout event or the user session expiring. For example: GeJCsym5eyvtEK2I."
      },
      "MobileSdkAppType": {
        "type": "string",
        "description": "HYBRID HYBRIDLOCAL HYBRIDREMOTE NATIVE REACTNATIVE"
      },
      "MobileSdkVersion": {
        "type": "String",
        "description": "5.0"
      },
      "OperatingSystemName": {
        "type": "string",
        "description": "The operating system name, derived from UserAgent. For example: Android, iOS, OSX, Windows."
      },
      "OperatingSystemVersion": {
        "type": "string",
        "description": "The operating system version, derived from UserAgent."
      },
      "PageAppName": {
        "type": "string",
        "description": "The internal name of the application that the user accessed from the App Launcher. For example: LightningSales."
      },
      "PageContext": {
        "type": "string",
        "description": "The name of the component hosting the main content of the page. For example: clients:cardsContainer."
      },
      "PageObjectIdentifier": {
        "type": "string",
        "description": "The unique entity identifier of the event. For example: 0013000000I3zJAAAZ."
      },
      "PageObjectType": {
        "type": "string",
        "description": "The object type of the event. For example: task, contacts."
      },
      "PageStartTime": {
        "type": "dateTime",
        "description": "The time when the page was initially loaded, measured in milliseconds. For example: 1471564788642."
      },
      "PageUrl": {
        "type": "string",
        "description": "Relative URL of the top-level Lightning Experience or Salesforce mobile app page that the user opened. The page can contain one or more Lightning components. Multiple record IDs can be associated with PageUrl. For example: /sObject/0064100000JXITSAA5/view."
      },
      "ParentUiElement": {
        "type": "string",
        "description": "The parent scope of the page element where the event occurred."
      },
      "PreviousPageAppName": {
        "type": "string",
        "description": "The internal name of the previous application that the user accessed from the App Launcher. For example: LightningSales."
      },
      "PreviousPageContext": {
        "type": "string",
        "description": "The context of the previous page where the event occurred. For example: clients:cardsContainer."
      },
      "PreviousPageObjectIdentifier": {
        "type": "string",
        "description": "The unique previous page object identifier of the event."
      },
      "PreviousPageObjectType": {
        "type": "string",
        "description": "The previous page object type of the event. For example: task, contacts."
      },
      "PreviousPageUrl": {
        "type": "string",
        "description": "The relative URL of the previous Lightning Experience or Salesforce mobile app page that the user opened. For example: /sObject/006410000."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "The unique ID of a single transaction. A transaction can contain one or more events. Each event in a given transaction has the same RequestIdentifier. For example: 3nWgxWbDKWWDIk0FKfF5DV."
      },
      "SdkAppVersion": {
        "type": "string",
        "description": "The SDK application version number. For example: 5.0."
      },
      "SessionKey": {
        "type": "string",
        "description": "The user’s unique session ID. You can use this value to identify all events in Lightning Experience within a session. When the user logs out and logs in again, a new session is started. For example: cdd09305cb6babf34059e27f70e47f1b11dec868."
      },
      "TargetUiElement": {
        "type": "string",
        "description": "The target page element where the event occurred. For example: label bBody truncate, tabitem-link."
      },
      "Timestamp": {
        "type": "dateTime",
        "description": "The access time of Salesforce services in GMT. For example, 2020-01-20T19:12:26.965Z. Milliseconds are the most granular setting."
      },
      "UiEventSequenceNumber": {
        "type": "double",
        "description": "An auto-incremented sequence number of the current event since the session started."
      },
      "UiEventTimestamp": {
        "type": "dateTime",
        "description": "An auto-incremented sequence number of the current event since the session started."
      },
      "UserAgent": {
        "type": "string",
        "description": "The numeric code for the type of client used to make the request (for example, the browser, application, or API) as a string."
      },
      "UserIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the user accessing Salesforce services through the UI or API. For example: 00530000009M943."
      },
      "UserType": {
        "type": "string",
        "description": "The category of user license of the user accessing Salesforce services through the UI or API."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_lightningpagevieweventlog.htm"
  }
}