{
  "LocationGroup": {
    "name": "LocationGroup",
    "description": "Represents a group of Omnichannel Inventory locations, providing an aggregate view of inventory availability across those locations. Omnichannel Inventory can create an inventory reservation for an order at the location group level, then assign the reservation to one or more locations in the group as needed.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "Description of the location group."
      },
      "ExternalReference": {
        "type": "string",
        "description": "Used when OCI is integrated with B2C Commerce to associate the location group with an inventory list in B2C Commerce. This value must match the inventory list ID in B2C Commerce."
      },
      "IsEnabled": {
        "type": "boolean",
        "description": "Indicates whether the location group is in use. If set to false, then inventory functions ignore this location group and its data isn’t synchronized with OCI. The default value is true."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. A null value can mean that this record has only been referenced (LastReferencedDate) and not viewed."
      },
      "LocationGroupName": {
        "type": "string",
        "description": "The name of the location group."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who currently owns this location group. Default value is the API user that created the record."
      },
      "ShouldSyncWithOci": {
        "type": "boolean",
        "description": "Specifies whether to synchronize inventory data for this location group with Omnichannel Inventory. The default value is true."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_locationgroup.htm"
  }
}