{
  "LogoutEventLog": {
    "name": "LogoutEventLog",
    "description": "Contains details of user sessions ending or being revoked.",
    "properties": {
      "ApiType": {
        "type": "Contains details of user sessions ending or being revoked. string",
        "description": "The type of API request."
      },
      "ApiVersion": {
        "type": "int",
        "description": "The version of the API that’s being used."
      },
      "AppType": {
        "type": "double",
        "description": "The application type that was in use upon logging out."
      },
      "BrowserType": {
        "type": "string",
        "description": "The identifier string returned by the browser used at login."
      },
      "ClientIp": {
        "type": "string",
        "description": "The IP address of the client that’s using Salesforce services. A Salesforce internal IP (such as a login from AppExchange) is shown as “Salesforce.com IP”."
      },
      "ClientVersion": {
        "type": "double",
        "description": "The version of the client that was in use upon logging out."
      },
      "IsUserInitiatedLogout": {
        "type": "boolean",
        "description": "The value is 1 if the user intentionally logged out of the organization by clicking the Logout button. If the user’s session timed out due to inactivity or another implicit logout action, the value is 0."
      },
      "LoginKey": {
        "type": "string",
        "description": "The string that ties together all events in a given user’s login session. It starts with a login event and ends with either a logout event or the user session expiring."
      },
      "PlatformType": {
        "type": "double",
        "description": "The code for the client platform. If a timeout caused the logout, this field is null."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "The unique ID of a single transaction. A transaction can contain one or more events. Each event in a given transaction has the same REQUEST_ID."
      },
      "ResolutionType": {
        "type": "double",
        "description": "The screen resolution of the client. If a timeout caused the logout, this field is null."
      },
      "SessionKey": {
        "type": "string",
        "description": "The user’s unique session ID. You can use this value to identify all user events within a session. When a user logs out and logs in again, a new session is started."
      },
      "SessionLevel": {
        "type": "string",
        "description": "The security level of the session that was used when logging out."
      },
      "SessionType": {
        "type": "string",
        "description": "The session type that was used when logging out."
      },
      "Timestamp": {
        "type": "dateTime",
        "description": "The access time of Salesforce services in GMT."
      },
      "UserIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the user who’s using Salesforce services through the UI or the API."
      },
      "UserType": {
        "type": "string",
        "description": "The category of user license of the user accessing Salesforce services through the UI or API."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_logouteventlog.htm",
    "accessRules": "View Event Log Object Data",
    "clouds": [
      "Core Salesforce",
      "Shield"
    ]
  }
}