{
  "Question": {
    "name": "Question",
    "description": "Represents a question in a zone that users can view and reply to.",
    "properties": {
      "BestReplyId": {
        "type": "reference",
        "description": "The ID of the reply that has been identified as the best answer to the question. Use the user interface to identify the best answer for a question."
      },
      "BestReplySelectedById": {
        "type": "reference",
        "description": "The ID of the user who selected the best answer to the question.This field is available in API version 24.0 and later. In API version 24.0 through version 29.0, you must update this field using the UI. In API version 30.0 and later, you can update this field using the API."
      },
      "Body": {
        "type": "textarea",
        "description": "Description of the question."
      },
      "CommunityId": {
        "type": "reference",
        "description": "The zone ID associated with the question. After you create a question, you can’t change the zone ID associated with that question."
      },
      "CreatorFullPhotoUrl": {
        "type": "string",
        "description": "URL of the user’s profile photo from the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "CreatorName": {
        "type": "string",
        "description": "Name of the user who posted the question or reply. Only the first name of internal users (agents) appears to portal users in the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "CreatorSmallPhotoUrl": {
        "type": "string",
        "description": "URL of the user’s thumbnail photo from the feed. Chatter Answers must be enabled to view this field. This field is available in API version 26.0 and later."
      },
      "HasSingleFieldForContent": {
        "type": "boolean",
        "description": "Indicates whether the content of a Chatter Answers question is: Included in only one field: Title if the content is unformatted and less than 255 characters; or Body if the content is formatted or more than 255 characters (true) Included in two fields: Title and Body (false) This field also determines if content displays in one or two fields in Chatter Answers question feeds. This field is available in API version 25.0 and later."
      },
      "LastReferencedDate": {
        "type": "date",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastReplyDate": {
        "type": "dateTime",
        "description": "The date and time the last reply (child Reply object) was posted."
      },
      "LastReplyId": {
        "type": "reference",
        "description": "Read only. The ID of the last reply (child Reply object) posted to the question."
      },
      "LastViewedDate": {
        "type": "date",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "MostReportAbusesOnReply": {
        "type": "int",
        "description": "The most number of user-reported abuses on a Reply associated with the question.This field is available in API version 24.0 and later."
      },
      "NumReplies": {
        "type": "int",
        "description": "The number of replies (child Reply object) that users have submitted for the question."
      },
      "NumReportAbuses": {
        "type": "int",
        "description": "Represents the number of user-reported abuses on the question.This field is available in API version 24.0 and later."
      },
      "NumSubscriptions": {
        "type": "int",
        "description": "Represents the number of users following the question.This field is available in API version 24.0 and later."
      },
      "Origin": {
        "type": "picklist",
        "description": "The source of the question, such as Chatter Answers.This field is available in API version 24.0 and later."
      },
      "Title": {
        "type": "string",
        "description": "The descriptive title of the question."
      },
      "UpVotes": {
        "type": "int",
        "description": "The total number of up votes for the question."
      },
      "VoteScore": {
        "type": "double",
        "description": "The internal score of the question, used to sort questions and articles on the Popular tab in the application user interface. The internal algorithm that determines the score gives older votes less weight than newer votes, simulating exponential decay. The score itself doesn’t display in the application user interface. Note Unlike other fields of type double, you can't use a SOQL aggregate function with this field."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_question.htm",
    "accessRules": "This object is only available if the Answers permission and AnswersEnabled preference or PortalFeed permission and PortalFeedEnabled preference are enabled in your org.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}