{
  "QuoteAdjustmentGroup": {
    "name": "QuoteAdjustmentGroup",
    "description": "Group containing a set of adjustments applied to a quote.",
    "properties": {
      "AdjustmentSource": {
        "type": "picklist",
        "description": "Indicates the origin of the price adjustment."
      },
      "AdjustmentType": {
        "type": "picklist",
        "description": "Indicates the type of mathematical adjustment to be applied to the quote."
      },
      "AdjustmentValue": {
        "type": "double",
        "description": "The specified AdjustmentType amount that is applied to the quote. For example, when AdjustmentType is AdjustmentAmount, AdjustmentValue is the cash amount of the price adjustment. When AdjustmentType value is AdjustmentPercentage, AdjustmentValue is the percent value of the price adjustment. When AdjustmentType is OverrideAmount, AdjustmentValue overrides the total amount of the quote."
      },
      "Description": {
        "type": "textarea",
        "description": "User-entered information about the quote adjustment group."
      },
      "Name": {
        "type": "string",
        "description": "The user-defined name of the quote adjustment group."
      },
      "Priority": {
        "type": "int",
        "description": "A numeric value that represents the order of precedence of the quote adjustment group. It can also represent the order of precedence when applying the AdjustmentType values. For example, a quote can have two adjustments: a $100 discount and a 10% discount. This field indicates which adjustment to apply first."
      },
      "QuoteId": {
        "type": "reference",
        "description": "The ID of the quote related to the adjustments in this group."
      },
      "TotalAmount": {
        "type": "currency",
        "description": "The total of all quote adjustments in this quote adjustment group, excluding tax."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_quoteadjustmentgroup.htm"
  }
}