{
  "QuoteLineDetail": {
    "name": "QuoteLineDetail",
    "description": "Represents the breakdown details of a quote line item. Revenue Cloud generates these records to capture pricing and quantity changes, such as negative quantity reductions, early renewals, derived pricing or repricing during an amendment, and bundle or product attribute reconfigurations.",
    "properties": {
      "BillingReference": {
        "type": "string",
        "description": "Reference to the original order item for which this amend or cancel record is created."
      },
      "EffectiveFrom": {
        "type": "dateTime",
        "description": "The date when the transaction becomes effective."
      },
      "EffectiveTo": {
        "type": "dateTime",
        "description": "The date when the transaction ends."
      },
      "LineNumber": {
        "type": "int",
        "description": "The line number of the detail record."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "NetUnitPrice": {
        "type": "currency",
        "description": "The unit price of the item that's calculated after applying any discounts and before tax calculation."
      },
      "PriceWaterfallIdentifier": {
        "type": "string",
        "description": "The price waterfall identifier generated by Salesforce Pricing that's associated with the pricing of the detail record."
      },
      "Quantity": {
        "type": "double",
        "description": "The quantity specified for the item in the detail record."
      },
      "QuoteLineItemId": {
        "type": "reference",
        "description": "The ID of the related quote line."
      },
      "ReferenceDate": {
        "type": "date",
        "description": "The reference date of the item. For example, the start date of the subscription that's associated with the detail record."
      },
      "ReferenceNumber": {
        "type": "string",
        "description": "The reference number of the item. For example, the order number that's associated with the detail record."
      },
      "TotalLineAmount": {
        "type": "currency",
        "description": "The net total price of the order product, before price adjustments, inclusive of quantity and the subscription term."
      },
      "TotalPrice": {
        "type": "currency",
        "description": "The total price of the item in the detail record that's calculated using the quantity, net unit price, and after applying the pricing terms."
      },
      "UnitPrice": {
        "type": "currency",
        "description": "The unit price of the item before any discounts or tax calculation."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_quotelinedetail.htm",
    "accessRules": "This object is available in Enterprise, Unlimited, and Developer Editions of Revenue Cloud.",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}