{
  "QuoteToOrderCompletedEvent": {
    "name": "QuoteToOrderCompletedEvent",
    "description": "Notifies subscribers when the /actions/standard/createOrderFromQuote REST request is complete. If the request is successful, use this event to learn about the Order record. If the request isn’t successful, use this event to learn about the errors associated with the request.",
    "properties": {
      "CorrelationIdentifier": {
        "type": "string",
        "description": "Reserved for future use."
      },
      "EventUuid": {
        "type": "string",
        "description": "A universally unique identifier (UUID) that identifies a platform event message."
      },
      "HasErrors": {
        "type": "boolean",
        "description": "Contains true if errors occurred during the process; otherwise false. The default value is false."
      },
      "OrderId": {
        "type": "string",
        "description": "The ID of the order created from the quote. If the process failed, this field is null."
      },
      "OrderNumber": {
        "type": "string",
        "description": "The user-friendly, unique number assigned to the order created from the quote."
      },
      "QuoteToOrderErrorDetailEvents": {
        "type": "QuoteToOrderErrDtlEvent[]",
        "description": "Contains a list of error messages and error codes if the request failed."
      },
      "ReplayId": {
        "type": "string",
        "description": "Represents an ID value that is populated by the system and refers to the position of the event in the event stream. Replay ID values aren’t guaranteed to be contiguous for consecutive events. A subscriber can store a replay ID value and use it on resubscription to retrieve missed events that are within the retention window."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "The unique ID returned in the actions/standard/createOrderFromQuote response. Use this ID to identify the event for a specific request."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_quotetoordercompletedevent.htm",
    "accessRules": "This object is available with Subscription Management.",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}