{
  "InsurancePolicySurcharge": {
    "name": "InsurancePolicySurcharge",
    "description": "Represents the charges calculated for an insurance policy and its related assets, coverages, and participants in a region.",
    "properties": {
      "ApplicableObjectType": {
        "type": "picklist",
        "description": "Specifies the item on which the surcharge was applied."
      },
      "InsurancePolicyAssetId": {
        "type": "reference",
        "description": "The insurance policy asset associated with the surcharge."
      },
      "InsurancePolicyCoverageId": {
        "type": "reference",
        "description": "The insurance policy coverage associated with the surcharge."
      },
      "InsurancePolicyId": {
        "type": "reference",
        "description": "The insurance policy associated with the surcharge."
      },
      "InsurancePolicyParticipantId": {
        "type": "reference",
        "description": "The insurance policy participant associated with the surcharge."
      },
      "InsurancePolicyTransactionId": {
        "type": "reference",
        "description": "The insurance policy transaction associated with the surcharge."
      },
      "IsProrationAllowed": {
        "type": "boolean",
        "description": "Indicates whether the term surcharge amount is prorated based on the policy duration."
      },
      "IsRefundAllowed": {
        "type": "boolean",
        "description": "Indicates whether the term surcharge amount is eligible for refund."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the insurance policy surcharge."
      },
      "ProductSurchargeId": {
        "type": "reference",
        "description": "The product surcharge associated with an insurance policy surcharge."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the system from which this insurance policy surcharge was obtained."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of the insurance policy surcharge record in the source system. This field is unique within your organization."
      },
      "SurchargeAmount": {
        "type": "currency",
        "description": "The surcharge amount calculated for an insurance policy, insurance policy asset, insurance policy coverage, or an insurance policy participant. This surcharge is calculated based on the tax and fee structure defined for products or can be retrieved from a source system."
      },
      "TermSurchargeAmount": {
        "type": "currency",
        "description": "The surcharge amount calculated for the duration of an insurance policy, insurance policy asset, insurance policy coverage, or insurance policy participant."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies the type of surcharge."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_insurancepolicysurcharge.htm",
    "clouds": [
      "Financial Services Cloud"
    ]
  }
}