{
  "InsurancePolicyParticipant": {
    "name": "InsurancePolicyParticipant",
    "description": "A junction object that associates the InsurancePolicy object with the Account object. This object represents the participants of an insurance policy. Insurance policy participants include policy owners and beneficiaries.",
    "properties": {
      "BeneficiarySharePercentage": {
        "type": "percent",
        "description": "The percentage of the total benefits that goes to the nominee."
      },
      "EffectiveDate": {
        "type": "dateTime",
        "description": "The date from which the participant is active on the policy."
      },
      "EffectiveFromDate": {
        "type": "date",
        "description": "The date from when the participant becomes active on the policy."
      },
      "EffectiveToDate": {
        "type": "date",
        "description": "The date after when the participant becomes inactive on the policy."
      },
      "ExpirationDate": {
        "type": "dateTime",
        "description": "The date from which the participant is inactive on the policy."
      },
      "InsurancePolicyId": {
        "type": "reference",
        "description": "The ID of the insurance policy."
      },
      "IsActiveParticipant": {
        "type": "boolean",
        "description": "Indicates whether the participant is an active participant on the policy. The default value is False."
      },
      "IsMinorBeneficiary": {
        "type": "boolean",
        "description": "Indicates whether the nominee is a minor. The default value is False."
      },
      "IsPolicyholder": {
        "type": "boolean",
        "description": "Indicates whether this client owns the policy or is just a participant on the policy. This field is available from API version 51.0 and later."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "LegalGuardianId": {
        "type": "reference",
        "description": "The legal guardian of the minor beneficiary. This can be a business account or a person account."
      },
      "Name": {
        "type": "string",
        "description": "An auto-generated number assigned to this record."
      },
      "ParticipantCode": {
        "type": "string",
        "description": "The unique code of the insurance policy participant across all the policy versions."
      },
      "ParticipantName": {
        "type": "string",
        "description": "The name of the participant of the insurance policy."
      },
      "PrimaryParticipantAccountId": {
        "type": "reference",
        "description": "The ID of the primary participant's account."
      },
      "PrimaryParticipantContactId": {
        "type": "reference",
        "description": "The ID of the primary participant's contact."
      },
      "ProductId": {
        "type": "reference",
        "description": "The product associated with the participant."
      },
      "RelatedInsPolicyParticipantId": {
        "type": "reference",
        "description": "The related insurance policy participant."
      },
      "RelatedParticipantAccountId": {
        "type": "reference",
        "description": "The ID of the related participant's account."
      },
      "RelatedParticipantContactId": {
        "type": "reference",
        "description": "The ID of the related participant's contact."
      },
      "RelationshipToInsured": {
        "type": "picklist",
        "description": "The relationship of the nominee with the insured."
      },
      "Role": {
        "type": "multipicklist",
        "description": "The roles that the participant has in the policy. For example, owner, beneficiary, driver."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the source system this record was obtained from."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of this record in the source system."
      },
      "StandardFeeAmount": {
        "type": "currency",
        "description": "The expected fee for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "StandardPremiumAmount": {
        "type": "currency",
        "description": "The expected premium for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "StandardTaxAmount": {
        "type": "currency",
        "description": "The expected tax on the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "TermFeeAmount": {
        "type": "currency",
        "description": "The expected fee for the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TermPremiumAmount": {
        "type": "currency",
        "description": "The expected premium for the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TermTaxAmount": {
        "type": "currency",
        "description": "The expected tax on the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TotalStandardAmount": {
        "type": "currency",
        "description": "The sum of the expected premium, fee, and tax for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "TotalTermAmount": {
        "type": "currency",
        "description": "The sum of the expected premium, tax, and fee for the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_insurancepolicyparticipant.htm",
    "clouds": [
      "Financial Services Cloud"
    ]
  }
}