{
  "InsurancePolicy": {
    "name": "InsurancePolicy",
    "description": "Represents a type of insurance policy. Available with the Provider Network Management permission set license.",
    "properties": {
      "ActualRenewalDate": {
        "type": "date",
        "description": "The actual renewal date of the policy."
      },
      "AuditTerm": {
        "type": "picklist",
        "description": "The frequency of the audit. For example, monthly, semi-monthly, quarterly, semi-annually, or annually."
      },
      "BillingCarrierAccountId": {
        "type": "reference",
        "description": "The name of the Billing Carrier Account associated with the Insurance Policy. When the company that sells the policy also writes the policy, then the billing carrier is the same as the writing carrier."
      },
      "BillingType": {
        "type": "picklist",
        "description": "Specifies the type of biling for the policy."
      },
      "CancellationDate": {
        "type": "dateTime",
        "description": "The date on which the insurance policy was canceled."
      },
      "CancellationReason": {
        "type": "textarea",
        "description": "The reason for canceling the insurance policy."
      },
      "CancellationReasonType": {
        "type": "picklist",
        "description": "The category that the cancellation reason belongs to."
      },
      "CashSurrenderValue": {
        "type": "currency",
        "description": "The cash surrender value of the insurance policy."
      },
      "ChangeSubtype": {
        "type": "picklist",
        "description": "A further categorization of the change type. For example, childbirth, marriage."
      },
      "ChangeType": {
        "type": "picklist",
        "description": "The type of the change in the policy. For example, life event, house renovation."
      },
      "CommissionFrequency": {
        "type": "picklist",
        "description": "The frequency of receiving commission from the carrier."
      },
      "CommissionPercent": {
        "type": "percent",
        "description": "The percentage of policy premium to be earned as commission by the brokerage firm."
      },
      "CurrentDueAmount": {
        "type": "currency",
        "description": "The current due amount for the policy."
      },
      "DateRenewed": {
        "type": "dateTime",
        "description": "The date on which the policy was last renewed."
      },
      "Discount": {
        "type": "double",
        "description": "The discount that was given on the policy."
      },
      "EffectiveDate": {
        "type": "dateTime",
        "description": "The date from which the policy is in effect."
      },
      "EffectiveFromDate": {
        "type": "date",
        "description": "The date when the policy becomes effective."
      },
      "EffectiveToDate": {
        "type": "date",
        "description": "The date until when the policy remains effective."
      },
      "ExpectedRevenueAmount": {
        "type": "currency",
        "description": "The revenue amount that the brokerage firm is expected to earn from the policy."
      },
      "EmployeeContribution": {
        "type": "currency",
        "description": "The employee's contribution towards the insurance premium value."
      },
      "EmployerContribution": {
        "type": "currency",
        "description": "The employer's contribution towards the insurance premium value."
      },
      "ExpirationDate": {
        "type": "dateTime",
        "description": "The date on which the policy expires."
      },
      "FinalRenewalDate": {
        "type": "dateTime",
        "description": "The final date on which the policyholder can renew the insurance policy."
      },
      "FundingType": {
        "type": "picklist",
        "description": "Specifies how the policy is being funded."
      },
      "GrossWrittenPremium": {
        "type": "currency",
        "description": "The total expected premium amount for the insurance policy over the policy period."
      },
      "HasAnyAutoCoverage": {
        "type": "boolean",
        "description": "Indicates whether the insurance policy has an Any Auto coverage, which extends the coverage to hired and other non-owned vehicles."
      },
      "IntermediaryAccountId": {
        "type": "reference",
        "description": "The Intermediary Account associated with the Insurance Policy."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the policy is active."
      },
      "IsLoanEligibile": {
        "type": "boolean",
        "description": "Indicates whether a loan can be requested against the insurance policy."
      },
      "IsPolicyEditLocked": {
        "type": "boolean",
        "description": "Indicates whether the application locks the policy record. The default value is False."
      },
      "IsRenewedPolicy": {
        "type": "boolean",
        "description": "Indicates whether the policy is a renewed policy."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "LineOfBusiness": {
        "type": "picklist",
        "description": "The line of business associated with the policy."
      },
      "LineOfCoverage": {
        "type": "picklist",
        "description": "The coverage type of the policy."
      },
      "Name": {
        "type": "string",
        "description": "The insurance policy number. Label is Policy Number."
      },
      "NameInsuredId": {
        "type": "reference",
        "description": "The name of the primary insured."
      },
      "OriginalEffectiveDate": {
        "type": "dateTime",
        "description": "The date on which the original policy went into effect. This field is available from API version 51.0 and later."
      },
      "OriginalEffectiveFromDate": {
        "type": "date",
        "description": "The date when the original policy became effective."
      },
      "OriginalEffectiveToDate": {
        "type": "date",
        "description": "The date until when the original policy remains effective."
      },
      "OriginalExpirationDate": {
        "type": "dateTime",
        "description": "Expiration date of the original policy. This field is available from API version 51.0 and later."
      },
      "OriginalPolicyId": {
        "type": "reference",
        "description": "The ID of the original insurance policy. This field is available from API version 51.0 and later."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the record owner."
      },
      "PaidToDate": {
        "type": "date",
        "description": "The date up to which the policy is paid for. This field is available from API version 51.0 and later."
      },
      "ParentPolicyId": {
        "type": "reference",
        "description": "The ID of the parent policy that covers this policy. For example, a parent policy can cover an auto policy and home policy."
      },
      "PastDueAmount": {
        "type": "currency",
        "description": "The amount past due for the policy."
      },
      "PaymentDueDate": {
        "type": "dateTime",
        "description": "The date on which the next payment of the premium is due."
      },
      "PlannedRenewalDate": {
        "type": "date",
        "description": "The expected renewal date of the policy."
      },
      "PlanTier": {
        "type": "picklist",
        "description": "The class that the insurance policy belongs to. For example, silver, gold, or platinum."
      },
      "PlanType": {
        "type": "picklist",
        "description": "The type of the insurance policy plan. For example, single life, joint last-to-die, or joint first-to-die (primarily applicable for term insurance)."
      },
      "PolicyCode": {
        "type": "string",
        "description": "The code that's unique for the policy across all versions."
      },
      "PolicyDescription": {
        "type": "textarea",
        "description": "The description of the insurance policy."
      },
      "PolicyName": {
        "type": "string",
        "description": "The name of the insurance policy."
      },
      "PolicyTerm": {
        "type": "picklist",
        "description": "The time period for which the policy provides coverage. This field is available from API version 51.0 and later."
      },
      "PolicyType": {
        "type": "picklist",
        "description": "The type of the insurance policy. For example, home, auto, annuity, or life."
      },
      "PremiumAmount": {
        "type": "currency",
        "description": "The premium paid by the policy owner for the current billing period."
      },
      "PremiumCalculationMethod": {
        "type": "picklist",
        "description": "The premium calculation method for a payment period. This field is available from API version 51.0 and later."
      },
      "PremiumFrequency": {
        "type": "picklist",
        "description": "The frequency of the premium payment or billing. For example, monthly, semi-monthly, quarterly, semi-annually, or annually."
      },
      "PremiumPaymentType": {
        "type": "picklist",
        "description": "The type of premium payment, such as Advance or Arrears. This field is available from API version 51.0 and later."
      },
      "PreviousPremium": {
        "type": "currency",
        "description": "The premium of the policy before it was renewed."
      },
      "PreviousRenewalDate": {
        "type": "dateTime",
        "description": "The date on which the insurance policy was renewed in the last renewal cycle."
      },
      "PriorPolicyId": {
        "type": "reference",
        "description": "The ID of the insurance policy before it was renewed."
      },
      "ProducerId": {
        "type": "reference",
        "description": "The ID of the agency or the agent who sold the policy."
      },
      "ProductId": {
        "type": "reference",
        "description": "The product that this policy belongs to. For example, if the customer buys a silver auto policy, this field looks up to the silver auto product in the Product object."
      },
      "RatingDate": {
        "type": "date",
        "description": "The date to determine the rating details on a mid-term adjustment, endorsement, or out-of-sequence endorsement to a policy."
      },
      "ReferencePolicyNumber": {
        "type": "string",
        "description": "The reference number of the insurance policy that is renewed when the policy term tracking is continued across multiple policy versions. For example, if a limit is a \"Lifetime Limit\", then the policy term tracking is tracked across all versions of the policy."
      },
      "RenewalChannel": {
        "type": "picklist",
        "description": "The channel through which the insurance policy was renewed."
      },
      "RenewalDate": {
        "type": "dateTime",
        "description": "The date on which the policy is expected to be renewed. The actual renewal date may be different."
      },
      "SaleDate": {
        "type": "dateTime",
        "description": "The date on which the policy was sold."
      },
      "ServicingOffice": {
        "type": "address",
        "description": "The address of the office that issued the policy and that services the policy."
      },
      "SourceOpportunityId": {
        "type": "reference",
        "description": "The ID of the opportunity from which the policy was created."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the source system this record was obtained from."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The unique ID of this record in the source system."
      },
      "StandardFeeAmount": {
        "type": "currency",
        "description": "The expected fee for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "StandardPremiumAmount": {
        "type": "currency",
        "description": "The expected premium for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "StandardTaxAmount": {
        "type": "currency",
        "description": "The expected tax on the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the insurance policy."
      },
      "Substatus": {
        "type": "picklist",
        "description": "The carrier system's substatus code for the insurance policy."
      },
      "TaxesSurcharges": {
        "type": "currency",
        "description": "The taxes and surcharges levied on the premium for the insurance policy."
      },
      "TermFeeAmount": {
        "type": "currency",
        "description": "The expected fee for the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TermPremiumAmount": {
        "type": "currency",
        "description": "The expected premium for the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TermTaxAmount": {
        "type": "currency",
        "description": "The expected tax on the policy over the policy period, prorated based on the policy's effective dates. This field is available from API version 51.0 and later."
      },
      "TotalStandardAmount": {
        "type": "currency",
        "description": "The sum of the expected premium, fee, and tax for the policy over the policy period. This field is available from API version 51.0 and later."
      },
      "TotalSumInsured": {
        "type": "currency",
        "description": "The total insured amount. This field is available from API version 51.0 and later."
      },
      "TotalTermFeeAmount": {
        "type": "currency",
        "description": "The current total term fees of all policy versions."
      },
      "TotalTermPremiumAmount": {
        "type": "currency",
        "description": "The current total term premium of all policy versions."
      },
      "TotalTermTaxAmount": {
        "type": "currency",
        "description": "The current total term taxes of all policy versions."
      },
      "UnderwritingEntityId": {
        "type": "reference",
        "description": "Legal entity that underwrote the insurance policy."
      },
      "UniversalPolicyNumber": {
        "type": "string",
        "description": "A number that uniquely identifies the policy across different source systems."
      },
      "WritingCarrierAccountId": {
        "type": "reference",
        "description": "The Writing Carrier Account associated with the Insurance Policy."
      },
      "AttributesSelectedValues__c": {
        "type": "textarea",
        "description": "Values of root product attributes set at the InsurancePolicy level."
      },
      "ContractLineItemId__c": {
        "type": "reference",
        "description": "The ID of a line item in the contract for the policy."
      },
      "FnolChannel": {
        "type": "picklist",
        "description": "The channel through which the loss for the claim associated with this policy was reported. This field is deprecated in API version 48.0 and will be removed in API version 52 (the Summer ’21 release)."
      },
      "ProductCode__c": {
        "type": "string",
        "description": "The code of the product that this policy belongs to."
      },
      "SourceQuoteId": {
        "type": "reference",
        "description": "The ID of the quote from which the policy was created."
      },
      "TotalCommissionAmount": {
        "type": "currency",
        "description": "The total commission amount for the policy."
      }
    },
    "module": "Health Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.health_cloud_object_reference.meta/health_cloud_object_reference/sforce_api_objects_insurancepolicy.htm",
    "clouds": [
      "Financial Services Cloud",
      "Health Cloud"
    ]
  }
}