{
  "InsuranceProfile": {
    "name": "InsuranceProfile",
    "description": "Represents the insurance-related attributes for the insured member.",
    "properties": {
      "ContactId": {
        "type": "reference",
        "description": "The ID of the contact related to this insurance profile."
      },
      "IsAlcoholAbuser": {
        "type": "boolean",
        "description": "Indicates whether the person has a history of alcohol abuse. The default value is False."
      },
      "IsAlcoholConsumer": {
        "type": "boolean",
        "description": "Indicates whether the person consumes alcohol. The default value is False."
      },
      "IsDrugAbuser": {
        "type": "boolean",
        "description": "Indicates whether the person has a history of drug abuse. The default value is False."
      },
      "IsGoodDriver": {
        "type": "boolean",
        "description": "Indicates whether the person is categorized as a good driver. The default value is False."
      },
      "IsGoodStudent": {
        "type": "boolean",
        "description": "Indicates whether the person is categorized as a good student. The default value is False."
      },
      "IsHighRiskOccupation": {
        "type": "boolean",
        "description": "Indicates whether the person’s current employment is a high-risk job. The default value is False."
      },
      "IsLicenseSuspended": {
        "type": "boolean",
        "description": "Indicates whether the insured member’s driver’s license was ever suspended. The default value is False."
      },
      "IsTobaccoConsumer": {
        "type": "boolean",
        "description": "Indicates whether the person consumes tobacco. The default value is False."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, it’s possible that this record was referenced (LastReferencedDate) and not viewed."
      },
      "MajorCitationCount": {
        "type": "int",
        "description": "The number of major citations the person had when the policy was created."
      },
      "MinorCitationCount": {
        "type": "int",
        "description": "The number of minor citations the person had when the policy was created."
      },
      "Name": {
        "type": "string",
        "description": "An auto-generated number assigned to this record."
      },
      "NumberOfAccidents": {
        "type": "int",
        "description": "The number of accidents the insured member was involved in."
      },
      "SourceSystem": {
        "type": "string",
        "description": "The name of the source system this record was obtained from."
      },
      "SourceSystemIdentifier": {
        "type": "string",
        "description": "The ID of this record in the source system."
      }
    },
    "module": "Financial Services Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.financial_services_cloud_object_reference.meta/financial_services_cloud_object_reference/sforce_api_objects_insuranceprofile.htm",
    "clouds": [
      "Financial Services Cloud"
    ]
  }
}