{
  "InternalOrganizationUnit": {
    "name": "InternalOrganizationUnit",
    "description": "Represents an organization that an Employee belongs to.",
    "properties": {
      "Description": {
        "type": "string",
        "description": "A description of the organization the Employee is working in."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "OrganizationCode": {
        "type": "string",
        "description": "Required. The code of the organization the Employee is working in."
      },
      "OrganizationName": {
        "type": "string",
        "description": "The name of the organization the Employee is working in."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who currently owns this record. Default value is the user logged in to the API to perform the create operation."
      },
      "ParentOrganizationId": {
        "type": "reference",
        "description": "A reference to the parent organization."
      },
      "Type": {
        "type": "picklist",
        "description": "Specifies whether the record is for an internal or an external organization. This field is available in API version 60.0 and later."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_internalorganizationunit.htm",
    "accessRules": "To access this object, you have either a Workplace Command Center permission set license and the Provides access to Workplace Command Center features system permission, or the Employee Management and Employee User add-on licenses. This object is also available with the Referral Marketing license.",
    "clouds": [
      "Core Salesforce"
    ]
  }
}