{
  "InvBatchDraftToPostedRun": {
    "name": "InvBatchDraftToPostedRun",
    "description": "Represents information about the batch job that posts all invoices with the status as Draft that are generated by the invoice batch run associated with the billing schedule.",
    "properties": {
      "Comments": {
        "type": "textarea",
        "description": "Additional notes or comments for the invoice batch draft to posted run record."
      },
      "CompletionDateTime": {
        "type": "dateTime",
        "description": "The completion date and time of this invoice batch draft to posted run process."
      },
      "CreditApplicationStatus": {
        "type": "picklist",
        "description": "The status of a credit application to the invoices that are posted by the invoice batch draft to posted run process."
      },
      "InvBatchDraftToPostedRunNumber": {
        "type": "string",
        "description": "Required. The auto-generated number of the invoice batch draft to posted run record."
      },
      "InvoiceBatchRunId": {
        "type": "reference",
        "description": "Required. The ID of the invoice batch run record associated with the invoice batch draft to posted run record."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed an invoice batch draft to posted run record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed an invoice batch draft to posted run record. If this value is null, it’s possible that the user only accessed the invoice batch draft to posted run record or a related list view (LastReferencedDate), but not viewed the invoice batch draft to posted run record itself."
      },
      "StartDateTime": {
        "type": "dateTime",
        "description": "Required. The start date and time of the invoice batch draft to posted run process."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the invoice batch draft to posted run record."
      },
      "TotalDraftInvoicesSelected": {
        "type": "int",
        "description": "The total number of invoices that are selected to be processed by the invoice batch draft to posted run process."
      },
      "TotalInvoiceAmount": {
        "type": "currency",
        "description": "The total amount of all the invoices posted by the invoice batch draft to posted run process."
      },
      "TotalInvoicesFailed": {
        "type": "int",
        "description": "The total number of invoices that the invoice batch draft to posted run process failed to post."
      },
      "TotalPostedInvoices": {
        "type": "int",
        "description": "The total number of invoices posted by the invoice batch draft to posted run process."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_invbatchdrafttopostedrun.htm",
    "accessRules": "Billing Operations",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}