{
  "InvoiceLineRelationship": {
    "name": "InvoiceLineRelationship",
    "description": "Represents a relationship between invoice line items to support bundles where one parent invoice line has multiple child invoice lines.",
    "properties": {
      "AssociatedInvoiceLineId": {
        "type": "reference",
        "description": "Required. The ID of the related invoice line record. In a bundle relationship, this invoice line is the child."
      },
      "AssociatedInvoiceLinePricing": {
        "type": "picklist",
        "description": "Required. This field describes how the related invoice line is priced relative to the primary invoice line."
      },
      "AssociatedInvoiceLineRole": {
        "type": "picklist",
        "description": "Required. This field describes the role of the related invoice line in the relationship. The value is derived from the AssociatedProductRoleCat field of the ProductRelationshipType object."
      },
      "InvoiceId": {
        "type": "reference",
        "description": "The ID of the related invoice record."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last accessed an invoice line relationship record indirectly, for example, through a list view or related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp when the current user last viewed an invoice line relationship record. If this value is null, it’s possible that the user only accessed the invoice line relationship record or a related list view (LastReferencedDate), but not viewed the invoice line relationship record itself."
      },
      "MainInvoiceLineId": {
        "type": "reference",
        "description": "Required. The ID of the primary invoice line record. In a bundle relationship, this invoice line is the parent."
      },
      "MainInvoiceLineRole": {
        "type": "picklist",
        "description": "Required. This field describes the role of the primary invoice line in the relationship. The value is derived from the MainProductRoleCat field of the ProductRelationshipType object."
      },
      "Name": {
        "type": "string",
        "description": "Required. An auto-generated number identifying the invoice line relationship."
      },
      "ProductRelationshipTypeId": {
        "type": "reference",
        "description": "The ID of the product relationship type record between the main and associated invoice lines."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_invoicelinerelationship.htm"
  }
}