{
  "OmniExtTrackingDef": {
    "name": "OmniExtTrackingDef",
    "description": "Represents a connection between an OmniTrackingGroup in OmniAnalytics and a third-party Analytics system such as Google Analytics.",
    "properties": {
      "Description": {
        "type": "string",
        "description": "A description of the OmniExtTrackingDef."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the OmniExtTrackingDef in the API. This name can contain only underscores and alphanumeric characters and must be unique in your organization. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. Limit: 80 characters. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance may slow while Salesforce generates one for each record. Note Only users with View DeveloperName OR View Setup and Configuration permission can view, group, sort, and filter this field."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Specifies whether the OmniExtTrackingDef is active."
      },
      "Language": {
        "type": "picklist",
        "description": "The language for the OmniExtTrackingDef."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The unique master label of the OmniExtTrackingDef. This internal label doesn’t get translated."
      },
      "OmniExtTrackingDefKey": {
        "type": "string",
        "description": "A UUID generated internally by Salesforce to uniquely identify an OmniExtTrackingDef record across all orgs."
      },
      "TrackingFrameworkInformation": {
        "type": "textarea",
        "description": "JSON data containing information about an external service, such as the API call and input parameter names."
      },
      "TrackingServiceProvider": {
        "type": "picklist",
        "description": "The third-party Analytics system to which user interaction data is sent."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_omniexttrackingdef.htm"
  }
}