{
  "OperationLog": {
    "name": "OperationLog",
    "description": "Represents long-running or asynchronous operations triggered and tracked through Tooling API.",
    "properties": {
      "DetailedStatus": {
        "type": "string",
        "description": "Complements the Status field with an operation processor-specific status code."
      },
      "Message": {
        "type": "string",
        "description": "Complements the Status field with information helpful to the user. For example, if Status=FAILED, state the reason in this field."
      },
      "Parameters": {
        "type": "OperationParameters",
        "description": "A complex type that represents a set of parameters passed to the operation processor. Specify the parameters by using the OperationPayload value that corresponds to your operation type."
      },
      "Status": {
        "type": "picklist",
        "description": "Indicates the status of an operation triggered through Tooling API. Valid values are: NEW RUNNING COMPLETED FAILED ABORTED Only records with Status=NEW can be created through the API."
      },
      "Type": {
        "type": "picklist",
        "description": "The type of operation submitted through Tooling API. For each operation type, use the corresponding payload of input parameters. Valid operation types are: RunTerritoryRules Runs account assignment rules for any territory that has rules defined and belongs to a territory model in Planning or Active state. When you run rules from Setup, accounts are assigned to territories according to your rules if your territory model is in Active or Planning state. Accounts are assigned to territories according to your rules automatically on account creation or update only if your territory model is in Active state.When you choose this operation type, use the payload Territory2RunTerritoryRulesPayload in the Parameters field. RunOppTerrAssignmentApex Uses filter-based opportunity territory assignment to assign territories to opportunities using a simple job. We provide code for an Apex class that you can use as-is or modify as needed based on our guidelines. After you create and deploy the class, run the job to complete the assignment process. Job options include making assignments within date ranges and assigning territories to open opportunities only. When you choose this operation type, use the payload Territory2RunOppTerrAssignmentApexPayload in the Parameters field."
      },
      "oldPassword": {
        "type": "string",
        "description": ""
      },
      "newPassword": {
        "type": "string",
        "description": ""
      },
      "payload": {
        "type": "OperationPayload",
        "description": ""
      },
      "keyPrefix": {
        "type": "string",
        "description": ""
      },
      "territoryId": {
        "type": "string",
        "description": ""
      },
      "territoryModelId": {
        "type": "string",
        "description": ""
      },
      "excludeClosedOpportunities": {
        "type": "string",
        "description": ""
      },
      "opportunityCloseDateFrom": {
        "type": "string",
        "description": ""
      },
      "opportunityCloseDateTo": {
        "type": "string",
        "description": ""
      },
      "opportunityLastModifiedDateFrom": {
        "type": "string",
        "description": ""
      },
      "opportunityLastModifiedDateTo": {
        "type": "string",
        "description": ""
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_operationlog.htm"
  }
}