{
  "OrderItemUsageRsrcPlcy": {
    "name": "OrderItemUsageRsrcPlcy",
    "description": "Represents the policies that are used for the usage resource that's associated with the usage product added in the order item.",
    "properties": {
      "DrawdownOrder": {
        "type": "picklist",
        "description": "Specifies the order that's used to debit consumption of entitlements related to the usage resource from the usage entitlement bucket."
      },
      "Name": {
        "type": "string",
        "description": "An auto-generated number assigned to the order item for usage product grant record. For example, OIURG-4567"
      },
      "OrderItemId": {
        "type": "reference",
        "description": "The order item associated with the usage product."
      },
      "ProductUsageResourcePolicyId": {
        "type": "reference",
        "description": "The product usage resource policy associated with the usage resource related to the usage product added in the order item."
      },
      "RatingFrequencyPolicyId": {
        "type": "reference",
        "description": "The rating frequency policy associated with the usage resource related to the usage product added in the order item."
      },
      "UsageAggregationPolicyId": {
        "type": "reference",
        "description": "The usage aggregation policy associated with the usage resource related to the usage product added in the order item."
      },
      "UsageCommitmentPolicyId": {
        "type": "reference",
        "description": "The usage commitment policy associated with the usage resource related to the usage product added in the order item."
      },
      "UsageOveragePolicyId": {
        "type": "reference",
        "description": "The usage overage policy associated with the usage resource related to the usage product added in the order item."
      },
      "UsageResourceId": {
        "type": "reference",
        "description": "The usage resource associated with the usage product that's added in the order item."
      }
    },
    "module": "Revenue Lifecycle Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.revenue_lifecycle_management_dev_guide.meta/revenue_lifecycle_management_dev_guide/sforce_api_objects_orderitemusagersrcplcy.htm",
    "clouds": [
      "Revenue Lifecycle Management"
    ]
  }
}