{
  "SalesAgreementProduct": {
    "name": "SalesAgreementProduct",
    "description": "Represents the total quantity or amount and the default pricing information of a product or category across the total time period of the sales agreement.",
    "properties": {
      "ActualMarginPercentage": {
        "type": "percent",
        "description": "The total actual margin amount as a percentage of total actual amount."
      },
      "AreSchedulesCreatedManually": {
        "type": "boolean",
        "description": "Indicates whether schedules are created automatically or manually."
      },
      "CostPrice": {
        "type": "currency",
        "description": "The cost of manufacturing one unit of a product."
      },
      "DiscountPercentage": {
        "type": "percent",
        "description": "Percent of discount offered on the sales price."
      },
      "DisplayName": {
        "type": "string",
        "description": ""
      },
      "GuidancePrice": {
        "type": "currency",
        "description": "The guidance price that's calculated using the core pricing rules. This price is used to determine the sales price."
      },
      "InitialPlannedAmount": {
        "type": "currency",
        "description": "The total amount of the product or category that you initially plan on selling across the sales agreement term."
      },
      "InitialPlannedQtyValue": {
        "type": "double",
        "description": "The initial quantity of a product planned for sale across schedules in a sales agreement. This field stores initial product quantity in decimals."
      },
      "InitialPlannedQuantity": {
        "type": "int",
        "description": "The total quantity of the product or category that you initially plan on selling across the sales agreement term."
      },
      "IsActualsCalculationProduct": {
        "type": "boolean",
        "description": "Indicates whether this product is used for actuals calculations instead of other products with the same product name."
      },
      "IsAddedAfterActivation": {
        "type": "boolean",
        "description": "Indicates whether the sales agreement product or category is added after the sales agreement was activated."
      },
      "IsQuantityInDecimals": {
        "type": "boolean",
        "description": "Indicates whether the quantities of the sales agreement product are decimal values (true) or integer values (false)."
      },
      "IsUnderRevision": {
        "type": "boolean",
        "description": "Indicator of whether the sales agreement product or category is under revision or not. In an under revision state, edits can be made and if approved, the edits are automatically incorporated and the sales agreement is reactivated."
      },
      "LastPricingExecIdentifier": {
        "type": "string",
        "description": "The unique identifier for the last price waterfall information."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which this record was referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which this record was viewed."
      },
      "ListPrice": {
        "type": "currency",
        "description": "Price of a product as specified in a price book."
      },
      "Name": {
        "type": "string",
        "description": "Name of the product or category."
      },
      "PlannedMarginPercentage": {
        "type": "percent",
        "description": "The total planned margin amount as a percentage of total planned amount."
      },
      "PricebookEntryId": {
        "type": "reference",
        "description": "ID of the referenced price book."
      },
      "ProductCategoryId": {
        "type": "reference",
        "description": "The product category associated with the sales agreement."
      },
      "ProductId": {
        "type": "reference",
        "description": "ID of the product."
      },
      "SalesAgreementId": {
        "type": "reference",
        "description": "ID of the sales agreement to which the product is added."
      },
      "SalesPrice": {
        "type": "currency",
        "description": "Price per unit of the unit at which you initially decide to sell the product."
      },
      "TotalActualAmount": {
        "type": "currency",
        "description": "Field displaying the sum of actual amounts across all schedules at a given time."
      },
      "TotalActualCostAmount": {
        "type": "currency",
        "description": "The sum of the actual cost amounts across all schedules in a sales agreement."
      },
      "TotalActualMarginAmount": {
        "type": "currency",
        "description": "The sum of the actual margin amounts across all schedules in a sales agreement."
      },
      "TotalActualQuantity": {
        "type": "int",
        "description": "Field displaying the sum of actual quantities across all schedules at a given time."
      },
      "TotalActualQuantityValue": {
        "type": "double",
        "description": "The sum of actual quantities of a product across all schedules in a sales agreement. This field stores the sum of actual quantities in decimals."
      },
      "TotalActualShipmentQuantity": {
        "type": "double",
        "description": "The sum of the actual shipment quantities of a product across all schedules in a sales agreement."
      },
      "TotalClonedActualQuantity": {
        "type": "double",
        "description": "The rolled up cumulative actual quantity based on the cloned actual quantities for each sales agreement product schedule."
      },
      "TotalForecastedAmount": {
        "type": "currency",
        "description": "Field displaying the sum of forecasted amounts across all schedules at a given time."
      },
      "TotalForecastedQuantity": {
        "type": "int",
        "description": "Field displaying the sum of forecasted quantities across all schedules at a given time."
      },
      "TotalForecastedQtyValue": {
        "type": "double",
        "description": "The sum of forecasted quantities of a product across all schedules in a sales agreement. This field stores the sum of forecasted quantities in decimals."
      },
      "TotalPlannedAmount": {
        "type": "currency",
        "description": "Field displaying the sum of planned amounts across all schedules at a given time."
      },
      "TotalPlannedCostAmount": {
        "type": "currency",
        "description": "The sum of the planned cost amounts across all schedules in a sales agreement."
      },
      "TotalPlannedMarginAmount": {
        "type": "currency",
        "description": "The sum of the planned margin amounts across all schedules in a sales agreement."
      },
      "TotalPlannedQuantity": {
        "type": "int",
        "description": "Field displaying the sum of planned quantities across all schedules at a given time."
      },
      "TotalPlannedQuantityValue": {
        "type": "double",
        "description": "The sum of planned quantities of a product across all schedules in a sales agreement. This field stores the sum of planned quantities in decimals."
      },
      "TotalPlannedShipmentQuantity": {
        "type": "double",
        "description": "The sum of the planned shipment quantities of a product across all schedules in a sales agreement."
      },
      "TotalProposedPlannedAmount": {
        "type": "currency",
        "description": "Field displaying the sum of planned amounts across all schedules at a given time when the sales agreement is under revision."
      },
      "TotalProposedPlannedQuantity": {
        "type": "int",
        "description": "Field displaying the sum of planned quantities across all schedules at a given time when the sales agreement is under revision."
      },
      "TotalProposedPlnQtyValue": {
        "type": "double",
        "description": "The sum of proposed quantities of a product across all schedules in a sales agreement. This field stores the sum of proposed quantities in decimals."
      },
      "TotalUnallocatedOrderQuantity": {
        "type": "double",
        "description": "The sum of the unallocated order quantities of a product across all schedules in a sales agreement."
      },
      "TotalUnallocatedOrderRevenue": {
        "type": "currency",
        "description": "The sum of the unallocated order revenue of a product across all schedules in a sales agreement."
      },
      "TotalUnallocatedPlannedQty": {
        "type": "double",
        "description": "The difference between the initial planned quantity value and total planned quantity value of a product that's distributed manually."
      }
    },
    "module": "Manufacturing Cloud"
  }
}