{
  "SalesTrxnItemRelationship": {
    "name": "SalesTrxnItemRelationship",
    "description": "Describes the relationship between sales transaction items; for example, a bundle or set.",
    "properties": {
      "AssociatedItemPricing": {
        "type": "picklist",
        "description": "Describes how the associated sales transaction item is priced, relative to the main sales transaction item."
      },
      "AssociatedSalesTrxnItemId": {
        "type": "reference",
        "description": "The unique identifier of the associated sales transaction item."
      },
      "AssociatedSalesTrxnItemRole": {
        "type": "picklist",
        "description": "Describes the position of the associated sales transaction item in the relationship."
      },
      "ImplementorType": {
        "type": "string",
        "description": "The object that is implementing this object interface; for example, an OrderProduct object."
      },
      "MainSalesTrxnItemId": {
        "type": "reference",
        "description": "The unique identifier of the main sales transaction item."
      },
      "MainSalesTrxnItemRole": {
        "type": "picklist",
        "description": "Indicates the position of the main sales transaction item in the relationship."
      },
      "ProductRelationshipTypeId": {
        "type": "reference",
        "description": "The unique identifier of the record that describes the relationship between the main and associated sales transaction items."
      },
      "QuantityScaleMethod": {
        "type": "picklist",
        "description": "How to scale the quantity of the associated sales transaction item, relative to the main sales transaction item. The value is informative; the system doesn’t check whether the scaled quantities are correct. If this field has a non-null value, you can't edit the associated sales transaction item’s quantity."
      },
      "SalesTransactionId": {
        "type": "reference",
        "description": "The unique identifier of the sales transaction to which the main and associated sales transaction items belong to."
      }
    },
    "module": "Core Salesforce"
  }
}