{
  "SalesAgreementProductSchedule": {
    "name": "SalesAgreementProductSchedule",
    "description": "Represents the quantity or amount and the pricing information of a product or category for a particular schedule of the sales agreement.",
    "properties": {
      "ActualAmount": {
        "type": "currency",
        "description": "Actual amount per product per schedule of a sales agreement."
      },
      "ActualCostAmount": {
        "type": "currency",
        "description": "The cost of manufacturing the actual quantity of a product."
      },
      "ActualMarginAmount": {
        "type": "currency",
        "description": "The difference between the sales price and cost price for the actual quantity of a product."
      },
      "ActualMarginPercentage": {
        "type": "percent",
        "description": "The difference between the sales price and cost price for the actual quantity of a product, expressed as a percentage of the sales price."
      },
      "ActualQuantity": {
        "type": "int",
        "description": "Actual quantity per product per schedule of a sales agreement."
      },
      "ActualQuantityValue": {
        "type": "double",
        "description": "The actual quantity of a product for a specific schedule in a sales agreement. This field stores the actual quantity in decimals."
      },
      "ActualShipmentQuantity": {
        "type": "double",
        "description": "The actual quantity of a product being shipped to a partner."
      },
      "ClonedActualQuantity": {
        "type": "double",
        "description": "The actual quantity copied over from an agreement from which the current sales agreement product schedule was deep cloned."
      },
      "CostPrice": {
        "type": "currency",
        "description": "The cost of manufacturing one unit of a product."
      },
      "DerivedPlannedAmount": {
        "type": "currency",
        "description": "Planned amount per product per schedule of a sales agreement."
      },
      "DiscountPercentage": {
        "type": "percent",
        "description": "Percent of discount per unit of the product for a specific schedule."
      },
      "EndDate": {
        "type": "date",
        "description": "Date on which the schedule ends."
      },
      "ForecastedAmount": {
        "type": "currency",
        "description": "Forecasted amount per product per schedule of a sales agreement."
      },
      "ForecastedQuantity": {
        "type": "int",
        "description": "Forecasted Quantity per product per schedule of a sales agreement."
      },
      "ForecastedQuantityValue": {
        "type": "double",
        "description": "The forecasted quantity of a product for a specific schedule in a sales agreement. This field stores the forecasted quantity in decimals."
      },
      "IsUnderRevision": {
        "type": "boolean",
        "description": "Indicator of whether the sales agreement product schedule is under revision or not. In an under revision state, edits can be made and if approved, the edits are automatically incorporated and the sales agreement is reactivated."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The most recent date on which this record was referenced."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The most recent date on which this record was viewed."
      },
      "MaximumOrderQuantity": {
        "type": "double",
        "description": "The maximum quantity for a product in a single order."
      },
      "MinimumPurchaseQuantity": {
        "type": "double",
        "description": "The minimum quantity of a product that a partner must purchase for a specific schedule."
      },
      "MinimumPurchaseRevenue": {
        "type": "currency",
        "description": "The minimum revenue of a product that must be generated for a specific schedule."
      },
      "Name": {
        "type": "string",
        "description": "User-defined name of the schedule."
      },
      "PlannedAmount": {
        "type": "currency",
        "description": "Planned amount for a product for a specific schedule."
      },
      "PlannedCostAmount": {
        "type": "currency",
        "description": "The cost of manufacturing the planned quantity of a product."
      },
      "PlannedMarginAmount": {
        "type": "currency",
        "description": "The difference between the sales price and cost price for the planned quantity of a product."
      },
      "PlannedMarginPercentage": {
        "type": "percent",
        "description": "The difference between the sales price and cost price for the planned quantity of a product, expressed as a percentage of the sales price."
      },
      "PlannedQuantity": {
        "type": "int",
        "description": "Planned quantity for a product for a specific schedule."
      },
      "PlannedQuantityValue": {
        "type": "double",
        "description": "The planned quantity of a product for a specific schedule in a sales agreement. This field stores the planned quantity in decimals."
      },
      "PlannedShipmentQuantity": {
        "type": "double",
        "description": "The planned quantity of a product to be shipped to a partner."
      },
      "ProposedCostPrice": {
        "type": "currency",
        "description": "The proposed cost for one unit of a product when the sales agreement is under revision."
      },
      "ProposedDerivedPlannedAmount": {
        "type": "currency",
        "description": "Planned amount for a product for a specific schedule when the sales agreement is under revision."
      },
      "ProposedDiscountPercentage": {
        "type": "percent",
        "description": "Discount per unit per schedule of the product at which you want to sell it when the sales agreement is under revision."
      },
      "ProposedPlannedAmount": {
        "type": "currency",
        "description": "Planned amount for a product for a specific schedule when the sales agreement is under revision."
      },
      "ProposedPlannedQuantity": {
        "type": "int",
        "description": "Planned quantity for a product for a specific schedule when the sales agreement is under revision."
      },
      "ProposedPlannedQtyValue": {
        "type": "double",
        "description": "The planned quantity of a product for a specific schedule in a sales agreement that's under revision. This field stores the planned quantity in decimals."
      },
      "ProposedSalesPrice": {
        "type": "currency",
        "description": "Price per unit per schedule of the product at which you want to sell it when the sales agreement is under revision."
      },
      "SalesAgreementProductId": {
        "type": "reference",
        "description": "ID of the sales agreement product of which the schedule is a part."
      },
      "SalesPrice": {
        "type": "currency",
        "description": "Price per unit per schedule of the product at which you want to sell it."
      },
      "StartDate": {
        "type": "date",
        "description": "Date on which the schedule starts."
      },
      "UnallocatedOrderQuantity": {
        "type": "double",
        "description": "The ordered quantity of a product that isn't associated with a sales agreement."
      },
      "UnallocatedOrderRevenue": {
        "type": "currency",
        "description": "The revenue generated from an order that isn't associated with a sales agreement."
      }
    },
    "module": "Manufacturing Cloud"
  }
}