{
  "SalesTransactionItemShape": {
    "name": "SalesTransactionItemShape",
    "description": "Defines the business logic for a sales transaction shape item, for example, an item in an order.",
    "properties": {
      "BasisTransactionItemShapeId": {
        "type": "reference",
        "description": "The ID of the sales transaction shape item to use as a reference when pricing this transaction. For example, when pricing an order, this field refers to the order being canceled. This field is available if Subscription Management is enabled."
      },
      "BillingFrequency": {
        "type": "picklist",
        "description": "The time period that indicates how often the sales transaction shape item is billed. This field is available if Subscription Management is enabled."
      },
      "EndDate": {
        "type": "date",
        "description": "The last day the sales transaction shape item is available. For example, the last day of the subscription. This field is available if Subscription Management is enabled."
      },
      "ListPrice": {
        "type": "currency",
        "description": "The list price for the sales transaction shape item. This value is inherited from the related price book entry."
      },
      "ListPriceTotal": {
        "type": "currency",
        "description": "The list price, inclusive of quantity. This calculated field is equal to ListPrice times Quantity."
      },
      "NetUnitPrice": {
        "type": "currency",
        "description": "The final unit price of the product, after all adjustments are applied."
      },
      "ObligatedAmount": {
        "type": "currency",
        "description": "In a subscription, the amount a subscriber is billed for products used during the subscription period that the subscriber returns before the subscription end date. This field's value is the price for use of the product."
      },
      "ParentTransactionItemShapeId": {
        "type": "reference",
        "description": "The ID of the parent TransactionItemShape."
      },
      "PeriodBoundary": {
        "type": "picklist",
        "description": "The period boundary helps determine the start and end date of the billing periods. This field is available if Subscription Management is enabled."
      },
      "PeriodBoundaryDay": {
        "type": "int",
        "description": "Required when PeriodBoundary is DayOfPeriod. Indicates day of the week or month that marks the period boundary. Must be an integer from 1 through 31. This field is available if Subscription Management is enabled."
      },
      "PeriodBoundaryStartMonth": {
        "type": "picklist",
        "description": "Field is populated based on input in the StartDate, PeriodBoundary, and PeriodBoundaryDay when BillingFrequency is Annual or by manual user entry. Possible values are: 1-January 2-February 3-March 4-April 5-May 6-June 7-July 8-August 9-September 10-October 11-November 12-December"
      },
      "PricebookEntryId": {
        "type": "reference",
        "description": "The ID of the related price book entry. The related price book entry contains all the pricing information about the product being sold."
      },
      "PricingTermCount": {
        "type": "double",
        "description": "A calculated field indicating the number of pricing terms in the subscription. This field is available if Subscription Management is enabled."
      },
      "PricingTransactionType": {
        "type": "picklist",
        "description": "Indicates the type of pricing transaction, for example, a new sale, an amendment, or a renewal. This field is available if Subscription Management is enabled."
      },
      "ProductId": {
        "type": "reference",
        "description": "The ID of the related product."
      },
      "ProductSellingModelId": {
        "type": "reference",
        "description": "The ID of the related product selling model. The product selling model defines one method by which a product can be sold; for example, as a one-time sale, an evergreen subscription, or a termed subscription. This field is available if Subscription Management is enabled."
      },
      "ProrationPolicyId": {
        "type": "reference",
        "description": "The ID of the related proration policy. The proration policy defines how the price is calculated for each subscription period; for example, whether partial periods are allowed, and how remainder amounts are handled. This field is available if Subscription Management is enabled."
      },
      "Quantity": {
        "type": "double",
        "description": "Number of units in the sales transaction shape item."
      },
      "SalesItemType": {
        "type": "picklist",
        "description": "The type of sale."
      },
      "SalesTransactionItemShapeName": {
        "type": "string",
        "description": "Required. The name of the sales transaction shape item."
      },
      "SalesTransactionShapeId": {
        "type": "reference",
        "description": "Required. The ID of the sales transaction shape. A sales transaction shape is the way in which the sales transactions occur. For example, a cart, an order, or a quote."
      },
      "StartDate": {
        "type": "date",
        "description": "The start date of the subscription. This field is available if Subscription Management is enabled."
      },
      "StartingPriceTotal": {
        "type": "currency",
        "description": "The starting unit price, inclusive of quantity, prorated for the duration of the subscription. This field has two ways to obtain its value. The value can be manually entered or automatically calculated. The calculation is equal to StartingUnitPrice times Quantity."
      },
      "StartingUnitPrice": {
        "type": "currency",
        "description": "The unit price before any adjustments."
      },
      "StartingUnitPriceSource": {
        "type": "picklist",
        "description": "Indicates whether the starting unit price was inherited, entered manually, or calculated."
      },
      "StockKeepingUnit": {
        "type": "string",
        "description": "The SKU assigned to the related product."
      },
      "SubscriptionTerm": {
        "type": "int",
        "description": "The number of terms in the subscription. You can indicate a subscription’s length using either the start and end dates, or by using the start date and the subscription term. This field is available if Subscription Management is enabled."
      },
      "TotalAdjustmentAmount": {
        "type": "currency",
        "description": "The sum of all adjustments applied to the related sales transaction shape items, inclusive of quantity, prorated for the duration of the subscription. Includes distributed price adjustment items and price adjustment items applied directly. This calculated field is equal to the sum of TotalAdjustmentAmount on the related sales transaction shape items."
      },
      "TotalAdjustmentDistAmount": {
        "type": "currency",
        "description": "The sum of the distributed price adjustment items applied to the sales transaction shape item, prorated for the duration of the subscription. Doesn’t include price adjustment items that are applied directly. A distributed price adjustment is automatically created to apply a transaction-level adjustment to the transaction items. For example, let’s say that you have an order with two order items: one for a file storage service and another for a video streaming service. A 10% volume discount and a 15% manual discount are applied to the entire order. An additional 20% discount is applied to the file storage service. To distribute the order-level discounts, the system creates a 10% price adjustment item and a 15% price adjustment item for each order item. In this example, the file storage service’s sales transaction shape item has the following field values: TotalAdjustmentAmount — The sum of all item-level adjustments, including the 10% price adjustment item, the 15% price adjustment item, and the 20% price adjustment item. TotalAdjustmentDistAmount— The sum of the distributed item-level adjustments, including the 10% price adjustment item and the 15% price adjustment item."
      },
      "TotalLineAmount": {
        "type": "currency",
        "description": "The total price before price adjustments, inclusive of quantity, prorated for the duration of the subscription. This calculated field is equal to StartingPriceTotal times PricingTermCount."
      },
      "TotalPrice": {
        "type": "currency",
        "description": "The price after all adjustments, inclusive of quantity, prorated for the duration of the subscription. This calculated field is equal to TotalAdjustmentAmount plus StartingPriceTotal."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_salestransactionitemshape.htm"
  }
}