{
  "SandboxProcess": {
    "name": "SandboxProcess",
    "description": "Represents the sandbox copy process for a SandboxInfo record.",
    "properties": {
      "ActivatedById": {
        "type": "reference",
        "description": "A reference to the ID of the user who requested sandbox activation."
      },
      "ActivatedDate": {
        "type": "dateTime",
        "description": "Represents when the sandbox was activated during a refresh."
      },
      "ActivationUserGroupId": {
        "type": "reference",
        "description": "A reference to the ID of the group consisting of users who can access the sandbox. The user who created the sandbox is added to the group by default. Available in API version 60.0 and later."
      },
      "ApexClassId": {
        "type": "reference",
        "description": "A reference to the ID of an Apex class to run after each copy of the sandbox. Running this class allows you to perform DML operations on the sandbox to prepare it for use. The class must extend the System.SandboxPostCopy interface. Available in API version 36.0 and later."
      },
      "AutoActivate": {
        "type": "boolean",
        "description": "Represents whether the sandbox refresh is configured to activate immediately upon completion."
      },
      "CopyArchivedActivities": {
        "type": "boolean",
        "description": "If true, archived activity data is copied to the sandbox."
      },
      "CopyChatter": {
        "type": "boolean",
        "description": "Represents whether archived Chatter data is copied to the sandbox."
      },
      "CopyProgress": {
        "type": "int",
        "description": "Represents how much of a copy has been completed."
      },
      "Description": {
        "type": "string",
        "description": "A description of the sandbox, which helps you distinguish it from other sandboxes."
      },
      "EndDate": {
        "type": "dateTime",
        "description": "Represents when the sandbox copy process finished."
      },
      "Features": {
        "type": "textarea",
        "description": "The list of add-on features to apply after the sandbox is created or refreshed."
      },
      "HistoryDays": {
        "type": "int",
        "description": "Represents the number of days of object history to be copied in the sandbox."
      },
      "LicenseType": {
        "type": "picklist",
        "description": "The sandbox license type. Valid values: ADVANCED_DEV ADVANCED_FULL DEVELOPER DEVELOPER_PRO PARTIAL FULL FULL_PLUS"
      },
      "RefreshAction": {
        "type": "picklist",
        "description": "Editing this field activates or discards a sandbox refresh. Valid values: ACTIVATE DISCARD"
      },
      "SandboxInfoId": {
        "type": "reference",
        "description": "A reference to the ID of the SandboxInfo being processed (create or refresh)."
      },
      "SandboxName": {
        "type": "string",
        "description": "The name of the sandbox."
      },
      "SandboxOrganization": {
        "type": "string",
        "description": "The ID of the org created by the copy process. This field is available in API version 37.0 and later."
      },
      "SourceId": {
        "type": "reference",
        "description": "A reference to the ID of the SandboxInfo that this sandbox is a clone of. This field is used only when cloning a sandbox. When this field is used, LicenseType must be null. Your source sandbox must be an existing, completed sandbox, that belongs to the same production org as the sandbox you’re creating or refreshing. Your SourceId value can’t be the same SandboxInfo that you’re updating. Available in API version 37.0 and later."
      },
      "StartDate": {
        "type": "dateTime",
        "description": "Represents when the sandbox copy process started."
      },
      "Status": {
        "type": "string",
        "description": "Current state of the sandbox copy process."
      },
      "TemplateId": {
        "type": "reference",
        "description": "A reference to the ID of the PartitionLevelScheme that represents the sandbox template associated with the sandbox for this process. A sandbox template selects which objects to copy in a sandbox."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_sandboxprocess.htm"
  }
}