{
  "Scope3PcmtSummary": {
    "name": "Scope3PcmtSummary",
    "description": "Represents the amount that the organization spends for an individual procurement category. Scope 3 procurement summary quantifies the effect on atmospheric warming, represented in tonnes of carbon dioxide equivalent (tCO₂e) by using a matched emission factor from an associated Procurement Emission Factor Item record.",
    "properties": {
      "CalendarYear": {
        "type": "picklist",
        "description": "The year to which this procurement summary record data corresponds."
      },
      "CarbonFootprintReportDate": {
        "type": "date",
        "description": "The date to include in reports and dashboards. The report date can be the reporting end date, the first day of the calendar year in the reporting year, or the current date."
      },
      "CurrencyCode": {
        "type": "picklist",
        "description": "The currency code for this procurement summary record."
      },
      "Description": {
        "type": "textarea",
        "description": "The description for this procurement summary record."
      },
      "InflationRate": {
        "type": "percent",
        "description": "The current inflation rate if you don’t enter the inflation rate override value."
      },
      "InflationRateCalculated": {
        "type": "percent",
        "description": "The inflation rate calculated based on the currency and calendar year of this procurement summary record. This rate is used to adjust emission factors."
      },
      "InflationRateOverride": {
        "type": "percent",
        "description": "The value to override the current inflation rate."
      },
      "IsComplete": {
        "type": "boolean",
        "description": "Indicates whether you’ve entered all the required values."
      },
      "IsRecordLocked": {
        "type": "boolean",
        "description": "Indicates whether the scope 3 procurement summary record is locked for editing because the associated carbon footprint is locked for editing."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PcmtEmssnFctrId": {
        "type": "reference",
        "description": "The procurement emissions factor set record that's used to match procurement items with emissions factors."
      },
      "Scope3CrbnFtprntId": {
        "type": "reference",
        "description": "The scope 3 carbon footprint record associated with this procurement summary record."
      },
      "Scope3EmssnSrcId": {
        "type": "reference",
        "description": "The scope 3 emissions source record associated with this procurement summary record."
      },
      "Scp3EmssnBusinessTravel": {
        "type": "double",
        "description": "The total scope 3 emissions from business travel for all the associated procurement records, included in category 6."
      },
      "Scp3EmssnCapitalGood": {
        "type": "double",
        "description": "The total scope 3 emissions from the production of capital goods for all the associated procurement records, included in category 2."
      },
      "Scp3EmssnDnstrmLeasedAsset": {
        "type": "double",
        "description": "The total scope 3 emissions from the downstream leased assets for all the associated procurement records, included in category 13."
      },
      "Scp3EmssnDnstrmTrnspDistr": {
        "type": "double",
        "description": "The total scope 3 emissions from the transportation and distribution of downstream leased assets for all the associated procurement records, included in category 9."
      },
      "Scp3EmssnEndLifeSoldProdt": {
        "type": "double",
        "description": "The total scope 3 emissions from the end-of-life treatment of sold products for all the associated procurement records, included in category 12."
      },
      "Scp3EmssnFranchise": {
        "type": "double",
        "description": "The total scope 3 emissions from the operation of franchises for all the associated procurement records, included in category 14."
      },
      "Scp3EmssnFuelEnergyActivity": {
        "type": "double",
        "description": "The total scope 3 emissions from the production of fuels and energy for all the associated procurement records, included in category 3."
      },
      "Scp3EmssnInvestment": {
        "type": "double",
        "description": "The total scope 3 emissions from investments for all the associated procurement records, included in category 15."
      },
      "Scp3EmssnProcSoldProduct": {
        "type": "double",
        "description": "The total scope 3 emissions from the processing of sold products for all the associated procurement records, included in category 10."
      },
      "Scp3EmssnPurchGoodsService": {
        "type": "double",
        "description": "The total scope 3 emissions from the production of purchased goods and services for all the associated procurement records, included in category 1."
      },
      "Scp3EmssnUpstrmLeasedAsset": {
        "type": "double",
        "description": "The total scope 3 emissions from the operation of upstream leased assets for all the associated procurement records, included in category 8."
      },
      "Scp3EmssnUpstrmTrnspDistr": {
        "type": "double",
        "description": "The total scope 3 emissions from the transportation and distribution of upstream leased assets for all the associated procurement records, included in category 4."
      },
      "Scp3EmssnUseOfSoldProduct": {
        "type": "double",
        "description": "The total scope 3 emissions from the use of sold products and services for all the associated procurement records, included in category 11."
      },
      "Scp3UncatgEmissions": {
        "type": "double",
        "description": "The total scope 3 uncategorized emissions for all the associated procurement records."
      },
      "Scp3WasteGenInOper": {
        "type": "double",
        "description": "The total scope 3 emissions from the treatment and disposal of generated waste for all the associated procurement records, included in category 5."
      },
      "ScpEmssnEmployeeCommuting": {
        "type": "double",
        "description": "The total scope 3 emissions from the transportation of employees for all the associated procurement records, included in category 7."
      },
      "StnryAssetEnvrSrcId": {
        "type": "reference",
        "description": "The stationary asset environmental source record associated with this procurement summary record."
      },
      "TotalScp3DnstrmEmissions": {
        "type": "double",
        "description": "The total scope 3 emissions from downstream activities. This value is calculated by adding the emissions from transportation and distribution of downstream leased assets, processing and use of sold products, end-of-life treatment of sold products, operation of downstream leased assets, operation of franchises, and investments."
      },
      "TotalScp3Emissions": {
        "type": "double",
        "description": "The total scope 3 emissions for this procurement summary record. This value is calculated based on the associated procurement records."
      },
      "TotalScp3UpstrmEmissions": {
        "type": "double",
        "description": "The total scope 3 emissions from upstream activities. This value is calculated by adding emissions from the transportation and distribution of upstream leased assets, waste generated in operations, business travel, employee commuting, operation of upstream leased assets, and production of purchased goods and services, capital goods, fuel, and energy."
      },
      "TotalSpentAmount": {
        "type": "double",
        "description": "The total amount spent that's calculated based on the associated procurement records."
      }
    },
    "module": "Net Zero Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.netzero_cloud_dev_guide.meta/netzero_cloud_dev_guide/sforce_api_objects_scope3pcmtsummary.htm"
  }
}