{
  "Scope3PcmtItem": {
    "name": "Scope3PcmtItem",
    "description": "Represents the procurement (corporate spending) entry records. Procurement is considered as the amount that the organization spends on goods and services.",
    "properties": {
      "CalculatedScope3EmssnInTco2e": {
        "type": "double",
        "description": "The scope 3 emissions for this procurement item record. This value is calculated based on the amount spent, the total scope 3 emissions per million spent, and the parent procurement summary record’s inflation rate."
      },
      "FinalScorecardEmissions": {
        "type": "double",
        "description": "The final scorecard emissions value when the calculation type is Sustainability Scorecard."
      },
      "IsRecordLocked": {
        "type": "boolean",
        "description": "Indicates whether the scope 3 procurement item record is locked for editing because the associated carbon footprint is locked for editing."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the record."
      },
      "PcmtEmssnFctrSetItemId": {
        "type": "reference",
        "description": "The procurement emissions factor set item that contains the emissions factor to be applied to this procurement item."
      },
      "ProcurementEmssnFactorSetEmssn": {
        "type": "double",
        "description": "The calculated emissions when the calculation type is Procurement Emission Factor Set."
      },
      "ProcurementSummaryId": {
        "type": "reference",
        "description": "The parent scope 3 procurement summary record for this scope 3 procurement item record."
      },
      "ProductEmissionsFactorId": {
        "type": "reference",
        "description": "The product emissions factor that's used to calculate the quantity-based emissions for this procurement item."
      },
      "ProductId": {
        "type": "reference",
        "description": "The product that's being purchased in this procurement item."
      },
      "PurchaseQuantity": {
        "type": "double",
        "description": "The quantity of the items that are purchased in this procurement item."
      },
      "ReportDate": {
        "type": "date",
        "description": "The date to include in reports and dashboards. The report date is set to the spent date, carbon footprint report end date, the first day of the calendar or fiscal year of the carbon footprint reporting year, or the current date."
      },
      "Scope3EmissionsCalculationType": {
        "type": "picklist",
        "description": "The calculation type for the scope 3 emissions."
      },
      "Scope3EmissionsInTco2": {
        "type": "double",
        "description": "The calculated scope 3 emissions if you don’t enter the emissions value provided by the vendor."
      },
      "Scope3GhgCategory": {
        "type": "picklist",
        "description": "The scope 3 GHG category."
      },
      "Scp3QtyBsdEmssnInTco2e": {
        "type": "double",
        "description": "The calculated quantity-based scope 3 emissions for this procurement item record. The value is calculated based on the quantity of items purchased and the product emissions factor."
      },
      "Scp3UncatgEmissions": {
        "type": "double",
        "description": "The scope 3 emissions value if you don’t select the scope 3 GHG category."
      },
      "SpendingCategory1": {
        "type": "string",
        "description": "The first-level spending category for the procurement item."
      },
      "SpendingCategory2": {
        "type": "string",
        "description": "The second-level spending category for the procurement item, that’s a subset of the first-level spending category."
      },
      "SpendingCategory3": {
        "type": "string",
        "description": "The third-level spending category for the procurement item, that’s a subset of the second-level spending category."
      },
      "SpentAmount": {
        "type": "double",
        "description": "The amount spent for this procurement item in the currency selected for the parent procurement summary record."
      },
      "SpentDate": {
        "type": "date",
        "description": "The date when the amount was spent for this procurement item."
      },
      "SupplierId": {
        "type": "reference",
        "description": "The supplier associated with this procurement item."
      },
      "SustainabilityScorecardId": {
        "type": "reference",
        "description": "The parent supplier sustainability scorecard record that's associated with the procurement item."
      },
      "TotScpe3EmssnPerMillionSpent": {
        "type": "double",
        "description": "Total scope 3 emissions per million spent that’s adjusted according to the inflation rate in the associated scope 3 procurement summary record."
      },
      "UnitOfMeasure": {
        "type": "picklist",
        "description": "The unit of measure for the items that are purchased in this procurement item. For custom unit of measure, if the NamespacePrefix exists then this value is {NamespacePrefix}_custom_{DeveloperName of the SustainabilityUom object}; for example, ftPackage_custom_bundle, else this value is custom_{DeveloperName of the SustainabilityUom object}; for example, custom_bundle."
      },
      "VendorPrvdScope3EmssnInTco2e": {
        "type": "double",
        "description": "The scope 3 emissions provided by the vendor to override the calculated total scope 3 emissions."
      }
    },
    "module": "Net Zero Cloud"
  }
}