{
  "ServiceChannel": {
    "name": "ServiceChannel",
    "description": "Represents a channel of work items that are received from your organization—for example, cases, chats, or leads.",
    "properties": {
      "AcwExtensionDuration": {
        "type": "int",
        "description": "The maximum length of time, measured in seconds, an agent can spend on After Conversation Work (ACW) each time they extend the timer. You must set this field if HasAcwExtensionEnabled is set to true. Specify a value from 10 through 3600. Available only for service channels of type Messaging or Voice."
      },
      "AfterConvoWorkMaxTime": {
        "type": "int",
        "description": "The maximum length of time, measured in seconds, an agent has to complete After Conversation Work (ACW). You must set this field if HasAfterConvoWorkTimer is set to true. Specify a value from 10 through 3600. Available only for service channels of type Messaging or Voice.For service channels of type Voice, this field is available in API version 52.0 and later. For service channels of type Messaging, this field is available in API version 56.0 and later."
      },
      "CapacityModel": {
        "type": "picklist",
        "description": "The method that determines when an agent's capacity for a work item is released. With the Status-Based capacity routing model, work remains assigned and applied to an agent’s capacity until the work is completed or reassigned to a different agent. In contrast, the tab-based capacity model releases an agent’s capacity when a work tab is closed in the service console. Possible values are StatusBased and TabBased."
      },
      "CustomSoundId": {
        "type": "reference",
        "description": "CustomSound"
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization."
      },
      "DoesCheckCapOnOwnerChange": {
        "type": "boolean",
        "description": "In the Status-Based capacity routing model, when work is reassigned to a specific agent, you can choose to override the capacity check and keep the work assigned to the agent. The default value is false."
      },
      "DoesCheckCapOnStatusChange": {
        "type": "boolean",
        "description": "In the Status-Based capacity routing model, when work is reopened, you can choose to override the capacity check keep the work assigned to a specific agent. The default value is false."
      },
      "DoesMinimizeWidgetOnAccept": {
        "type": "boolean",
        "description": "Automatically minimizes the Omni-Channel widget when an agent accepts work. The default value is false."
      },
      "DoesOverridePresenceAudio": {
        "type": "boolean",
        "description": "Service channel settings override the audio settings for each agent’s presence configuration. The default value is false."
      },
      "HasAcwExtensionEnabled": {
        "type": "boolean",
        "description": "If set to true, agents can extend their After Conversation Work (ACW) time. Available only if HasAfterConvoWorkTimer is set to true. If set to true, you must also set the AcwExtensionDuration and MaxExtensions fields. The default value is false. Available only for service channels of type Messaging or Voice.This field is available in API version 56.0 and later."
      },
      "HasAfterConvoWorkTimer": {
        "type": "boolean",
        "description": "If set to true, After Conversation Work (ACW) time can be configured for the channel. If set to true, you must also set the AfterConvoWorkMaxTime field. The default value is false. Available only for service channels of type Messaging or Voice.For service channels of type Voice, this field is available in API version 52.0 and later. For service channels of type messaging, this field is available in API version 56.0 and later."
      },
      "HasAutoAcceptEnabled": {
        "type": "boolean",
        "description": "Work items in a service channel open automatically in the agent’s workspace so that the agent doesn’t have to manually accept them. The default value is false."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the service channel."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label of the service channel."
      },
      "MaxExtensions": {
        "type": "picklist",
        "description": "The maximum number of times an agent can extend their After Work Conversation (ACW) time. Specify a value from 1 through 10. You must set this field if HasAcwExtensionEnabled is set to true. Available only for service channels of type Messaging or Voice. This field is available in API version 56.0 and later."
      },
      "RelatedEntity": {
        "type": "picklist",
        "description": "The type of object that’s associated with this service channel. This field is unique within your organization."
      },
      "RoutingConfigurationId": {
        "type": "reference",
        "description": "RoutingConfiguration"
      },
      "SecRoutingPriorityField": {
        "type": "picklist",
        "description": "The name of the standard field or the id of the custom field that is used for secondary routing priority. This field is unique within your organization."
      },
      "SoundLength": {
        "type": "int",
        "description": "The length of time that a sound plays when new work is assigned to an agent."
      },
      "StatusField": {
        "type": "picklist",
        "description": "The picklist field that you use to track work status in the Status-Based capacity routing model. Use ServiceChannelStatusField to specify the values that indicate completed and in-progress work-item status."
      }
    },
    "module": "Core Salesforce"
  }
}