{
  "ServiceTerritoryMember": {
    "name": "ServiceTerritoryMember",
    "description": "Represents a service resource who can be assigned to an appointment in a service territory.",
    "properties": {
      "Address": {
        "type": "address",
        "description": "The member’s address."
      },
      "City": {
        "type": "string",
        "description": "The city of the member’s address. Maximum length is 40 characters."
      },
      "Country": {
        "type": "string",
        "description": "The country of the member’s address. Maximum length is 80 characters."
      },
      "EffectiveEndDate": {
        "type": "dateTime",
        "description": "The date when the service resource is no longer a member of the territory."
      },
      "EffectiveStartDate": {
        "type": "dateTime",
        "description": "The date when the service resource becomes a member of the service territory."
      },
      "GeocodeAccuracy": {
        "type": "picklist",
        "description": "The level of accuracy of a location’s geographical coordinates compared with its physical address. Usually provided by a geocoding service based on the address’s latitude and longitude coordinates."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the territory member was last modified."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the territory member was last viewed."
      },
      "Latitude": {
        "type": "double",
        "description": "Used with Longitude to specify the precise geolocation of the member’s address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "Longitude": {
        "type": "double",
        "description": "Used with Latitude to specify the precise geolocation of the member’s address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "MemberNumber": {
        "type": "string",
        "description": "(Read only) An auto-generated number identifying the service territory member."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The operating hours assigned to the service territory member. If no operating hours are specified, the member is assumed to use their parent service territory’s operating hours. If a member needs special operating hours, create them in Setup and select them in the Operating Hours lookup field on the member’s detail page."
      },
      "PostalCode": {
        "type": "string",
        "description": "The postal code of the member’s address. Maximum length is 20 characters."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The service resource assigned to the service territory."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The service territory that the service resource is assigned to."
      },
      "State": {
        "type": "string",
        "description": "The state of the member’s address. Maximum length is 80 characters."
      },
      "Street": {
        "type": "textarea",
        "description": "The street number and name of the member’s address."
      },
      "TerritoryType": {
        "type": "picklist",
        "description": "Specifies the type of the territory in relation to the resource who is a member."
      }
    },
    "module": "Automotive Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.automotive_cloud.meta/automotive_cloud/sforce_api_objects_serviceterritorymember.htm"
  }
}