{
  "ServiceResourceCapacity": {
    "name": "ServiceResourceCapacity",
    "description": "Represents the maximum number of scheduled hours or number of service appointments that a capacity-based service resource can complete within a specific time period.",
    "properties": {
      "CapacityInHours": {
        "type": "double",
        "description": "The number of hours that the resource can work per time period. You must fill out this field, the CapacityInWorkItems field, or both."
      },
      "CapacityInWorkItems": {
        "type": "int",
        "description": "The total number of service appointments that the resource can complete per time period. You must fill out this field, the CapacityInHours field, or both."
      },
      "CapacityNumber": {
        "type": "string",
        "description": "(Read only) An auto-generated number identifying the capacity record."
      },
      "EndDate": {
        "type": "date",
        "description": "The date the capacity ends; for example, the end date of a contract."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The associated service resource. You can set multiple capacities for a resource as long as their start and end dates do not overlap."
      },
      "StartDate": {
        "type": "date",
        "description": "The date the capacity goes into effect."
      },
      "TimePeriod": {
        "type": "picklist",
        "description": "Days, Hours, or Months. For example, if a resource can work 80 hours per month, the capacity’s Time Period would be Month and Hours per Time Period would be 80."
      }
    },
    "module": "Field Service Lightning",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.field_service_dev.meta/field_service_dev/sforce_api_objects_serviceresourcecapacity.htm"
  }
}