{
  "ServiceContract": {
    "name": "ServiceContract",
    "description": "Represents a customer support contract (business agreement).",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "ID of the account associated with the service contract."
      },
      "ActivationDate": {
        "type": "dateTime",
        "description": "The initial day the service contract went into effect (whereas StartDate may include a renewal date)."
      },
      "AdditionalDiscount": {
        "type": "percent",
        "description": "Extra discount percentage for the service contract. Available in API version 55.0 and later."
      },
      "ApprovalStatus": {
        "type": "picklist",
        "description": "Approval status of the service contract."
      },
      "BillingAddress (beta)": {
        "type": "address",
        "description": "The compound form of the billing address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "BillingCity": {
        "type": "string",
        "description": "Details for the billing address. Maximum size is 40 characters."
      },
      "BillingCountry": {
        "type": "string",
        "description": "Details for the billing address. Maximum size is 40 characters."
      },
      "BillingCountryCode": {
        "type": "picklist",
        "description": "The ISO country code for the service contract’s billing address."
      },
      "BillingLatitude": {
        "type": "double",
        "description": "Used with BillingLongitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "BillingLongitude": {
        "type": "double",
        "description": "Used with BillingLatitude to specify the precise geolocation of a billing address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "BillingPostalCode": {
        "type": "string",
        "description": "Details for the billing address. Maximum size is 20 characters."
      },
      "BillingState": {
        "type": "string",
        "description": "Details for the billing address. Maximum size is 20 characters."
      },
      "BillingStateCode": {
        "type": "picklist",
        "description": "The ISO state code for the service contract’s billing address."
      },
      "BillingStreet": {
        "type": "textarea",
        "description": "Street address for the billing address."
      },
      "ContactId": {
        "type": "reference",
        "description": "Required. ID of the Contact associated with the service contract. Must be a valid ID."
      },
      "ContractNumber": {
        "type": "string",
        "description": "Unique number automatically assigned to the service contract."
      },
      "Description": {
        "type": "textarea",
        "description": "Description of the service contract."
      },
      "Discount": {
        "type": "percent",
        "description": "Discount percentage for the service contract."
      },
      "EndDate": {
        "type": "date",
        "description": "The last day the service contract is in effect."
      },
      "GrandTotal": {
        "type": "currency",
        "description": "Total price of the service contract plus shipping and taxes."
      },
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "LastReferencedDate": {
        "type": "date",
        "description": "The timestamp when the current user last interacted with this record, directly or indirectly. Some sample scenarios are:"
      },
      "LastViewedDate": {
        "type": "date",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "LineItemCount": {
        "type": "int",
        "description": "Number of ContractLineItem records associated with the service contract."
      },
      "Name": {
        "type": "string",
        "description": "Name of the service contract."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who currently owns the service contract."
      },
      "ParentServiceContractId": {
        "type": "reference",
        "description": "The service contract’s parent service contract, if it has one."
      },
      "Pricebook2Id": {
        "type": "reference",
        "description": "ID of the Pricebook2 associated with the service contract. Must be a valid ID."
      },
      "RootServiceContractId": {
        "type": "reference",
        "description": "(Read only) The top-level service contract in a service contract hierarchy. Depending on where a service contract lies in the hierarchy, its root could be the same as its parent."
      },
      "ShippingAddress (beta)": {
        "type": "address",
        "description": "The compound form of the shipping address. Read-only. See Address Compound Fields for details on compound address fields."
      },
      "ShippingCity": {
        "type": "string",
        "description": "Details of the shipping address. Maximum size is 40 characters."
      },
      "ShippingCountry": {
        "type": "string",
        "description": "Details of the shipping address. Country maximum size is 40 characters."
      },
      "ShippingCountryCode": {
        "type": "picklist",
        "description": "The ISO country code for the service contract’s shipping address."
      },
      "ShippingLatitude": {
        "type": "double",
        "description": "Used with ShippingLongitude to specify the precise geolocation of a shipping address. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "ShippingLongitude": {
        "type": "double",
        "description": "Used with ShippingLatitude to specify the precise geolocation of an address. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "ShippingPostalCode": {
        "type": "string",
        "description": "Details of the shipping address. Postal code maximum size is 20 characters."
      },
      "ShippingState": {
        "type": "string",
        "description": "Details of the shipping address. State maximum size is 20 characters."
      },
      "ShippingStateCode": {
        "type": "picklist",
        "description": "The ISO state code for the service contract’s shipping address."
      },
      "ShippingStreet": {
        "type": "textarea",
        "description": "The street address of the shipping address. Maximum of 255 characters."
      },
      "SpecialTerms": {
        "type": "textarea",
        "description": "Any terms specifically agreed to and tracked in the service contract."
      },
      "StartDate": {
        "type": "date",
        "description": "The first day the service contract is in effect."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the service contract, such as Inactive."
      },
      "Subtotal": {
        "type": "currency",
        "description": "Total of the service contract line items (products) before discounts, taxes, and shipping are applied."
      },
      "Tax": {
        "type": "currency",
        "description": "Total taxes for the service contract."
      },
      "Term": {
        "type": "int",
        "description": "Number of months that the service contract is valid."
      },
      "TotalPrice": {
        "type": "currency",
        "description": "Total of the contract line items (products) after discounts and before taxes and shipping."
      }
    },
    "module": "Field Service Lightning",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.field_service_dev.meta/field_service_dev/sforce_api_objects_servicecontract.htm"
  }
}