{
  "ServiceTerritoryMember": {
    "name": "ServiceTerritoryMember",
    "description": "Represents a service resource who can be assigned to service appointments in a service territory in Salesforce Scheduler.",
    "properties": {
      "Address": {
        "type": "address",
        "description": "The member’s address. You can want to list the related service resource’s address in this field."
      },
      "EffectiveEndDate": {
        "type": "datetime",
        "description": "The date when the service resource is no longer a member of the territory. If the resource will be working in the territory for the foreseeable future, leave this field blank. This field is useful for indicating when a temporary relocation ends."
      },
      "EffectiveStartDate": {
        "type": "datetime",
        "description": "The date when the service resource becomes a member of the service territory."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the territory member was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the territory member was last viewed."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The operating hours assigned to the service territory member. If no operating hours are specified, the member is assumed to use their parent service territory’s operating hours. If a member needs special operating hours, create them in Setup and select them in the Operating Hours lookup field on the member’s detail page."
      },
      "Role": {
        "type": "picklist",
        "description": "The role associated with the service resource."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The service resource assigned to the service territory."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The service territory that the service resource is assigned to."
      },
      "TerritoryType": {
        "type": "picklist",
        "description": "Primary, Secondary, or Relocation. The primary territory is typically the territory where the resource works most often—for example, near their home base. Service resources can only have one primary territory. Secondary territories are territories where the resource can be assigned to appointments, if needed. Service resources can have multiple secondary territories. Relocation territories represent temporary moves for service resources. For example, a service resource can have the following territories: Primary territory: West Chicago Secondary territories: East Chicago South Chicago Relocation territory: Manhattan, for a three-month period"
      }
    },
    "module": "Scheduler"
  }
}