{
  "ServiceCrewOwnerSharingRule": {
    "name": "ServiceCrewOwnerSharingRule",
    "description": "Represents the rules for sharing a service crew with user records other than the owner or anyone above the owner in the role hierarchy.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "A description of the sharing rule. Maximum size is 1000 characters."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Corresponds to Rule Name in the user interface. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record."
      },
      "GroupId": {
        "type": "reference",
        "description": "The ID representing the source group. A service crew owned by a User in the source Group triggers the rule to give access."
      },
      "Name": {
        "type": "string",
        "description": "Label of the sharing rule as it appears in the user interface. Limited to 80 characters. Corresponds to Label on the user interface."
      },
      "ServiceResourceAccessLevel": {
        "type": "picklist",
        "description": "A value that represents the type of access granted to the target Group, or UserRole. The possible values are: Read Edit All"
      },
      "UserOrGroupId": {
        "type": "reference",
        "description": "The ID representing the User or Group being granted access."
      }
    },
    "module": "Core Salesforce"
  }
}