{
  "ServiceResource": {
    "name": "ServiceResource",
    "description": "Represents a technician or an asset.",
    "properties": {
      "AssetId": {
        "type": "reference",
        "description": "ID of the Asset."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the resource."
      },
      "IsActive": {
        "type": "boolean",
        "description": "When selected, this option means that the resource can be assigned to appointments. For service tracking purposes, resources can’t be deleted, so deactivating a resource is the best way to send them into retirement.Deactivating a user doesn’t deactivate the related service resource. You can’t create a service resource that is linked to an inactive user."
      },
      "IsPrimary": {
        "type": "boolean",
        "description": "Indicate whether Salesforce Scheduler must consider the service resource record for scheduling appointments (true) or not (false). Note This field is applicable only if the Main Service Resource setting is enabled in your Salesforce org."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the service resource was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the service resource was last viewed."
      },
      "RelatedRecordId": {
        "type": "reference",
        "description": "The associated user. Its label in the UI is User. If the service resource represents a service crew rather than a user, leave the User field blank and select the related crew in the ServiceCrewId field."
      },
      "ResourceType": {
        "type": "picklist",
        "description": "Indicates whether the resource is a Technician (T) or Asset (S). The default value is Technician (T). You can’t add additional resource types."
      }
    },
    "module": "Scheduler"
  }
}