{
  "ServiceAppointment": {
    "name": "ServiceAppointment",
    "description": "Represents an appointment booked through Salesforce Scheduler.",
    "properties": {
      "AccountId": {
        "type": "reference",
        "description": "(Read only) The account associated with the appointment."
      },
      "ActualDuration": {
        "type": "double",
        "description": "The number of minutes that it took the resource to complete the appointment. When values are first added to the Actual Start and Actual End fields, the Actual Duration is automatically populated to list the difference between the Actual Start and Actual End. If the Actual Start and Actual End fields are subsequently updated, the Actual Duration field doesn’t re-update, but you can manually update it."
      },
      "ActualEndTime": {
        "type": "dateTime",
        "description": "The actual date and time the appointment ended."
      },
      "ActualStartTime": {
        "type": "dateTime",
        "description": "The actual date and time the appointment started."
      },
      "AdditionalInformation": {
        "type": "string",
        "description": "Represents additional information about the service appointment,"
      },
      "Address": {
        "type": "address",
        "description": "The address where the appointment is taking place."
      },
      "AppointmentCategoryId": {
        "type": "reference",
        "description": "The ID of the appointment category related to the service appointment. For example, for customers who visit the branch without an appointment, the drop in category is applicable. For pre-booked appointments, the scheduled category is applicable. This field is available in API version 58.0 and later."
      },
      "AppointmentInvitationId": {
        "type": "reference",
        "description": "The ID of the appointment invitation related to the appointment. This field is available in API version 55.0 and later."
      },
      "AppointmentMode": {
        "type": "picklist",
        "description": "The mode of the service appointment.. This field is available in API version 60.0 and later."
      },
      "AppointmentNumber": {
        "type": "string",
        "description": "An auto-assigned number that identifies the appointment."
      },
      "AppointmentType": {
        "type": "picklist",
        "description": "The type of appointment."
      },
      "ApptBookingInfoUrl": {
        "type": "textarea",
        "description": "The appointment booking URL related to the appointment. This field is available in API version 57.0 and later."
      },
      "ArrivalWindowEndTime": {
        "type": "dateTime",
        "description": "The end of the window of time in which the technician is scheduled to arrive at the site. This window is typically larger than the Scheduled Start and End window to allow time for delays and scheduling changes. You can choose to share the Arrival Window Start and End with the customer, but keep the Scheduled Start and End internal-only."
      },
      "ArrivalWindowStartTime": {
        "type": "dateTime",
        "description": "The beginning of the window of time in which the technician is scheduled to arrive at the site. This window is typically larger than the Scheduled Start and End window to allow time for delays and scheduling changes. You can choose to share the Arrival Window Start and End with the customer, but keep the Scheduled Start and End internal-only."
      },
      "AttendeeCount": {
        "type": "int",
        "description": "The number of attendees associated with the service appointment. This field is available in API version 60.0 and later."
      },
      "AttendeeLimit": {
        "type": "int",
        "description": "The maximum number of customers allowed to attend the service appointment. This field is considered when the appointment mode is Group. This field is available in API version 60.0 and later."
      },
      "CancellationReason": {
        "type": "string",
        "description": "The reason for the service appointment cancellation."
      },
      "CheckedInTime": {
        "type": "dateTime",
        "description": "The date and time when the service appointment status changed to CheckedIn. This field is available in API version 60.0 and later."
      },
      "City": {
        "type": "string",
        "description": "The city where the appointment is completed. The maximum length is 40 characters."
      },
      "Comments": {
        "type": "string",
        "description": "The comments for the service appointment."
      },
      "ContactId": {
        "type": "reference",
        "description": "The contact associated with the parent record. If needed, you can manually update the service appointment contact."
      },
      "Country": {
        "type": "string",
        "description": "The country where the appointment is completed. The maximum length is 80 characters."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the appointment."
      },
      "DueDate": {
        "type": "dateTime",
        "description": "The date by which the appointment must be completed. Earliest Start Permitted and Due Date typically reflect terms in the customer’s service-level agreement."
      },
      "Duration": {
        "type": "double",
        "description": "The estimated length of the appointment. The duration is in minutes or hours based on the value selected in the Duration Type field."
      },
      "DurationType": {
        "type": "picklist",
        "description": "The unit of duration."
      },
      "EarliestStartTime": {
        "type": "dateTime",
        "description": "The date after which the appointment must be completed. Earliest Start Permitted and Due Date typically reflect terms in the customer’s service-level agreement."
      },
      "Email": {
        "type": "email",
        "description": "The email address."
      },
      "EngagementChannelTypeId": {
        "type": "reference",
        "description": "The engagement channel type that's associated with the service appointment. This field is available in API version 56.0 and later."
      },
      "GroupAppointmentAccessType": {
        "type": "picklist",
        "description": "The users who can access the group service appointment. Valid values are: AddedAndExperienceSiteAndInvitedUsers—Added, Experience Site, and Invited Users AddedAndExperienceSiteUsers—Added and Experience Site Users AddedUsers—Added Users"
      },
      "IsAnonymousBooking": {
        "type": "boolean",
        "description": "Indicates whether a service resource was automatically assigned to the appointment (true) or not (false). The default value is false."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the service appointment was last modified. Its label in the user interface is LastModifiedDate."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the service appointment was last viewed."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the service appointment."
      },
      "ParentRecordId": {
        "type": "reference",
        "description": "The parent record associated with the appointment. The parent record can’t be updated after the service appointment is created."
      },
      "ParentRecordType": {
        "type": "string",
        "description": "(Read only) The type of parent record: Account."
      },
      "Phone": {
        "type": "phone",
        "description": "The phone number."
      },
      "PostalCode": {
        "type": "string",
        "description": "The postal code where the appointment is completed. The maximum length is 20 characters."
      },
      "SchedEndTime": {
        "type": "dateTime",
        "description": "The time at which the appointment is scheduled to end. ScheduledEnd – ScheduledStart = EstimatedDuration."
      },
      "SchedStartTime": {
        "type": "dateTime",
        "description": "The time at which the appointment is scheduled to start."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The service territory associated with the appointment."
      },
      "State": {
        "type": "string",
        "description": "The state where the service appointment is completed. The maximum length is 80 characters."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the appointment. The picklist includes the following values, which can be customized: None—Default value. CheckedIn—Checked In Scheduled—Appointment has been assigned to a service resource. Dispatched—Assigned service resource has been notified about their assignment. In Progress—Work has begun. Completed—Work is complete. Cannot Complete—Work couldn’t be completed. Canceled—Work is canceled, typically before any work began"
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "The category that each Status value falls into. The StatusCategory field’s values are identical to the default Status values except CheckedIn. Use the CheckedIn value for drop-in customers.If you create custom Status values, you must indicate which category it belongs to. For example, if you create a Customer Absent value, you can decide that it belongs in the Cannot Complete category. To learn which processes reference StatusCategory, see How are Status Categories Used?"
      },
      "Street": {
        "type": "textarea",
        "description": "The street number and name where the service appointment is completed."
      },
      "Subject": {
        "type": "string",
        "description": "A short phrase describing the appointment."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The work type associated with the service appointment."
      }
    },
    "module": "Scheduler"
  }
}