{
  "ServiceAppointment": {
    "name": "ServiceAppointment",
    "description": "Represents a service appointment booked through Automotive Scheduler, for test drives or vehicle services.",
    "properties": {
      "ActualDuration": {
        "type": "double",
        "description": "The number of minutes that it took the resource to complete the appointment. When values are first added to the Actual Start and Actual End fields, the Actual Duration is automatically populated to list the difference between the Actual Start and Actual End. If the Actual Start and Actual End fields are subsequently updated, the Actual Duration field doesn’t re-update, but you can manually update it."
      },
      "ActualEndTime": {
        "type": "dateTime",
        "description": "The actual date and time the appointment ended."
      },
      "ActualStartTime": {
        "type": "dateTime",
        "description": "The actual date and time the appointment started."
      },
      "AdditionalInformation": {
        "type": "string",
        "description": "Represents additional information about the service appointment."
      },
      "Address": {
        "type": "address",
        "description": "The address where the appointment is taking place."
      },
      "AppointmentNumber": {
        "type": "string",
        "description": "An auto-assigned number that identifies the appointment."
      },
      "ArrivalWindowEndTime": {
        "type": "dateTime",
        "description": "The end of the window of time in which the technician is scheduled to arrive at the site."
      },
      "ArrivalWindowStartTime": {
        "type": "dateTime",
        "description": "The beginning of the window of time in which the technician is scheduled to arrive at the site."
      },
      "CancellationReason": {
        "type": "string",
        "description": "The reason for the service appointment cancellation."
      },
      "City": {
        "type": "string",
        "description": "The city where the appointment is completed. Maximum length is 40 characters."
      },
      "Comments": {
        "type": "string",
        "description": "The comments for the service appointment."
      },
      "Country": {
        "type": "string",
        "description": "The country where the appointment is completed. Maximum length is 80 characters."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the appointment."
      },
      "DueDate": {
        "type": "dateTime",
        "description": "The date by which the appointment must be completed."
      },
      "Duration": {
        "type": "double",
        "description": "The estimated length of the appointment as derived from the associated work type. The duration is in minutes or hours based on the value selected in the Duration Type field."
      },
      "DurationType": {
        "type": "picklist",
        "description": "The unit of duration as specified for the associated work type."
      },
      "EarliestStartTime": {
        "type": "dateTime",
        "description": "The date after which the appointment must be completed."
      },
      "GeocodeAccuracy": {
        "type": "picklist",
        "description": "The level of accuracy of a location’s geographical coordinates compared with its physical address. Usually provided by a geocoding service based on the address’s latitude and longitude coordinates."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the service appointment was last modified."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the service appointment was last viewed."
      },
      "Latitude": {
        "type": "double",
        "description": "Used with Longitude to specify the precise geolocation of the address where the service appointments is completed. Acceptable values are numbers between –90 and 90 with up to 15 decimal places."
      },
      "Longitude": {
        "type": "double",
        "description": "Used with Latitude to specify the precise geolocation of the address where the service appointment is completed. Acceptable values are numbers between –180 and 180 with up to 15 decimal places."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the appointment."
      },
      "ParentRecordId": {
        "type": "reference",
        "description": "The parent record related to the appointment. The parent record can’t be updated after the service appointment is created. For test drive appointments, the parent record is a lead or an opportunity. For vehicle service appointments, theparent record is an asset that’s related to the vehicle."
      },
      "ParentRecordType": {
        "type": "string",
        "description": "(Read only) The type of parent record that provides context for the appointment, such as Asset, Lead, or Opportunity."
      },
      "PostalCode": {
        "type": "string",
        "description": "The postal code where the appointment is completed. Maximum length is 20 characters."
      },
      "SchedEndTime": {
        "type": "dateTime",
        "description": "The time at which the appointment is scheduled to end."
      },
      "SchedStartTime": {
        "type": "dateTime",
        "description": "The time at which the appointment is scheduled to start."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The service territory associated with the appointment."
      },
      "State": {
        "type": "string",
        "description": "The state where the service appointment is completed. Maximum length is 80 characters."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the appointment. The picklist values can be customized."
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "The category that each Status value falls into. The Status Category field’s values are identical to the default Status values."
      },
      "Street": {
        "type": "textarea",
        "description": "The street number and name where the service appointment is completed."
      },
      "Subject": {
        "type": "string",
        "description": "An autopopulated phrase describing the type of appointment, such as Test Drive Appointment or Vehicle Service Appointment."
      },
      "WorkTypeId": {
        "type": "reference",
        "description": "The work type associated with the service appointment."
      }
    },
    "module": "Automotive Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.automotive_cloud.meta/automotive_cloud/sforce_api_objects_serviceappointment.htm"
  }
}