{
  "ServiceTerritory": {
    "name": "ServiceTerritory",
    "description": "Represents a geographic or functional region in which work can be performed in Salesforce Scheduler.",
    "properties": {
      "Address": {
        "type": "address",
        "description": "An address to associate with the territory. You can want to list the address of the territory’s headquarters."
      },
      "City": {
        "type": "string",
        "description": "The city of the associated address. Maximum length is 40 characters."
      },
      "Country": {
        "type": "string",
        "description": "The country to associate with the territory. Maximum length is 80 characters."
      },
      "Description": {
        "type": "textarea",
        "description": "The description of the territory."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the service territory is meant to be used. If a territory is inactive, you can’t add members to it or link it to service appointments."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date when the territory was last modified. Its label in the user interface is Last Modified Date."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the territory was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the territory."
      },
      "OperatingHoursId": {
        "type": "reference",
        "description": "The territory’s operating hours, which indicate when service appointments within the territory can occur. Service resources who are members of a territory automatically inherit the territory’s operating hours unless different hours are specified on the resource record."
      },
      "PostalCode": {
        "type": "string",
        "description": "The postal code of the address associated with the territory. Maximum length is 20 characters."
      },
      "PricebookId": {
        "type": "reference",
        "description": "This field creates a foreign key relationship with the PriceBook record, storing data related to pricing."
      },
      "State": {
        "type": "string",
        "description": "The state of the address associated with the territory. Maximum length is 80 characters."
      },
      "Street": {
        "type": "textarea",
        "description": "The street number and name of the address associated with the territory."
      }
    },
    "module": "Scheduler"
  }
}