{
  "ShiftSegmentType": {
    "name": "ShiftSegmentType",
    "description": "Represents a type of activity scheduled within a shift.",
    "properties": {
      "AdherenceThreshold": {
        "type": "int",
        "description": "A threshold, in minutes. If the agent starts the scheduled activity within this threshold, the shift segment activity is in adherence."
      },
      "Category": {
        "type": "picklist",
        "description": "A category for the type of shift segment."
      },
      "Color": {
        "type": "string",
        "description": "Sets a background color when shift activities of this type are displayed in the UI. Use a 3- or 6-digit hexadecimal format, for example #FF00FF."
      },
      "Description": {
        "type": "textarea",
        "description": "A description of the shift segment type."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores. In managed packages, this field prevents naming conflicts on package installations. With this field, a developer can change the object’s name in a managed package and the changes are reflected in a subscriber’s organization. Note When creating large sets of data, always specify a unique DeveloperName for each record. If no DeveloperName is specified, performance slows down while Salesforce generates one for each record. Note Only users with View DeveloperName OR View Setup and Configuration permission can view, group, sort, and filter this field."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates if the shift segment type is active (true) or not (false)."
      },
      "Language": {
        "type": "picklist",
        "description": "The language of the shift segment type."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The label of the shift segment type."
      },
      "ServicePresenceStatusId": {
        "type": "reference",
        "description": "The unique ID of the associated service presence status for segments of this type."
      }
    },
    "module": "Core Salesforce"
  }
}