{
  "Shift": {
    "name": "Shift",
    "description": "Represents a shift for service resource scheduling.",
    "properties": {
      "AppointmentCategoryId": {
        "type": "reference",
        "description": "This field is a relationship field. Available in API version 61.0 and later."
      },
      "BackgroundColor": {
        "type": "string",
        "description": "Sets a background color for shifts shown in the UI. Use a 3- or 6-digit hexadecimal format. For example, #FF00FF. Available in API version 55.0 and later."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The date and time that the shift ends."
      },
      "Label": {
        "type": "string",
        "description": "The label that a shift is given."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time when the current user last viewed a related record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time when the current user last viewed this record."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The owner of the shift."
      },
      "RecurrenceEndDate": {
        "type": "date",
        "description": "The date when the recurrence period ends. The date must be after the Recurrence Start Date. The value for this field is retrieved from the pattern defined in the RecurrencePattern field. You can define the end date by using the COUNT or UNTIL parameter in the RecurrencePattern field. If you specify a value in this field and define a recurrence pattern, Salesforce Scheduler overrides the value with the end date in the recurrence pattern.The recurrence period is limited to 180 days. This field is available in API version 56.0 and later."
      },
      "RecurrencePattern": {
        "type": "string",
        "description": "The RRULE that describes the recurrence pattern for recurring shifts. Supports a subset of the RFC 5545 standard for internet calendaring and scheduling. See the Salesforce Scheduler Recurring Shifts section in this topic for usage examples. The period for the recurrence pattern is limited to 180 days. This field is available in API version 56.0 and later."
      },
      "RecurrenceStartDate": {
        "type": "date",
        "description": "The date when the recurrence period begins. The date must be before the Recurrence End Date. The value for this field is retrieved from the StartTime field. Don’t modify the value for this field.This field is available in API version 56.0 and later."
      },
      "ServiceResourceId": {
        "type": "reference",
        "description": "The ID of the service resource the shift belongs to. Available in API versions 47.0 and later."
      },
      "ServiceTerritoryId": {
        "type": "reference",
        "description": "The ID of the service territory the shift belongs to. Available in API versions 47.0 and later."
      },
      "ShiftNumber": {
        "type": "string",
        "description": "The number automatically given to the shift upon creation."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The date and time that the shift starts."
      },
      "Status": {
        "type": "picklist",
        "description": "Describes the status of the shift. Users can create custom values."
      },
      "StatusCategory": {
        "type": "picklist",
        "description": "Describes the status of the shift using static values. This field is derived from Status using the mapping defined in setup."
      },
      "TimeSlotType": {
        "type": "picklist",
        "description": "Type of time slot for the shift. The same setup values as the TimeSlot field in the OperatingHours object."
      },
      "Type": {
        "type": "picklist",
        "description": "Type of shift."
      },
      "WorkTypeGroupId": {
        "type": "reference",
        "description": "The ID of the work type group the shift belongs to. Available in API versions 54.0 and later."
      }
    },
    "module": "Scheduler"
  }
}