{
  "SignupRequest": {
    "name": "SignupRequest",
    "description": "Represents a request for a new sign-up.",
    "properties": {
      "AuthCode": {
        "type": "string",
        "description": "A one-time authorization code that can be exchanged for an OAuth access token and refresh token using standard Salesforce APIs. It’s used with ConnectedAppCallbackUrl and ConnectedAppConsumerKey when the specified connected app hasn’t been configured with an X.509 certificate. The system provides this read-only field after the sign-up request has been processed. This field is available in API version 29.0 and later."
      },
      "Company": {
        "type": "string",
        "description": "The name of the company requesting the trial sign-up."
      },
      "ConnectedAppCallbackUrl": {
        "type": "string",
        "description": "When used with ConnectedAppConsumerKey, specifies a connected app that’s approved automatically during the sign-up creation. This field is available in API version 28.0 and later."
      },
      "ConnectedAppConsumerKey": {
        "type": "string",
        "description": "When used with ConnectedAppCallbackUrl, specifies a connected app that’s approved automatically during the sign-up creation. This field is available in API version 28.0 and later."
      },
      "Country": {
        "type": "string",
        "description": "The default value is the country of the requesting org. To override the default, enter the two-character, uppercase ISO-3166 country code (Alpha-2 code). A complete list of the codes is located at https://www.iso.org/obp/ui/#search. The language of the trial org is auto-determined based on the value of this field."
      },
      "CreatedOrgId": {
        "type": "string",
        "description": "The 15-character org ID of the trial org created. The system provides this read-only field after the sign-up request has been processed."
      },
      "CreatedOrgInstance": {
        "type": "string",
        "description": "The server instance of the new trial org, for example, “na8.” This field is available in API version 29.0 and later."
      },
      "Edition": {
        "type": "picklist",
        "description": "The Salesforce template that is used to create the trial org. Possible values are Partner Group, Professional, Partner Professional, Sales Enterprise, Professional TSO, Enterprise, Partner Enterprise, Service Professional, Enterprise TSO, Developer, and Partner Developer. This field is available in API version 35.0 and later."
      },
      "ErrorCode": {
        "type": "string",
        "description": "The error code if the sign-up request isn’t successful. The system provides this read-only field for support purposes."
      },
      "FirstName": {
        "type": "string",
        "description": "The first name of the admin user for the trial sign-up."
      },
      "LastName": {
        "type": "string",
        "description": "The last name of the admin user for the trial sign-up."
      },
      "PreferredLanguage": {
        "type": "picklist",
        "description": "The language of the trial org being created. Specify the language using a language code listed under Fully Supported Languages in Supported Languages in Salesforce Help. For example, use zh_CN for simplified Chinese. The value you select overrides the language set by the locale. If you specify an invalid language, the org defaults to the default language of the country. Likewise, if you specify a language that isn’t supported by the Salesforce edition associated with your trial template, the trial org defaults to the default language of the country. This field is available in API version 35.0 and later."
      },
      "ResolvedTemplateId": {
        "type": "string",
        "description": "Populated during the sign-up request and for internal use by Salesforce. This field is available in API version 35.0 and later."
      },
      "ShouldConnectToEnvHub": {
        "type": "boolean",
        "description": "When set to true, the trial org is connected to the Environment Hub. The sign-up must take place in the hub main org or a spoke org. This field is available in API version 35.0 and later."
      },
      "SignupEmail": {
        "type": "email",
        "description": "The email address of the admin user for the trial sign-up."
      },
      "SignupSource": {
        "type": "string",
        "description": "A user-specified description of the trial sign-up, up to 60 characters. This field is available in API version 36.0 and later."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the request. Possible values are New, In Progress, Error, or Success. The default is New."
      },
      "Subdomain": {
        "type": "string",
        "description": "The My Domain name for the new trial org used in the org’s login and application URLs. In Developer Edition orgs, your name must contain at least 3 characters and no more than 27 characters. In all other editions, it must be at least 3 characters and no more than 34 characters. It can include letters, numbers, and hyphens, but you can’t start the name with a hyphen. If you don’t choose a My Domain during sign-up, Salesforce assigns one for you based on your company name. If you don’t like the one we set, you can change it. For details, see My Domain in Salesforce Help."
      },
      "SuppressSignupEmails": {
        "type": "boolean",
        "description": "When set to true, no sign-up emails are sent when the trial org is created. This field is used for the Proxy Signup feature and is available in API version 29.0 and later."
      },
      "TemplateId": {
        "type": "string",
        "description": "The 15-character ID of the Trialforce template that is the basis for the trial sign-up. Salesforce must approve the template. If you don’t specify an edition, a template ID is required."
      },
      "TrialDays": {
        "type": "anyType",
        "description": "The duration of the trial sign-up in days. Must be equal to or less than the trial days for the approved Trialforce template. If not provided, it defaults to the trial duration specified for the Trialforce template."
      },
      "TrialSourceOrgId": {
        "type": "string",
        "description": "The 15-character org ID of the Trialforce Source Organization (TSO) from which the Trialforce template was created."
      },
      "Username": {
        "type": "string",
        "description": "The username of the admin user for the trial sign-up. It must follow the address convention specified in RFC822: www.w3.org/Protocols/rfc822/#z10."
      }
    },
    "module": "Core Salesforce"
  }
}