{
  "SiteEventLog": {
    "name": "SiteEventLog",
    "description": "SiteEventLog stores details of Site.com requests. Requests can originate from the browser (UI).",
    "properties": {
      "ClientIp": {
        "type": "string",
        "description": "The IP address of the client that’s using Salesforce services. A Salesforce internal IP (such as a login from AppExchange) is shown as “Salesforce.com IP”."
      },
      "CpuTime": {
        "type": "double",
        "description": "The CPU time in milliseconds used to complete the request. This field indicates the amount of activity taking place in the app server layer."
      },
      "DatabaseTotalTime": {
        "type": "double",
        "description": "The time in nanoseconds for a database round trip. Includes time spent in the JDBC driver, network to the database, and DB_CPU_TIME. Compare this field to CPU_TIME to determine whether performance issues are occurring in the database layer or in your own code."
      },
      "HttpHeaders": {
        "type": "string",
        "description": "The HTTP headers that were sent in the request."
      },
      "HttpMethod": {
        "type": "string",
        "description": "The HTTP method of the request. For example: GET, POST, PUT, and so on."
      },
      "IsApi": {
        "type": "boolean",
        "description": ""
      },
      "IsError": {
        "type": "boolean",
        "description": "True if this page was an error page."
      },
      "IsFirstRequest": {
        "type": "boolean",
        "description": "True if this page is the first Visualforce transaction in the request."
      },
      "IsGuest": {
        "type": "boolean",
        "description": "True if this page was a guest (unauthenticated) request."
      },
      "IsSecure": {
        "type": "boolean",
        "description": "True if this request is secure."
      },
      "LoginKey": {
        "type": "string",
        "description": "The string that ties together all events in a given user’s login session. It starts with a login event and ends with either a logout event or the user session expiring. For example: GeJCsym5eyvtEK2I."
      },
      "PageName": {
        "type": "string",
        "description": "The name of the Visualforce page that was requested."
      },
      "QueryString": {
        "type": "string",
        "description": "The SOQL query, if one was performed."
      },
      "RequestIdentifier": {
        "type": "string",
        "description": "The unique ID of a single transaction. A transaction can contain one or more events. Each event in a given transaction has the same REQUEST_ID. For example: 3nWgxWbDKWWDIk0FKfF5DV."
      },
      "RequestStatus": {
        "type": "string",
        "description": "The status of the request for a page view or user interface action. This field can have a blank value."
      },
      "RequestType": {
        "type": "String",
        "description": "Possible values are: page—a normal request for a page content_UI—a content request for a page that originated in the user interface content_apex—a content request initiated by an Apex call PDF_UI—a request for a page in PDF format through the user interface PDF_apex—a request for PDF format by an Apex call (usually a Web Service call)"
      },
      "RunTime": {
        "type": "double",
        "description": "The amount of time that the request took in milliseconds."
      },
      "SessionKey": {
        "type": "string",
        "description": "The user’s unique session ID. You can use this value to identify all user events within a session. When a user logs out and logs in again, a new session is started. For example: d7DEq/ANa7nNZZVD."
      },
      "SiteIdentifier": {
        "type": "string",
        "description": "The 15-character ID of the Site.com site."
      },
      "Timestamp": {
        "type": "dateTime",
        "description": "The access time of Salesforce services in GMT. For example: 20130715233322.670."
      },
      "Uri": {
        "type": "string",
        "description": "The URI of the page that’s receiving the request. For example: home/home.jsp."
      },
      "UserIdentifier": {
        "type": "string",
        "description": "The 18-character ID of the user who’s using Salesforce services through the UI or the API. For example: 00530000009M943YAS."
      },
      "UserType": {
        "type": "string",
        "description": "The category of user license."
      }
    },
    "module": "Core Salesforce"
  }
}