{
  "SlaProcess": {
    "name": "SlaProcess",
    "description": "Represents an entitlement process associated with an Entitlement.",
    "properties": {
      "BusinessHoursId": {
        "type": "reference",
        "description": "Required. ID of the BusinessHours associated with the entitlement. Must be a valid business hours ID."
      },
      "Description": {
        "type": "textarea",
        "description": "A description of the entitlement process."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the entitlement process is active (true) or not (false)."
      },
      "IsVersionDefault": {
        "type": "boolean",
        "description": "Indicates whether the entitlement process is the default version (true) or not (false)."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date when the SlaProcess was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the entitlement process."
      },
      "NameNorm": {
        "type": "string",
        "description": "The read-only value for the unique name of the entitlement process or the entitlement process version. If entitlement versioning is enabled, this value is automatically generated for each version of an entitlement process in this form: process name+_v + x, where x is the version number (for example, “gold_support_v2”)."
      },
      "SObjectType": {
        "type": "picklist",
        "description": "The type of records that the entitlement process can run on. Its values are: Case Work Order An entitlement process runs only on records that match its type. For example, a Case entitlement process that’s applied to an entitlement runs only on cases associated with the entitlement, not on work orders. As a best practice, therefore, manage customers’ work orders and cases on separate entitlements.The field label in the user interface is Entitlement Process Type."
      },
      "StartDateField": {
        "type": "picklist",
        "description": "The criteria for cases to enter the entitlement process. Cases can enter the process based on: The creation date on a case A custom date/time field on a case"
      },
      "VersionMaster": {
        "type": "string",
        "description": "Identifies the sequence of versions to which this entitlement process belongs. This field’s contents can be any value as long as it is identical among all versions of the entitlement process."
      },
      "VersionNotes": {
        "type": "textarea",
        "description": "The description of the entitlement process version."
      },
      "VersionNumber": {
        "type": "int",
        "description": "The version number of the entitlement process. Must be 1 or greater."
      }
    },
    "module": "Core Salesforce",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_slaprocess.htm"
  }
}