{
  "Solution": {
    "name": "Solution",
    "description": "Represents a detailed description of a customer issue and the resolution of that issue.",
    "properties": {
      "IsDeleted": {
        "type": "boolean",
        "description": "Indicates whether the object has been moved to the Recycle Bin (true) or not (false). Label is Deleted."
      },
      "IsHtml": {
        "type": "boolean",
        "description": "Indicates whether the Solution is an HTML solution (true) or not (false)."
      },
      "IsOutOfDate": {
        "type": "boolean",
        "description": "Read-only field that indicates whether a solution master has been updated since the translated version was created (true) or not (false). Note that this field does not appear in the page layout of master solutions."
      },
      "IsPublished": {
        "type": "boolean",
        "description": "Indicates whether the Solution has been published (true) or not (false). A solution’s published state does not affect how it can be used, or whether you can query, update, or delete it. Label is Public. Note Prior to Spring ‘14, the label was Visible in Self-Service Portal."
      },
      "IsPublishedInPublicKb": {
        "type": "boolean",
        "description": "Indicates whether the Solution has been published as a Public Solution (true) or not (false). Label is Visible in Public Knowledge Base. This field only applies to solutions, not articles in the public knowledge base."
      },
      "IsReviewed": {
        "type": "boolean",
        "description": "Indicates whether the Solution has been reviewed (true) or not (false). This flag can only be set indirectly via the Status picklist. Each predefined Status value implies an IsReviewed value. Label is Reviewed."
      },
      "LastReferencedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last interacted with this record, directly or indirectly. Some sample scenarios are:"
      },
      "LastViewedDate": {
        "type": "datetime",
        "description": "The timestamp when the current user last viewed this record or list view. If this value is null, it’s possible that the user only accessed this record or list view (LastReferencedDate), but not viewed it."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the User who owns the Solution."
      },
      "ParentId": {
        "type": "reference",
        "description": "ID of the master solution, if this is the translation of a master solution."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": "ID of the RecordType to which the Solution is associated."
      },
      "SolutionLanguage": {
        "type": "picklist",
        "description": "The language that the solution is written in, such as French or Chinese (Traditional)."
      },
      "SolutionName": {
        "type": "string",
        "description": "Required. If a client application creates a new Solution and a value for this field is unspecified, a hyphen (-), the default value for this field, is used. Limit: 255 characters. Label is Title."
      },
      "SolutionNote": {
        "type": "textarea",
        "description": "The details of the Solution record. Limit: 32,000 characters. Label is Solution Details. Note If you have HTML Solutions enabled, any HTML tags used in this field are verified before the object is created or updated. If invalid HTML is entered, an error is thrown. Any JavaScript used in this field is removed before the object is created or updated."
      },
      "SolutionNumber": {
        "type": "string",
        "description": "An identifying number that is assigned automatically when a solution is created. It can’t be set directly, and it can’t be modified."
      },
      "Status": {
        "type": "picklist",
        "description": "Required. The status of the solution. Directly controls the IsReviewed value. To obtain the status values in the picklist, a client application can query the SolutionStatus."
      },
      "TimesUsed": {
        "type": "int",
        "description": "Number of times this solution has been used. Label is Num Related Case."
      }
    },
    "module": "Core Salesforce"
  }
}