{
  "SOSSession": {
    "name": "SOSSession",
    "description": "This object is automatically created for each SOS session and stores information about the session.",
    "properties": {
      "AppVersion": {
        "type": "string",
        "description": "The version of the customer’s mobile application in which SOS is implemented."
      },
      "CaseId": {
        "type": "reference",
        "description": "The ID of the case that’s associated with the SOS session."
      },
      "ContactId": {
        "type": "reference",
        "description": "The ID of the contact that’s associated with the SOS session."
      },
      "DeploymentId": {
        "type": "reference",
        "description": "The ID of the SOS deployment that the SOS session originated from."
      },
      "EndTime": {
        "type": "dateTime",
        "description": "The time that the SOS session ended."
      },
      "IpAddress": {
        "type": "string",
        "description": "To protect the customer’s privacy, this field is now blank."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that the session record was last referenced by a user."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time that the session record was last viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the session."
      },
      "OpentokSession": {
        "type": "encryptedstring",
        "description": "The ID of the OpenTok session that’s associated with the SOS video call."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the session record’s owner."
      },
      "SessionDuration": {
        "type": "int",
        "description": "The amount of time that the SOS session lasted."
      },
      "SessionRecordingUrl": {
        "type": "url",
        "description": "The URL where the SOS session recording is stored."
      },
      "SosVersion": {
        "type": "string",
        "description": "The version of SOS that was used in your organization’s mobile application when this session occurred."
      },
      "StartTime": {
        "type": "dateTime",
        "description": "The time that the SOS session began."
      },
      "SystemInfo": {
        "type": "string",
        "description": "Information about the customer’s mobile device from which the SOS call originated, such as the device’s operating system."
      },
      "WaitDuration": {
        "type": "int",
        "description": "The amount of time the customer waited before an agent accepted the SOS session and the call began."
      }
    },
    "module": "Core Salesforce"
  }
}