{
  "StaticResource": {
    "name": "StaticResource",
    "description": "Represents a static resource that can be used in Visualforce markup.",
    "properties": {
      "Body": {
        "type": "base64",
        "description": "Required. Encoded file data."
      },
      "BodyLength": {
        "type": "int",
        "description": "Size of the file (in bytes)."
      },
      "CacheControl": {
        "type": "picklist",
        "description": "The sharing policy for the static resource when cached. The cache control can have one of these values: Private specifies that the static resource is accessible to all authenticated users. The static resource is stored on the Salesforce server in a user’s individual cache for the duration of the session. Public specifies that the static resource is accessible after caching to all internet traffic, including unauthenticated users. The resource is stored on the Salesforce server in a shared cache, which results in faster load times."
      },
      "ContentType": {
        "type": "string",
        "description": "Type of content. Label is Mime Type. Limit: 120 characters."
      },
      "Description": {
        "type": "textarea",
        "description": "Text description of the static resource. Limit: 255 characters."
      },
      "Name": {
        "type": "string",
        "description": "Required. Name of the static resource."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace prefix that is associated with this object. Each Developer Edition org that creates a managed package has a unique namespace prefix. Limit: 15 characters. You can refer to a component in a managed package by using the namespacePrefix__componentName notation. The namespace prefix can have one of the following values. In Developer Edition orgs, NamespacePrefix is set to the namespace prefix of the org for all objects that support it, unless an object is in an installed managed package. In that case, the object has the namespace prefix of the installed managed package. This field’s value is the namespace prefix of the Developer Edition org of the package developer. In orgs that are not Developer Edition orgs, NamespacePrefix is set only for objects that are part of an installed managed package. All other objects have no namespace prefix."
      }
    },
    "module": "Core Salesforce"
  }
}