{
  "StnryAssetWaterActvty": {
    "name": "StnryAssetWaterActvty",
    "description": "Represents information about the water activities, such as withdrawal, consumption, or discharge that are related to the stationary assets.",
    "properties": {
      "ActivitySourceType": {
        "type": "picklist",
        "description": "Specifies the type of water source that's related to this water activity."
      },
      "ActivityType": {
        "type": "picklist",
        "description": "Specifies the type of water activity related to the stationary asset."
      },
      "CostCenter": {
        "type": "string",
        "description": "The cost center associated with this stationary asset water activity."
      },
      "CostPerUnit": {
        "type": "currency",
        "description": "The per unit cost of this water activity."
      },
      "Description": {
        "type": "textarea",
        "description": "The information that describes the stationary asset water activity."
      },
      "EndDate": {
        "type": "date",
        "description": "The date from which the values of this stationary asset water activity become invalid."
      },
      "EnvironmentalRiskId": {
        "type": "reference",
        "description": "The environmental risk associated with this water activity."
      },
      "IsRecordLocked": {
        "type": "boolean",
        "description": "Indicates whether the stationary asset water activity record and the associated carbon footprint record is locked for editing."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of this stationary asset water activity."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "Quantity": {
        "type": "double",
        "description": "The quantity of water related to the selected activity type."
      },
      "QuantityInM3": {
        "type": "double",
        "description": "The water quantity that's calculated using the cubic meter (m3) measuring unit."
      },
      "QuantityUnit": {
        "type": "picklist",
        "description": "Specifies the unit of measure for calculating the water quantity."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": ""
      },
      "ServiceProviderId": {
        "type": "reference",
        "description": "The supplier associated with this water activity."
      },
      "StartDate": {
        "type": "date",
        "description": "The date from which the values of this stationary asset water activity become valid."
      },
      "StnryAssetEnvrSrcId": {
        "type": "reference",
        "description": "The stationary asset environmental source related to this water activity."
      },
      "StnryAssetWaterFtprntId": {
        "type": "reference",
        "description": "The water footprint associated with the stationary asset water activity."
      },
      "TotalCost": {
        "type": "currency",
        "description": "The total cost of this water activity."
      },
      "TreatmentType": {
        "type": "picklist",
        "description": "The type of activity that's performed for the treatment and discharge of the water."
      },
      "WaterDataMeasurement": {
        "type": "picklist",
        "description": "Specifies the mechanism or technique to measure a company's water consumption, discharge, and withdrawal."
      },
      "WaterFtprntReportDate": {
        "type": "date",
        "description": "The date when the water footprint data of the associated stationary asset is due to be sent to a reporting body."
      }
    },
    "module": "Net Zero Cloud"
  }
}