{
  "StnryAssetCrbnFtprnt": {
    "name": "StnryAssetCrbnFtprnt",
    "description": "Represents the total carbon emissions and other environmental attributes from stationary assets. Carbon footprint quantifies the effect of atmospheric warming, which is represented in metric tonnes of carbon dioxide equivalent (tCO₂e). Additionally, it also quantifies various aspects of the energy performance of the asset.",
    "properties": {
      "AllocatedRenewableEnergyInKwh": {
        "type": "double",
        "description": "The total renewable energy allocated to this carbon footprint record."
      },
      "AllocationStatus": {
        "type": "picklist",
        "description": "The allocation status of renewable energy for this carbon footprint record."
      },
      "AnnualEmssnInventoryId": {
        "type": "reference",
        "description": "The emissions inventory record for a particular year that’s related to the stationary asset carbon footprint record."
      },
      "AuditApprovalStatus": {
        "type": "picklist",
        "description": "The status of audit approval of this carbon footprint record."
      },
      "AvgDataCenterPue": {
        "type": "double",
        "description": "The average power usage effectiveness of the data center that’s calculated based on all the associated energy use records. This value is calculated by dividing the data center’s total electricity consumption value by the data center computing equipment’s total electricity consumption value."
      },
      "AvgMonthlyElectrCnsmpInKwh": {
        "type": "double",
        "description": "The average monthly-normalized electricity consumption in kWh. This value is calculated based on the electricity consumption values across all stationary asset energy use records associated with this carbon footprint record."
      },
      "BuildingEnergyIntensityId": {
        "type": "reference",
        "description": "The building energy intensity record that can be used to fill energy consumption data gaps."
      },
      "CarbonInventoryRecordCount": {
        "type": "double",
        "description": "The number of energy use records associated with this carbon footprint record."
      },
      "Ch4EmissionsInKg": {
        "type": "double",
        "description": "The CH4 emissions that are calculated for this energy use record."
      },
      "Co2EmissionsInKg": {
        "type": "double",
        "description": "The CO2 emissions that are calculated for this energy use record."
      },
      "DataCtrItDieselCnsmpIntensity": {
        "type": "double",
        "description": "The diesel consumption intensity of the data center’s computing equipment."
      },
      "DataGapStatus": {
        "type": "picklist",
        "description": "The status of filling the energy consumption data gaps for this carbon footprint record."
      },
      "ElectricityIntensityVarPct": {
        "type": "percent",
        "description": "The percentage difference between the regional electricity consumption intensity of the carbon footprint and the electricity consumption intensity of the associated carbon footprint item."
      },
      "EndDate": {
        "type": "date",
        "description": "The date until when the values of this carbon footprint record are valid."
      },
      "EnrgyCnsmpIntensityInKbtuM2": {
        "type": "double",
        "description": "The energy consumption intensity of all the associated energy use records in kBtu per square meter."
      },
      "EnrgyCnsmpIntensityInKbtuSqft": {
        "type": "double",
        "description": "The energy consumption intensity of all the associated energy use records in kBtu per square foot."
      },
      "EnrgyCnsmpIntensityInKwhM2": {
        "type": "double",
        "description": "The energy consumption intensity of all the associated energy use records in kWh per square meter."
      },
      "EnrgyCnsmpIntensityInKwhSqft": {
        "type": "double",
        "description": "The energy consumption intensity of all the associated energy use records in kWh per square foot."
      },
      "EnrgyIntensityVariancePct": {
        "type": "percent",
        "description": "The percentage difference between the electricity consumption intensity and the regional electricity consumption intensity of the carbon footprint"
      },
      "FootprintStage": {
        "type": "picklist",
        "description": "The workflow stage for this carbon footprint record."
      },
      "IsRecordLocked": {
        "type": "boolean",
        "description": "Indicates whether the stationary asset carbon footprint record and the associated energy use records are locked for editing."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "LocBasedElectrFrOthrFuelInKwh": {
        "type": "double",
        "description": "The total electricity generated from other fuel energy sources for all the associated energy use records, that’s used to calculate emissions using the location-based method."
      },
      "LocBasedElectrFromBiomassInKwh": {
        "type": "double",
        "description": "The total electricity generated from biomass for all the associated energy use records, that's used to calculate emissions using the location-based method."
      },
      "LocBasedElectrFromCoalInKwh": {
        "type": "double",
        "description": "The total electricity generated from coal for all the associated energy use records, that’s used to calculate emissions using the location-based method."
      },
      "LocBasedElectrFromGasInKwh": {
        "type": "double",
        "description": "The total electricity generated from gas for all the associated energy use records, that’s used to calculate emissions using the location-based method."
      },
      "LocBasedElectrFromHydroInKwh": {
        "type": "double",
        "description": "The total electricity generated from hydroelectric energy sources for all the associated energy use records, that’s used to calculate emissions using the location-based method."
      },
      "LocBasedElectrFromNuclearInKwh": {
        "type": "double",
        "description": "The total electricity generated from nuclear power for all the associated energy use records, that’s used to calculate emissions using the location-based method."
      },
      "LocBasedElectrFromOilInKwh": {
        "type": "double",
        "description": "The total electricity generated from oil for all the associated energy use records, that’s used to calculate emissions using the location-based method."
      },
      "LocBasedElectrFromSolarInKwh": {
        "type": "double",
        "description": "The total electricity generated from solar photovoltaic energy sources for all the associated energy use records, that’s used to calculate emissions using the location-based method."
      },
      "LocBasedElectrFromWindInKwh": {
        "type": "double",
        "description": "The total electricity generated from wind for all the associated energy use records, that’s used to calculate emissions using the location-based method."
      },
      "LocBsdElectrFrGeothermalInKwh": {
        "type": "double",
        "description": "The total electricity generated from geothermal energy sources for all the associated energy use records, that’s used to calculate emissions using the location-based method."
      },
      "LocBsdElectrOthrFossilFuelKwh": {
        "type": "double",
        "description": "The total electricity generated from other fossil fuel energy sources for all the associated energy use records, that’s used to calculate emissions using the location-based method."
      },
      "MaxVarianceAboveAvgElectrCnsmp": {
        "type": "percent",
        "description": "The difference between the highest normalized monthly electricity consumption and the average monthly electricity consumption of all the associated energy use records"
      },
      "MaxVarianceBelowAvgElectrCnsmp": {
        "type": "percent",
        "description": "The difference between the lowest normalized monthly electricity consumption and the average monthly electricity consumption of all the associated energy use records"
      },
      "MktBsdElectrFrBiomassInKwh": {
        "type": "double",
        "description": "The total electricity generated from biomass for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "MktBsdElectrFrFromCoalInKwh": {
        "type": "double",
        "description": "The total electricity generated from coal for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "MktBsdElectrFrGasInKwh": {
        "type": "double",
        "description": "The total electricity generated from gas for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "MktBsdElectrFrGeothermalInKwh": {
        "type": "double",
        "description": "The total electricity generated from geothermal energy sources for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "MktBsdElectrFrHydroInKwh": {
        "type": "double",
        "description": "The total electricity generated from hydroelectric energy sources for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "MktBsdElectrFrNuclearInKwh": {
        "type": "double",
        "description": "The total electricity generated from nuclear power for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "MktBsdElectrFrOilInKwh": {
        "type": "double",
        "description": "The total electricity generated from oil for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "MktBsdElectrFrOthrFuelInKwh": {
        "type": "double",
        "description": "The total electricity generated from other fuel energy sources for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "MktBsdElectrFrSolarInKwh": {
        "type": "double",
        "description": "The total electricity generated from solar photovoltaic energy sources for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "MktBsdElectrFrWindInKwh": {
        "type": "double",
        "description": "The total electricity generated from wind for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "MktBsdElectrOthrFossilFuelKwh": {
        "type": "double",
        "description": "The total electricity generated from other fossil fuel energy sources for all the associated energy use records, that’s used to calculate emissions using the market-based method."
      },
      "N2oEmissionsInKg": {
        "type": "double",
        "description": "The N2O emissions that are calculated for this energy use record."
      },
      "Name": {
        "type": "string",
        "description": "The name for this carbon footprint record."
      },
      "OccupiedFloorArea": {
        "type": "double",
        "description": "The value to override the occupied floor area of the associated stationary asset environmental source."
      },
      "OccupiedFloorAreaUnit": {
        "type": "picklist",
        "description": "The unit of measure for the occupied floor area of the associated stationary asset environmental source."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PrevYrAnnlCarbonFootprintId": {
        "type": "reference",
        "description": "The previous year's carbon footprint record for the associated stationary asset environmental source."
      },
      "PrevYrDataCenterPue": {
        "type": "double",
        "description": "The data center’s power usage effectiveness for the previous year."
      },
      "PrevYrEnrgyIntensityKbtuM2": {
        "type": "double",
        "description": "The energy consumption intensity for the previous year in kBtu per square meter."
      },
      "PrevYrEnrgyIntensityKbtuSqft": {
        "type": "double",
        "description": "The energy consumption intensity for the previous year in kBtu per square foot."
      },
      "PrevYrEnrgyIntensityKwhM2": {
        "type": "double",
        "description": "The energy consumption intensity for the previous year in kWh per square meter."
      },
      "PrevYrEnrgyIntensityKwhSqft": {
        "type": "double",
        "description": "The energy consumption intensity for the previous year in kWh per square foot."
      },
      "RegionalBldgEnergyIntensityId": {
        "type": "reference",
        "description": "The building energy intensity record containing the standard building energy intensity data from a government source."
      },
      "ReportingDate": {
        "type": "date",
        "description": "The date when this carbon footprint record data is due to be sent to a reporting body."
      },
      "ReportingYear": {
        "type": "picklist",
        "description": "The year in which this carbon footprint record data is due to be sent to a reporting body."
      },
      "RgnlElectrCnsmpIntensity": {
        "type": "double",
        "description": "The total regional electricity consumption intensity from the associated regional building energy intensity record in kWh per square foot."
      },
      "RgnlEnrgyCnsmpIntensity": {
        "type": "double",
        "description": "The total regional electricity consumption intensity from the associated regional building energy intensity record in kBtu per square foot."
      },
      "Scope3EmssnDnstrmLsdAst": {
        "type": "double",
        "description": "The total scope 3 emissions from downstream leased assets that are included in category 13 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnCptlGoods": {
        "type": "double",
        "description": "The total scope 3 emissions from the production of capital goods that are included in category 2 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnEmpCommute": {
        "type": "double",
        "description": "The total scope 3 emissions from the employee commute that's included in category 7 of the related carbon footprint record or the override values."
      },
      "Scp3EmssnFranchises": {
        "type": "double",
        "description": "The total scope 3 emissions from the operation of franchises that are included in category 14 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnInvestments": {
        "type": "double",
        "description": "The total scope 3 emissions from investment that are included in category 15 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnProcSoldPrdct": {
        "type": "double",
        "description": "The total scope 3 emissions from the processing of sold products that are included in category 10 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnPurchGoodsSrvcs": {
        "type": "double",
        "description": "The scope 3 emissions from the production of purchased goods and services that are ncluded in category 1 associated with the carbon footprint record or the relevant override value."
      },
      "Scp3EmssnUpstrmLsdAst": {
        "type": "double",
        "description": "The total scope 3 emissions from the operation of upstream leased assets that are included in category 8 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnUseOfSoldPrdct": {
        "type": "double",
        "description": "The total scope 3 emissions from the use of sold products and services that are included in category 11 of the related carbon footprint record or the override value."
      },
      "Scp3EmssnWstGenInOper": {
        "type": "double",
        "description": "The total scope 3 emissions from the treatment and disposal of generated waste that is included in category 5 of the related carbon footprint record or the override value."
      },
      "Scp3EndLifeTreatSoldPrdct": {
        "type": "double",
        "description": "The total scope 3 emissions from the end-of-life treatment of sold products that are included in category 12 of the related carbon footprint record or the override value."
      },
      "Scp3FuelEnrgyRelaActv": {
        "type": "double",
        "description": "The total scope 3 emissions from the production of fuel and energy that are included in category 3 of the related carbon footprint record or the override values."
      },
      "Scp3UncategorizedEmssn": {
        "type": "double",
        "description": "The total scope 3 emissions from uncategorized sources in the related carbon footprint record or the override value."
      },
      "StartDate": {
        "type": "date",
        "description": "The date from when the values of this carbon footprint record are valid."
      },
      "StnryAssetEnvrSrcId": {
        "type": "reference",
        "description": "The stationary asset environmental source record associated with this carbon footprint record."
      },
      "SuplScope1Emissions": {
        "type": "double",
        "description": "The supplemental scope 1 emissions value that’s added to the calculated total scope 1 emissions value."
      },
      "SuplScope2LocationBasedEmssn": {
        "type": "double",
        "description": "The supplemental scope 2 location-based emissions value that’s added to the calculated total scope 2 location-based emissions value."
      },
      "SuplScope2MarketBasedEmssn": {
        "type": "double",
        "description": "The supplemental scope 2 market-based emissions value that’s added to the calculated total scope 2 market-based emissions value."
      },
      "SuplScope3DnstrmEmissions": {
        "type": "double",
        "description": "The supplemental scope 3 emissions value from downstream activities that’s added to the calculated total scope 3 emissions value."
      },
      "SuplScope3UpstrmEmissions": {
        "type": "double",
        "description": "The supplemental scope 3 emissions value from upstream activities that’s added to the calculated total scope 3 emissions value."
      },
      "TotBldgIndirectEnrgyCnsmpInMwh": {
        "type": "double",
        "description": "The total consumption of energy generated from electricity, heat, cooling, and steam. The consumption value excludes energy generated from other building fuels."
      },
      "TotEnergyConsumptionInGj": {
        "type": "double",
        "description": "The total energy consumption from all the energy sources and associated energy use records converted from kWh to gigajoules."
      },
      "TotEnergyConsumptionInKwh": {
        "type": "double",
        "description": "The total energy consumption from all the energy sources and associated energy use records."
      },
      "TotEnergyConsumptionInMwh": {
        "type": "double",
        "description": "The total energy consumption from all the energy sources and associated energy use records converted from kWh to MWh."
      },
      "TotRnwlEnrgyExclHydroInKwh": {
        "type": "double",
        "description": "The total renewable energy excluding hydroelectric energy. This value is calculated based on the market-based grid mix values and allocated renewable energy values."
      },
      "TotRnwlEnrgyExclHydroPct": {
        "type": "percent",
        "description": "The percentage of total renewable energy excluding hydroelectric energy out of the total electricity consumption."
      },
      "TotScope1EmissionsInTco2e": {
        "type": "double",
        "description": "The total scope 1 emissions from all the associated energy use records and supplemental emissions."
      },
      "TotScope2LocBasedEmissions": {
        "type": "double",
        "description": "The total scope 2 emissions value that’s calculated based on the location-based data of grid emissions."
      },
      "TotScope2MktBasedEmissions": {
        "type": "double",
        "description": "The total scope 2 emissions value that's calculated based on the utility-provided emissions data and allocated renewable energy."
      },
      "TotalFloorArea": {
        "type": "double",
        "description": "The value to override the total floor area of the associated stationary asset environmental source."
      },
      "TotalFloorAreaUnit": {
        "type": "picklist",
        "description": "The unit of measure for the total floor area of the associated stationary asset environmental source."
      },
      "TotalRenewableEnergyInKwh": {
        "type": "double",
        "description": "The total renewable energy in kWh that's calculated based on the market-based grid mix values and the allocated renewable energy value."
      },
      "TotalRenewableEnergyPct": {
        "type": "percent",
        "description": "The percentage of total renewable energy out of the total electricity consumption."
      },
      "TotalScp3DnstrmEmissions": {
        "type": "double",
        "description": "The total scope 3 emissions from downstream activities. This value is calculated based on the scope 3 downstream emission values and supplemental scope 3 downstream emission values of all the associated energy use records."
      },
      "TotalScp3UpstrmEmissions": {
        "type": "double",
        "description": "The total scope 3 emissions from upstream activities. This value is calculated based on the scope 3 upstream emission values and supplemental scope 3 upstream emission values of all the associated energy use records."
      },
      "YearOverYearPueVariancePct": {
        "type": "percent",
        "description": "The percentage difference of the data center’s power usage effectiveness in the current year’s carbon footprint and the previous year’s carbon footprint."
      }
    },
    "module": "Net Zero Cloud"
  }
}