{
  "StnryAssetWaterFtprnt": {
    "name": "StnryAssetWaterFtprnt",
    "description": "Represents information about the total volume of water from the water activities, such as withdrawal, consumption, or discharge that are related to the stationary assets.",
    "properties": {
      "CnsmpIntsVariancePct": {
        "type": "percent",
        "description": "The percentage difference between the water consumption intensity and the previous year water consumption intensity of the water footprint."
      },
      "DchgIntsVariancePct": {
        "type": "percent",
        "description": "The percentage difference between the water discharge intensity and the previous year water discharge intensity of the water footprint."
      },
      "EmployeeCnsmpIntsInM3": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's consumed by each employee."
      },
      "EmployeeCount": {
        "type": "double",
        "description": ""
      },
      "EmployeeDchgIntsInM3": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's discharged by each employee."
      },
      "EmployeeWdrwIntsInM3": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's withdrawn by each employee."
      },
      "EndDate": {
        "type": "date",
        "description": "The date when the values of this stationary asset water activity becomes invalid."
      },
      "ExtremeStressCnsmpPct": {
        "type": "percent",
        "description": "The percentage of water consumption in the extremely high water stress region."
      },
      "ExtremeStressWdrwPct": {
        "type": "percent",
        "description": "The percentage of water withdrawal in the extremely high water stress region."
      },
      "FlAreaCnsmpIntsInM3M2": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's consumed per square meter (m2) by each floor."
      },
      "FlAreaCnsmpIntsInM3Sqft": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's consumed per square feet (sqft) by each floor."
      },
      "FlAreaDchgIntsInM3M2": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's discharged per square meter (m2) by each floor."
      },
      "FlAreaDchgIntsInM3Sqft": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's consumed per square feet (sqft) by each floor."
      },
      "FlAreaWdrwIntsInM3M2": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's withdrawn per square meter (m2) by each floor."
      },
      "FlAreaWdrwIntsInM3Sqft": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's withdrawn per square feet (sqft) by each floor."
      },
      "FootprintStage": {
        "type": "picklist",
        "description": "Specifies the latest stage in this water footprint life cycle."
      },
      "HighStressCnsmpPct": {
        "type": "percent",
        "description": "The percentage of water consumption in the high water stress region."
      },
      "HighStressWdrwPct": {
        "type": "percent",
        "description": "The percentage of water withdrawal in the high water stress region."
      },
      "IsRecordLocked": {
        "type": "boolean",
        "description": "Indicates whether the stationary asset water footprint record and the associated carbon footprint record is locked for editing."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the stationary asset water footprint."
      },
      "OccupiedFloorArea": {
        "type": "double",
        "description": "The building floor area occupied by your organization."
      },
      "OccupiedFloorAreaUnit": {
        "type": "picklist",
        "description": "The unit of measure for the occupied floor area."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PreviousYearWaterFtprntId": {
        "type": "reference",
        "description": "The previous year water footprint that's used in calculating the variance of each water activity."
      },
      "ProdtVolumeCnsmpIntsInM3": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's consumed by each product."
      },
      "ProdtVolumeDchgIntsInM3": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's discharged by all the products."
      },
      "ProdtVolumeWdrwIntsInM3": {
        "type": "double",
        "description": "The intensity that's calculated in cubic meter (m3) for the water that's withdrawn by all the products manufactured."
      },
      "ReportingYear": {
        "type": "picklist",
        "description": "The year in which this water footprint record data is due to be sent to a reporting body."
      },
      "StartDate": {
        "type": "date",
        "description": "The date when the values of this stationary asset water activity becomes valid."
      },
      "StnryAssetEnvrSrcId": {
        "type": "reference",
        "description": "The stationary asset environmental source associated with this water footprint."
      },
      "TotalConsumptionInMl": {
        "type": "double",
        "description": "The water consumed by all the related water activities."
      },
      "TotalCost": {
        "type": "currency",
        "description": "The total cost of this water activity."
      },
      "TotalDischargeInMl": {
        "type": "double",
        "description": "The water discharge by all the related water activities."
      },
      "TotalFloorArea": {
        "type": "double",
        "description": "The total building floor area of your organization."
      },
      "TotalFloorAreaUnit": {
        "type": "picklist",
        "description": "The unit of measure for the total floor area."
      },
      "TotalStorageDuringPreviousYear": {
        "type": "double",
        "description": "The total water stored during the previous year. This value is measured in cubic meter (m3)."
      },
      "TotalStorageInMl": {
        "type": "double",
        "description": "The water reserve available for all the related water activities."
      },
      "TotalUnitsManufactured": {
        "type": "double",
        "description": "The total units manufactured by the associated stationary asset."
      },
      "TotalWithdrawalInMl": {
        "type": "double",
        "description": "The water withdrawal from all the related water activities."
      },
      "WaterInventoryRecCount": {
        "type": "double",
        "description": "The number of energy use records associated with this water footprint record."
      },
      "WdrwIntsVariancePct": {
        "type": "percent",
        "description": "The percentage difference between the water withdrawal intensity and the previous year water withdrawal intensity of the water footprint."
      }
    },
    "module": "Net Zero Cloud",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.netzero_cloud_dev_guide.meta/netzero_cloud_dev_guide/sforce_api_objects_stnryassetwaterftprnt.htm"
  }
}