{
  "StnryAssetAnnualFact": {
    "name": "StnryAssetAnnualFact",
    "description": "Represents the information about stationary assets and their types, which is used to quantify the related intensity.",
    "properties": {
      "ApplicableYear": {
        "type": "picklist",
        "description": "Specifies the year that's applicable to the stationary asset annual fact."
      },
      "Description": {
        "type": "textarea",
        "description": "The information about the stationary asset."
      },
      "EmployeeCount": {
        "type": "int",
        "description": "The count of employees that are associated with the stationary asset."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record."
      },
      "Name": {
        "type": "string",
        "description": "The name of the stationary asset master data."
      },
      "OccupiedFloorArea": {
        "type": "double",
        "description": "The floor area in a building that's occupied by an organization. This value is used in the associated stationary asset water footprint or its water activities."
      },
      "OccupiedFloorAreaUnit": {
        "type": "picklist",
        "description": "Specifies the unit of measure to calculate the occupied floor area."
      },
      "RecordTypeId": {
        "type": "reference",
        "description": ""
      },
      "Revenue": {
        "type": "double",
        "description": "The revenue generated from the associated stationary asset."
      },
      "StnryAssetEnvrSrcId": {
        "type": "reference",
        "description": "Specifies the environmental source that's associated with the stationary asset."
      },
      "TotalFloorArea": {
        "type": "double",
        "description": "The total floor area in a building for an organization. This value is used in the associated stationary asset water footprint or its water activities."
      },
      "TotalFloorAreaUnit": {
        "type": "picklist",
        "description": "Specifies the unit of measure to calculate the total floor area."
      },
      "TotalUnitsManufactured": {
        "type": "double",
        "description": "The total units manufactured by the associated stationary asset."
      }
    },
    "module": "Net Zero Cloud"
  }
}