{
  "SupplierProduct": {
    "name": "SupplierProduct",
    "description": "Represents information that's used to track the products that are purchased from a supplier.",
    "properties": {
      "AttributeEndDate": {
        "type": "date",
        "description": "The date when the product attribute becomes inactive."
      },
      "AttributeStartDate": {
        "type": "date",
        "description": "The date when the product attribute becomes active."
      },
      "DefaultProductEmssnFctrId": {
        "type": "reference",
        "description": "The default emissions factor associated with this product that's purchased from the supplier."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates whether the product is currently active or inactive."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of this supplier product data."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "ProductId": {
        "type": "reference",
        "description": "The product that the organization is purchasing from the associated supplier."
      },
      "SourcingAllocPercentage": {
        "type": "percent",
        "description": "The sourcing allocation percentage of a supplier towards the total quantity that's purchased by an organization."
      },
      "SupplierId": {
        "type": "reference",
        "description": "The supplier that's associated with the sale of this product."
      },
      "SupplierRank": {
        "type": "double",
        "description": "The rank given to the supplier that helps an organization determine when to engage a supplier to make a purchase."
      }
    },
    "module": "Net Zero Cloud"
  }
}