{
  "SurveyQuestionResponse": {
    "name": "SurveyQuestionResponse",
    "description": "Represents a participant’s answer to a specific question.",
    "properties": {
      "ChoiceValue": {
        "type": "textarea",
        "description": "Response provided by a participant for the following question types: Multiple choice Picklist Radio Ranking"
      },
      "Datatype": {
        "type": "Filter, Group, Nillable, Restricted picklist, Sort",
        "description": ""
      },
      "DateTimeValue": {
        "type": "dateTime",
        "description": "Response provided by a participant for a question of the type date time."
      },
      "DateValue": {
        "type": "date",
        "description": "Response provided by a participant for a question of the type date."
      },
      "InvitationId": {
        "type": "reference",
        "description": "The ID of the SurveyInvitation that was sent to the survey participant."
      },
      "IsTrueOrFalse": {
        "type": "boolean",
        "description": "Response provided by a participant for a question type which has only two possible values: True and False."
      },
      "NumberValue": {
        "type": "int",
        "description": "Response provided by a participant for the following question types: Net Promoter Score (NPS) Rating Score Slider"
      },
      "QuestionChoiceId": {
        "type": "reference",
        "description": "The ID of SurveyQuestionChoice that a participant chose in response to a question."
      },
      "QuestionId": {
        "type": "reference",
        "description": "The ID of the SurveyQuestion that a participant provided an answer for."
      },
      "Rank": {
        "type": "int",
        "description": "Rank provided by a participant for an answer choice for the ranking question type."
      },
      "ResponseId": {
        "type": "reference",
        "description": "The ID of the SurveyResponse that is the parent of this SurveyQuestionResponse."
      },
      "ResponseShortText": {
        "type": "string",
        "description": "Up to the first 250 characters of the response provided by a participant for a text type question."
      },
      "ResponseValue": {
        "type": "textarea",
        "description": "Response provided by a participant for a question."
      },
      "SurveyVersionId": {
        "type": "reference",
        "description": "The ID of the SurveyVersion that the response belongs to."
      }
    },
    "module": "Feedback Management"
  }
}