{
  "SurveyInvitation": {
    "name": "SurveyInvitation",
    "description": "Represents the invitation sent to a participant to complete the survey.",
    "properties": {
      "CommunityId": {
        "type": "reference",
        "description": "The ID of the Experience Cloud site that you want to send the survey to."
      },
      "ContactId": {
        "type": "reference",
        "description": "ID of the contact who received the invitation. This field is available in API v49.0 and later."
      },
      "EmailBrandingId": {
        "type": "reference",
        "description": "The ID of the survey email branding object that’s associated with this invitation."
      },
      "InvitationLink": {
        "type": "url",
        "description": "The URL to the survey that is sent to participants. To query on this field, you need access to the associated Survey record."
      },
      "InviteExpiryDateTime": {
        "type": "dateTime",
        "description": "The date and time that the survey invitation expires."
      },
      "IsDefault": {
        "type": "boolean",
        "description": "Determines whether this is the default survey invitation to use when the survey is sent to participants."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this survey invitation."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this survey invitation."
      },
      "LeadId": {
        "type": "reference",
        "description": "ID of the lead who received the invitation. This field is available in API v49.0 and later."
      },
      "Name": {
        "type": "string",
        "description": "The name of the survey invitation that appears in the UI."
      },
      "OptionsAllowGuestUserResponse": {
        "type": "boolean",
        "description": "Determines whether participants who don’t have a Salesforce account can complete the survey."
      },
      "OptionsAllowParticipantAccessTheirResponse": {
        "type": "boolean",
        "description": "Determines whether participants can access a copy of their responses after they complete the survey."
      },
      "OptionsCollectAnonymousResponse": {
        "type": "boolean",
        "description": "Determines whether participants can complete the survey anonymously."
      },
      "OwnerId": {
        "type": "reference",
        "description": "ID of the user who created the survey invitation."
      },
      "ParticipantId": {
        "type": "reference",
        "description": "ID of the participant if the participant is a Salesforce contact, user, or lead."
      },
      "ResponseStatus": {
        "type": "picklist",
        "description": "The status of a participant’s response to the survey that’s associated with the survey invitation. Possible values include: NotStarted — For an invitation with a ParticipantID, it means that the recipient hasn’t opened the survey. For an invitation without the ParticipantID, it means that none of the recipients have opened the survey. Started — For an invitation with a ParticipantID, it means that the recipient opened the survey. For an invitation without the ParticipantID, it means that the survey has been opened by at least one recipient. Paused — For an invitation with a ParticipantID, it means that the recipient has paused the survey. For an invitation without the ParticipantID, it means that the survey has been paused by any one of the recipients. Paused isn't available for invitations in which either OptionsAllowParticipantAccessTheirResponse or OptionsCollectAnonymousResponse is true. PartiallyCompleted— For an invitation with a ParticipantID field, it means that the recipient has partially completed the survey. For an invitation without the ParticipantID field, it means that at least one recipient has partially completed the survey. Available in API version 63.0 and later. Completed — For an invitation with a ParticipantID, it means that the recipient has submitted the survey. For an invitation without the ParticipantID, it means that the invitation has been submitted by at least one recipient."
      },
      "SurveyId": {
        "type": "reference",
        "description": "ID of the survey that’s sent in the invitation."
      },
      "UUID": {
        "type": "string",
        "description": "A unique user ID that's added to a survey invitation generated for a contact, lead,or user."
      },
      "UserId": {
        "type": "reference",
        "description": "ID of the user who received the invitation. This field is available in API v49.0 and later."
      }
    },
    "module": "Feedback Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.salesforce_feedback_management_dev_guide.meta/salesforce_feedback_management_dev_guide/sforce_api_objects_surveyinvitation.htm"
  }
}