{
  "SurveyResponse": {
    "name": "SurveyResponse",
    "description": "Represents information about a participant’s response to a survey, such as the status of the response, the participant’s location, and when the survey was completed.",
    "properties": {
      "CompletionDateTime": {
        "type": "dateTime",
        "description": "The date and time that the participant completed the survey."
      },
      "DataMapperExecutionStatus": {
        "type": "picklist",
        "description": "Status of all the survey data maps after a response is received. This field is available in API v49.0 and later, with Feedback Management - Starter and Feedback Management - Growth licenses."
      },
      "InterviewGuid": {
        "type": "string",
        "description": "An automatically-generated, unique ID for a saved survey response."
      },
      "InterviewId": {
        "type": "reference",
        "description": "The ID of the FlowInterview object that’s associated with this response."
      },
      "InvitationId": {
        "type": "reference",
        "description": "The ID of the SurveyInvitation object that’s associated with this response."
      },
      "IpAddress": {
        "type": "string",
        "description": "The IP address of the device the participant used to take the survey."
      },
      "Language": {
        "type": "picklist",
        "description": "The language that the participant used to complete the survey."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The date and time that another Salesforce object last referenced this SurveyResponse object."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The date and time that someone last viewed this SurveyResponse object."
      },
      "Latitude": {
        "type": "double",
        "description": "The latitude of the participant’s location."
      },
      "Location": {
        "type": "location",
        "description": "The latitude and longitude coordinates of the participant’s location."
      },
      "Longitude": {
        "type": "double",
        "description": "The longitude of the participant’s location."
      },
      "Name": {
        "type": "string",
        "description": "The name of the participant."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the survey. Possible values include: NotStarted — The participant hasn't opened the survey. Started — The participant has opened the survey. Paused — The participant has paused the survey. Paused isn't available for invitations in which either OptionsAllowParticipantAccessTheirResponse or OptionsCollectAnonymousResponse is true. PartiallyCompleted — The participant has partially completed the survey. Available in API version 63.0 and later. Completed — The participant has completed the survey."
      },
      "SubmitterId": {
        "type": "reference",
        "description": "The ID of the Salesforce user, contact, or lead who completed the survey."
      },
      "SurveyId": {
        "type": "reference",
        "description": "The ID of the survey that the participant completed."
      },
      "SurveyVersionId": {
        "type": "reference",
        "description": "The ID of the version of the survey that the participant completed."
      }
    },
    "module": "Feedback Management",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.salesforce_feedback_management_dev_guide.meta/salesforce_feedback_management_dev_guide/sforce_api_objects_surveyresponse.htm"
  }
}