{
  "SurveyQuestionScore": {
    "name": "SurveyQuestionScore",
    "description": "Represents the aggregate of responses for the following question types: date, multiple choice, picklist, radio, ranking, rating, scoring, slider, and Net Promoter Score® (NPS®).",
    "properties": {
      "CumulativeScore": {
        "type": "double",
        "description": "Sum of the responses provided by all the participants for a question of the following types: rating, scoring, and slider. For a question of the type ranking, sum of the weights provided by all the participants for each item."
      },
      "DateResponse": {
        "type": "date",
        "description": "The date selected by one or more participants for a question of the type date."
      },
      "Name": {
        "type": "string",
        "description": "For an overall score type record: Name of a question. Name of an item in a question of the type ranking."
      },
      "QuestionChoiceId": {
        "type": "reference",
        "description": "Unique identifier of the answer choice selected by one or more participants. For an individual score type record, this field is applicable for questions of the following types: picklist, radio, multi choice, ranking and rating. For an overall score type record, this field is applicable for questions of the type ranking."
      },
      "QuestionDeveloperName": {
        "type": "string",
        "description": "The API name of the question for which response is recorded. The API name must be unique within a particular version of the survey."
      },
      "QuestionId": {
        "type": "reference",
        "description": "Unique identifier of the question for which response is recorded."
      },
      "QuestionName": {
        "type": "textarea",
        "description": "Name of the question for which response is recorded."
      },
      "QuestionSkippedCount": {
        "type": "int",
        "description": "Number of participants who didn’t respond to the question."
      },
      "ResponseCount": {
        "type": "int",
        "description": "For an overall score type record, number of participants who responded to the question. For an individual score type record, number of participants who selected a particular answer choice."
      },
      "ResponseValue": {
        "type": "double",
        "description": "Answer choice selected by one or more participants for a question of the following types: rating, slider, score, NPS. Rank provided by the participant for an item in a question of the type ranking."
      },
      "Score": {
        "type": "double",
        "description": "For an individual score type record, percentage of participants who selected a particular answer choice. Note For questions of the type ranking, the percentage of participants who have provided the same rank to an item."
      },
      "ScoreType": {
        "type": "picklist",
        "description": "Type of the score calculated for a record. Possible values are: Individual Overall"
      },
      "SurveyId": {
        "type": "reference",
        "description": "Unique identifier of the survey that contains the question for which scores are calculated."
      },
      "SurveyInvitationId": {
        "type": "reference",
        "description": "Unique identifier of the survey invitation for which scores are calculated."
      },
      "SurveyVersionId": {
        "type": "reference",
        "description": "Unique identifier of the survey version for which scores are calculated."
      }
    },
    "module": "Feedback Management"
  }
}