{
  "SustainabilityScorecard": {
    "name": "SustainabilityScorecard",
    "description": "Represents information about the annual sustainability scorecard of third-party organizations whose data is used to calculate scope 3 emissions.",
    "properties": {
      "AllocatedWaterCnsmpInM3": {
        "type": "double",
        "description": "The allocated water consumption based on the water calculation method."
      },
      "AllocatedWaterDchgInM3": {
        "type": "double",
        "description": "The allocated water discharged based on the water calculation method."
      },
      "AllocatedWaterWdrwInM3": {
        "type": "double",
        "description": "The allocated water withdrawn based on the water calculation method."
      },
      "AllocationStatus": {
        "type": "picklist",
        "description": "The allocation status of procurement items for the sustainability scorecard record."
      },
      "CompanyAnnualExpenditure": {
        "type": "double",
        "description": "The amount spent by the company on the supplier."
      },
      "CompanyAnnualExpenditureEmssn": {
        "type": "double",
        "description": "The annual spend-based scope 3 emissions of the company. This value is equal to the Final Scorecard Emissions when the scope 3 emissions calculation measure is spend based."
      },
      "CompanyEmissionsAllocationPct": {
        "type": "percent",
        "description": "The percentage of emissions allocated by the supplier to the company."
      },
      "ConsumptionUnit": {
        "type": "picklist",
        "description": "Specifies the unit of measure for the water consumed by the supplier."
      },
      "Description": {
        "type": "textarea",
        "description": "The description for the sustainability scorecard."
      },
      "DischargeUnit": {
        "type": "picklist",
        "description": "Specifies the unit of measure for the water discharged by the supplier."
      },
      "EmissionAllocationType": {
        "type": "picklist",
        "description": "The type of emissions data being provided by the supplier. Supplier-Allocated Emissions indicates that the supplier has already allocated greenhouse gas emissions to your company. Total Supplier Emissions indicates that the emissions value is the total greenhouse gas emissions value of the supplier."
      },
      "EndDate": {
        "type": "date",
        "description": "The date until when the values in the sustainability scorecard record are valid."
      },
      "FinalScorecardEmissions": {
        "type": "double",
        "description": "The final scope 3 emissions value that’s displayed based on the selected calculation measure."
      },
      "IsCurrentSupplierScorecard": {
        "type": "boolean",
        "description": "Indicates if this record is the current third party scorecard."
      },
      "LastReferencedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed a record related to this record."
      },
      "LastViewedDate": {
        "type": "dateTime",
        "description": "The timestamp for when the current user last viewed this record. If this value is null, this record might only have been referenced (LastReferencedDate) and not viewed."
      },
      "Name": {
        "type": "string",
        "description": "The name of the sustainability scorecard record."
      },
      "OrgWaterAllocPct": {
        "type": "percent",
        "description": "The percentage of water activity allocated by the supplier to the organization."
      },
      "OwnerId": {
        "type": "reference",
        "description": "The ID of the user who owns this record."
      },
      "PercentageBasedEmissions": {
        "type": "double",
        "description": "The annual scope 3 emissions of the company when the calculation measure is Emissions Percentage."
      },
      "ReportingDueDate": {
        "type": "date",
        "description": "The date when the sustainability scorecard is due to be sent to a reporting body."
      },
      "ScienceBasedTargetStatus": {
        "type": "picklist",
        "description": "The status of the science-based target of the supplier."
      },
      "Scope1Emissions": {
        "type": "double",
        "description": "The total scope 1 emissions value that’s provided by the supplier."
      },
      "Scope2LocationBasedEmissions": {
        "type": "double",
        "description": "The total scope 2 emissions value that’s provided by the supplier and calculated based on the location-based data of grid emissions."
      },
      "Scope2MarkedBasedEmissions": {
        "type": "double",
        "description": "The total scope 2 emissions value that’s provided by the supplier and calculated based on the utility-provided emissions data and allocated renewable energy."
      },
      "Scope3Emissions": {
        "type": "double",
        "description": "The total scope 3 emissions value that’s provided by the supplier based on the selected Scope3EmssnCalculationMeasure, which can be Percentage-Based, Revenue-Based, Spend-Based, or Supplier-Provided."
      },
      "Scope3EmssnCalculationMeasure": {
        "type": "picklist",
        "description": "The measure that’s used to calculate scope 3 emissions."
      },
      "ScopestoIncludeinCalc": {
        "type": "picklist",
        "description": "The emissions scopes to include in the final scorecard calculations."
      },
      "StartDate": {
        "type": "date",
        "description": "The date from when the values in the sustainability scorecard record are valid."
      },
      "Status": {
        "type": "picklist",
        "description": "The status of the sustainability scorecard."
      },
      "SupplierAnnlRevenuePct": {
        "type": "percent",
        "description": "The supplier's annual revenue percentage that's used in revenue-based water calculation."
      },
      "SupplierAnnualRevenue": {
        "type": "double",
        "description": "The annual revenue of the supplier."
      },
      "SupplierAnnualRevenueEmissions": {
        "type": "double",
        "description": "The annual scope 3 emissions of the company when the calculation measure is Supplier Annual Revenue."
      },
      "SupplierClassification": {
        "type": "picklist",
        "description": "The classification of the related supplier based on the expenditure, importance, size, purchasing agreements, and other criteria."
      },
      "SupplierContactId": {
        "type": "reference",
        "description": "The primary contact of the supplier who’s responsible for providing the supplier’s sustainability details."
      },
      "SupplierEmssnRdctnCmtType": {
        "type": "picklist",
        "description": "The type of climate commitment made by the supplier. A supplier committing to the 1.5° Celsius emissions reduction target must set targets across all the greenhouse gas scopes in line with 1.5° Celsius emission scenarios. A supplier committing to a net-zero emissions reduction target must set a long-term science-based target to reach net-zero value chain greenhouse gas emissions by no later than 2050. It must also set interim targets across all the relevant greenhouse gas scopes. The targets must be set in line with the criteria and recommendations of the Science Based Targets initiative."
      },
      "SupplierId": {
        "type": "reference",
        "description": "The supplier related to the sustainability scorecard record."
      },
      "SupplierProvidedEmissions": {
        "type": "double",
        "description": "The annual scope 3 emissions of the company when the calculation measure is Supplier-Provided Emission Values."
      },
      "SupplierReportingScope": {
        "type": "picklist",
        "description": "The scope of sustainability reporting that can be done by the supplier."
      },
      "SupplierTier": {
        "type": "picklist",
        "description": "The relationship tier of the supplier. Tier 1 is for direct suppliers and tier 2 is for companies that supply tier 1 suppliers."
      },
      "SupplierWaterActvtyType": {
        "type": "picklist",
        "description": "Specifies the type of supplier-provided water activity. \""
      },
      "WaterCalculationMethod": {
        "type": "picklist",
        "description": "Specifies the method that’s used to calculate an organization’s water activity."
      },
      "WaterConsumptionValue": {
        "type": "double",
        "description": "The water consumed by the supplier."
      },
      "WaterDischargeValue": {
        "type": "double",
        "description": "The water discharged by the supplier."
      },
      "WaterWithdrawalValue": {
        "type": "double",
        "description": "The water withdrawn by the supplier."
      },
      "WithdrawalUnit": {
        "type": "picklist",
        "description": "Specifies the unit of measure for the water withdrawn by the supplier."
      }
    },
    "module": "Net Zero Cloud"
  }
}