{
  "SvcCatalogItemDef": {
    "name": "SvcCatalogItemDef",
    "description": "Represents a service catalog item that can be requested by a service catalog user.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "The definition of the catalog item. This field is visible on the Service Catalog page."
      },
      "DeveloperName": {
        "type": "string",
        "description": "The unique developer name for the catalog item."
      },
      "FlowName": {
        "type": "string",
        "description": "The flow called when the user navigates to the request page for the catalog item. Available in API version 55.0 and later."
      },
      "FulfillmentFlowId": {
        "type": "reference",
        "description": "The ID of the fulfillment flow. Available in API version 56.0 and later."
      },
      "ImageId": {
        "type": "reference",
        "description": "The image ID used for the catalog item."
      },
      "ImageReference": {
        "type": "string",
        "description": "Derived field from ImageId to expose ContentAssetId on item definitions. Available in API version 61.0 and later."
      },
      "InternalNotes": {
        "type": "textarea",
        "description": "A place for the Service Catalog Builder to leave internal notes about the catalog item."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Derived field from Status to indicate whether the service catalog item is active."
      },
      "IsAvailableToAllCustomers": {
        "type": "boolean",
        "description": "Indicates whether the Service Catalog item is available to all customers. The default value is false."
      },
      "IsFeatured": {
        "type": "boolean",
        "description": "Specifies whether a catalog item is marked as a favorite for the org. Favorites display as a featured item on the Service Catalog home page."
      },
      "IsGuestAccessible": {
        "type": "boolean",
        "description": "Indicates whether the Service Catalog item can be accessed by guest users. The default value is false."
      },
      "IsOutOfSync": {
        "type": "boolean",
        "description": "Indicates whether the fulfillment flow that the Service Catalog item is based on has been updated. Available in API version 58.0 and later."
      },
      "Language": {
        "type": "picklist",
        "description": "Supported languages for catalog items."
      },
      "Product": {
        "type": "picklist",
        "description": "The product associated with the Service Catalog item. The value is derived from UsageType. Available in API version 59.0 and later."
      },
      "ShortDescription": {
        "type": "string",
        "description": "The short description of the catalog item."
      },
      "Status": {
        "type": "picklist",
        "description": "Allows the Service Catalog Builder to control whether the flow is displayed to users within the Service Catalog."
      },
      "UsageType": {
        "type": "picklist",
        "description": "The business type for which the Service Catalog is used. Available in API version 57.0 and later."
      }
    },
    "module": "Core Salesforce"
  }
}