{
  "SvcCatalogCategory": {
    "name": "SvcCatalogCategory",
    "description": "Represents the grouping of individual catalog items in Service Catalog.",
    "properties": {
      "DeveloperName": {
        "type": "string",
        "description": "Developer name for this category."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the category. This name has the following requirements: It must be unique across the org. It must contain only alphanumeric characters and underscores. It must begin with a letter. It must not include spaces. It must not end with an underscore. It must not contain two consecutive underscores. Query this field only if the query result contains up to one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance."
      },
      "IsActive": {
        "type": "boolean",
        "description": "Indicates if a catalog category is active."
      },
      "ManageableState": {
        "type": "picklist",
        "description": "Describes the manageable state of a category that is contained in a package."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The primary label for the catalog category record."
      },
      "Metadata": {
        "type": "complexvalue",
        "description": "The category’s metadata. Query this field only if the query result contains up to one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace associated with this category."
      },
      "ParentCategoryId": {
        "type": "reference",
        "description": "If provided, the name of another SvcCatalogCategory that this category appears under. The parent category in this field can’t have its own parent category. Categories can’t have more than one level of nesting."
      },
      "SortOrder": {
        "type": "int",
        "description": "Displays a set order for catalog category entities."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_svccatalogcategory.htm"
  }
}