{
  "SvcCatalogFulfillFlowItem": {
    "name": "SvcCatalogFulfillFlowItem",
    "description": "Represents a variable in a fulfillment flow for Service Catalog that can accept input.",
    "properties": {
      "CatalogFulfillmentId": {
        "type": "reference",
        "description": "Id of the SvcCatalogFulfillmentFlow that this item belongs to."
      },
      "CatalogInputVariable": {
        "type": "string",
        "description": "The FlowVariable the fulfillment flow property represents."
      },
      "DisplayType": {
        "type": "picklist",
        "description": "The display options available."
      },
      "FieldDefinition": {
        "type": "picklist",
        "description": "The name of a field in the object provided in ObjectLookupDomainId that specifies the value for this variable. If DisplayType is Picklist, this value must be the name of a picklist field. If DisplayType is Lookup and FieldLookupDomainId is FieldDefinition, this value must be the name of a relationship field. This value can be a field from a standard or custom object."
      },
      "FieldLookupDomainId": {
        "type": "string",
        "description": "The name of a standard or custom object that specifies the domain of that lookup or picklist. This value is relevant only if displayType is Lookup or Picklist."
      },
      "IsAdditionalQuestionsInputVariable": {
        "type": "boolean",
        "description": "Determines if this variable accepts input for all additional questions that were asked to a user. This value can only be true if the DisplayType for this item is Text. Only one item per SvcCatalogFulfillmentFlow component can set this attribute to true."
      },
      "IsRequired": {
        "type": "boolean",
        "description": "Determines if the field is required for the related fulfillment flow to be executed."
      },
      "LookupDomainFieldType": {
        "type": "string",
        "description": "This value specifies the fields for the object specified by ObjectLookupDomainId that are displayed in the Catalog Builder by type. This value is only relevant if DisplayType is Lookup and fieldLookupDomain is FieldDefinition."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The primary label for the fulfillment flow record."
      },
      "ObjectLookupDomainId": {
        "type": "string",
        "description": "The name of a custom or standard object. If DisplayType is Lookup or Picklist, this value filters the available options to a specific object."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_svccatalogfulfillflowitem.htm"
  }
}