{
  "SvcCatalogItemDef": {
    "name": "SvcCatalogItemDef",
    "description": "Represents the grouping of individual catalog items in Service Catalog.",
    "properties": {
      "Description": {
        "type": "textarea",
        "description": "Free-text description of the catalog item."
      },
      "DeveloperName": {
        "type": "string",
        "description": "Developer name for this catalog item."
      },
      "FlowId": {
        "type": "reference",
        "description": "The screen flow associated with the catalog item."
      },
      "FulfillmentFlowId": {
        "type": "reference",
        "description": "This field is a relationship field."
      },
      "FullName": {
        "type": "string",
        "description": "The full name of the catalog item. This name has the following requirements: It must be unique across the org. It must contain only alphanumeric characters and underscores. It must begin with a letter. It must not include spaces. It must not end with an underscore. It must not contain two consecutive underscores. Query this field only if the query result contains up to one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance."
      },
      "InternalNotes": {
        "type": "textarea",
        "description": "Describes what the catalog item does and its implementation. This value is meant for other catalog builders."
      },
      "IsFeatured": {
        "type": "boolean",
        "description": "Determines if the catalog item is part of the featured catalog items."
      },
      "Language": {
        "type": "picklist",
        "description": "Possible values are: da - Danish de - German en_US - English es - Spanish es_MX - Spanish (Mexico) fi - Finnish fr - French it - Italian ja - Japanese ko - Korean nl_NL - Dutch no - Norwegian pt_BR - Portuguese (Brazil) ru - Russian sv - Swedish th - Thai zh_CN - Chinese (Simplified) zh_TW - Chinese (Traditional)"
      },
      "ManageableState": {
        "type": "picklist",
        "description": "Describes the manageable state of a catalog item that is contained in a package."
      },
      "MasterLabel": {
        "type": "string",
        "description": "The primary label for the catalog item record."
      },
      "Metadata": {
        "type": "complexvalue",
        "description": "The catalog item’s metadata. Query this field only if the query result contains up to one record. Otherwise, an error is returned. If more than one record exists, use multiple queries to retrieve the records. This limit protects performance."
      },
      "NamespacePrefix": {
        "type": "string",
        "description": "The namespace associated with this catalog item."
      },
      "Status": {
        "type": "picklist",
        "description": "Displays the publishing status of a catalog item."
      }
    },
    "module": "Tooling API",
    "sourceUrl": "https://developer.salesforce.com/docs/atlas.en-us.api_tooling.meta/api_tooling/tooling_api_objects_svccatalogitemdef.htm"
  }
}